[
  {
    "id": 42445037,
    "title": "FTC bans hidden junk fees in hotel, event ticket prices",
    "originLink": "https://www.cnbc.com/2024/12/17/ftc-bans-hidden-junk-fees-in-hotel-event-ticket-prices-.html",
    "originBody": "SKIP NAVIGATION MARKETS BUSINESS INVESTING TECH POLITICS VIDEO INVESTING CLUB PRO LIVESTREAM Search quotes, news & videos WATCHLIST SIGN IN POLITICS FTC bans hidden junk fees in hotel, event ticket prices PUBLISHED TUE, DEC 17 20248:40 AM EST U.S. President Joe Biden delivers remarks on protecting consumers from hidden junk fees during an event at the South Court Auditorium at Eisenhower Executive Office Building on June 15, 2023 in Washington, DC. Alex WongGetty Images The U.S. Federal Trade Commission passed a rule on Tuesday requiring ticket sellers, hotels and vacation rental sites to disclose total prices, including fees upfront, prohibiting them from concealing add-on charges until the last minute. The rule is one of the final pieces of President Joe Biden's wide-ranging crackdown on junk fees that drive up consumer costs without providing visible benefits. \"We all know the experience of encountering a hidden fee at the very last stage of checkout — these junk fees sneak onto your bill and companies end up making you pay more because they can. Those fees add up, taking real money out of the pockets of Americans,\" Biden said in a statement. President-elect Donald Trump could seek to withdraw the rule for further review, and Republicans who will have control of Congress could seek to vacate it by law. The rule would require service fees, resort fees, and other charges commonly added to bookings to be included in advertised prices. The rule is narrower than what the FTC proposed in 2023 that would have broadly banned hidden and deceptive fees regardless of industry. \"I urge enforcers to continue cracking down on these unlawful fees and encourage state and federal policymakers to build on this success with legislation that bans unfair and deceptive junk fees across the economy,\" FTC Chair Lina Khan said in a statement. The FTC estimates the rule would save U.S. consumers 53 million hours per year they would not have to spend sleuthing out total costs before making purchases. Biden's regulators have taken aim at inflated and hidden fees, though their efforts have met with lawsuits by businesses and corporate interest groups. A judge in Texas blocked a rule that would cap credit card late fees, and an appeals court in New Orleans blocked a requirement that airlines disclose baggage and other fees upfront. The cases are ongoing. Subscribe to CNBC PRO Subscribe to Investing Club Licensing & Reprints CNBC Councils Select Personal Finance CNBC on Peacock Join the CNBC Panel Supply Chain Values Select Shopping Closed Captioning Digital Products News Releases Internships Corrections About CNBC Ad Choices Site Map Podcasts Careers Help Contact News Tips Got a confidential news tip? We want to hear from you. GET IN TOUCH CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox SIGN UP NOW Get this delivered to your inbox, and more info about our products and services. Advertise With Us PLEASE CONTACT US Privacy Policy CA Notice Terms of Service © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Market Data Terms of Use and Disclaimers Data also provided by",
    "commentLink": "https://news.ycombinator.com/item?id=42445037",
    "commentBody": "FTC bans hidden junk fees in hotel, event ticket prices (cnbc.com)491 points by LordAtlas 22 hours agohidepastfavorite480 comments breadwinner 20 hours agoThis shouldn't be controversial. FTC isn't banning these fees, it is only requiring merchants to disclose the fees. Why would anyone be against that? Another good rule is click-to-cancel. Just a couple of days ago I logged into my Dish Network account to cancel it (after they hiked prices). There is no way to cancel online. There is no way to cancel via chat. You have to call. As soon as you call you're told the wait time is over 45 minutes. There is no call back option. Why should a consumer have to be on the phone for 45 minutes to cancel? (Typically they will drop the call after 45 minutes and you have to call again.) If you call Dish to sign up service the wait time is 0 minutes: they answer immediately. If you then tell that you're actually calling to cancel, they forward you to the cancellation number with the wait. This is an abusive business practice, and banning it should not be controversial. reply jeffwass 19 hours agoparentDish is evil. Years ago when signed up with them I opted to pay the extra service for local tv channels, which required an andditional antenna to install. For some reason the installer couldn’t fit it securely on our house, and said to call Dish to remove the service since we cannot receive it. Dish refused to remove the local service! They said since we signed a contract we were stuck paying for it even though they couldn’t fit the antenna. I pointed out in a hundred different ways that the contract also required them to provide a service which they are not providing so we shouldn’t have to pay. All of my attempts to reason with them were ignored, and their call staff refused to escalate to their manager. Long story short we had to pay for twelve months for something they couldn’t provide to us. Literally the minute the contract was up we cancelled (it was easier to cancel back then). I would never ever go near this company again. reply paulryanrogers 18 hours agorootparentIsn't this what small claims court is for? reply dh2022 3 hours agorootparentTerms and Conditions usually spell out the dispute process. You may find out that disputes need to go to arbitration court in a different state. reply kstrauser 1 minute agorootparentAlternatively, you can take them to small claims court and see if the judge there is hyper-interested in upholding their insanely restrictive contracts. They can appeal a judgment, of course, but that's likely to be far more expensive for them than just honoring the decision. noprocrasted 1 hour agorootparentprevYou don't even need small claims court. You just don't pay, and point them to (small claims?) court if they want to get paid for the service they don't provide. None of these shit companies will ever take you up on the offer though, because expecting to get paid for a service you don't provide (and can't provide in this case) won't fly in court. reply mikestew 46 minutes agorootparentYou just don't pay, and point them to (small claims?) court if they want to get paid for the service they don't provide. Have you actually tried this? Because having not tried it myself, I'd bet a paycheck that you get sent to collections, get a ding on your credit report, and you're still on the hook for taking it to court if you want it resolve to your favor. (Assuming U. S.) And as a cherry on top of that shit sundae, it's probably in the contract that you have to go through arbitration anyway. reply noprocrasted 22 minutes agorootparentI have done so multiple times, albeit in the UK. When collections calls, you explain them the situation (service not provided or whatever, and evidence of trying to resolve it with them in good faith) and they go away. Have yet to see a court summons or anything, although I'd love to see them try their lies in court. I did not care about the credit report impact - it's probably the only valid reason not to do this if this is something you care about. reply mikestew 3 minutes agorootparentI have done so multiple times, albeit in the UK. Thanks for the follow-up. I suspect UK does make a difference, but IANAL in either country. I do, however, have a bit of personal experience in the U. S. :-) jtbayly 19 minutes agorootparentprevThe first thing that would happen is they would cut off all your service. If you are relying on them for something other than the thing you don’t want to pay for, this becomes a problem. For example, I disputed a charge with my CC from the Apple App Store when I was charged for an app that I shouldn’t have been years ago. They immediately cut off my access to the Store. Other apps couldn’t update, OS couldn’t update, couldn’t get new apps, etc. reply hiatus 18 hours agorootparentprevSo now likely hundreds (or more) of individuals have to not only wait on hold forever, but have to learn the process of and actually go through with filing a small claim? That there is recourse is beside the point when it is mired in bureaucracy (not to mention taking days off to show up to court, etc). reply TeMPOraL 17 hours agorootparentI'm surprised I haven't yet heard of companies who would handle this for you, like there are e.g. for handling the process of getting compensation when an airline screws up scheduling or loses baggage, etc. I'm guessing there isn't enough money to be won there for them to be able to survive off a percentage of it. reply fooker 16 hours agorootparentA hypothetical company that can do this, would also be capable of handling much more lucrative class action suits. reply paulryanrogers 18 hours agorootparentprevClass action suits may be easier, if only arbitration was opt-in-by-default or easier to opt out of. reply DiscourseFan 18 hours agorootparentprevit only takes a few hits from lawsuits for the companies to fix the process. reply kevincox 3 hours agoparentprevCustomers should be able to bill them for wasted time. If you are calling to cancel you can bill an hourly rate. Make it some multiple of minimum wage. Then services will pop up to have someone call and cancel for you, then bill the company for that time. Zero effort on the consumer side and suddenly wait times will drop. The problem is that there is no incentive on the company side to have easy cancellation or any other \"negative\" customer service. If they get billed a hundred dollars for keeping you on the line for 2 hours they will suddenly care a lot. reply throwuxiytayq 17 minutes agorootparentI mean technically, sure. But isn’t that a bit roundabout? There is no real life reason why unsubscribing should be more than a few clicks of effort. If it takes more than 30 seconds, something has gone horribly wrong. Keep companies to that standard, instead of giving them an opportunity to calculate that precisely 9 minutes of wait time doesn’t cost them much and is sufficient for 70% of customers to give up, or something. reply kevincox 12 minutes agorootparentThe idea is that this can be extended naturally to may situations. Warranty claims, insurance claims... If you just add a fine with a threshold it is actually much harder to pick the right fine amount. This way it has some sort of degree of scaling naturally. A small delay is less costly to you than a long delay rather than being all-or-nothing. I agree that for simple things like unsubscribing a button can be mandated, but for other causes of calls to customer support it isn't that simple. reply throwuxiytayq 6 minutes agorootparentI agree that the idea generalizes well. reply jfengel 19 hours agoparentprevThere is a move afoot to eliminate all regulations unless they've been specifically passed by Congress. Which is basically incapable of passing anything. Ironically, that inherent dysfunction is the main reason to suspect that won't happen. But politically, every regulation as automatically partisan, even when it has overwhelming support. reply jimmaswell 19 hours agorootparent> There is a move afoot to eliminate all regulations unless they've been specifically passed by Congress. Which is basically incapable of passing anything. (At least some of) the agencies brought this on themselves with their abuse of the goodwill/benefit of the doubt previously afforded to them. Most flagrant has been the ATF, for one example constantly redefining machine guns or pistol braces, turning millions of citizens into felons with no oversight beyond drawn out and expensive court cases against them. I never liked the smell of this power being afforded to agencies in the abstract, even for the \"good guys\" at the CDC or Department of the Interior. It's too rife for abuse. Federal regulations (whether you call it a law or a rule, the party van is coming if you break them) are supposed to be hard to pass. We once needed an amendment to ban alcohol before we forgot the definitions of interstate and commerce, but if my understanding is correct, under Chevron deference the DEA could have decided to schedule it without even asking congress. reply maximusdrex 15 hours agorootparentYour understanding is not correct. Chevron deference never meant agencies can just make up and pass law; it was a legal doctrine which merely stated that in places where the law is ambiguous (say a law declares water must be clean of pollutants, or bans pistol braces) that courts should look at any guidance from relevant agencies for guidance, since supposedly they should know more about the subject than the courts. It never allowed agencies to circumvent congress or prevented congress from further clarifying law. For example, the DEA doesn’t have the power to schedule drugs due to chevron, Congress includes provisions for the AG to reschedule drugs, which the AG historically has delegated to the DEA, the point being this was a power explicitly granted by congress. While it may sound nice to you right now that the Supreme Court did away with chevron due to your gripes with the ATF, now the definitions of machine guns or pistols or anything else are up to the whims of any judge in any jurisdiction, which could be better or, given that judges likely have even less knowledge of the subject than the ATF, probably worse and more inconsistent. reply Ajedi32 2 hours agorootparent> Chevron deference never meant agencies can just make up and pass law Not on it's own, no. The bigger culprit there is the erosion of the nondelegation doctrine. But Chevron aggravated the problem by allowing agencies to stretch their authority beyond what even congress intended with little possibility of legal challenge. Interpreting the law is and should be the role of the courts, not the role of the agencies that that law is supposed to be governing. It'd be like if we passed a law intended to regulate insurance companies, and the courts decided to give deference to the insurance company's interpretation of that law because \"they're the experts on insurance\". reply michaelmrose 2 hours agorootparentIs there a well functioning large country that doesn't effectively govern this way? The US isn't well functioning its just rich reply Ajedi32 1 hour agorootparentI think most democratic nations have a similar principle of separation of powers, so... almost all of them? The US is rich because it's well functioning. reply 1shooner 13 hours agorootparentprevThis is coming into my work life with web accessibility: The DoJ published a rulemaking in April that filled the many, many gaps in the existing law that determines if the government is violating the ADA when creating websites, etc. What came before this was at least 15 years of tort action, a patchwork of civil rulings across a wide variety of jurisdictions, and generally, confusion and ambiguity. Not the stuff of efficient government. From my perspective, this rulemaking is pretty close to ideal. I did not dream of getting such a clear, detailed direction from a federal agency. I think my jaw may have literally dropped as I read through it. I think the web accessibility is an interesting example, because it's not a bloated bureaucracy harassing some fishermen, it's an agency trying to prevent the government from violating your civil rights. So, is the idea that Congress would have accomplished this instead? I just can't imagine that happening. reply naijaboiler 5 hours agorootparentyeah because Congress now have to become experts at everything: from definition of machine guns, to ADA guidelines. Afterall, if Congress didn't specifically pass the law to the detail, it doesn't exist. The sheer stupidity of that argument is mind-blowing. When you have a government agency with dedicated technical resources, but you will rather a bunch of couple hundred of people with different backgrounds make specific rules about everything. That's just madness reply danaris 4 hours agorootparentThat's because it's not actually intended to make the regulations better. It's intended to make it impossible for regulatory agencies to do their jobs effectively, without outright legislating them out of existence, because the people backing it believe that without effective regulation they and their allies will be more easily able to enrich themselves at the public's expense. reply rietta 3 hours agorootparentIt's because that is the constraints that the U.S. Constitution places on our form of Federal government. The Congress passes laws (and controls the money), the Executive implements the law, and the Courts interpret the law. My lay understanding is that Chevron shifted too much power from the Congress and the Courts to the administrative agencies in the Executive branch. It seemed like a \"good idea\" at the time but over time the abuses became apparent and this Supreme Court reigned it back in towards the balance of powers required by the Constitution. reply immibis 1 hour agorootparentIf congress says \"companies can't pollute and the EPA determines what is a pollutant\" then the EPA is implementing a law congress passed. That's not against any constitutional constraints. reply michaelmrose 2 hours agorootparentprevWhat abuses reply LorenPechtel 15 hours agorootparentprevMachine guns? The ATF is simply going on function rather than form. It shoots like a machine gun it is a machine gun no matter what you call it. That being said, bump stocks are a simple enough concept that banning them is stupid. We should quite our obsession over machine guns--there are few situations where it even matters. The problem with it going through congress is that it will always be political rather than scientific. The agencies don't do a good job, but a lot of that is because of garbage they are saddled with by congress (think of the machine guns--the basic problem is that the legal and practical definitions are out of sync) and a lot of it is because politics manages to get in anyway. How about a middle ground: agencies can make rules but they must give their reasoning and supporting evidence--and anyone can challenge such in court. You can't go after the ruling but if you can knock out it's supports it goes away. This would cut both ways--exempt something from a more general ruling and the reason for the exemption can be challenged. (And I'd like to see the same thing for laws.) reply Dylan16807 13 hours agorootparent> The ATF is simply going on function rather than form. It shoots like a machine gun it is a machine gun no matter what you call it. The part where it breaks down is pointing at a specific piece that enables automatic fire and calling that piece a \"machine gun\", even if it's just a tiny piece of metal or a specially-tied shoelace. reply AceyMan 12 hours agorootparentIf it carries the \"machine gun\" ability with it, it's like ... The Enchanted Seer of Automatic Firing. It turns a 'plain gun' into a machine gun, and there are almost no other ways to do that. So it seems like calling it \"a machine gun\" is reasonable from linguistic perspective. #wittgenstein reply LorenPechtel 3 hours agorootparentNo. The seers have been banned. I don't think anyone thinks they're not machine gun parts. What's been going on is the ATF has been going after a variety of methods of circumventing the concept--means of using the recoil to \"pull\" the trigger without the operator actually pulling it. The result sure acts like a machine gun, albeit an unreliable and inaccurate one. The problem is that it's simply too easy to do, they are fighting a hopeless battle. My understanding is the same problem applies to silencers--plenty of filters out there that just happen to be of the right size to function as silencers. And there isn't even any reason for the rules against silencers. They aren't like Hollywood, it's still loud but below the threshold of hearing damage. reply Dylan16807 11 hours agorootparentprevI don't think the \"almost no other ways to do that\" part holds up. reply lostlogin 1 hour agorootparentYes, other countries manage. Restricting gun ownership rather than machine gun ownership is one approach. reply gosub100 3 hours agorootparentprevI think the machine gun issue is mostly settled. But there is a lot of controversy lately about what is a short barreled rifle (which requires a special federal permit). I don't know the specifics but the laws have been changed after people purchased their guns, such that if they were caught with them they would be in violation of serious gun laws (essentially as serious as having a machine gun without a permit) reply intended 11 hours agorootparentprevThere’s always one part I find worth adding about government being ripe for abuse. Everything is ripe for abuse. ———- Right now, agencies are the defensive structures. Corporations which own media or parties that are effectively corporations - are the threat. One of the specific defenses that’s employed by private forces is reduction in trust of agencies. —— All systems are vulnerable. It’s a question of relative vulnerability. reply someothherguyy 17 hours agorootparentprevhttps://en.wikipedia.org/wiki/Congressional_Review_Act reply rietta 3 hours agorootparentprev\"constantly redefining machine guns or pistol braces\" Pistol braces was struck down not on second amendment grounds, but because the ATF failed to comply with the Administrative Procedures Act, specifically failing the logical outgrowth test. They proffered a comment period and then did a switch when publishing the final rule. Similar shenanigans were afoot with the Trump area bump stock ban, which was ruled against by the Supreme Court itself in Garland v. Cargill. I think that had to do with the agency exceeding its authority beyond what the statute specifically specifies. In laymans terms, the legal details were not ambiguous enough to justify the conclusion that the agency came to stretching the statute through their interpretation. reply throw10920 19 hours agorootparentprev> There is a move afoot Who is behind this move? What individuals, and what politicians? By what legal means is this happening? I've literally never heard of anything like this before - without further details, this is just political flame-baiting. reply adgjlsfhk1 19 hours agorootparent> Who is behind this move? What individuals, and what politicians? By what legal means is this happening? The supreme court. The removal of Chevron Deference this year means that the courts have given themselves huge amounts of power over any administrative decision that isn't specifically regulated by congress (rather than the prior stance which was to presume that agency decisions were reasonable interpretations of the legislation unless there was clear evidence to the contrary). reply thehappypm 18 hours agorootparentFederal agencies now have oversight from the judicial branch. That's a big check on their power. reply someothherguyy 16 hours agorootparent> now They always have? reply thehappypm 16 hours agorootparentMuch less. reply immibis 1 hour agorootparentYes. Previously the court had to prove that something an agency did went against the mandate congress gave it, to strike it down. Now it can just strike it down for no reason. This is useful in times when republicans control the courts and democrats control the executive. reply tbrownaw 17 hours agorootparentprevThis is not an accurate description of that decision. Agencies no longer get special privileges in interpreting the scope of what Congress delegated to them. Within the scope of what Congress delegated to them, they still have an much power and discretion as ever. reply adgjlsfhk1 1 hour agorootparentif Congress wanted to delegate decision making to the judicial branch they can pass laws that do so. they pass a law saying that the agency can make decisions, those decisions should be respected. this decision is right the equivalent of if the courts decided they had the power to block laws that the court thought were bad policy reply FireBeyond 16 hours agorootparentprevThere was an argument about noncompetes and the FTC in front of a Federal judge recently. The judge said, \"Even as the agency has the power, I don't feel sufficiently convinced by their argument and will block it anyway.\" That doesn't sound like they have as much power in their delegated responsibilities if an arbitrary judge says \"... and you also have to convince me personally, even though you're entitled to do it.\" reply Curvature5868 19 hours agorootparentprevhttps://apnews.com/article/supreme-court-chevron-regulations... reply throw10920 19 hours agorootparentChevron is irrelevant here and does not support the argument being made, unless you're moving the goalposts. reply theossuary 17 hours agorootparentprevYou shouldn't assume others are acting in bad faith when the much more likely explanation is you're just not paying attention. Three major developments from the courts in this direction have been: - The overturning of Chevron gave courts the power to interpret portions of laws written by subject matter experts, instead of those experts themselves. - The big questions doctrine has allowed the courts to decide when the legislature has deligated too much power. - Cornerpost has removed the statue of limitations for challenge policies and rules out in place by agencies. These together clearly paint a picture. Any policy can be challenged (in any venue, allowing the plaintiff to pick their venue). This allows policies in place for decades to be challenged and brought to the supreme court. The most recent court has adopted the major questions doctrine, allowing them to strike down any policy they feel pertain to \"issues of major political or economic significance.\" (no they didn't define it more than that). Or, if they can't make that argument, they can interpret the law to strike down the policy due to the overturning of Chevron. We've seen an unprecedented shift of power to the supreme court in the last few years. They're using the disfunction in the legislature as an opening to gain power. Which is scary considering it's a group of 9 unelected people with lifetime appointments. https://www.scotusblog.com/2024/06/supreme-court-strikes-dow... https://en.m.wikipedia.org/wiki/Major_questions_doctrine https://www.scotusblog.com/case-files/cases/corner-post-inc-... reply soco 8 hours agorootparentThe Romanian supreme court just decided to block the presidential elections. They might have had reasons, but they definitely didn't have the mandate, yet they decided it nevertheless and because they are supreme nobody can challenge them. I'm sure the US supreme court (and more) is warming up to this concept. reply immibis 1 hour agorootparentYou aren't listening. Read about the reasons they did that, before concluding they did it for no reason. reply Der_Einzige 19 hours agorootparentprevhttps://en.m.wikipedia.org/wiki/Executive_Order_13771 reply rat87 19 hours agorootparentprevThe politicians on the supreme court and while the case was pretty recent the move to limit it dates back a long time before that https://www.scotusblog.com/2024/06/supreme-court-strikes-dow... reply specialist 15 minutes agorootparentYes and: Two (of many, many) books which detail two separate efforts to dismantle our administrative state are: Lobbying America https://www.amazon.com/dp/0691168016 the history of how Business Roundtable, Chamber of Commerce, et al reacted to The New Deal by transitioning from trade groups to political players. Democracy in Chains https://www.amazon.com/Democracy-Chains-History-Radical-Stea... shares (Nobel winning economist) James McGill Buchanan's role in bootstrapping the Southern flavored conservative movement (libertarian \"free enterprise\" segregationists reacting to Civil Rights Era and The Great Society). reply eadmund 18 hours agorootparentprev> By what legal means is this happening? Article I, section 1 of the Constitution: ‘All legislative Powers herein granted shall be vested in a Congress of the United States, which shall consist of a Senate and House of Representatives.’ It doesn’t say, ‘Congress may delegate its legislative Powers to the Executive.’ Arguably, the ‘shall’ language forbids that! Article I, section 8 does give the Congress the authority to pass laws necessary and proper to execute its regulation of interstate commerce (among other things), but … it’s not necessary to delegate legislative power in order to execute the law. reply specialist 2 minutes agorootparentWhile complimentary, the various policy, legislating, rules making, procedures, and enforcement are distinct activities in the governmental stack. By necessity, legislators delegate rule making to agencies. Who do you want determining the precise definition of a kilogram? Congress or NIST? By necessity, some rules have the force of law. Like how many state's Secretaries of State are entrusted with clearly scoped essential administrivia, like how to run elections. Do you really want legislators doing the technical and operational evaluation of tabulators? Of course, precisely where the lines are between various jurisdictions must be adjudicated. That's why we have the courts. IIRC, most cases heard by SCOTUS pertain to administrative law. How else could our government function? intended 11 hours agorootparentprevAgencies require masters and Phds amongst their experts. Those people need to be paid, and their services accounted for. Those outreach and comms programs also need to be handled. Congress can’t add 300 days into 24 hours. So this is a reading of law kinda like an absolutist readings of a text. reply potato3732842 18 hours agorootparentprev>There is a move afoot to eliminate all regulations unless they've been specifically passed by Congress. Which is basically incapable of passing anything. It's hard to argue with this in principal. The rules as law BS has been a band-aid over dysfunction. It needs to go. It'll hurt in the short term but should be more sustainable in the long term. That people will get more angry at congress for doing nothing is icing on the cake. reply ajmurmann 17 hours agorootparent> That people will get more angry at congress for doing nothing is icing on the cake. I want to be optimistic about this. In practice it seems that the strategy created by McConnel to block any legislation at all has been doing/tricking the voter really well. As he predicted, credit for anything good goes to the current admin while anything bad also gets blamed on the current admin. I can see a likely scenario where \"people getting more angry\" will only make this strategy to block everything work even better. I hope I am wrong and the \"nuance\" that congress exists and isn't controlled by the president will finally get into people heads. I also hope that once it gets into their heads, the conclusion won't be that a authoritarian dictator is needed. reply xp84 17 hours agorootparentI agree with you: frustrated by a Congress that can’t pass any legislation, the one thing it doesn’t seem like anyone is willing to try is to consider compromises. Everyone seems fully convinced that if only the 50% (or more) of the voters who disagree with them would just drop dead, we could fix everything. And as a result, voters punish lawmakers, who horse trade and negotiate. Even though that’s the only way things used to get done until everything broke 10 or 15 years ago. reply immibis 1 hour agorootparentCompromising in the current congress: \"Let's meet in the middle\" says the unjust man. You take a step towards him. He takes a step back. \"Let's meet in the middle\" says the unjust man. reply someothherguyy 17 hours agorootparentprev> It'll hurt in the short term There are decades of rules in the federal register. How long do you imagine it will take the legislative branch to patch them? Go skim some of them, and see if you feel the same way afterward: https://www.federalregister.gov/documents/search?conditions%... reply TylerE 17 hours agorootparentprevIt's very easy to argue against when the people that most want to violate the rules have congress in their back pocket. I personally prefer being actually able to breathe the air and not work 70 hours a week with no benefits. reply drewg123 20 hours agoparentprevDish is terrible. After my mom passed away, they were one of the few things that my Dad had trouble cancelling. Even with a copy of her death certificate, my Dad could not get the service cancelled. He just ended up throwing the bills (and their equipment) away. reply flutas 18 hours agorootparentYup, same experience here 3 months trying to make them understand \"he is dead\". We left their crap in a room for ~6 months total at the advise of his estate lawyer. Eventually they did accept that he was dead and canceled the account as well as sent a box to send the equipment back. They got their equipment back after it had all had an unexpected encounter with a hammer. Never heard a peep about it. reply gosub100 1 hour agorootparentprevI think they went bankrupt, so hope that's some consolation. I heard that an attempt to buy them by DTV got rejected on antitrust. But in the article it said they went bust reply impossiblefork 19 hours agoparentprevIt's really basic contract law stuff. Here in Sweden, if the amount isn't clearly presented, there's no agreement to pay the specified amount, so there's no contract and no obligation to pay-- an agreement becomes binding because of the reasonable expectation of a party on the counterparty. I don't understand American contract law, since I even see ideas like changing agreements, which are completely contrary to the very notion of a contracts as I understand it, so it's nice that something is done about these strange practices. I don't understand how it's come to this point though. That courts have been willing to tolerate things that aren't in the contract (i.e. changes to contracts), provisions that aren't clear, etc., and complex and strange provisions even in contracts of adhesion and things presented to consumers. reply LorenPechtel 15 hours agorootparentMostly it comes down to the fees being presented at the end rather than at the beginning. You have to follow the process through to the end to figure out what it would cost which makes price comparisons much harder. Occasionally this is unavoidable--shipping charges. If they simply pass through what UPS charges, fine. Otherwise, they should be listed up front. reply __MatrixMan__ 20 hours agoparentprevI'm told you can just write the account number to cancel on a brick and throw it through their window. Might be worth a try. reply onlyrealcuzzo 20 hours agoparentprevOf course it's controversial. They do this to increase profits. A certain portion of the population is pro-profit at virtually any cost. It might seem like Dish employees wake up every day and say, \"What can we do today to screw our customers even more?\" But usually they're just trying to find ways to make more money. reply Centigonal 20 hours agorootparentDish knows their satellite TV business is on the way out. Their strategy is to maximize the present value of that business by retaining and squeezing as many of those customers as much as possible, slowing the decline and pulling as much money out of that vertical for as long as they still have it, so that they can reinvest that cash into new verticals with more promise. reply gosub100 1 hour agorootparentI swear these satellite services could eliminate live tv and go on-demand only using a hard drive DVR style, with maybe 10-20 live channels. Everything else would be a stream that would download and notify you when it was ready. The bandwidth of those dishes has got to be multiple gigabytes per second. They could broadcast everything and the viewers would just opt in to the specific shows or movies they want. Completely switch the business model. reply Aloha 19 hours agorootparentprevThe ironic part of all of this, I would have pay linear TV services if it was cheaper - 50 bucks a month for the whole house, and I suspect they could have 30%+ more customers. reply gosub100 1 hour agorootparentDish profit doesn't scale that way. They have to pay the channels for broadcast rights. More TVs per household means in theory more royalties paid to the networks. reply thanksgiving 18 hours agorootparentprevIt doesn't solve the problem that \"the line must constantly go up\". A steady revenue and constant returns isn't good enough, apparently and in the case of dish, it will be declining revenue over time no matter what they do. reply amyames 19 hours agorootparentprev>It might seem like Dish employees wake up every day and say, \"What can we do today to screw our customers even more?\" Made the mistake of buying a boost mobile sim this year. It was “expired” upon opening it. Retailer refused to refund it. Having not learned my lesson yet, I went elsewhere and ripped it open to check the expiration date this time before I bought it. Well “it’s prepaid for 90 days and comes with 35 gigs” it says on the card. Go to activate it, it puts a further $100 on my credit card and congratulates me for activating my 30 gig service plan. Hokey frauds. reply selimthegrim 18 hours agorootparentBe glad you weren’t on Ting. reply simfree 16 hours agorootparentWhat crap did Ting pull on you? Their aggressive data throttling always rubbed me the wrong way, along with the Extreme data pricing, considering it was on Sprint's terrible network. reply joecool1029 20 hours agorootparentprev> It might seem like Dish employees wake up every day and say, \"What can we do today to screw our customers even more?\" Shit flows downhill. Their owner, Charlie Ergan, wakes up every day thinking of new ways to defraud the government with DISH and Echostar: https://nypost.com/2024/03/22/us-news/doj-moved-to-dismiss-3... I usually complain about his spectrum squatting with DISH, but there's so much more if you dig a little. reply jagged-chisel 18 hours agorootparentprev> \"What can we do today to screw our customers even more?\" But usually they're just trying to find ways to make more money. But you repeat yourself. reply meiraleal 18 hours agorootparentprevThe directors and shareholders, not the employees. They only want to get paid. reply throw10920 19 hours agorootparentprevnext [2 more] [flagged] BadHumans 18 hours agorootparentDo you expect there to have been studies done on what percentage of the population puts profit over everything else? > What does \"virtually\" mean? virtually /vûr′choo͞-ə-lē/ adverb Almost but not quite; nearly. reply AnthonyMouse 18 hours agorootparentprev> A certain portion of the population is pro-profit at virtually any cost. This is a mischaracterization of the criticism. Suppose we all agree that Dish sucks and making it hard to cancel is malicious. A rule is proposed to require customers to be able to cancel any subscription on the vendor's website. Is that a completely reasonable rule that will have no negative consequences? A lot of small businesses don't even have a website, or if they do it's fully static content that just provides information about their offering and if you want it you call them. Some two-person landscaping service doesn't have an IT department to implement this and having to call them to cancel isn't a real problem because they actually answer their phone. And if this was only one rule they would just suck it up and pay someone a thousand bucks to make them a website where you can cancel, but it's not. So when you propose yet another piece of red tape they have to take food off their table to make go away, they line up with rotten tomatoes, and anyone proposing to pare some of it back gets their vote. reply acaloiar 18 hours agorootparentClick to cancel does not mean exactly what the name implies. It means cancellation must be as easy as signup [1]. In your example, signup is not a click away, so the cancellation process need not be. It’s a very reasonable position. [1] https://www.ftc.gov/news-events/news/press-releases/2024/10/... reply danaris 3 hours agorootparentTo be fair, the name \"click to cancel\" does not, in fact, imply that cancellation must be as easy as signup in cases where signup is not a click away. A name that would better imply that would be something like \"symmetric cancellation\", or \"cancellation parity\". However, that would be less catchy to the public than \"click to cancel\". reply khuey 18 hours agorootparentprev> A rule is proposed to require customers to be able to cancel any subscription on the vendor's website. Except that's not the proposed rule. The way this works in California (and the way the rule the FTC recently published works, I believe) is that a business is required to allow customers to cancel \"in the same medium\" that they subscribed. That doesn't require anyone to start running a website. The rest of your post is just arguing against something that's not even happening. reply AnthonyMouse 17 hours agorootparent> a business is required to allow customers to cancel \"in the same medium\" that they subscribed. But then you're not really fixing it anymore. \"Must be able to cancel directly via website\" (i.e. without waiting for a customer service rep) might have been useful. Require only the same medium and soon Dish has both sign up and cancellation happen via a customer service chat window on their website, but if you choose sign up the chat has representatives/acceptance bots appear instantaneously to approve your sign up, whereas cancellation has a four hour queue and if you fail to wiggle your mouse every 30 seconds you get timed out. You have to come up with a rule strict enough to defeat the corporate lawyers without making it so complicated or comprehensive that it puts significant compliance costs on smaller entities. Which is really hard to do, with the result that most of the rules that actually pass don't do that, which is why people get irked. One of the better ways to actually solve this is to have some fairly significant entity size thresholds (e.g. thousands of employees and millions of customers) and then exempt all smaller entities but fasten the larger entities to the wall with red tape. If you could get the regulators to consistently do that. But because that's typically not what happens, people continue to be discontented. reply BytesAndGears 16 hours agorootparentAs-is, it works very well in California. I had never experienced the resistance you imagined during the 3-4 years I lived in California, and regularly cancelled subscriptions that were notoriously hard in other states reply AnthonyMouse 12 hours agorootparentCalifornia passed the click to cancel law this year. They passed a different law trying to make it easier to cancel subscriptions in 2018. The need for them to revisit it implies that the original one wasn't working. Corporations act strategically. They typically don't immediately thwart new laws because the coalition that passed them is still intact and would try to do something about it. So they wait a minute, maybe take the time to buy some more legislators, before testing the fences again. If people have forgotten about them by then you lose, and if people haven't forgotten about them by then, California passes the 2024 law and you lose the other way. Because they pass the new law in addition to rather than instead of the old one, even though the old one has stopped working, so you have a ratchet of ever-increasing compliance costs that also apply to all the companies that were never doing anything wrong to begin with but still have to hire lawyers to evaluate their activities against an entire bookshelf of rules to see if any of them require something they're not doing. reply LorenPechtel 15 hours agorootparentprevNo timers, no human interaction. And if the process takes time (there are times I think confirmations are warranted) once that's been done the cancellation takes place at the time of your original request. (Which you can screenshot.) reply AnthonyMouse 13 hours agorootparent> No timers, no human interaction. Is there something in the proposed rule that actually says this? And if so, what happens to the small business that does cancellations over email/phone and therefore requires human interaction? > And if the process takes time (there are times I think confirmations are warranted) once that's been done the cancellation takes place at the time of your original request. (Which you can screenshot.) The issue isn't that you care if the cancellation happens at 9AM or 9PM, it's that if you have to wait twelve hours to speak to a representative you give up before reaching the point you can make the request. reply nyczomg 18 hours agorootparentprevYou make the rule such that if you can sign up for a service on a website you can also cancel it said website. Now your hypothetical landscaping company is safe reply AnthonyMouse 47 minutes agorootparentAre they? A very basic website can easily have a form you can fill to sign up and all it does on the back end is send an email with the info to the proprietors. Even a generic mailto: or tel: link arguably makes it possible to sign up via the website, if tapping the link on your phone to send a message can directly result in a signup. To do the same thing for cancellations you'd have trouble avoiding the need for customer accounts to sign in and connect to a database to list what services they're currently subscribed to etc. Otherwise people who signed up under the wife's name may try to cancel under the husband's name and you don't know who they are, neighbors who don't like the racket from the equipment see your website on the trucks and try to cancel the service even though they're not the customer because you have no authentication, people make ambiguous or incomplete requests and you don't know what they're asking to do. But if you have to contact them to clarify you're not satisfying the requirement that they can cancel via the website. reply SOLAR_FIELDS 18 hours agoparentprevAgree to both. And both are incredibly easy problems to solve. For the first just have a law that says: > Any advertised price must include all mandatory taxes and fees. No exceptions. For the second just have a law that says: > An end user must be allowed to use the same method to cancel as they used to sign up for the service. No exceptions. Additionally, an end user cannot be required to perform more manual actions to cancel than was required to sign up. No exceptions. No one should be against this except greedy corporations. Easily solved, common sense rules that already have working examples in the real world. 1 is already the law in Netherlands and Australia and these countries aren’t falling over from the undue burden placed on businesses. I’ll end with: two cornerstones of a free market are price transparency and the ability/mobility to switch services when a better competing offering emerges. Not having legislation like above to protect those values is anti capitalistic reply LorenPechtel 15 hours agorootparentBut what's a mandatory fee? Free airfare to Hawaii! Fee for paying by cash: $1000 Fee for paying by check: $1100 Fee for paying by credit card: $1050 Fee for middle seat: $200 Fee for window seat: $300 Fee for aisle seat: $250 Note that no fee on this list is mandatory because you always have other options. reply SOLAR_FIELDS 15 hours agorootparentTo me that is totally fine. If there are electives, then elective them. Fix the mandatory ones first. Like the “resort fee” hotels charge. Or “cleaning fees”. It becomes trickier when the fee is elective, but a significant part of the advertisement. Southwest Airlines complaining about having to advertise their fares, which come with two bags included, alongside other airlines who don’t include any bags comes to mind. I think there is probably some world where elective fees are included as well though this seems more nebulous. However, let’s not let the perfect be the enemy of the good: Even just including everything that is compulsory in the base price itself, including taxes, would be a massive improvement to the status quo. Fixing this elective fee ambiguity would be a next step reply danaris 3 hours agorootparentDid you...actually read what they wrote there? The (hypothetical) airfare was listed as \"free\", but it was impossible to end up paying less than $1200 for it. The point being that even if you have a choice between several fees (making none of them \"mandatory\" by a narrow reading), you're still paying something beyond the advertised base price. The logical good-faith rule in a case like this would be that you must advertise at least the minimum price anyone would end up paying based on the available \"fee choices\". reply LorenPechtel 3 hours agorootparentI'd go a little farther and say that if there are impractical scenarios to avoid the fee it still must be included. (Say, no fee if you pay the fare in Timbuktu.) Advertise it based on the 95th percentile of what actually happens. reply lmm 15 hours agorootparentprevSo what happens when you buy that ticket and don't pay any of the fees? If you get taken to Hawaii then they're in the clear. If they won't take you without you paying the fee then I guess the fee wasn't optional after all. reply LorenPechtel 3 hours agorootparentBuy the ticket how? Look at the fees for paying--you can't actually buy the ticket without paying for it. reply insane_dreamer 20 hours agoparentprev> banning it should not be controversial for many people, any kind of regulation that restricts companies abilities to make money, regardless of the consequences for average citizen, is \"wasteful and discourages innovation\". Elon would like to get rid of the FTC altogether for that reason, as well as the Consumer Financial Protection Bureau, which was set up to help protect users from scammy behavior like this. so yeah, don't hold your breath for the next 4 years (or longer if Elon manages to buy the next election too) reply mikrl 4 hours agorootparentI revisited Henry Hazlitt’s economics in one lesson and in the chapter on labour unions, he actually is fairly moderate provided that unions stick to non-price distorting policies. Making wage information more accessible to workers being a policy he- an Austrian School economist- supports. This government ruling falls under that class of policies IMO. It makes prices much more available to consumers and does not on first inspection threaten to distort supply and demand. reply LoganDark 20 hours agoparentprevMy preferred way to cancel these types of services is to close or pause the card they're charging. If you use a virtual card service like Privacy.com, this is easy, if you don't, then maybe not so much. But using virtual cards for everything you can is typically a good idea anyway, imo. reply breadwinner 20 hours agorootparentBut then that becomes unpaid bills and they send you to collections. reply sudoshred 20 hours agorootparentYou can dispute debt in collections by requesting proof of the debt. The consumer protections in that area (debt collections) are quite a bit more developed than any consumer protections about intentional procedural inefficiency when cancelling service. reply naijaboiler 5 hours agorootparentyou will end up with damaged credit. The only negative on my credit report is from a verizon phone I bought from a verizon store (actually ended up not being Verizon owned store,) which i returned within the 7 days return fee, even paid re-stocking fee. But which the store credits me for having returned it later than I did, which allowed Verizon charged me 1 month service fee, which I never got a bill or email even though verizon had both, until it showed up on credit as collection. Nothing I did could get it off. reply nodamage 19 hours agorootparentprevIf you never actually took the steps to cancel your contract won't they be able to prove your debt via the existence of a non-cancelled contract? reply danaris 20 hours agorootparentprevYou can probably avoid this—or, rather, cover your ass legally—by doing something like sending them a letter registered mail informing them that you are cancelling and will be blocking further payments. It's far from a good solution, but it should at least put you in a better position vis-a-vis the courts if it comes to that. reply spiderice 19 hours agorootparentSuddenly waiting on the phone for 45 minutes doesn't sound so bad, unless proving a point is your main goal. reply breadwinner 18 hours agorootparentActually there is another option. Make a complaint to your state's Attorney General's Office. They usually have a website for filing consumer complaints, and AGO will contact the business, and the business is usually responsive when contacted by AGO. reply eric-hu 18 hours agorootparentHow does this work? Do you provide the AGO with your name, phone and address? Subscription details? reply breadwinner 17 hours agorootparentYes. Here's the Texas AGO's web site, as an example: https://www.texasattorneygeneral.gov/consumer-protection/fil... reply hiatus 18 hours agorootparentprevIt certainly takes less that 45 minutes to send registered mail. There are even online services to which you can upload a PDF or document of your message. I have done this on numerous occasions. reply danaris 6 hours agorootparentprevFor some people, being on the phone for 45 minutes (and what guarantee is there that you'd actually get to talk to them after 45 minutes?) during business hours is simply not an option. They would have to take time off from work, which a) might not be allowed, and b) if allowed would certainly reduce their pay. Furthermore, there's an entire category of people for whom \"talk on the phone\" is not an option, period. If they wanted to cancel by the approved method, they'd not only need to take that time themselves, they'd need someone else willing to take that time with them. reply xenospn 20 hours agorootparentprevSimple anecdote, but when I paid a medical bill and they still came after me and sent it to collections, I contested the bill and told the collection agency that this is not my debt. Never heard from them again. reply dboreham 20 hours agorootparentprevOnly in America reply LorenPechtel 16 hours agoparentprevThe problem with click-to-cancel is that there should be confirmations built into important cancellations. But require it to be practical to do online, with no delays and no requirement about when relative to renewals. reply 77pt77 3 hours agoparentprevYou can always cancel any contract by certified mail. reply dotancohen 18 hours agoparentprevWhy is a law needed to address this? Isn't the market supposed to adjust for companies like this? reply TylerE 17 hours agorootparentWe have hundreds of years of examples of the blessed free market failing to do exactly that. If the free market had it's way we'd still be under the yoke of Standard Oil and Ma Bell. One key element of a free market is the \"well informed consumer\". How is the consumer supposed to be informed about what new cutting edge chemicals are toxic, for instance? reply dotancohen 6 hours agorootparentFor the hundreds of years of examples, we have not had an interconnected network with information available to almost every human on the planet. reply TylerE 4 hours agorootparentNot a free market project. Funded by the US military. reply LiquidSky 3 hours agorootparentprevPoe's Law truly is a terrible thing. reply Freedom2 18 hours agorootparentprevPrecisely. The overarching HN view, although it's not a monolith (so the viewpoint isn't shared by all), is that the free market solves for all things and regulation by the government is largely a waste of taxpayer money that could be going to other things worthwhile (roads, military, police). reply haliskerbas 19 hours agoparentprevThe woke ideology wants to add all of this nonsense regulation and make it hard for real entrepreneurs to generate value in the wonderful system of capitalism. /s P.S. this is also a good summary of every all in podcast episode post election reply alberth 3 hours agoprevThe hidden fees is what turned me off from AirBnb... Because it would display the nightly rate as $X. But then at checkout, it would add in \"house cleaning fees\" etc (which I don't dispute is a fair fee to include) but it at times can grossly misrepresent what your true nightly cost is when searching. Maybe this will be a step in the direction like Telco's have had to do with creating simplified & standardized \"nutrition labels\" for pricing. reply SparkyMcUnicorn 52 minutes agoparentOn AirBnB just check the \"Display total before taxes\" box on the search results page. Not including fees in the nightly rate makes sense as some are fixed rate, and having the option to see the cost for the total stay (including fees) solves the problem. reply munk-a 21 hours agoprevAn excellent change. It's unfortunate that stewardship of the committee will soon change hands as Khan has been a great advocate for fair contracts between companies and consumers during her tenure. reply idopmstuff 1 hour agoparentI think she's done such great work on the administrative side of things with junk fee bans, etc., but I feel like she has also burned an enormous amount of taxpayer money on lawsuits that don't have value (like suing Meta for acquiring the tiny VR fitness company). It feels like she's just against any acquisitions by large companies, and I think that's both too broad of a stance for the FTC to take (as opposed to really looking on a case-by-case basis of whether consumers would be hurt by an acquisition) and also harmful to new companies being created, since suddenly an important option for exits is a whole lot less likely as large companies hesitate to be acquisitive. reply lobsterthief 32 minutes agorootparentLawsuits are one of the few enforcement mechanisms the FTC has. reply mentalgear 21 hours agoparentprevIndeed, Khan has been the first real pro-public steward of the FTC for decades. reply nxm 17 hours agorootparentnext [2 more] [flagged] azemetre 5 hours agorootparentmeh, her changes are good and empower every day consumers. I vastly prefer Khan over judges that don’t care and act partisan. reply nodesocket 21 hours agoparentprevnext [22 more] [flagged] hcal 21 hours agorootparentYou're right that businesses might roll fees into the base price, but that’s the point: transparency. When all costs are upfront, customers can more easily compare prices between competitors. Hidden fees make price comparisons difficult and misleading. Take airlines, for example—if one shows a $200 ticket and another shows $180 but sneaks in $30 of fees later, the second one appears cheaper. By requiring prices to reflect the full cost upfront, businesses compete on the actual price rather than deceptive practices. This won’t magically lower costs, but it will force clarity and reward companies offering genuine value. Consumers should have a clear picture of what they’re paying, not a surprise at checkout. Isn’t that just fair competition? reply tippytippytango 20 hours agorootparentYes! Markets work better when deceptive price signals are not inhibiting price discovery. When deception is not rewarded. reply jameskraus 21 hours agorootparentprevThere's still a lot of benefit to seeing the prices up front vs. fees which are added on later. It can be a frustrating experience to realize that something you think is affordable is significantly more expensive once you make it to the checkout screen. For example, I've been booking a group trip lately, and I found that the sticker prices for some things didn't include many fees, so it was more of a hassle to actually get accurate quotes. At the same time, the companies which were providing these prices have an incentive to hide fees, because that's what all their competitors are doing – they have pressure to be competitive both at first glance and at checkout. With a level playing field, these fees should be incorporated into the total price across competitors, allowing for easier cross-shopping. I'm excited to be more confident I can quote what I see initially vs. going through a checkout flow. reply KumaBear 21 hours agorootparentprevSo which is better? Ticket price shows at a price of 100 dollars upon checkout you get a ton of fees and it balloons to 140 dollars. Or ticket price shows as 140 dollars you can choose to buy it at said price or not no surprises later in the checkout process. If prices are perceived as high from the moment someone searches for it they may be more tempted to check elsewhere or opt out. reply hnburnsy 21 hours agorootparentSome ticket sites won't even show you the fees until you create an account. reply bullfightonmars 21 hours agorootparentprev1. I'm not convinced by this argument, airlines compete on list price. If they can add a bunch of fees after winning on list price, they can move more and more of their costs into the fees and are no longer competing on the real price. 2. Let airlines compete on transparent pricing. I think this alone is enough of a benefit to this move. reply ghaff 20 hours agorootparentThey do. On the other hand, I'm typically exempt from a lot of the airline add-ons for various reasons. Airlines are probably not the best example. A lot of people probably want cheaper airfares even if it means less/poorer service in a lot of ways. But it should be as transparent up-front as possible. Even if infrequent travelers may not always understand the details. reply bobthepanda 20 hours agorootparentI think airlines are a great example because the fees are often actually paying for something materially different. When purchasing concert tickets recently I got a \"mobile convenience fee\" for an e-ticket even though the venue doesn't operate a physical box office. A recent hotel had a \"resort fee\" that was not opt-out even if you didn't use the amenities it allegedly paid for. These kinds of BS fees should go away. reply ghaff 20 hours agorootparentNon-opt-out resort fees and facility fees and the like are especially annoying. They're also (presumably deliberately) a small enough portion of the total amount that they're not really worth getting into a big lather about. I think we're agreeing. While a lot of airline fees are nickel-and-diming, they're also over and above transporting people from A to B, in many cases for as little money as they want to spend as possible. reply getnormality 21 hours agorootparentprevI think that's all we want. To know the cost upfront so we can compare choices efficiently. We don't expect businesses to lower total cost, just be more cooperative and less exploitative in communicating it. reply kevin_thibedeau 21 hours agorootparentprevThe higher price will be displayed up front and affected companies will have to compete on the real pricing. reply the_svd_doctor 21 hours agorootparentprevPersonally that's all I'm asking for. Transparent pricing. It amazes me how far business will go to to just hide how much they want to charge me. Recently in California, restaurant have been great at making their prices as difficult as possible to try to figure out. reply munk-a 21 hours agorootparentprevIgnoring your last sentence - I'm well aware. These changes increase price transparency and that's something we all benefit from. Junk fees are a way to exploit psychology and ignorance to extract more money out of consumers than they'd like to pay. I'm okay with things being expensive - I'd prefer if they weren't but that's the way to the world - I'm not okay with things being expensive and companies advertising them at a far lower price. reply specialp 21 hours agorootparentprevThat is fine because then someone decides to buy something based on what it costs. The status quo is that some company decides to backload the cost with hidden fees and then all competitors need to follow by doing the same or they will be \"undercut\". This is just bad for consumers because it makes it very hard to determine what they are paying for something and how to compare it with other prices. reply rozap 21 hours agorootparentprevThat's fine. Just tell me the price up front. reply cmurf 21 hours agorootparentprevYou're defending hidden fees? Free markets depend on information. Facts. Not lies. reply Sohcahtoa82 20 hours agorootparentLet's be honest here. The people that claim to support \"free markets\" really just mean they support corporations being free to do whatever the hell they want. reply cmurf 2 hours agorootparentMany people are confused. A free market needs regulation to maintain competition. Companies dislike competition because it lowers profits, and will do what they can to avoid competing on a level playing field. Like adding hidden fees. reply Sohcahtoa82 1 hour agorootparentI think really there are two types of \"free market\" supporters. The first is what you're arguing, a version that includes \"free of monopolies\" in the definition. A market full of competition. A market that has no choice but to serve their customers to the best they can because otherwise a competitor will take their customers. The second are the anarcho-capitalists. They have the naive belief that corporations that do bad things will be punished by the market, making regulations unnecessary and stifling. To them, if one business is winning due to deceit, then the blame lies in the customer for being deceived. They think the decision that leads to the most profit is the best, side-effects be damned. They're insufferable and would gladly destroy the planet for an extra 5% profit on their quarterly reports. reply taco_emoji 21 hours agorootparentprevI get the impression you haven't thought about this very hard. reply atoav 20 hours agorootparentprevCool. Come over here to Europe and tell us how expensive our you pay what you expect concert tickets are. Naive shilling for the capitalists doesn't get you anything, except more expensive concert tickets that is. So let me ask you one question. Who do you think will pay more: 1. the person who sees all the costs upfront 2. the person who at the end of the deal will see additional fees please tell me it is 1 and tell all of us how it is you \"who understands basic economics\" reply BurningFrog 21 hours agoparentprevAs a free market fan, Khan seems to have been pretty terrible. But this looks genuinely good! It's basically banning fraud. ---[EDIT], since everyone is asking for reasons here are two libertarian/conservative critiques: • https://reason.com/2024/11/07/good-riddance-lina-khan/ • https://archive.ph/IjNmZ reply nabla9 20 hours agorootparentAs a pro-market fan, Khan is great. Pro-market: pro-market advocates for policies that enhance competition and market efficiency. Understands that god markets are made. Pro-market advocates believe in creating conditions where businesses can compete fairly without undue advantages from government favoritism. Government regulation can be essential to correct market failures and promote a level playing field. Free market: and ideological stance where markets are without government intervention. Belief in ideal world where market failures don't exist and if they exists that's a good thing. reply fsckboy 14 hours agorootparent>Free market: and ideological stance where markets are without government intervention no, markets without government intervention are called \"laissez-faire\" markets. There would be no need for that term if that's what free market meant. reply ImPostingOnHN 11 minutes agorootparent> There would be no need for that term if that's what free market meant. I'm not following here: are you suggesting that given any two different words, it is impossible for them to refer to the same thing or mean the same thing? reply nickff 20 hours agorootparentprevWhy do you describe “free market” as being ideological, and “pro-market” without those terms? Both seem equally ideological (or not). reply sdwr 20 hours agorootparentIdealist: \"the free market is perfect!\" Realist: \"the free market has flaws, which can be addressed by...\" Replace \"free market\" with anything you like reply meiraleal 18 hours agorootparentThe realist might be an idealist that is seeing inexistent flaws tho reply sdwr 1 minute agorootparentVery true. The definition of realist has flaws... TeMPOraL 17 hours agorootparentprevThey most likely aren't idealist, as that isn't a requirement. Anyone who's smarter than a potato can notice some of the more glaring failures (even if they don't understand the mechanism behind it). reply hiatus 18 hours agorootparentprevThen that's not a realist, by definition. > accepting a situation as it is and being prepared to deal with it accordingly. or > representing a person or thing in a way that is accurate and true to life. reply meiraleal 17 hours agorootparentThat's the point, a wrong realist. reply gizmo 20 hours agorootparentprevEverything is ideology to some extent, but not everything is ideological to the same degree. The beliefs that a level playing field is good and that winning by means of political favoritism is bad are almost universally agreed on. Almost all political philosophies, including various shades of socialism and communism, agree that markets are needed to some degree if only for price discovery. reply theossuary 20 hours agorootparentprevRepublicans have made the term ideological a negative one. Sure, the dictionary definition is to relate to ideology; but in practice (especially when talking politics) it implies one is picking a worse option because it aligns with their ideology. So their claim above is one is picking free markets due to ideology, whereas another would pick pro markets because it's actually the best solution. reply qeternity 20 hours agorootparentprevBecause they are against one and for the other. Pro markets means whatever policies they agree with, which is of course how all broken highly regulated markets begin their run. reply LinXitoW 20 hours agorootparentprevI mean, I agree that Khan is the best possible option, but I disagree that pro-market isn't ideological. Where the free market fans see child slavery and sexual slavery and rejoice (free to make any contract you want to after all), the pro market people believe that if you just put enough guard rails on it, greed will magically turn into a force for good. Obviously I also have an ideology, but at least I'm honest enough to not pretend that capitalism (or communism/anarchy) are naturally occuring, instead of simply a choice we make. reply michael1999 2 hours agorootparentprevThose are pretty weak sauce. The Reason piece is lazy drive-by snark. Calling the anti-trust standards of the 20c \"hipster anti-trust\" is just a-historical. Blocking consolidation of national chains is hardly some crazy innovation. In fact, it was Bork who was the rebel introducing the stricter \"consumer harm\" standard. People might argue which is the appropriate standard -- the one invented during the 1890s to break the most powerful trusts in history, or the one invented by a Regan appointee in 1980 to replace it. But the Reason snark does nothing except claim it. At least the WSJ makes an actual argument about consumer harm. Unfortunately, their argument is: there has been so much consolidation in distribution, we need to consolidate retail to increase their bargaining power to balance. Given the geographical nature of grocery shopping, consolidation is likely to reduce consumer bargaining power further. That the WSJ fails to acknowledge the obvious fact that the greater power of a merged entity would act on both sides of the market is bad-faith. reply insane_dreamer 20 hours agorootparentprev> Khan seems to have been pretty terrible to the contrary, she's great for free, competitive markets she's just not good for winner-take-all M&A investors, and _that_ is a good thing the average American - and even the average investor - will not benefit from her departure reply websap 20 hours agorootparentprevKhan has been absolutely spectacular for the free markets. Transparency in pricing (with this law), transparency in cancellation of subscriptions, blocking acquisitions where businesses should fail. The free market shouldn't allow monopolies, or duopolies to form. Bad businesses should fail, not absorb more capital and continue scaling. reply nxm 17 hours agorootparentHer policy changes have been countlessly shut down/overturned by courts since she's overstepped her authority. reply bdangubic 17 hours agorootparentthat should tell you she is doing the absolute right things :) reply EdwardDiego 20 hours agorootparentprevWhat do you mean? Minimising monopolies is how you keep the free market competitive. reply diob 20 hours agorootparentI hope they reply. This is the first FTC in a while to try and get the free market \"free\" again, rather than captured. reply carlosjobim 20 hours agorootparentprevFree competition should mean that you don't get punished for winning. There is no sport that punishes a competitor who is constantly winning, as long as they are competing fairly. Imagine Schwarzenegger being banned from Mr Olympia or Gretzky being banned for life from minor league ice hockey. So that the other competitors are given a fair chance of winning. But every sport punishes competitors who are cheating or being unsportsmanlike. As it should be in the marketplace. But hackers and the EU and US bureaucrats think that being a leader in a market has to be punished for being a \"monopoly\". While always turning a blind eye to rampant fraud and scams that are in the marketplace everywhere online and offline. reply kettro 19 hours agorootparent> There is no sport that punishes a competitor who is constantly winning, as long as they are competing fairly Almost all North American sports have a player entry draft, where the weighting is based on your success. The best teams (eg the Detroit Red Wings of the 90’s and 00’s) are given garbage draft picks, while the bottom-feeders (eg the Edmonton Oilers of the late 00’s-early 10’s) are given (the opportunity for) superstars. This is clearly a punishment for doing well, and a reward for being terrible. reply ewb 19 hours agorootparentprevMost sports have a salary cap to prevent being able to buy your way to success. They recognize that having more money than your opponent gives you an unfair advantage and destroys competition. reply brandall10 19 hours agorootparentprevIt's funny you bring up Schwarzenegger, as his last Olympia win was mired in controversy for being almost certainly rigged. Did he cheat? No, everyone used a similar amount of steroids. But to anyone with eyes and a basic knowledge of the sport it's overwhelmingly obvious that the organizers and judges threw it in his favor because of the attention it would bring. Which is the issue when an entity becomes too big to fail. There is a power disparity that is virtually impossible to overcome as the leverage is so much that any opponent can be swat down with ease. Things such as: - leveraging economies of scale when dealing with suppliers and resources to the point of starving access to competition - using lobbyists to write legislation in their favor or blockade opponents - doing fuck all with no reservations, then pay out lawsuits and fines at an order of magnitude less than profit made and damage done reply lazyasciiart 19 hours agorootparentprevThat’s because business isn’t an abstract activity that doesn’t affect anyone’s real life. reply carlosjobim 19 hours agorootparentOkay, what about art? Should we punish and limit the most successful artists to give other people a chance? reply lazyasciiart 17 hours agorootparentNo, because see above. reply carlosjobim 7 hours agorootparentArt affects people's real life profoundly. For example TV shows alter the behaviour of entire generations of people. reply beart 19 hours agorootparentprevI'm not an expert on these things, so I'm asking in good faith; what significant anti monopoly policies have been enacted in the US in recent history? reply acdha 19 hours agorootparentprev> But hackers and the EU and US bureaucrats think that being a leader in a market has to be punished for being a \"monopoly\". This is a provocative claim. Do you have any examples? reply carlosjobim 7 hours agorootparentIt is repeated on the level of gospel here on HN that Apple is \"a monopoly\", and nobody even flinches at the absurdity of that claim. reply acdha 3 hours agorootparentThat’s not in this thread, though, and it usually gets a lot of pushback. reply TeMPOraL 16 hours agorootparentprev> There is no sport that punishes a competitor who is constantly winning, as long as they are competing fairly. Constantly winning in a competitive environment with no runaway feedback loops[0] is evidence of cheating. See also, casinos: the \"legitimate\" ones don't rig the game - they know the odds; they expect you to win something here and then, but if they see you winning consistently, they'll rightfully assume you're cheating somehow, and ban you from the venue. > But every sport punishes competitors who are cheating or being unsportsmanlike. As it should be in the marketplace. Marketplace isn't like sportsball. It's like war. On the market like in war, anything goes. The only people who can afford living under delusion of market sportsmanship are people who are already so well-off and safe they can treat it as a game; for everyone else, it's a matter of life and death. > But hackers and the EU and US bureaucrats think that being a leader in a market has to be punished for being a \"monopoly\". The market isn't some divine ball game, or a magic ritual. It's a feedback system, with known failure modes. Wrt. monopolies, in particular, any good profit-seeking actor will aim at becoming a monopolist in their market segment, because that's how they can maximize profits while minimizing effort. At the same time, the market serves a critical function in organizing human society - but that stops working when monopolies pop up. It's really very simple: all the goods and services and advancement we enjoy require market players to be actively putting in effort. To society, an entrepreneur is basically a donkey with a pole mounted to it, from which there hangs a carrot, just out of reach - the donkey just wants to grab the carrot, but the society only benefits when the donkey is chasing it. The donkey needs to believe they can win, so it keeps running, but it also can never be allowed to actually get their prize, because then it'll stop. That's why markets are regulated as to let people and companies grow and accumulate winnings, until a point, past which they'd stop participating (or worse, just go screwing around breaking things). I.e. it's not about punishing someone for winning - it's about preventing them from complete victory, because then they become useless to society. > While always turning a blind eye to rampant fraud and scams that are in the marketplace everywhere online and offline. Who's turning a blind eye to it? Fraud and scams are the base state of the market; it's what it decays to if left to its own devices. Regulations are there to counteract this tendency. -- [0] - Feedback loops like compounding interest. In sports, unlike in the economy, you can't just reinvest your win to get more wins, and then reinvest them in turn, until you're winning so much so fast that no one can ever hope to catch up with you. reply carlosjobim 7 hours agorootparent> Constantly winning in a competitive environment with no runaway feedback loops[0] is evidence of cheating. Right. How did Usain Bolt cheat? How did Michael Phelps cheat? How did ABBA cheat? > any good profit-seeking actor will aim at becoming a monopolist in their market segment Of course. And then hackers redefine the market segment to encompass that businesses product and ta-da, you have a monopoly. Like Apple. If we're talking about real monopolies, then I couldn't agree more. But what hackers and the EU are doing is redefining monopoly in a dishonest way because they have personal grudges against a company. > The donkey needs to believe they can win, so it keeps running, but it also can never be allowed to actually get their prize, because then it'll stop. Here's something to blow your mind: The donkey enjoys running. Or let's take a real life example: sled dogs. They love pulling the sled. Entrepreneurs love working and love competing. Those who don't love it usually pull out of the game with their profits way before they have even national impact. This is a huge divide in attitude I've seen everywhere in the world in my life. You have category X of people who see all kind of work as an immense suffering. They complain endlessly, do the minimum effort, and never get anywhere. And you have category Y of people who love working, because it's doing something productive and learning. That doesn't mean that they're satisfied with being abused wage slaves. Rather it is the first category who never advances in life, because they think it's all a scam. People in the second category also fail a lot because they take chances. But they usually get up again. > Who's turning a blind eye to it? Fraud and scams are the base state of the market; it's what it decays to if left to its own devices. Regulations are there to counteract this tendency. All governments and law enforcement seem to be turning a blind eye to it. About 50% of advertisements on Facebook and Instagram are outright scams, ie physical products from brand names that are advertised at bargain prices and if you \"buy\" it you will not get delivery because it is an outright scam. US and EU governments should fine Meta billions of dollars for having their main source of income from organized crime and fraud. But they are focused on completely irrelevant crap like app stores. Talk about sieving mosquitoes and swallowing camels. reply RajT88 19 hours agorootparentprevAh, Reason. The paragon of good and sensible arguments like, \"Legalize Insider Trading\". This author has not written one of those pieces, but she is in good company with the ones who did. reply kylecazar 20 hours agorootparentprevPersonally, I think she's for the free market. She is progressive, which is controversial, but I don't really see why non-billionaires run to the defense of big tech when their monopolistic status is scrutinized. I totally understand why billionaires do, on the other hand. Worth watching Reid Hoffman embarrass himself on Jake Tapper on the subject of Khan recently for those interested reply websap 19 hours agorootparentBecause people have been conditioned through the media to believe that once the Billionares get taxed, you're next. We're at an unprecedented levels of wealth inequality in America. Billion dollar businesses built on tax payer money, should contribute to the system. Instead we've designed a system where these companies would rather pay millions of dollars in campaign contributions and to lobbyists. reply Gigachad 20 hours agorootparentprevHN is full of people who think they will one day be the billionaires scamming people. reply TheGamerUncle 19 hours agorootparentprevI well mm used to like reason a while ago but this is laughable. The article does not show how or explain why or in which manner she affects consumers. It says that she has been bad for them but there is no proof of this. Instead it makes quite a comical attempt at trying to vaguely point at the sky and say she is evil or overreaching, but she is not and anyone whoa actually wants a free market can tell you that. I honestly just cannot understand what happened to Reason I checked some more or their side articles and wow the quality has dropped to a level that would make the NYT blush. reply BurningFrog 18 hours agorootparentThe article is pretty clear to me. The main complaint is that the Khan FTC by default is against all mergers and acquisitions. This is different from the previous standard that only mergers that harm consumers are bad. So now even mergers that benefit consumers are blocked. reply michael1999 2 hours agorootparentThat is an a-historical claim. That standard was THE standard from 1890-1980. The consumer-harm standard was the innovation of Bork under Regan in 1980. reply r00fus 20 hours agorootparentprevFree markets - you know freedom isn't free right? You have to enforce it - and you do this by regulation. reply m_ke 21 hours agorootparentprevPlease name some of the terrible parts EDIT: to make it easier here's a list of actions from perplexity: Here are more explicit actions taken by the FTC under Lina Khan's leadership: Lawsuit against Amazon (2023): The FTC filed a landmark antitrust case accusing Amazon of monopolistic practices in its online marketplace and Prime subscription service. Meta (Facebook) lawsuit (2023): The FTC sued Meta to block its acquisition of virtual reality app maker Within Unlimited, citing concerns about monopolization in the VR market. Microsoft-Activision merger challenge (2023): The FTC attempted to block Microsoft's $69 billion acquisition of Activision Blizzard, though it ultimately failed. Kroger-Albertsons merger: A U.S. district court judge ruled in favor of the FTC to block the proposed $25 billion merger between these two major supermarket chains Nvidia's acquisition of Arm: The FTC sued to block this merger, though it's not explicitly mentioned in the search results Amazon's acquisition of iRobot: While not explicitly mentioned in the search results, this is another high-profile merger that the FTC has challenged under Khan's leadership. Enforcement against data brokers (2022-2023): The FTC took action against several data brokers for selling precise geolocation data that could be used to track people's movements. Zoom settlement (2021): The FTC finalized a settlement with Zoom over allegations of deceptive security practices. Right to Repair initiative (2021): Khan's FTC unanimously voted to ramp up law enforcement against repair restrictions that prevent small businesses, workers, and consumers from fixing their own products. Made in USA labeling rule (2021): The FTC finalized a new rule cracking down on marketers who make false, unqualified claims that their products are Made in the USA. Penalties for fake reviews (2022): The FTC imposed multi-million dollar penalties on companies for using fake reviews and suppressing negative reviews. Action against \"dark patterns\" (2021-2023): The FTC has taken action against companies using deceptive design practices known as \"dark patterns\" to trick consumers. Increased use of Penalty Offense Authority: The FTC has revived its Penalty Offense Authority to seek civil penalties for violations of FTC administrative orders. Ban on hidden junk fees: The FTC announced a rule requiring companies to show full prices for items like hotel rooms, concert tickets, and sporting events upfront, rather than hiding fees until the end of the checkout process Changes to merger review process: The FTC has altered principles, practices, and policies of merger review that had been in place for decades Expanded scope of enforcement: The FTC has taken a more holistic approach to identifying harms affecting workers, independent businesses, and consumers, with a focus on addressing power asymmetries and unlawful practices Rulemaking changes: Chair Khan has orchestrated wholesale changes in FTC rulemaking practices and policies Proposed ban on noncompete clauses: The FTC has proposed banning noncompete clauses in employer agreements Increased focus on data privacy: The FTC has sued multiple companies for allegedly sharing customer data and warned about the \"hidden impacts\" of advertising tools like third-party tracking pixels reply chrisweekly 20 hours agorootparentThat's a pretty good list of things the FTC deserves credit for, in my book. reply m_ke 20 hours agorootparentLiterally the best government person we have had for competitive markets in decades reply OptionOfT 20 hours agoprevI'd be interested to see whether a movie theater is considered an event. Our local one charges a convenience fee when buying online because ... they can? I wish they banned all mandatory add-ons. If I don't have the choice it should be part of the base price. The touristic railroad near me advertises a price, and then slaps on a mandatory Fuel Surcharge and Historic Preservation Fee. Excuse me? How can I compare what I'm going to spend my money on if you're just allowed to lie to me? Sidenote on fuel cost: Fuel is almost back to pre-COVID costs https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=pet&s=e... and once you add in inflation it's even cheaper. reply ToucanLoucan 20 hours agoparent> How can I compare what I'm going to spend my money on if you're just allowed to lie to me? You're not supposed to, that's the point. It's frankly shocking (and also not, but you know) how much businesses in America are allowed to bullshit you. I signed on with a telco for high speed internet when we bought our house for $65 a month and by the time we got fiber and I could finally tell them to kick rocks, the bill had soared to nearly $200 for the exact same service over the course of 4 years. Why? Because they can, and go fuck yourself. A hotel stay for a vacation was supposed to cost $851, but they demanded a $300 pre-authorization on top of that. Why? Because they can. I wasn't notified ahead of time, absolutely nowhere was this information given to me. And I could take that on fine, but why is this allowed? What if I wasn't so fortunate and was traveling by air, do I just sleep in a box because the hotel can't guarantee I'll be able to pay for $300 worth of room service I have no intention of buying? I feel like this just happens everywhere now, I just expect it. I expect to get fucked over in one way or another, and on the one hand I'm sure it's my anxiety, but on the other hand there is so much expensive arbitrary nonsense that's just plunked down in front of me, and yeah, most of it I can handle fine, because I work in tech and make good wages. So I guess just fuck everyone who grew up at the income level I got, because I am fucking sure that my single mother trying her hardest as she was, wouldn't be able to get by if I was born like 15-20 years later than I was. Edit: Oh and FUCK every politician who has ever farted out words something like \"responsible consumption of healthcare\" because sweet Jesus, healthcare billing is an utter nightmare. I don't think I have EVER, EVER in my entire life had some kind of medical event where I knew the costs going in that were then reflected afterwards. It's just all made the fuck up on the fly with no respect for the patients, when they are already stressed out and scared. reply FireBeyond 15 hours agorootparent> You're not supposed to, that's the point. It's frankly shocking (and also not, but you know) how much businesses in America are allowed to bullshit you. There's actually an administrative code in Washington that furniture (and maybe other) stores are only allowed to have a \"Going out of business\" sale _once a year_. reply ToucanLoucan 3 hours agorootparentWe could use one of those where I live. There was a furniture store off the side of the highway that over a period of like 4 years had at least 12 of them, and then would just change it's name each time. Never bought anything from there since it seemed so incredibly sketchy. Then at last it went out of business properly and a U-Haul took over the space. reply currymj 20 hours agoparentprevwhen you buy a ticket online, you are actually buying an option on the ticket, because you can go in and refund it at any time before the movie starts. the “convenience fee” is the option premium. it would be fairer if this were opt-in. Some e commerce sites now allow you to pay a few extra dollars to have free returns, something similar would work for movies. reply conductr 19 hours agorootparentNo, this is complicating things. A physical ticket can also be refunded prior to show time. It's not an option at all, it's just a fee. They are charging you to 1) pick your seat 2) not have to show up early 3) peace of mind knowing your spot is reserved - all of those things are conveniences in the purest sense of the word. In many cases, the fee is more closely related to a platform fee going to fandango or similar service. reply disambiguation 17 hours agorootparentprevMaybe some places operate that way, but I worked on payment systems for a few years and since then I figure most convenience fees come from credit card processing rates being passed on to the customer - at least that's how ours worked. https://www.creditdonkey.com/interchange-rates.html reply guidedlight 21 hours agoprevThey should ban hidden taxes too. The sticker price should be the final price. reply ChrisMarshallNY 21 hours agoparentI remember shopping in Japan. The price on the tag, is exactly what you pay (same with services, like hotels). Since this is Japan, it's a high price, but no surprises. Also, the service is amazing, and they won't accept tips. If you leave money on the table, they will chase after you, to give it back. reply belfalas 21 hours agorootparent> Also, the service is amazing, and they won't accept tips. If you leave money on the table, they will chase after you, to give it back. I visited Japan some years back and loved this aspect of the culture as well. An Australian ski guide (this was a winter visit) explained it like so: \"the Japanese attitude is to want to do a good job by default. Tipping implies that a good job is only done because of pay. The Japanese see quality service as intrinsically valuable in itself.\" reply ChrisMarshallNY 21 hours agorootparentI believe that servers are also paid quite well. reply spiderice 2 hours agorootparentQuick Google search says the average is $7.55 USD/hour (1,159 Yen). Seems like they're paid quite poorly. reply ChrisMarshallNY 2 hours agorootparentMight be more to that story. Remember that Japan is a very socialized country, so CoL expenses are not what they are in the US. I have a friend that basically shops as part of her job. She has been power-shopping, mostly in Europe (dream job, I suppose), for decades. She tells me that she runs into the same sales associates, year after year, and has watched them “grow up” over years. So it seems to be possible, at least in Europe, for people to make lifelong careers in the service industry. reply thaumasiotes 20 hours agorootparentprevThat's fantasy. The same thing is true in China. All it means is that the local culture doesn't tip. reply presentation 7 hours agorootparentJapan does have a well known “customer is god” cultural background; whether or not tipping has anything to do with that is here or there, though it is the expectation that if someone does a job, it is expected not to be half assed. One of the big differences between here in Japan and other parts of the world I’ve visited and lived in, is the near absence of service staff who actively make a point of looking like they hate their life and treat you like crap, though this is slowly changing here too. reply belfalas 19 hours agorootparentprevThis kind of reply is what makes me want to quit HN forever. There's always somebody out there smarter who knows better. Why bother to try and contribute anything? reply thaumasiotes 18 hours agorootparentYes, contributing mythology is in fact worse than contributing nothing. reply wileydragonfly 18 hours agorootparentThis is geek internet. Suggesting that anything about Japan is less than peak perfection is controversial. reply mattlondon 20 hours agorootparentprevSame in UK. As a kid, having grown up in the UK I knew that if the price label said £1.99 and I had £2 in my pocket I could afford it, with £0.01 change. First time I went to the USA as a young teenager I remember being quite embarrassed when the thing I thought I was getting for $1.99 was actually not $1.99 but $2.17 or whatever, and I had to leave without buying. Felt quite deceptive and totally incomprehensible. reply WickyNilliams 9 hours agorootparentprevI have done a fair bit of travelling. The US is the only place I've been where the price shown is not the price paid. Adding on tips, and it becomes nigh on impossible to know how much something will cost you upfront. It's ridiculous tbh reply ensignavenger 19 hours agorootparentprevJapan has the exact same sales tax rate(s) across the entire country, and it rarely changes. In the US, we have thousands of different rates and they change multiple times per year. Also, while it is the norm in Japan to include the tax, there are some exceptions. (Japan has 2 rates, 8% for certain items like food, and 10% for everything else). reply mFixman 54 minutes agorootparentThat's a good reason to include the tax in the price in the US. How would consumers know how much they will pay otherwise? reply rascul 57 minutes agorootparentprev> In the US, we have thousands of different rates and they change multiple times per year. Where in the US do the sales tax rates change so frequently? I've never seen this. reply andreareina 16 hours agorootparentprevBrick and mortar stores know exactly how much tax they have to pay, yet they don't show an all-inclusive price. It's clearly not a case of online retailers just not showing the tax because it's difficult. If they wanted to they could let you give your post code before checking out, and query the same database to show the post-tax price for everything. reply ensignavenger 5 hours agorootparentReally, you expect them to go through every item in the store, multiple times per year, and update the price tags? reply asciimov 3 hours agorootparentAround me most stores change their price tags weekly, if not more often. They either have a sheet with new tags or a small printer and scanner and they swap out the tags on the shelf. reply mazugrin2 3 hours agorootparentprevAside from silly \"sales-tax-holidays\" I've never heard of the sales tax rates changing so frequently. I'm curious to know where this is happening \"multiple times per year\". Here in MA it's been the same rate for 15 years. And for the sales-tax-holiday situation can't a shop just say something like \"everything will have x% taken off at the register\" just like they would during a typical \"10% off all items\" type of sale? reply ensignavenger 3 hours agorootparentIf MA has a single rate across the entire state that hasn't changed in 15 users, they are very different from how most other states operate. reply asciimov 2 hours agorootparentHere in Texas you will nearly always be paying the maximum 8.25%, its been that way for 30+ years. reply celegans25 4 hours agorootparentprevWith price increases over the last couple of years from inflation, retailers have shown they are more than capable of doing so already. So yes reply ensignavenger 3 hours agorootparentPrice increases don't hit every item all at once. reply sangnoir 13 hours agorootparentprev> In the US, we have thousands of different rates and they change multiple times per year. Yet at any given moment, every proprietor is miraculously able calculate the taxes due at the point of sale. The variety of tax regimes, and the fact that the amounts change doesn't impact the ability to calculate the final amount due. reply robotfelix 20 hours agorootparentprevI'm not sure Japan is the best example here. My experience is that most shops have the price excluding consumption tax printed very prominently in large numbers, and then price including consumption tax is printed in much smaller writing underneath. The price excluding tax is the only one you can read at a distance, that draws you in. As someone from the UK who is used to seeing price tags show the final price you pay at the till, I was constantly disappointed that items weren't quite such a bargain as I'd first hoped. On the whole there are still many things that are much cheaper than in the UK though :) reply ChrisMarshallNY 19 hours agorootparentI have a feeling that's optional. It may even be regional. My experience was almost exclusively Tokyo. I traveled to Tokyo for over 20 years, and always paid what was on the sticker. I was told that the tax was included in the price. I remember one of my bigger purchases, was a ¥75,000 Oceanus watch, and that was exactly what I paid. reply verall 19 hours agorootparentIf you go to a donqi the price tags list without the tax besides small text that either lists the full price or says \"+10% consumption tax\" or along those lines. As a tourist you don't always have to pay the consumption tax though. reply ChrisMarshallNY 17 hours agorootparentI have a feeling that you're right. I remember the saleswoman asking to see my passport, when I was buying the watch (it was that big department store in Akihabara). reply kalleboo 11 hours agorootparentprevThere was a period of a few years where they raised the sales tax in steps 5%, 8%, 10%, and stores were allowed to show the price without tax during that period, which has left some practices a bit messy since. reply _zoltan_ 19 hours agorootparentprevThis is the norm in Europe. It's crazy to me that in the US I can never be sure how much I'll end up paying... reply pedalpete 19 hours agorootparentprevI believe this is the default for most of the world. Some countries have some strange differences like Argentina having a table charge on your bill, but here in Australia, the price on the box is the price at the till, with the exception of the card surcharges which are currently being reviewed to be removed. The exception here is also the holiday surcharge (an extra fee on holidays and Sundays), which has to be \"disclosed\" before ordering. Usually there is a small sign somewhere that nobody pays attention to. reply xenospn 20 hours agorootparentprevThe price part is essentially the same all over the world except for America, where you’re not entirely sure how much more you’ll have to add for taxes and tips. reply thenickdude 20 hours agorootparentprevExcept 100 yen stores which are actually 110 yen stores. reply sofixa 20 hours agorootparentprev> The price on the tag, is exactly what you pay (same with services, like hotels). That's the norm, not the exception, in developed countries. reply crazygringo 20 hours agorootparentNo -- it's the norm in countries that have a single uniform VAT. It's obviously not the norm in countries that have sales taxes which vary by locality. Whether a country is \"developed\" or not has nothing to do with it. The vast majority of countries in Africa have a VAT, while the world's richest country has a sales tax. reply sofixa 20 hours agorootparent> It's obviously not the norm in countries that have sales taxes which vary by locality Why not? If each store or restaurant or theatre or whatever in each locality know what price to bill you, they know the applicable price to show you upfront. > Whether a country is \"developed\" or not has nothing to do with it. The vast majority of co",
    "originSummary": [
      "The FTC has implemented a rule banning hidden fees in hotel and event ticket prices, requiring sellers to disclose total costs upfront.",
      "This initiative is part of President Biden's broader effort to eliminate junk fees that unnecessarily increase consumer costs.",
      "The rule mandates that service and resort fees be included in advertised prices, potentially saving consumers significant time, though it may face challenges from future administrations and Congress."
    ],
    "commentSummary": [
      "The Federal Trade Commission (FTC) has prohibited hidden junk fees in hotel and event ticket pricing, mandating that all fees be disclosed upfront to consumers.- This regulation is intended to enhance price transparency and shield consumers from misleading practices by merchants.- The decision has initiated conversations about the necessity for regulations to promote fair competition and prevent consumer exploitation through concealed costs."
    ],
    "points": 490,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1734467767
  },
  {
    "id": 42447071,
    "title": "Ergo Chat – A modern IRC server written in Go",
    "originLink": "https://github.com/ergochat/ergo",
    "originBody": "Ergo (formerly known as Oragono) is a modern IRC server written in Go. Its core design principles are: Being simple to set up and use Combining the features of an ircd, a services framework, and a bouncer (integrated account management, history storage, and bouncer functionality) Bleeding-edge IRCv3 support, suitable for use as an IRCv3 reference implementation High customizability via a rehashable (i.e., reloadable at runtime) YAML config Ergo is a fork of the Ergonomadic IRC daemon . Once you have done so, you should enable SASL in your clients, ensuring that you will be automatically logged into your account on each connection. This will prevent problems claiming your registered nickname. Once you have registered your nickname, you can use it to register channels: Join the channel with /join #channel Register the channel with /CS REGISTER #channel After this, your channel will remember the fact that you're the owner, the topic, and any modes set on it! Credits Jeremy Latt (2012-2014) Edmund Huber (2014-2015) Daniel Oaks (2016-present) Shivaram Lingamneni (2017-present) Many other contributors and friends of the project <3",
    "commentLink": "https://news.ycombinator.com/item?id=42447071",
    "commentBody": "Ergo Chat – A modern IRC server written in Go (github.com/ergochat)248 points by OuterVale 18 hours agohidepastfavorite113 comments donio 16 hours agoI've been running Ergo for the past year for my friends/family chat. I went this route because of the ease of hosting, very low resource requirements and a protocol and codebase that I feel I can understand and debug if needed. The v3 chathistory support and the always-on[1] multi-client[2] features paired with modern clients (like Goguma) go a long way at providing a modern chat environment. Most others on the server don't even know that they are using IRC. The built-in websocket support is another key feature for me since it lets me to provide a web client just by serving some static files (I use Gamja for this). [1] always-on: https://github.com/ergochat/ergo/blob/master/docs/USERGUIDE.... [2] multiclient: https://github.com/ergochat/ergo/blob/master/docs/USERGUIDE.... reply stackskipton 16 hours agoparentAs heavy Discord user, it's nice to see that IRC is still kicking and might be available if/when Discord ZIRP gas runs out. reply arcanemachiner 10 hours agorootparentJust think of all that information, stuck in the walled garden, away from the prying eyes of search engines or any other forms of public discoverability. Just waiting to get flushed down the drain or shoved into the training data of a future round of AI crapware... reply ycuser2 10 hours agorootparentIRC is also a walled garden. reply TonyTrapp 9 hours agorootparentIRC is pretty much the opposite of the definition of a walled garden. Its content is not discoverable by search engines by default, but that is not the definition of a walled garden, which is typically a synonym for closed platforms where you have no choice how to access their content (e.g. being forced to use a specific client software). reply sandos 8 hours agorootparentBut in general IRC is not really archived etc? So just as throw-away as Discord imo. reply dijit 6 hours agorootparentAny single client can upload their logs, since it's \"archived\" in plaintext on every users PC. You can also log from the server; using a multitude of modules; https://docs.inspircd.org/4/modules/log_syslog/ or https://docs.inspircd.org/4/modules/log_json/ if you're using inspircd. reply mbreese 19 minutes agorootparentMany years ago at $WORK we had an in house IRC server (pre-Slack). It was well archived and logs were easily searchable. It was a pretty easy setup. And for IRC, I think this is a good compromise between \"everything is public at all times\" and \"everything is walled off and private at all times\". If you want to have a log of your use, it's possible. If the org running the server wants a log, they can do that too. Is that possible with something like Discord? reply hombre_fatal 3 hours agorootparentprevThe point still stands. Regardless of how easy it might be to access logs, not a single popular Freenode (or otherwise) server I spent years chatting on has an archive online. It might as well have all taken place on Discord. Turns out what matters isn’t how easy it is to access logs but whether anyone cares to do it. reply dijit 2 hours agorootparentYou sure? There are loads. Have you tried looking? Heres an archive searcher for #bitfighter on freenode: https://bitfighter.org/irclogs/search.php reply hombre_fatal 32 minutes agorootparentThat's the counter example? A channel with one day logged in 2024, then nothing for two years, then nine days logged in 2022, five days logged in 2021, etc? What about big tech channels like, say, nodejs and javascript? reply dijit 19 minutes agorootparentI’m not exactly sure why you think that matters. The capability and software exist; did you need an account or specialised client? Thats the point. Be the change you want to see if you want archives uploaded. Or, do what others do: grep your local files or znc logs. johannes1234321 7 hours agorootparentprevHowever on IRC this is not for technical reasons, but limited interest. Pre-LLM-GenAI gathering information from huge chat logs was quite limited. But different extraction mechanisms always existed. Some people kept logs, some servers/channels had web-archives. Discord tries to keep it exclusive to them. (Focussing on technical side here, whether it's socially wanted is a different big question, which ends with a \"it depends\") reply anthk 9 minutes agorootparentgrep/recoll. Fast even on ancient machines. corobo 6 hours agorootparentprevBeing knowingly throwaway meant that any long term knowledge got turned into a blog post, documentation, a forum thread, or a search engine indexable logs-to-html site in the worst case. With discord the message might get pinned if a mod thinks it was useful and remains undiscoverable for the majority of people reply thunky 26 minutes agorootparent> remains undiscoverable for the majority of people IME it doesn't work very well. If you hang around a discord server long enough you see the same conversations happening over and over and over. And the app is not good at helping you finding old conversations (which is why they are repeated endlessly). It's also very bad at resuming where you left off, so it's incredibly difficult to follow an active thread without missing anything: https://www.reddit.com/r/discordapp/comments/18d4tiv/inexpli... reply johnisgood 5 hours agorootparentprevLots of people log channels, and that is another discussion when you see yourself online. They usually mention it in the topic though that the channel is logged. reply tryauuum 8 hours agorootparentprevHm, for me the definition of the walled garden is \"you have to have an account to see any discussions\" reply fl0id 8 hours agorootparentWhich you don’t need for irc. Also pretty sure that’s not an accurate definition as you can be walked without needing an account technically. reply rendx 7 hours agorootparentprevFor me, a \"walled garden\" is also something controlled and regulated by a party I have no influence over. They can arbitrarily make and change rules and decide who to let in or not, which feature to drop, how the UX looks like etc. IRC is an open, community protocol, and as such not a walled garden. Even if I'm not involved, which I could be, I trust the composition of people there much more than any single commercial actor. The power dynamics are fundamentally different. A single instance (an IRC network) may be a \"walled garden\", in control of the group that runs it. The incentives are different. Also because people can simply migrate to another network given the open protocol (and different, third party clients; the API cannot be shut down like with Twitter/X). Historical example e.g. Freenode ownership change. reply boltzmann64 8 hours agorootparentprevIt's not a website a search engine can crawl but anyone on the internet can log all the messages on IRC as long as they want without any restrictions. In fact if you are nice, you will never need to login and can have conversation for as long as you want with a guest login. It is not a walled garden. reply trollbridge 4 hours agorootparentSearch engines could crawl it if they wanted to. reply blueflow 6 hours agorootparentprevIRC is not \"walled off\" - open protocol, open servers, open clients. reply tomrod 5 hours agorootparentprevA walled garden is a platform where auth is required to come in and user content is owned and stuck within. IRC is not a walled garden. You will have a better time registering with Nickserv, but you can pull content and logs channels. So, more like a fenced meadow. reply yapyap 57 minutes agorootparentprevexplain ur definition of walled garden please reply kyawzazaw 15 hours agoparentprevyour family and friends care enough to download and set this up? reply rollcat 5 hours agorootparentMy fam chat is currently on Telegram, but there recently (Durov's arrest) was a long discussion about that; everyone is actually interested in switching to something E2EE and/or self-hosted. But we want to keep the core features: share photos/videos, keep a history, 1-on-1 voice/video calls, etc. So the main alternatives are WhatsApp, and (distant second) Signal - the latter doesn't offer history for newly joining devices. If self-hosting in general wasn't such a PITA, I'd probably research the options and set something up. But honestly, I'm burnt out with trying to maintain even the most basic setups. I have a Raspberry Pi with NixOS under my desk that hosts Miniflux over Tailscale, and I can forget it exists 99.7% of the time - until I accidentally unplug it, and 6 hours later, wonder wtf happened again. Now multiply the problem by the average funny cat video size and crappiness of my residential uplink. Won't happen. reply dazed_confused 3 hours agorootparent> Signal doesn't offer history for newly joining devices This is a great feature for privacy though reply rollcat 2 hours agorootparentThis is not a feature, this is a limitation. It would've been a feature if Signal offered you a choice of whether the history should be synced up or not (perhaps with a default of \"no\" for existing users, to maintain the established expectation). As it is, this is a limitation. reply rekabis 1 hour agorootparentIn order for Signal to provide this history, said history would have to be stored on their servers, massively nerfing one of their core competitive advantages. This “limitation” is the ultimate advantage from the perspective of Signal’s core competency. reply devjab 35 minutes agorootparentIt could be saved on devices and supplied as needed from that device history. They wouldn’t need to keep it on their servers. I don’t think you can fault signal for not wanting to do that, but it also means signal is a terrible communications platform if you want that sort of thing. reply phillipseamore 15 hours agorootparentprevThe last line of OP: \"The built-in websocket support is another key feature for me since it lets me to provide a web client just by serving some static files (I use Gamja for this).\" https://github.com/Libera-Chat/gamja reply donio 7 hours agorootparenthttps://codeberg.org/emersion/gamja is probably what you want, the repo above seems like a local branch and it's a few months behind. reply crtasm 15 hours agorootparentprevIsn't it just: install app, enter myserver.net and username+password ? reply kyawzazaw 15 hours agorootparentyeah, this part itself. How easy it is to get them to do it? reply brabel 12 hours agorootparentAny app that requires a login will be exactly the same? What's exactly your point? That people can't login to phone apps? reply Mashimo 11 hours agorootparent> That people can't login to phone apps? Probably that they don't bother to have another chat app just for a few people. A older family member has WhatsUp and Signal and gets sometimes confused. I have WhatsUp, signal, telegram, discord, meta messenger and would be .. hesitant to install an IRC client for like 3 people. reply mavhc 6 hours agorootparentWhatsapp wins because it doesn't require a username and password, that's too complex for many people reply prmoustache 3 hours agorootparent> wins because it doesn't require a username and password And lose because you can't give it to a kid that doesn't have a mobile phone number. I have shared custody of my daughter and we communicate via xmpp on a tablet they carry over there when they spend a week at their mother's. reply worldsayshi 4 hours agorootparentprevThe reason that most people don't want another chat app is not just because of the initial work. Every chat app adds a mental overhead for some activities. Want to find that recipe that you remember that some person shared with you a while back? Now you have to look through four different apps. And the overhead grows quite fast as you add apps. reply hombre_fatal 3 hours agorootparentprevYour incredulous attitude is naive. Yes, people don’t want to have yet another increasingly niche chat app to communicate with just a few people. reply Kiro 10 hours agorootparentprevYes. People install a handful of known apps and that's it. You would never convince any of my friends or family to install this. In fact, I wouldn't either. reply eddieroger 15 hours agorootparentprevwhy would they need to download and setup a server? can't they just log in to OP's with the client of their choice? reply kyawzazaw 15 hours agorootparenti am asking about download the client and even registering and entering a password reply scrapcode 14 hours agorootparentAlthough I understand your point, and certainly have some friends that would feel like they're hacking the gibson connecting to an irc server, is Discord et. al really that much different? reply mikepurvis 12 hours agorootparentIt’s an inertia issue. I already have iMessage, FB Messenger, WhatsApp, and Signal as “primary” messaging apps, plus Instagram and LinkedIn and Teams as secondary— my tolerance would be basically zero for installing something else to connect with a specific person or friend group. reply prmoustache 3 hours agorootparentThat is because you already have an absurd lots of them though. I have whatsapp and conversations and that's it. I only use teams on my professional computer, you will never see me install \"work\" on my personal smartphone and nobody needs a linkedin app, the website is enough. reply mikepurvis 3 hours agorootparentiMessage is needed for texting, Messenger for neighbours and FB Marketplace, WhatsApp for group chats, and Signal to have a non-meta option. I agree about LinkedIn and will probably get rid of it; I mostly installed it as I was going to a conference and wanted the easy option for swapping contact details using camera codes. reply kyawzazaw 12 hours agorootparentprevdiscord is totally different. I assure you they are not going to download Signal, Whatsapp. there is massive network effect involved and inertia Even getting people to use a different messaging app (such as Facebook Messenger) already installed on their phones is difficult. reply donio 13 hours agorootparentprevYes, they just download the app and enter the server name, username and pw. It's a private server and I manage the accounts so there is no registration step. And they only need to worry about any of this when they get a new phone. reply Suppafly 15 hours agoparentprev>(like Goguma)(I use Gamja for this). Is everything related to potatoes lol? reply donio 13 hours agorootparentYep, both are by the same author (emersion) and there is definitely a running theme in the project names. reply nolist_policy 10 hours agoparentprevInteresting, does push notification work? Will phones receive messages and notify while sleeping? reply donio 8 hours agorootparentThis explains the notification options with Goguma, the mobile client we use: https://codeberg.org/emersion/goguma/src/branch/master/doc/n... I didn't bother setting up proper push notification so we use the \"Servers supporting chathistory\" mode. This means that when the app is not in the foreground a workmanager task polls every few minutes. So in this mode notifications can be delayed by a few minutes which is fine for our use case. reply okasaki 9 hours agoparentprevI think ircd is the wrong layer to attach those features to. You can run something like thelounge and have that on any server. reply qudat 5 hours agorootparentI disagree. I run all comms for https://pico.sh through IRC on libera and people really struggle to onboard into IRC. People will pop-in ask a question, then leave because they arrive to a chat that is empty and didnt see any activity in 5mins and bounce. We tried to offer a bouncer instance for users and even that had a barrier to entry because it requires creating 2 accounts: one for libera and one for pico. I think about us switching to ergo every few months because I think the onboarding experience will be much nicer. Logging into a channel for the first time and see the chat log will make people a lot more motivated to stay. reply superkuh 4 hours agorootparentprevI agree. The reason IRC is so good is that it is mostly stateless and stores very little information beyond lists of IPs associated with each socket it's stuffing messages into. Once a server starts hosting for people there are a huge set of problems and pressures. IRC is the text chat layer of the internet. It's not by itself, it's part of a larger network of open protocols. If you avail yourself to these it far exceeds the capabilities of even the most featureful walled corporate garden. reply emmanueloga_ 11 hours agoprevIRC is often romanticized, but after working with its protocol spec, I found it rather unsavory. Its unstructured message format looks like this: :User1 PRIVMSG User2 :Hello, are you receiving this message? While this might look fine at first glance, the lack of more regular structure caused issues. Some messages are easier to parse than others. Each implementation introduced quirks and variations, creating countless edge cases and hairy parsing code. To be fair, IRC _was_ a product of its time... but s-expressions were invented in the 1950s, so adding more structure and rigor to the messages wasn't out of reach. My memories are from a long time ago so I may be overreacting... perhaps the Ergo authors can comment on their experiences if they are around here! I heard about IRCv3 but I doubt that effort solved most of my main gripes with the protocol. If I were to work on a messaging app today, I'd look elsewhere for inspiration. From a quick search, it seems there's room for a modern and _simple_ protocol for chat, simpler than XMPP or Matrix. Essentially, we need a protocol that is for messaging what Gemini is for HTTP. Stretch: squinting a bit, the NATS client protocol looks close to a starting point for something like that [1]. -- 1: https://docs.nats.io/reference/reference-protocols/nats-prot... reply indrora 33 minutes agoparentIRC is a Very Old Protocol, you're right. if you dig through the spec you will find a few historic relics: 7-bit ASCII only, 254 character max total line length (some reserved for the message itself), and many many more. NATS as an IRC replacement is using the wrong tool for the wrong job. I've long been thinking about how I'd replace IRC and I keep coming back to another IRC-era protocol that wasn't as popular but was definitely ahead of its time by some amount: Hotline. It wasn't Open like IRC and was limited to Macintosh users for a long time, but it has a lot of what most people are looking for in a \"chat system\" today. One thing, however, that I think would benefit the protocol designers of the future: Learn from MSN. MSN separated their Authentication and Chat systems. You ask for a token that identifies you to the chat system from the authentication system. These were two separated protocols that did one thing specifically for each other. I honestly think that separating chat-locus and identity from one another is important. reply toast0 32 minutes agoparentprevSomething a little more tightened up might be nice, because who likes scanning for line endings, when you could have a byte count, and what's up with the colons, and while you're there, might as well have a single byte command, right? But from my recollection of writing bad IRC client in the 90s (including in mIRC script after they added support for sockets in the scripting language in mIRC v5.3 released December 1997), the protocol isn't that hard to work with. Once you figured out you needed to send a : in front of your message text, I don't remember any other big gotchas. It's not XML, and I don't remember any quoting issues, but maybe there's some I forgot. CTCP maybe isn't ideal either. DCC probably doesn't work anymore, but it was a different time when being on the internet meant an expectation that you were a peer and could accept inbound connections. reply Tepix 9 hours agoparentprevMatrix was invented because XMPP was getting too complex. Are we once again at a point where it's time to start over? A federated asynchronous group chat protocol with modern e2e encryption for desktop and mobile use (thus, not always online) is impossible to build without a faire share of complicated corner cases. reply emmanueloga_ 7 hours agorootparentI guess I did not make the scope of the project clear. Both Matrix and XMPP specs add up to 100s of pages, 500 or so give or take. IRCv3 seems to be over 100 pages too. In comparison, Gemini is about 10 pages long or so. A bunch of people here talk about setting up a small server for family and friends, so I think a smaller protocol, akin to Gemini in size, could be a lot of fun to work with for small scale deployments. reply MattJ100 7 hours agorootparentThe protocol isn't really an issue for the use-case you talk about. I founded the Snikket project, which aims squarely at the family-and-friends use case you mention (after all, it was made to scratch my own itch - my family's excessive use of WhatsApp for communicating with each other). I can tell you that my family don't care a bit whether Snikket uses IRC, XMPP or Matrix or some real-time Gemini equivalent. There may be some scalability differences between different protocols/implementations for the admin of the service, but Snikket fits comfortably on even low-end Raspberry Pi devices, and literally over half of the typical resource usage is by the web dashboard (yay Python). So what difference does the protocol make? It can make a difference to the developer experience. If all you want to do is exchange text messages, then yeah, XMPP and Matrix are absolutely overkill. But - especially for a family-and-friends use case - people also want file sharing, audio/video calls, and all that stuff. It very quickly gets quite complex to support all this stuff, especially in a way that allows you to evolve the protocol over time (trust me, what you think of as core messaging features today, were not a thing 10+ years ago, and messaging in 10+ years will also involve a new set of features). There will always be a set of users for whom plain text messaging is enough (90% of my own daily communication is via messaging in a terminal app). However that set does not intersect significantly with the general population, and practically none of my family members would accept such a solution as a replacement for WhatsApp. reply linsomniac 6 hours agorootparentTIL: https://snikket.org/ reply Gormo 8 hours agorootparentprev> Are we once again at a point where it's time to start over? Ask Sisyphus. In the meantime, while everything else keeps going through newer iterations of XKCD 927 (https://xkcd.com/927/), IRC keeps chugging along, and gaining new features and functionality as it enters its fourth decade despite the previous commenter's gripes. reply hnarn 8 hours agorootparent> Ask Sisyphus. that doesn't make any sense. reply ezst 6 hours agorootparentprevTo me, it's slowly become obvious that Matrix was invented because certain people wanted to ride the trendy wave of VC money propping up Slack and friends back in those days. Matrix has been all about superlative marketing and over-promises with little substance and theoretical underpinnings to back it up. The fact that they were spreading FUD and disinformation against XMPP and the alternatives in their early days should have been a red herring. The fact that they haven't stabilized their protocol and made it scalable to mid-level deployments after more than a decade should be a reason for pause. The fact that after so long, due to the sheer complexity of it, only one entity has emerged as willing to sink the costs of Matrix should be a reason for worries. I think that we are due for an XMPP resurgence. Not that it is perfect by any stretch of mind, but it is no-BS, mature, lightweight on resources and bandwidth and verifiably fit for purpose, whether you want to host small-scale for your family & friends, or for the whole world with the ambition to be the next GTalk, facebook messenger, or whatsapp (all of them XMPP services at one point or another of their histories) reply zaik 5 hours agorootparent> red herring I think you meant to say red flag, not red herring: https://en.wikipedia.org/wiki/Red_herring reply tcfhgj 4 hours agorootparentprev> Matrix has been all about superlative marketing and over-promises with little substance and theoretical underpinnings to back it up. I don't think so. The underpinnings were there, may it be the concepts for E2EE, P2P, Verification, Bridging, decentralized rooms and conferencing, synchronized history, etc. Not everything is production ready let alone finished with perfect UX, but it doesn't lack theoretical underpinnings. > The fact that they were spreading FUD and disinformation against XMPP In the past, I have experienced it more often vice versa than this way. > The fact that they haven't stabilized their protocol and made it scalable to mid-level deployments after more than a decade should be a reason for pause. There are already pretty large deployments (1+ million users), so I think it's scalable to mid-level deployments. > only one entity has emerged as willing to sink the costs of Matrix should be a reason for worries. idk what you mean > all of them XMPP services at one point or another of their histories histories is an important keyword reply donatj 5 hours agoparentprevI see nothing wrong with that syntax? Just avoid the extensions. All you really need to do is get text from A to B and it's great for that. reply beepbooptheory 4 hours agoparentprevPerhaps I'm just a bit dim but I don't really understand the problem here. If that had commas and { ... } around itself no one would give a second thought. But you also mention s-expressions, and there you dont even have to add the commas! reply samatman 3 hours agoparentprevWithout unconditionally endorsing the content of this blog (especially the more recent parts of it) you may find this post interesting: http://www.loper-os.org/?p=4003 reply th0th 15 hours agoprevIt feels really nice to see stuff like this while the most of the people think Slack, Discord and a few others are the only choices. I recently went through the hassle of deciding on something small for my family + company circle. Mainly considered XMPP and Matrix, and went with Matrix. Didn't know there was such a thing as \"always-on\" on IRC tho. reply donio 13 hours agoparent> Didn't know there was such a thing as \"always-on\" on IRC tho. It's a server feature and might be unique to Ergo. It's a per-user setting (with a global default) and when it's on the user always appears to be online so you can type at them any time like you would with other DM systems. The v3 chathistory support ensures that they don't miss messages. For clients that don't support chathistory the server can replay any unseen messages. It's a lot like what bouncers provide but integrated and very easy to enable for everybody so no extra steps required for my users. reply fishgoesblub 15 hours agoparentprevHave you had any issue with messages/notifications not be sent/received with Matrix? I wanted to try Matrix for friends and family, but either I would never get the message until I opened the app, or I'd get the notification but my phone wouldn't vibrate. Eventually settled on XMPP with Conversations on Android. reply meatmanek 35 minutes agorootparentThe Element app on Android seems to have problems with delivery. I haven't had issues on iOS. reply th0th 14 hours agorootparentprevNot really, I didn't have any delivery-related issues, and didn't get any complaints from other people as well. I have mixed feelings towards Matrix due to; 1. The only stable and maintained implementation is \"matrix-synapse\" and it is written in Python. 2. The most commonly used client is \"element\", and it is governed by the same people. So it feels we are the mercy of a single company. I wanted hard to go with a more established protocol like XMPP but failed to get a server running properly :) reply nurple 13 hours agorootparentNot sure if you tried prosody[0], but I found it rather powerful and simple to configure, including multiuser chat(muc) and peering. It's written in lua and has a module system so it's easy to extend. In particular I used the dovecot auth module[1] so users could login with their email credentials and I could manage a single user repo. 0. https://prosody.im/ 1. https://modules.prosody.im/mod_auth_dovecot reply th0th 13 hours agorootparentYep, Prosody was one of my failed attempts :P I am running everything on a kubernetes cluster, so a maintained helm chart is the first thing I check when running something. I didn't have much luck with XMPP servers with this. That IMAP auth trick is really awesome thinking BTW, kudos! reply nurple 12 hours agorootparentAh interesting, I haven't tried running it on k8s yet. Migrating my mail stack over to k8s has been on my todo list for a little while; should probably get around to it since dovecot and postfix have supported inet sockets for user/domain db and auth for ~12 years now. Dovecot is really great, and a ton of stuff supports using it as a sasl auth backend (postfix being an important one). I made a simple facade service that feeds it and postfix from couchdb via its dict backend[0] and postfix's tcp_tables[1], then point everything at dovecot for auth. Couch document IDs map really well to email/user, domain, and sieve script lookups; helluva lot simpler than setting up and managing LDAP. 0. https://doc.dovecot.org/2.3/configuration_manual/dict/ 1. https://www.postfix.org/tcp_table.5.html reply ezst 6 hours agorootparentprevI've been running XMPP/ejabberd for a decade, it's a single service embarking everything you need, including what it takes to do A/V calls (NAT traversal & al.). Nonetheless, it's also the quietest and lowest-profile piece of server software I've ever used. I don't need a container for that, but if you want, there's an official docker image for it. Without going to host millions of concurrent users and needing to distribute the service across multiple physical servers via clustering, I don't see what good an \"helm chart\" does for you, but then you do you. reply omnimus 11 hours agorootparentprevIve been running matrix for small company/group for almost 10years. No need to use Synapse as there are many other solid servers (and have been for years). Matrix (the company) software like Synapse and Denderite (their “performant” server in go) are aimed at mega servers that federate and the features revolve around that. If you want to selfhost just make it easy and get Conduit. Its single binary and uses embedded db (rocksdb or sqlite). I cant say about federation but for private chat server this has been solid for me for years. I still run it with sqlite (worse than rocksdb) and with 30 very active people its more responsive than Synapse ever was. reply huijzer 3 hours agorootparentWhat clients do you use to connect to it? I just setup a Conduit server and can connect from my Mac via https://app.element.io as well as the official MacOS app, but the iPhone apps cannot find it somehow. Does that work for you too? reply zaik 5 hours agorootparentprevHave you seen https://snikket.org ? reply be_erik 16 hours agoprevJust in time for taking my chatops onprem. Clear text orchestration with a chat log is pretty nice. !docker-restart :) reply linsomniac 5 hours agoprevI think the answer is no, but can Ergo connect to other IRC servers? I'd like to set it up linked with my existing ngircd, for my users to try out, and then if it goes well shut down ngircd, which is a pattern I've used before when migrating between servers. reply LinuxBender 2 hours agoparentHere [1] is a table that has IRCv3 features by platform and then view each platforms web site to see all the standard features they support outside of IRCv3. FWIW one of the most popular by market share is UnrealIRCD [2]. [1] - https://ircv3.net/software/servers.html [2] - https://www.ircstats.org/servers reply crtasm 4 hours agoparentprevIt doesn't support any linking at present: https://github.com/ergochat/ergo/blob/stable/docs/MANUAL.md#... reply modinfo 11 hours agoprevA year ago I used this server for my friends, then it was called oragono. I really recommend it. reply nik736 11 hours agoprevIs it possible to send Webhooks to specific channels of an Ergo/any other IRC server? reply sn0n 10 hours agoprevCan I connect with.... Bersirc? reply apetresc 6 hours agoparentMaybe, but is there a particular reason you need to use a ~20-year-abandoned IRC client when there's literally dozens of actively-maintained ones for any platform you could reasonably think of? reply gnabgib 10 hours agoparentprevThose are all IRC clients (this is a server) reply sn0n 10 hours agorootparentYea I thought I was replying to a comment but it tossed up top, so I edited. reply resters 12 hours agoprevlet's hope this replaced slack and all the gimmickware. reply dzhiurgis 12 hours agoparentWhat’s wrong with Slack? reply okwhateverdude 11 hours agorootparentLook under the hood sometime and witness the lovecraftian horror. You can enable the electron dev console via env var. Everything from how they layout the page, to the underlying structure for messages and threads (and how they are accessed) is super complex. reply laurentlb 7 hours agorootparentprevI find it super expensive if you want to have the history. reply Svip 11 hours agoprevWhenever IRC comes along, someone mentions its lack of chathistory/backlog as a missing feature. Having witnessed what Discord have wrought, I am now in the firm belief that backlog - at least for communities - is an anti-feature. Because the logs persists between sessions, people start to post things there for perpetuity, a task classically reserved for bulletin forums. Without a server-side backlog, the chat is fleeting, and everyone knows that, so to preserve important content, people know to save it somewhere else. This keeps the chat as it was meant to; a live chat, mimicking that of a human conservation, where nothing is recorded until someone makes the conscientious effort to do so. reply sph 11 hours agoparentFully agreed, but let's not forget the psychological quirk of Discord moderators loving to divide the world into neat little boxes, so the mark of any established server is the myriad of different topic channels. Every single community has become a silo with their own memes channel. It's like they emulate modern social media websites where they try to keep you engaged and in one spot forever. I find it dystopian and power-tripping personalities trying to invent rules upon rules on their little kingdom is really not conducive to spontaneous socialisation. Now, sorry, you cannot contribute to this conversation because you haven't fully read the rules on #welcome, didn't complete the captcha from our bot and, worse of all, you have not chosen a role for yourself. reply corobo 9 hours agorootparentUnfortunately it's worse than that now. It used to be that everything got siloed into channels, now things get siloed into the new forum system. These forum channels don't automatically appear in the sidebar and you get no indication of anything new added unless you specifically follow the thread. Moving into forum threads is a great way to kill a conversation, perfect even, honestly I wouldn't be surprised if the feature was added just so Discord could appear in \"forum\" searches. There's no way the feature was planned when it's so bad for conversations. In any case the discord mod quirk of stomping on discussion inertia plus this horrible new forum system guarantees a conversation fizzles out immediately. reply samatman 3 hours agorootparentI'd rather software chats not be on Discord, but that said I've found the forum feature quite helpful for help channels. You get auto-search for the topic as you type out a title, and if you don't see what you need, you can turn it straight into a topic. It's a lot better than the old system of posting into a rolling scroll and hoping one of the regulars is around, and that you're not asking a question which should be in the docs but isn't (and therefore gets asked an annoying amount of times). reply Mashimo 10 hours agorootparentprevDo you think the same people would behave differently as an IRC server mod? reply nonrandomstring 9 hours agorootparentI do. See my suggestion above. Software shapes behaviour. If you design software for social interaction you are designing mass behaviours. reply nonrandomstring 9 hours agorootparentprev> personalities trying to invent rules upon rules on their little kingdom is really not conducive to spontaneous socialisation Seems like a neglected area of research in UX/UI - perhaps an opportunity for a good PhD or Masters: To what extent do software paradigms enable/inhibit pathological/virtuous personality traits? And no - not all software is a \"neutral\" blank canvas. Behaviours cluster around latent or implied structures. Designers imprint their own values on code, perhaps even unconsciously. reply Mashimo 10 hours agoparentprevPeople just started to build IRC bots for notes and reminders. Or used IRC proxies to keep history while offline. All just hacks and gatekeeping the history to people who are not that tech savvy. Discord servers can have forums like channels. https://support.discord.com/hc/en-us/articles/6208479917079-... reply Svip 10 hours agorootparentI recognise someone may not have been introduced to what I meant by what Discord has wrought; specifically Discord channels (including forum channels) are not indexable by search engines, meaning posts with important details cannot be uncovered by an outsider. Classic bulletin forums are public, and so obscure technical details shared there could later be dug up by a curious soul. It's not too infrequent to see a blog shared on HN, with the author complaining about how hard it was to find some details, because they weren't a member of an obscure Discord server. The irony of the persistent backlogs for Discord means that a lot of this information is practically lost. Archive.org cannot preserve copies, so if the Discord server is closed or whenever Discord itself decides to call it quits, it's all gone. reply Tepix 9 hours agoparentprevPerhaps what we need is a group chat that automatically maintains a summary of relevant chat history created by AI? The AI could maintain a Wiki with relevant stuff gathered from the discussions. Not sure if it's good enough today, but it does seem like an interesting prospect. Not many people like filling Wikis. reply siva7 9 hours agoprev [–] What's wrong with teams? reply Tepix 9 hours agoparentFor starters, it's closed source, centralized and proprietary. You have no control over your data and the product's future. reply miningape 9 hours agoparentprevWhat's right with teams? Every time I open that miserable app I want to deep fry my computer reply gijoeyguerra 3 hours agoparentprevMS Teams is designed to create siloed teams and organizations. It discourages public chat and collaboration. It encourages private group chats. reply prmoustache 3 hours agoparentprev [–] everything? reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "Ergo, previously known as Oragono, is a modern Internet Relay Chat (IRC) server developed in the Go programming language, offering ease of setup and use.",
      "It integrates features of an IRC daemon (ircd), services framework, and bouncer, with support for IRCv3, and is customizable through a YAML configuration file.",
      "Ergo is a fork of the Ergonomadic IRC daemon and includes contributions from developers like Jeremy Latt, Edmund Huber, Daniel Oaks, and Shivaram Lingamneni."
    ],
    "commentSummary": [
      "Ergo Chat is a contemporary IRC (Internet Relay Chat) server developed in Go, known for its simplicity in hosting, minimal resource usage, and advanced features like v3 chathistory and always-on multi-client support.",
      "It includes built-in websocket support, facilitating easy web client access, and offers a modern chat experience that users may not recognize as IRC.",
      "Discussions highlight IRC's open protocol and flexibility compared to platforms like Discord, and the debate over IRC's lack of persistent chat history, which some see as a feature for maintaining ephemeral conversations."
    ],
    "points": 248,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1734482779
  },
  {
    "id": 42448939,
    "title": "Silver amulet is the oldest evidence of Christianity north of the Alps",
    "originLink": "https://archaeologymag.com/2024/12/oldest-evidence-of-christianity-north-of-the-alps/",
    "originBody": "Rare medieval relics, including saintly figures, unearthed at Berlin’s Molkenmarkt December 17, 2024",
    "commentLink": "https://news.ycombinator.com/item?id=42448939",
    "commentBody": "Silver amulet is the oldest evidence of Christianity north of the Alps (archaeologymag.com)198 points by secretmark 10 hours agohidepastfavorite175 comments bjackman 6 hours agoI find it pretty cool how the spread of Christianity can be tracked so finely that a 50 update in earliest arrival time is exciting! I started listening to a podcast called \"the history of the early church\" to learn a bit more about that but unfortunately I think the target audience was Christians interested in theology rather than nerds interested in history. Recommendations for books etc are welcome! reply Hilift 5 hours agoparentI think the more interesting developments occurred after the fall of the western Roman empire. The eastern empire (Constantinople) had frequent arguments and disputes with the west over nearly everything, including Christianity. The eastern Orthodox church refers to itself as the \"Catholic Church\" in internal documents. After the west fell in 476, they continued to present themselves as \"the\" Catholic church, which was changed forever in 1200 when the largest Christian city in the world (Constantinople) was destroyed. The destruction took two years, and most of the writings, art and treasure of the richest city in the world was either destroyed, stolen, or lost. reply tivert 50 minutes agorootparent> The eastern Orthodox church refers to itself as the \"Catholic Church\" in internal documents. After the west fell in 476, they continued to present themselves as \"the\" Catholic church... Is that really so odd? Doesn't \"catholic\" mean something like \"universal,\" and I think it would be very odd for one faction of a split organization to cede that kind of title to its rival faction. I might be misunderstanding your point, but I kinda feel it should be followed up with a kind of \"Did you know, Western European, that these two different things are actually similar in this way you didn't know about?\" reply pwgentleman 36 minutes agorootparent> \"catholic\" mean something like \"universal,\" Christians make a distinction between churches and the church. The former is the physical building or even denominations like Lutherans or Roman Catholics. The latter is the group of people that are part of Christianity, across time and denominations. The Universal Church refers to the latter. Galatians 1:2 \"…the churches of Galatia…\" vs Colossians 1:24 \"…for the sake of his body, that is, the church…\" reply ithkuil 5 hours agorootparentprevIn fact the very word catholic derives from the Greek words kata and holos reply xdennis 2 hours agorootparentAdditionally, it's part of the credo: > [We believe] in one, holy, catholic, and apostolic Church.\" In Latin: > Et unam sanctam catholicam et apostolicam Ecclesiam. https://en.wikipedia.org/wiki/Four_Marks_of_the_Church Catholic just means universal. reply kamikazeturtles 5 hours agorootparentprevDid the fact that Christians from Western Europe looted Constantinople in 1200 play a role in the Eastern Roman Empire's decision to stop identifying themselves as part of the Catholic Church, or were there already deep theological and political divides? reply srcreigh 3 hours agorootparentThe pope who sent the schism message delegation died before it reached Constantinople. And the patriarch of Constantinople at the time, also died before his reply made it back to Rome. reply throaway2501 5 hours agorootparentprevCatholic means universal, so both present themselves as the original and true church, with the head either in Rome or Constantinople/Pentarchy. The actual break of communion comes from 1054 but really began much earlier. reply harimau777 2 hours agorootparentEven in protestant churches like the Presbyterians and the Methodists you will hear references to the \"Catholic Church\" where it refers to the universal church that is inclusive all all believers regardless of denomination. For example in shows up in the Nicene Creed and the Apostles Creed. reply gostsamo 4 hours agorootparentprevThe schism was in 1053 reply paganel 3 hours agorootparent1054, in fact, but the 1204 ransacking of Constantinople certainly didn't help with how the \"Franks\" (because that's how the Catholics were mostly called) were seen by the Christian-Orthodox (if it matters I'm a Christian-Orthodox myself). I was reading a travelogue written by a Russian monk (? not sure, either a monk or a wealthy boyar predisposed to the Holy stuff) who was visiting Constantinople sometimes in the early 1300s, so a century after the whole tragedy, and he was still describing how destroyed the city looked because of the Franks and what big of a tragedy that was. reply xdennis 1 hour agorootparentprev> a role in the Eastern Roman Empire's decision to stop identifying themselves as part of the Catholic Church From their point of view, the West abandoned the true (i.e. orthodox) faith. Also, it's hard to argue that the Eastern Christians changed more than Western ones. For example, since the 12th century the pope has forbidden priest marriage. There is some debate in the Catholic Church about allowing this again. If that is implemented, it would simply be a reversion to what the Orthodox Church has always done. reply loudmax 4 hours agoparentprevThe Centre Place youtube channel has some pretty good lectures, including some very good lectures on Judaism and early Christianity: https://www.youtube.com/@centre-place/playlists The videos are presented by a pastor of the Community of Christ church in Toronto, but they're from a historical rather than religious perspective. reply dddddaviddddd 3 hours agoparentprevThe “Religions of the Ancient Mediterranean” podcast is excellent. It’s mostly cut-up university lectures by the author, who teaches at York University in Toronto. https://www.philipharland.com/Blog/religions-of-the-ancient-... reply alskdj21 5 hours agoparentprevYou might enjoy Let's Talk Religion[0] and ReligionForBreakfast[1]. Both have variety of topics not solely focused on Christianity. [0] https://www.youtube.com/@LetsTalkReligion [1] https://www.youtube.com/@ReligionForBreakfast reply MontagFTB 6 hours agoparentprevI’d recommend “2,000 Years of Christ's Power” by Nick Needham. I am not sure where it falls on your theology/history spectrum but it has some of both. I enjoyed the audiobook of Volume 1 immensely. For me it did a great job describing the context in which the church began, the major figures throughout the early church, and the spread, schisms, and events that helped shape the church in its formative years. reply cogman10 4 hours agoparentprevData over dogma is a pretty good podcast about Christianity and Judaism. It's mostly about taking Bible stories and putting them into their historic context with the best evidence we have. It's not about converting, just covering the history. reply oldmanhorton 3 hours agoparentprevSomeone already said The Rest is History, but one of the presenters of that podcast Tom Holland (not the actor) has also written extensively about the history of the catholic church in Millennium and Dominion. Highly recommended. reply bigstrat2003 2 hours agorootparentSecond the recommendation on Millennium, just note that for some stupid reason the US publisher decided to retitle the book \"The Forge of Christendom\". So if you're in the US you won't find it under its real title. reply throw0101c 2 hours agoparentprev> Recommendations for books etc are welcome! See perhaps the references / (printed) sources at: * https://en.wikipedia.org/wiki/Historicity_of_Jesus reply wolfhelius 6 hours agoparentprevI had a long drive where I listened to The Great Courses, which had a set on early Christianity. I think the professor was from Notre Dame. The early church was wrestling with polytheism (is the OT god seemed really different from the NT god) and it eventually had to get resolved by the Council at Nicaea at Constantine's behest. reply papandada 5 hours agorootparentI've never heard anyone say the early church wrestled with polytheism. Maybe that's my bias nestled in Christian circles of not using that word, in favour of something more like \"the nature of the triune Godhead\", etc. reply kibwen 4 hours agorootparentEven today plenty of Christian sects refuse to recognize the council of Nicaea's interpretation of the trinity, including the Mormons and the Jehovah's witnesses: https://en.wikipedia.org/wiki/Nontrinitarianism (Whether or not any of these flirt with polytheism is up for debate.) Meanwhile, the Catholic church's own profusion of saints whom you are supposed to beseech for specific blessings is dangerously close to a polytheistic practice in its own right. reply JackFr 3 hours agorootparenthttps://en.wikipedia.org/wiki/Filioque - to this day the Roman Catholic Church and the Eastern Orthodox Church disagree on whether the Holy Spirit proceeds from the Father, or from the Father and the Son. reply giraffe_lady 3 hours agorootparentYeah but most lay people from either branch couldn't tell you the practical consequences of this. It's widely known & considered important because it's a remaining theological justification for the schism, not the other way around. reply throw0101c 2 hours agorootparentAn interesting take on the dilemma between the two 'sides': > You see the problem. If you include the filioque, you fight the Arians in the West while inadvertently supporting the Sabellians in the East. But if you exclude it, you fight the Sabellians while inadvertently supporting the Arians. At its heart, the filioque is really a linguistic debate, not a theological one. * https://old.reddit.com/r/Catholicism/comments/68hb00/eli5_th... (I don't know about the intricacies/subtleties enough to know how 'technically accurate' the above assessment is.) reply giraffe_lady 2 hours agorootparentI don't know either. To me (an orthodox christian) the filioque seems like a post hoc justification for a schism that was already well underway if not inevitable. By 1054 what became the two churches had already clearly differentiated religious traditions, local saints, and liturgical practices with very little interchange between them, not to mention language, governance, and secular culture. I have heard some fairly convincing (to a lay person) discussion between orthodox and catholic scholars that the filioque is potentially resolvable as a linguistic problem yes. But it's not worth really pursuing without a solution for the bigger issue of papal primacy. I don't know anyone who claims to have a viable path to reconciliation there. Plus, you know, the thousand years of mutual distrust and enmity. reply throw0101b 2 hours agorootparentprev> Even today plenty of Christian sects refuse to recognize the council of Nicaea's interpretation of the trinity, including the Mormons and the Jehovah's witnesses In some ways the (English) word \"God\" has become 'overloaded' over time: * https://edwardfeser.blogspot.com/2015/12/christians-muslims-... And that's not even getting into \"god\": * https://edwardfeser.blogspot.com/2011/04/further-thought-on-... reply 3pt14159 4 hours agorootparentprev> is dangerously close to a polytheistic practice in its own right. I don't really think so. We're supposed to pray with Mary to God and everyone recognizes that all of creation came through Christ, not Mary or any other saint. reply vintagedave 2 hours agorootparentI was taught as a child, and this was Protestant with a clear anti-Catholic bias, that: * Catholics prayed _to_ Mary (eg asking to intercede on your behalf); * This was speaking to the dead, and expecting a response, and thus a sin in some way I am not sure of. I'm guessing you're Catholic from your response; would you mind explaining to this somewhat lost person how Catholics view these two topics please? (I've never heard a good explanation, and even praying \"with\" Mary is new to me.) I admire Catholicism and wish I felt more trust in it, which is something that comes from childhood indoctrination, I know. Things stick into adulthood even when you're consciously aware of their root. So I'm keen to hear countering views :) reply svieira 1 hour agorootparent1. Prayer means several things - \"I then prayed my friend that he would accompany me on my trip to Italy\" does not mean that you worshiped your friend. Mary (and all the saints) are prayed to in that intercessory way, not in the worshipful way that we pray to God. The man at the Beautiful Gate asked Peter for charity and Peter gave him the ability to walk, not by his own power by by the power of Jesus (Acts 3:2-6). And again intercessory prayer as an important part of the life of the Church is well-attested - e. g., St. Paul in 1 Timothy 2:5 says \"I urge that supplications, prayers, intercessions, and thanksgivings be made for all men\". Finally, why the focus on Mary above all other saints? \"Who am I, that the mother of my Lord should come to me\" says Elizabeth \"filled with the Holy Spirit\" and before that \"Hail, full of grace, the Lord is with you\" says Gabriel bringing God's message to Mary. And what does Mary say in response? \"My soul magnifies the Lord, and my spirit rejoices in God my savior\" and \"I am the handmaid of the Lord, let it be done to me as you have said\". When trying to draw closer to Christ, who would you want with you on your journey more than she who was called to be His mother? And who among all mankind would be more eager to have you come to the throne than she for whom \"the Almighty has done [great things for]\"? 2. \"In fact, [God has not forbidden contact with the dead], because he at times has given it — for example, when he had Moses and Elijah appear with Christ to the disciples on the Mount of Transfiguration (Matt. 17:3). What God has forbidden is the necromantic practice of conjuring up spirits. \" Via https://www.catholic.com/tract/praying-to-the-saints reply blueshoe14 24 minutes agorootparentDid you mean 1 Timothy 2.1? reply sickofparadox 1 hour agorootparentprev>This was speaking to the dead, and expecting a response, and thus a sin in some way I am not sure of. Catholics believe that people in heaven are not dead, and can hear your prayers for intercession (this is the case with most protestants too). Jesus said, after all, that he is the God of the living not the God of the dead[1], and that those in heaven will be reborn in a new and everlasting life. Catholics further believe that the saints in heaven can pray on your behalf and are, in fact, excited to do so, and possibly better at it than anyone on earth. [1] https://www.biblegateway.com/verse/en/Matthew%2022%3A32 reply kibwen 3 hours agorootparentprevIndeed, I'm not trying to argue that the tradition of Catholic saints doesn't obey an absolute hierarchy. I'm referring to practices that are specific to the domains of various patron saints, such as placing medals of Saint Christopher in your car for protection (him being the patron saint of transporters and travelers, as well as athletics, bachelors, surfing, storms, epilepsy, gardeners, and toothache). One of the reasons that Protestants objected to saintly veneration was precisely because they felt it took focus away from Jesus. reply gpderetta 3 hours agorootparentEven if the Catholic church might technically be not polytheistic, it is hard to argue that the cult of saints didn't replace the ancient Roman lares in the day to day cult. Yes, saints are supposed to intercede to provide favors and protection, but the practical effects [1] are the same. Religious syncretism is very well attested. [1] however you want to interpret this. reply JackFr 3 hours agorootparentprevAs Mary asked Jesus to perform the miracle at the wedding at Cana, for the said of her friend, we too are called to pray to ask Mary to intercede for us for our intentions. reply kibwen 2 hours agorootparentYes, with \"saint\" I wasn't even trying to invoke a discussion involving Mary at all, because in practice she's so far above the saints that to equate them feels like heresy (and might literally be heresy in some contexts; hyperdulia vs. dulia and all). In practice the absolute adulation of Mary is such that she nearly feels like the fourth member of the trinity. reply mensetmanusman 2 hours agorootparentWho judges what appears to happen in practice? reply kibwen 0 minutes agorootparentWe can have separate interpretations of how things play out in practice, anything I list is free to be dismissed as anecdotal. But when I think of famous Christian art, I think of art that depicts Mary (and baby Jesus, yes, but the artists deliberately chose not to depict a scene of Jesus without Mary); there's so many of these that it became its own genre: https://en.wikipedia.org/wiki/Madonna_(art) . And when I think of famous Christian cathedrals, I think of the Notre Dame, among the other zillions that are named after Mary. And when I think of people pointing out modern miracles I think of weeping statues of Mary or people finding Mary in a grilled cheese sandwich; this once again has its own entire genre: https://en.wikipedia.org/wiki/Marian_apparition . And in Catholic parts of the US at least, IME you're more likely to see a Bathtub Mary outside of a house than a cross: https://en.wikipedia.org/wiki/Bathtub_Madonna xdennis 1 hour agorootparentprevAs an Atheist (formally Orthodox), I think I can adjudicate this. The problem with the First Council of Nicaea was that it was decided wrong. The whole \"there are three gods, but only one god\" is inherently confusing. There's a reason why Arianism keeps recurring over and over again. All the new nations who have been introduced to this aspect of Christianity find it bizarre. If the decision would have been more along the lines of Islam (i.e. Jesus is super holy, but not God) then it would have been easier to maintain unity. In fact, Islam's adoption of a form of Arianism is one of the reasons it replaced Christianity so quickly in North Africa and the Middle East. (Well, that and the sword.) reply giraffe_lady 3 hours agorootparentprevIn a taxonomy of religious belief the communion of saints is much closer to ancestor veneration than it is polytheism. If you're going to see anything in christianity as potentially polytheistic it's the triune god come on. reply petsfed 5 minutes agorootparentI think, in a technical sense, you're right. But the difference between ancestor veneration (especially semi-legendary ancestor veneration) and veneration of a pantheon of lower-tier dieties is practically nonexistent. Its a distinction without difference. Nobody hesitates to call Shintoism polytheistic, and its core practices, to an outsider, seem strikingly similar to how a Christian, especially a Roman Catholic, interacts with the saints. throw0101b 3 hours agorootparentprev> I've never heard anyone say the early church wrestled with polytheism. See: > Marcion preached that the benevolent God of the Gospel who sent Jesus Christ into the world as the savior was the true Supreme Being, different and opposed to the malevolent Demiurge or creator god, identified with the Hebrew God of the Old Testament.[2][3][5] * https://en.wikipedia.org/wiki/Marcionism reply pram 1 hour agorootparentI find myself agreeing with a lot of these “gnostic” interpretations tbh. When you read stuff like Numbers 14, God just comes off as a total asshole lol Although the whole theology they cooked up around the “true god” reads like bad fan fiction usually. reply throwup238 36 minutes agorootparent> \"the nature of the triune Godhead\" Yeah that sounds like some weak Warhammer 40k fanfic. reply mistrial9 4 hours agorootparentprevthis seems like a sideways retelling of the \"Gospels of Thomas\" stories.. this is a nuanced topic and shrouded by history.. Suffice it to say that intellectuals and pious people knew very well the cults of Apollo, astrology of High Priests, nature worship, Egyptian deism, goddess worship, and pantheonism while the Christian scriptures were solidifying as a social blueprint. reply dragonwriter 2 hours agorootparentprevNote that to non-Christian monotheists, the Christian resolution of that problem is often seen as polytheism with circumlocution. reply mensetmanusman 2 hours agorootparentThis arises from a confusion of multiplication 1x1x1 with addition 1+1+1 in the abstraction of facets of truth. reply sorokod 13 minutes agorootparentA neat analogy but aren't those 1s actually distinct from each other in your religion? reply foobarian 5 hours agoparentprevSpeaking of history podcasts, I've gone through Mike Duncan's Rome and Revolutions, the Fall of Civilizations, Dan Carlin's Hardcore Histories... any suggestions for more like this? I noticed there is a Byzantium history series that seemed interesting. reply BillSaysThis 58 minutes agorootparenthttps://www.thebritishhistorypodcast.com/ The British History Podcast starts in deep pre-Roman times and, after ~460 episodes, is up to 1091. reply loudmax 4 hours agorootparentprevThe History of English podcast is worth a listen. It's about the development of the English language, so it covers a lot of history and prehistory, and also linguistics. The presenter Kevin Stroud has a deep passion for the subject matter. Unfortunately, he also has a tendency to repeat himself and over-explain simple examples so the effect can be somewhat soporific. reply ecshafer 3 hours agorootparentprevAssuming you want more Long form, narrative style historical podcasts. History of the Germans, The French History Podcast, and The History of England are all very good in depth podcasts. I also enjoy the History of The Crusades, which is good, narrative and similar to Revolutions following various crusades. reply rpicard 4 hours agorootparentprevHistory on Fire is another great one. He’s especially interested in military / martial arts but it has a bit of everything. reply JackFr 3 hours agorootparentprevTwelve Byzantine Rulers https://12byzantinerulers.com/ reply HowardStark 5 hours agorootparentprevThought pointedly not a podcast, the YouTube channel Historia Civilis was my go to thing to fall asleep to for a while. The simple animation style and depth I found very soothing. reply anonymousDan 4 hours agorootparentprevThe rest is history is pretty good. reply kcsaba2 6 hours agoparentprevThe Triumph of Christianity: How the Jesus Movement Became the World's Largest Religion - Rodney Stark reply strogonoff 5 hours agoparentprevIf you want a non-religious take on the history of Abrahamic religions, a recent episode 393 of the podcast by Sam Harriss, where he interviews historian Simon Sebag Montefiore, should be an interesting listen. reply wslh 2 hours agoparentprevI think one of the oldest historical mentions of Jesus is by Josephus [1][2]. There is, however, scholarly discussion about whether parts of his references to Jesus were altered by later Christian scribes [3]. [1] https://en.wikipedia.org/wiki/Josephus [2] https://en.wikipedia.org/wiki/Josephus_on_Jesus [3] https://scholar.google.com/scholar?hl=en&as_sdt=0%2C5&q=jose... reply markeroon 2 hours agorootparentThis blew my mind when I first learned of it reply mensetmanusman 2 hours agorootparentprevThe Didache predates Josephus. reply wslh 1 hour agorootparentI understand that the Didache doesn't mention Jesus itself. reply abrenuntio 1 hour agorootparentRead it here: https://www.newadvent.org/fathers/0714.htm (E.g. when discussing the Eucharist.) reply ImJamal 1 hour agorootparentprevThe traditional view held by Christians is that the Gospel of Matthew was written within 10 years of Jesus' death. Modern scholars (often atheists) do not believe it though. reply Almondsetat 2 hours agoparentprevI mean, wouldn't you find it strange if historians from the year 4000 believed the sexual revolution of 1968 happened in 2018? Quite a discrepancy \"only\" 50 years reply hobs 4 hours agoparentprevMy favorite find in the last few months is the youtube channel \"esoterica\" - here's his video on the origins of yaweh as a storm god https://www.youtube.com/watch?v=mdKst8zeh-U He recommends books and primary sources for every episode and they vary from interesting more pubscience type stuff to incredibly expensive and deep academic sources out of print. The gentleman who runs it is very obviously jewish in practice but only uses that to inform his historical context instead of override it, its very refreshing as someone who is an atheist. reply Oarch 8 hours agoprevI'll never be able to read about us digitally unrolling fragile scrolls without it seemingly like otherworldly sci-fi technology. The translated blessing text itself seems almost modern. Funny to see how little we've changed in some ways. reply ben1040 2 hours agoparent>I'll never be able to read about us digitally unrolling fragile scrolls without it seemingly like otherworldly sci-fi technology. I similarly had my mind blown reading an article last week, about how sports & game card collectors are now having their packs CT scanned so they can identify what cards are inside (and the value of the pack) while keeping them sealed. https://www.nytimes.com/athletic/5987857/2024/12/12/trading-... reply FearNotDaniel 8 hours agoparentprevSpeaking as a participant in a number of somewhat \"modern\" Christian traditions, I think one factor is that we have changed quite a lot and then some strands of the faith have decided to go back into the past and seek what we lost from the early days. One example being certain rock'n'roll churches where people stick their hands up in the air while singing and praying: I heard one pastor defend this as being \"this is not a new form of prayer, this is what Jewish people were doing hundreds/thousands of years ago and now we're bringing it back\". (See the rather-ancient Book of Exodus, for example. No electric guitars or drum kits there[0], but Moses is definitely described as holding his hands up in prayer, sometimes with the help of Joshua when his arms got tired). [0] though I'm afraid to admit there is at least one actual tambourine... reply Cthulhu_ 6 hours agorootparentThing is, Christianity is (should be? idk) based on the teachings of Jesus which separated from Judaism; on prayer and worship, the New Testament has teachings like: > Matthew 6:5-14 > 5 “And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by others. Truly I tell you, they have received their reward in full. 6 But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. 7 And when you pray, do not keep on babbling like pagans, for they think they will be heard because of their many words. 8 Do not be like them, for your Father knows what you need before you ask him. That is, he teaches a humble, private, and not-showy way of praying, as opposed to the Jews of their time. But this is causing tension and schisms in Christian churches everywhere. I grew up in a fairly conservative one - grey suits, quiet / low energy services, nothing too outlandish. But family of mine ended up in more Evangelical churches, with live music and the like. Then there's Catholics where opulence and grandeur is apparent in their cathedrals, and while I can appreciate them for their architecture and atmosphere and the like, I don't think that's in line with Jesus' teachings of humility and helping the poor etc, especially not given how much money goes and went around in the church. reply christopher8827 6 hours agorootparent> I don't think that's in line with Jesus' teachings of humility and helping the poor etc, especially not given how much money goes and went around in the church. Hmm, but in the Exodus, the ark of the covenant was glided in gold with cherubs on the four corners. Same with the Jewish Temple, it was probably decked out in marble. Unlike Protestants, Catholicism have arts, choral music and statues and architecture not because they are \"worshipping it\" but because these things are supposed to direct the mind upwards towards God. I think the Catholic Mass is the ancient form of worship by the early Church. There's multiple references to the Real Presence in the Eucharist in New Testament (ie. the road to Eramus and the breaking of bread, and in John 6:53*) and the Sanctus is still in the Eucharistic Prayer, and besides, its an obvious break with the Jews who did burnt offerings in the Temple. John 6:53–58, “Very truly I tell you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in you. Whoever eats my flesh and drinks my blood has eternal life, and I will raise them up at the last day. For my flesh is real food and my blood is real drink. Whoever eats my flesh and drinks my blood remains in me, and I in them. Just as the living Father sent me and I live because of the Father, so the one who feeds on me will live because of me. This is the bread that came down from heaven. Your ancestors ate manna and died, but whoever feeds on this bread will live forever.” reply NemoNobody 4 hours agorootparentExodus was as far from Christ as we are. The Old Testament can't be used to counter Jesus - Jesus is the counter to the Old Testament. He is the reason it's \"Old\" - humility, loving all without conditions, forgivenes, turning the other cheek - The Greatest Commandment, none of them are ignored or \"misinterpreted\" in any justified way, even if that way is quoting scripture from Exodus. reply marky1991 3 hours agorootparentThat's a very unusual context for me, in my tradition (reformed Presbyterian) we definitely don't view things that we way in general, the God of the old testament is the God of the new and Jesus didn't wholesale make the old testament invalid, only the parts of the law that he had already satisfied. (Eg no need for more animal sacrifices, we've already sacrificed enough via Jesus) (Notably, the moral law and parts of the ceremonial law are still valid) It is interesting to think about why it's ok to differ from the old temple. Granted of course some of it is cultural differences, we're not the same people and it's 1000s of years later, and perhaps it was different because we're not the theocratic state of ancient Israel. But something for me to think about why this component is no longer needed (my church is very classic boring protestant architecture) reply ARandomerDude 1 hour agorootparentAgreed except for this comment. > parts of the ceremonial law are still valid Westminster Confession 19.3: “All which ceremonial laws are now abrogated, under the new testament.” The reason the ceremonial law is abrogated is because it pointed forward to Christ who was to come. But since Christ has come, retaining the ceremonial law is tantamount to denying Christ (see full text of WCF 19.3 and book of Hebrews). If you were thinking of the link between baptism and circumcision, remember that God gave the covenant promise and sign to Abraham 430 years before Moses (Gen 17, Gal 3:17), so circumcision predates the law. reply nemomarx 6 hours agorootparentprevWell yeah, opulent temples are in line with Jewish traditions but the other poster is suggesting that's not in line with the teaching of the new testament specifically? reply jajko 3 hours agorootparentprevAs somebody outside of religions (thank you both parents, probably the greatest gift one can give to one's kids - freedom of faith and self determination, something almost impossible as adult if indoctrinated young), these kind of discussions are funny to me. Why? They are present in every corner of the world, every religion. And all you need is to take few steps back and stop taking everything literally, trying to find some universal life guidance in bronze age texts. Not that its not there completely, some things are universal, but so are half the self-help books for example or literally any other serious text. Frank Herbert's Dune series is way more appealing and worthy to me for example and truths in it way more universal, yet I am not basing my whole life and morals on it, nor do I feel the need to push it on rest of the world. Those were stories, no moral value greater than old greek (or persian, hindu etc.) tales which always had some strong message beyond story on the surface. Stories made up by men, hundreds of years after christ, which were retold probably 20x before somebody wrote them down (and then 20x translated between various slangs, languages and targeted meanings). Current bible has little to do with original story, its simply not technically possible for complex stories to be preserved 100% for hundreds of years by just retelling them. You realize that say sunni vs shia muslims are, when reduced to few words, a conflict between which member of the family was the truest believer and whose words are more important, while having 0 reference to actually decide so? Yet conflicts between those are numerous and victims of those in hundreds of millions. Every time I see people desperately looking for specific truths, there is some deeper underlying problem and inability/unwillingness to decide something rather trivial for oneself. Like which sort of music should be happening where - what the heck does this have to do with actual faith in your god(s)? Do you also consult religious text when picking up Sunday sweater color? Deities are not that petty, not even in those bronze age tales, its just showing human flaws and fears. reply mistrial9 1 hour agorootparentthat's all brave and probably well intentioned, but there is another side to it. The Bible was specifically \"a single agreed upon text\" so that groups of people in real life could stop fighting about theology points, big and small. It still exists today. \"The Bible is the Truth\" end of statement. It is not because you personally cannot find new meaning in non-Bible things.. it is specifically to get groups of people \"on the same page\" .. that phrase is used today. The written nature of it also tends toward stability. Perhaps in an unsatisfying way to an adolescent, the answer is there already, and you personally find your place in the order that is established by your ancestors and lead you life. Mostly the whole exercise is opposite of adolescent exploration. IMHO this is neither bad nor good. It is boring and meant to be boring, to prevent deadly conflict, wasted efforts, petty differences etc. Based on this boring interpretation, Christians went on to build massive, mighty buildings, large civilized empires and vast written knowledge available to literate citizens. Those things did not have to happen at all. The triumph is that they did happen. In modern times we mostly dont even regard these things, since they are \"obvious.\" Please note that I am not saying this is the only one True Path at all, just describing things. reply mtalantikite 5 minutes agorootparent> It is boring and meant to be boring, to prevent deadly conflict, wasted efforts, petty differences etc. Seems like that failed miserably if it was a goal. > Based on this boring interpretation, Christians went on to build massive, mighty buildings, large civilized empires and vast written knowledge available to literate citizens. The buildings are impressive, but every time I walk through, say Sacré-Cœur Basilica, I can only think of the incomprehensible amounts of wealth extraction and enslavement that it was built upon. batch12 5 hours agorootparentprevWhile your reference talks about prayer which is distinct from worship, I think that the instructions around prayer and worship are related. However, I dont think the message is to be reserved, but instead be honest. I understand this verse to mean don't be fake, God knows your heart. Be real. Here are a few examples that reinforce why I think this. When talking to the Samaritan woman at the well Jesus talks about worship being true and of the spirit. John 4:23-24 NIV [23] Yet a time is coming and has now come when the true worshipers will worship the Father in the Spirit and in truth, for they are the kind of worshipers the Father seeks. [24] God is spirit, and his worshipers must worship in the Spirit and in truth. A reminder to forgive and seek forgiveness from those you have wronged (as reinforced in Matthew 6:14-15, Leviticus 19:18, Proverbs 17:9 ) before asking for forgiveness and before worshipping God: Matthew 5:23-24 NIV [23] “Therefore, if you are offering your gift at the altar and there remember that your brother or sister has something against you, [24] leave your gift there in front of the altar. First go and be reconciled to them; then come and offer your gift. Showing that fake worship means little: Matthew 15 8:9 (NIV) quoting Isaiah 29:13 [8] “ ‘These people honor me with their lips, but their hearts are far from me. [9] They worship me in vain; their teachings are merely human rules.’ ” reply abrenuntio 3 hours agorootparentprev\"This perfume was worth an entire year's wages. Why wasn't it sold and the money given to the poor?\" Sacred art exists to honor the Lord. We ourselves may remain poor and humble in the middle of all this beauty :-) reply emmelaich 4 hours agorootparentprevFWIW, this has changed a lot. Catholic churches built in the last 50 years are far more austere than those built earlier. reply abrenuntio 3 hours agorootparentIt's a catastrophe, not just esthetically but spiritually as well. It has nothing to do with austerity or wealth. Some of the churches no longer seek to express holiness (\"having been set aside for God\") and support the numinous and eternal nature of the divine liturgy that takes place in them. One of the most breathtaking pictures I've ever seen in this regard is of Mass in a German church completely destroyed during WW2. https://www.churchpop.com/content/images/size/w1200/wordpres... \"Stat crux dum volvitur orbis\"... reply mistrial9 3 hours agorootparentprevI believe it, modern society has killed the artisans crafts. No one can make the old style ornament now. reply riskable 3 hours agorootparentNonsense! It just isn't economical. There's loads of artisans that can expertly sculpt/carve marble, wood, etc. It's just if you want to hire someone (or a team of people) to create such things it could cost more than the building itself. Much cheaper to adorn your church with mass-manufactured statues made from molds and they give you that same air of creepiness for a tenth or 100th the price :thumbsup:. reply throw0101b 3 hours agorootparentprev> Then there's Catholics where opulence and grandeur is apparent […] It is not \"opulence and grandeur\" that are on display, but beauty, or Beauty: * https://ndpr.nd.edu/reviews/aquinas-on-beauty/ * https://en.wikipedia.org/wiki/Transcendentals See also \"Beauty, Truth, and Goodness\": * https://www.youtube.com/watch?v=e7RSQpDnYUY reply bjourne 2 hours agorootparentprevThat's because Yahweh was a sky god and lived high up in the clouds. So raising your hands, standing on mountain tops, etc, reduces your distance to him. Raising your hands while praying doesn't make as much sense anymore since Heaven is a metaphysical concept and not a place in the skies. reply wil421 8 hours agorootparentprevWhat about the rattle snake churches? reply FearNotDaniel 7 hours agorootparentWhat about them? Are you asking about the scriptural basis from ancient times that they use to justify their modern practices? (i.e. the immediate topic at hand) Or are you looking for theological and/or scientific opinions on whether the claims they make are true, for at least some meaning of the word “true”? reply markovs_gun 7 hours agorootparentprevThey also claim to be reviving an ancient practice, although the evidence for that actually being true is very lacking reply FearNotDaniel 7 hours agorootparentThere is nothing in the Bible that describes the practice they promote. Sure, there is a claim that people who are filled with the Holy Spirit will not die if bitten by snakes, but no description of it being used as a ritual practice and you could claim it contradicts “do not put the Lord God to the test”. I have no idea if there is extra-biblical evidence for people doing that in early churches, and whether those churches were considered orthodox or heretical at the time, or perhaps the 1st century equivalent of “we don’t know yet, we’re just trying stuff out to see what works”. reply aziaziazi 6 hours agorootparentIm going to cite (slightly shorten) Wikipedia. I have no competency to understand the sources and fact check but I though it’s quite interesting. > In the 2nd century the Ophites reportedly handled snakes during their services, and also worshipped the serpent. > The Ophites […] were a Christian Gnostic sect. > Gnosticism […] is a collection of religious ideas and systems that coalesced in the late 1st century AD among Jewish and early Christian sects. These diverse groups emphasized personal spiritual knowledge (gnosis) above the proto-orthodox teachings, traditions, and authority of religious institutions. Seems very reasonable sects to me but it’s understandable \"authorities of religious institutions\" didn’t like it. Indeed extra biblical gospel from Luke and Mark: > Behold, I give unto you power to tread on serpents and scorpions, and over all the power of the enemy: and nothing shall by any means hurt you. > And these signs shall follow them that believe: In my name shall they cast out devils; they shall speak with new tongues. They shall take up serpents; and if they drink any deadly thing, it shall not hurt them; they shall lay hands on the sick, and they shall recover. IMHO Gospels are comparable with the Bible as a source of history. reply NemoNobody 4 hours agorootparentGnosticism is a bit of a catchall - the Ophites were a sect or branch and not by any means the standard - it's difficult to say there is an established \"Standard Gnostic Theology\" as there really isn't, there are some common deviations from modern Christianity that rendered them more similar thru a modern lens than they may be, tho they are some common Gnostic themes, like self awareness but snake charming isn't one. That said, snakes have been widely deified thru out history by various cultures and beliefs. Prior to Christianity the god Tiamet would have been widely known and had been so for hundreds of years. It is common practice for a religion to take the previous god and render them the \"bad guy\" in their new religion - that could also have been done to the Ophites as the Gnostics were essentially erased by the Church and what little remains the establishment said about them has been rendered sus by what we have found recently of OG Gnostic texts. You have to realize, by 400 - saying someone handles snakes during their church service was a kin to saying they are a satanic cult. That said - Gnostics would handle snakes if they wanted or needed to and they would be fine bc that is the faith they preached, a faith of action. Step onto the water - you will not sink of you do and have faith already, no more is needed in the moment, no assistance from Priest or higher power. Christianity adopted the faith of Paul - the apostle not chosen by Christ, and became people that wait in their beliefs, faithfully waiting for God. Huge difference. reply mistrial9 3 hours agorootparentyes agree and .. there are branches of Christianity across the world that did not lose the connection to warfare. There are plenty of people who fight fiercely (in real life) that espouse Christ deeply.. a current Japan martial arts cage fighting champion from Brazil dedicated his whole victory speech to Christ recently, for example. reply woadwarrior01 5 hours agoparentprevThere's very similar, but perhaps much more challenging project for digitally unrolling the Herculaneum papyri[1], which is set up as an open machine learning competition[2]. [1]: https://en.wikipedia.org/wiki/Herculaneum_papyri [2]: https://scrollprize.org/ reply rrr_oh_man 7 hours agoparentprevMaybe our timescale of what is 'modern' is not so modern at all. reply bdcravens 8 hours agoparentprevIsn't any translation a product of the language norms of the translator, as opposed to a pure translation? I know when I read Spanish, I have to mentally convert the order of words to what makes sense in English (for example, \"Thanksgiving\" in Spanish would be \"Day of Action of Thanks\" if translated directly). reply markovs_gun 7 hours agorootparentYes, with the caveat that with religious texts there are certain conventions that get conserved even across languages. For example, The Book of John starts off \"In the beginning, there was the Word, and the Word was with God, and the Word was God.\" However, the term being translated here as \"Word\" (λόγος- logos) could easily be translated a number of different ways, and the technically literal meaning of \"word\" was already falling out of favor by the time John was written. The word could be \"Logic\" or \"reason\" or \"The underlying principle that governs the order of the universe\" but early Latin translators chose to translate this term as \"Verbe\" and so future translations followed suit. This is just one example. There are other instances where a word is a loanword from Greek or Latin because it is an early technical term. For example \"sanctification\" is taken directly from a Latin technical term that is translated that way because of how early Latin translators chose to translate the Greek. reply BoxOfRain 6 hours agorootparentI wonder if this is what radicals like Gerrard Winstanley had in mind when developing the English Reformation as chance for social reform as well? This quote for example suggests he was I think: >In the beginning of Time, the great Creator Reason, made the Earth to be a Common Treasury, to preserve Beasts, Birds, Fishes, and Man, the lord that was to govern this Creation; for Man had Domination given to him, over the Beasts, Birds, and Fishes; but not one word was spoken in the beginning, That one branch of mankind should rule over another. reply timthorn 6 hours agorootparentprevThere's 3 part Radio 4 series from a while ago on the King James Version, with one of the 45 minute episodes focussed on the translation of the work: https://www.bbc.co.uk/programmes/b00x3x68 reply FearNotDaniel 7 hours agorootparentprevGreat example. See also “thou shalt not kill” which would contradict tons of the surrounding text, if that is actually what the original Hebrew said. reply pergadad 7 hours agoprevLooks like the project partners made a video about it, with some good visuals. But i can't find the actual paper. Press release with link to the video is here: https://frankfurt.de/de-de/aktuelle-meldung/meldungen/frankf... reply FearNotDaniel 7 hours agoparentThanks for helping to flesh out the technical side of the discussion while I’m over here getting hung up on the theology :-) this is what makes HN still (occasionally) great. reply ilamont 1 hour agoprevThe article mentions \"18-line Latin text\" but I was unable to recognize any word on the scroll (took Latin in high school) even something obvious like deus. Was this some sort of Latin shorthand? reply adamredwoods 1 hour agoparent>> Although I realized fairly early on that the New Testament Letter to the Philippians is quoted at the end, I still spent a long time puzzling over the text, which is written in quite a crude form of Latin. I consulted specialist literature and databases and, finally, made some suggestions for how it might be interpreted. >> The inscription begins with the Trisagion, the threefold cry of “Holy” [based on Isaiah 6:3], which remains part of the liturgy of the Eucharist to this day. In this case, however, it’s written in Greek [“agios, agios, agios”] but in Latin script. https://www.uni-bonn.de/en/news/university-of-bonn-researche... reply alexjm 1 hour agoparentprevSome of the letter shapes look like Latin/Roman cursive, but even then I'm not sure I recognize any words either. https://en.wikipedia.org/wiki/Roman_cursive reply Decabytes 3 hours agoprevIt's super cool to see the digital unraveling of scrolls become more accessible. It's also amazing that we can still read the text of something that is nearly 2000 years old. One thing I don't understand is the picture of the scroll though. I don't see how they were able to figure out the letters? They don't look like an alphabet to me reply eschulz 3 hours agoprevBut what language is used for the inscription on the rolled silver amulet? reply elevaet 1 hour agoparentThe article said Latin, but I don't know what script that is. It looks like it was written right-to-left so maybe it's Latin written in Hebrew script? I'm not even sure if that was a thing. reply markovs_gun 32 minutes agorootparentNo, it's written left to right, it's just extremely messy cursive. There are also abbreviations and special shorthand symbols. reply emmelaich 4 hours agoprevRelated, for those interested in the history of religions and Christianity: https://www.astralcodexten.com/p/book-review-the-rise-of-chr... reply mistrial9 4 hours agoparent> a lot of male cult members join because the cult has hot girls. This seems to have been a big factor in the spread of early Christianity as well. well, that explains it thenreply Mistletoe 2 hours agorootparentAs someone that went to church for that reason as a child I can tell you some things never change. reply thih9 6 hours agoprev> Typically, amulets from this era contained a blend of Christian, Jewish, and pagan elements. Interesting; does anyone have a link showing a typical amulet from that era, for comparison? reply snapcaster 5 hours agoparentI found that interesting too, and curious about what it implies for how people thought about religion at the time reply PittleyDunkin 4 hours agorootparent> I found that interesting too, and curious about what it implies for how people thought about religion at the time Religion is an invention of the rennaisance. People at the time would have just perceived what we see as \"religion\" as worldview, much like people today typically believe in a fusion of economic theories. reply snapcaster 2 hours agorootparentThat's fascinating but makes sense. any places to go learn more about this you recommend? googling things like invention of religion don't really lead anything on this specific topic reply PittleyDunkin 2 hours agorootparentI'd probably start here: https://oxfordre.com/politics/display/10.1093/acrefore/97801... Or at the wikipedia page that links to that article: https://en.wikipedia.org/wiki/Secularism reply paganel 3 hours agoparentprevDon't have any reasonable good links available but over here, further East (present-day Romania and then the Roman province of Dacia) there was a strong presence of Oriental/Siro-Palmyrian deities like Mithras, Dea Syria or Belus. There's this (non-academic) page [1] in Romanian which you can use Google translate on in order to get a better hang of it. [1] https://historia.ro/sectiune/general/culte-si-credinte-in-da... reply MrBuddyCasino 5 hours agoprev> dates back to approximately 230-270 CE The nerve to use \"Common Era\" when specifically talking about the spread of christianity. reply abrenuntio 1 hour agoparent\"He who testifies to these things says, ``Yes, I am coming soon.'' Amen. Come, Lord Jesus.\" reply toolslive 4 hours agoprevthere might be even older evidence lurking if the following is true: \"Jesus was Julius Divius\" https://www.carotta.de/eindex.html reply briffid 4 hours agoparentThere is scientific consensus that Jesus was a historical figure, so the book referred here is probably fiction. reply lucozade 3 hours agorootparent> There is scientific consensus that Jesus was a historical figure It's fair to say that there is general consensus amongst Biblical scholars that there was a historical Jesus of Nazareth. Calling it a scientific consensus is a bit of a stretch though. As far as I'm aware there's zero scientific evidence for His existence. Just that the surviving textual evidence makes little sense if He didn't. reply mannyv 2 hours agorootparentThere's a ton of textual evidence for the existence of Santa Claus. reply abrenuntio 1 hour agorootparentCorrect, he lived in Turkey around the late third-early fourth century. reply _DeadFred_ 12 minutes agorootparentPretty sure he lived in Anatolia or the Roman empire. There was no 'Turkey' to live in around the late third century. reply cogman10 4 hours agorootparentprevOne of the more interesting pieces of evidence in the Bible. The Roman census that required every family go back to their hometown did not happen (why would it?). Romans kept very good records of censuses and such an event would be well covered. So why does the Bible have this story? The best guess is that Jesus was well known to have come from Nazareth. Yet the older messianic texts say the Messiah would be from Bethlehem. The gospel author undoubtedly was trying to square that circle to make sure the prophecy was fulfilled. Something they'd not need to do if Jesus wasn't real. The author had to explain to people who had grandparents who knew him as being from Nazareth why that still jives with older prophecies. reply ordinaryradical 3 hours agorootparentBefore you tie yourself in this knot it might be useful just to look and see if there was a Roman census in that time period: \"When I administered my thirteenth consulate (2 B.C.E.), the senate and Equestrian order and Roman people all called me father of the country, and voted that the same be inscribed in the vestibule of my temple\"[0] [0] http://classics.mit.edu/Augustus/deeds.html reply cogman10 2 hours agorootparentOh, I'm sorry I must not have been super clear. That Rome did censuses and kept detailed records of the censuses is not in dispute. The thing that never happened is people making long trips to the ancestral lands. The entire point of a census is to get an accurate population count for reasons of taxation and public spending. People uprooting to go to grandpa's home to be counted messes with that count. It's counter productive. Rome would never have required this and in fact would have tried to restrict travel during the census because they wanted an accurate population count. The much more likely explanation is the author of Luke needed Jesus to be born in Bethlehem, which was problematic because Jesus was well known to be from Nazareth. Here's a good article detailing those problems: https://bam.sites.uiowa.edu/faq/can-you-explain-problem-cens... I should note, this is not a controversial take. reply lucozade 1 hour agorootparentprevThat doesn't describe a census or anything like it. There is absolutely no evidence there was a census covering the Roman empire let alone the whole world (as actually stated in gLuke). However, there was a census of Judea ordered by Quirinius when Herod Archelaus was kicked out in 6AD. And that makes sense because, prior to that time, Judea was a client state so Rome would not have directly taxed it. Once it became a province, it would be subject to direct taxation and, hence, would have needed a census to determine the taxable population. So, by far the most likely scenario is that the author of gLuke was referring to this census but got his facts a bit wrong. He made way bigger whoppers than that one. reply FearNotDaniel 8 hours agoprevFascinating from both a technological and theological/ecclesiological perspective. I'll be sure to pass this on to some of my faith-filled friends who now live south of the Alps but have roots in the same region. > inhumation burials — a practice uncommon in other Roman cemeteries in Frankfurt To save others looking it up: \"inhumation burial\" seems to be a technical term in the field for what we simply call \"burial\", i.e. digging a grave and then covering the person with dirt and/or rocks. I'm not an expert, but given that this became the primary method of disposal in Christian culture (and still is, in many traditions who believe that cremation prevents the body being resurrected), one could infer that this is an indicator of Here Be Christians. If you know even a smidgeon of theology, it's not technically possible to define (mainstream) Christian faith without any reference to Jewish beliefs. Jesus was, of course, himself raised a Jew, as were both Saints Peter & Paul, although the latter was also a Roman citizen who wrote in Greek, and they famously quarrelled quite a bit about how much of Judaism should be incorporated into the new religion, well documented in the New Testament itself and plenty of extra-biblical evidence. It does seem a reasonable claim that nothing in this text contains elements of Judaism that were not already or subsequently incorporated into what became Christianity (though I'm pretty sure at this point it didn't yet have a name other than \"The Way\". I could be wrong there.) However, just for fun: - \"Holy Holy Holy\" is most definitely a reference to the (Hebrew) book of Isaiah, which was also quoted in the (Christian) book of Revelation aka Apocalypse (Greek, New Testament) - Of course they don't use the name Yahweh when talking about the God/Lord of the World, of whom Jesus is claimed to be the Son. Neither does the Septuagint (Greek translation of the Hebrew scriptures, produced for use by Greek-speaking Jews a few hundred years before Christ). But they are most definitely talking about the same God. - I'm not sure if this pre- or post- dates the Jewish tradition of replacing the Name with \"Adonai\" (Hebrew for \"Lord\") or its Greek/Latin equivalent, on the grounds that the Name itself is too holy to be spoken or to risk being destroyed if the manuscript gets damaged or, you know, buried in the ground to decay with a dead person. But that could also be a factor. Unfortunately they don't provide a transcription of the Latin text into modern characters so there's no opportunity right now to go nuts on that but it would be interesting to see what specific Latin words were used compared with translations of the Septuagint, and the original Greek and Hebrew texts themselves. Still, thanks for posting! reply bdcravens 8 hours agoparentMy wife is Messianic Jewish, where the primary intent is to restore Jewish traditions and beliefs while still believing in Jesus/Yeshua (\"Jesus\" being essentially a mispronunciation; the westernized version of the name would more accurately be \"Joshua\"). Personally my beliefs lie elsewhere, but it's still unfortunate that \"denomination\" is still such a tiny minority, given its desire to be a purer form of the religion. reply joshuamcginnis 1 hour agorootparentI have a lot of respect for Messianic Jews; they're struggle is real. I wish more Jews knew just how Jewish the story of Jesus actually is. As far as Christians are concerned, Jesus is the fulfillment of the messianic prophecies in the old testament. Jesus said, \"Do not think that I came to destroy the Law or the Prophets. I did not come to destroy but to fulfill.\" (Matthew 5:18) That said, there is arguably no simpler or purer form of Christianity than simply having faith in and a personal relationship with Jesus Christ. reply throaway2501 5 hours agorootparentprevMessianic Judaism is usually seen as a corruptive and corruptED force. Israel bans Messianic Jews from being citizens. reply lucozade 6 hours agorootparentprev> \"Jesus\" being essentially a mispronunciation Warning! Unnecessary nit-picking incoming... Jesus isn't a mispronunciation of Yeshua, it's a transliteration. Initially the Hebrew/Aramaic ישוע was transliterated to the Greek Ἰησοῦς which is essentially a phonetic transliteration with the ending changed to the Greek masculine singular. That was then transliterated to the Latin Iesus with basically the same deal ie phonetic with an ending change. And that morphed into Jesus, probably about the 16th century, when the swash 'I' became a 'j' sound. > more accurately be \"Joshua\" It wouldn't really be more accurate; it would just be a transliteration through a different route. The most that can be said is that there are fewer hops. It would still likely have most of the sounds wrong, esp if Jesus' name was originally pronounced in Galilean Aramaic. As I understand it that wouldn't have pronounced the final 'a' like an 'a' but more like a glottal stop. But that's right on the edge of my knowledge so I could have made the last bit up. reply abrenuntio 5 hours agorootparentprevDon’t confuse culture and gradual inculturation with purity of religion and validity of liturgy. In the age of the Messiah the faithful are truly drawn “from every nation, from all tribes and peoples and languages”. If your wife would go to any (decent) Catholic or Orthodox church, and learns to \"read\" the building and the liturgy of Holy Mass, maybe she could recognize the contours of the “pure” or “more Jewish\" religion she is yearning for. She could go to modern or more traditional Latin/Greek/Ukrainian/Syriac/Ethiopian/... rites and in the plurality of all those different cultures and temperaments recognize over and over again the exact same elements and basic plan, organically evolved yet meticulously preserved in a chain of unbroken sacramental obedience. Entering the church building she’d gradually walk from the holy water near the entrance, through the “outer courtyard” for the lay people, to the sanctuary with the sacrificial altar, golden vessels and incense, elevated and separated by altar rail or curtain. Behind is the tabernacle, the Holy of Holies containing the Real Presence, indicated by a lit candle. And if she was to e.g. carefully analyse the words of the Eucharistic prayers in all these different rites and languages, she would find over and over again the same underlying structure, complete with the Haggadah. But language and cultural differences aside, there must be fundamental differences as well. It is Christ Himself who took the prescribed liturgy of the ancient Passover meal and gave it its full and final meaning by substituting Himself, in the presence of the apostles, for the merely symbolic lamb. It is through Christ that the Trinity is fully revealed. How then could e.g. the exact same holidays have been retained? For instance, why would you celebrate Shavuot, if with Pentecost the Holy Spirit directly descended on the Church? Another example: the Lord's Day is not \"Sabbath on the wrong day\". Sabbath laws do not apply to those under the New Covenant. Beyond the most excellent idea of dedicating an entire day to the Lord with plenty of obligatory prayer, rest, food and family/community time, the Christian Sunday is simply not the Sabbath. On Sunday we celebrate the Resurrection, which occurred on the first day of a new week (the supernatural \"eighth day\", beyond the natural fullness of the old week). The priest in this age is also no longer a Levite. To properly offer this sacrifice, he is now sacramentally ordained by proper religious authorities “in the Order of Melchizedek”, reminiscent of the royal priesthood of David and the priesthood of Adam and the firstborns. And where the old liturgy was a sign of divine grace, the liturgy of our age is an effective cause of divine grace. If the priest obeys the liturgy that has been prescribed for his own rite and his own day, no amount of personal corruption can take away the sanctity of his work. This also means that there is no fundamental need for wars in the Holy Land or for \"conquering\" the Temple Mount by force. The Temple is already being built. Every time the faithful, after having been sacramentally cleansed of mortal sin through baptism or confession, participate in the Lord’s sacrifice by eating the body and drinking the blood of the Lamb, they themselves will inevitably become more and more the dwelling place of the Lord within the material creation. reply galangalalgol 6 hours agorootparentprevIsn't it Yesu, the diminutive, so Josh? \"Josh is the name above all names\", sounds kind of odd though. reply Cthulhu_ 6 hours agorootparentOnly because of your own cultural background / upbringing where Josh was a pretty normal and non-reverent name, like how people like me one day realise there's a whole culture of people out there where Jesus is still a common and popular first name, instead of something reserved for a religious figure. reply galangalalgol 5 hours agorootparentI live in one of those cultures and have several coworkers named Jesus. But some names have different associations. It is like \"Todd, The Necromancer!\" Vs \"Evelyn the sorceress\". Jesus is a serious and competent embedded c++ programmer. Josh is a goofy guy in accounting. reply andrepd 7 hours agorootparentprevEvery religion thinks they're the \"purer\" form of religion though, don't they? x) reply joshuamcginnis 1 hour agorootparentEvery religion makes truth claims. Many of those truth claims contradict each other. It's incumbent upon us to do the research, put the claims to the test and come to the most reasonable conclusion as to what is true. reply Cthulhu_ 6 hours agorootparentprevNot necessarily, they consider themselves right / proper or just prefer it over other flavours though (example being the many branches of Protestantism where each branch has a slightly different take on how things should be done, but it's not like they're at odds with each other per se) reply kevinmchugh 5 hours agorootparentProtestants all find their differences of opinion a big enough deal that they'll break up over it. They're not fighting wars I've doctrinal differences any more, but who in Christendom is these days? https://www.theguardian.com/stage/2005/sep/29/comedy.religio... reply FearNotDaniel 1 hour agorootparentGoodness, where to start… I don’t have time to read your link so I’ll only reply to what you wrote from my own direct personal experience: - many Protestant groups, while not fighting wars of physical violence, still harbour very unchristian hate in their hearts towards other Protestant sects and (usually) towards all Catholics, whom they consider to be idol worshippers led astray by Satan himself (sadly many Catholics also still feel the same about all Protestants and many other Catholics who don’t play the right music, wear the right vestments or worship in the right language and or precise form of words.) - on the other hand, many, many Protestants and Catholics are also working to resolve or otherwise sideline those “debatable things” and “foolish controversies” that St Paul advised the churches not to quarrel about (he didn’t say what, specifically, but then this is supposed to be a faith based on love and grace rather than legalism). I’ve been to large events where Catholics and Protestants are worshipping, witnessing and praying joyfully together and seeking to find the similarities and not the differences, without compromising on the fundamentals of what it means to follow Jesus. And these kinds of movements are growing around the world year upon year and also working together to fight social injustice, inequality and poverty — hopefully soon, more of our Orthodox brothers and sisters will get on board with this, but there are glimmers of hope in that direction too, as long as nobody says the word “Filioque” ;-) reply FearNotDaniel 1 hour agorootparentprevAh yes, I had a chance to read it while walking down the street. I know that joke, reminds me of the one my dad used to delight in telling, which ends with “I must be the luckiest Arab in Belfast”. Funnily enough the exact one that you posted is these days repeated by many churches somewhere during the Alpha Course, which after pausing for laughs is identified as an example of exactly not what you are being invited to believe. reply FearNotDaniel 6 hours agorootparentprevExcept Universalist/Unitarians, perhaps, they like to mix it all up into one big melting pot. reply joshdata 6 hours agorootparentprevThe unfortunate part is where Christians try to pass themselves off as Jews by adding \"Jewish\" to the name of their denomination. I wish my great aunts and uncles could have added \"Christian\" to their denomination to escape being murdered in the Holocaust, that would have been nice. reply noworriesnate 6 hours agorootparentWhat denominations do that? I'm familiar with Hebrew Roots, but doesn't seem to be what you're describing. reply vitus 5 hours agorootparentPresumably that's a reference to the GP describing \"Messianic Jewish\". (or rather, Messianic Judaism) > It considers itself to be a form of Judaism but is generally considered to be a sect of Christianity,[2][3] including by all major groups within mainstream Judaism, since Jews consider belief in Jesus as the Messiah and divine in the form of God the Son (and the doctrine of the Trinity in general) to be among the most defining distinctions between Judaism and Christianity. It is also generally considered a Christian sect by scholars and other Christian groups. https://en.wikipedia.org/wiki/Messianic_Judaism reply noworriesnate 5 hours agorootparentSo are they claiming that Messianic Jews are not actually Jews? Because they implied that people were falsely taking the title Jew if I understood them correctly. That would be the first time I've ever heard that particular assertion. reply joshdata 4 hours agorootparentYes and that was what I was saying (sorry it wasn't clear). What it means to be a Jew is complicated. Jews form an ethnicity of interconnected people with a range of beliefs and practices (it is, definitionally, not whether one is religiously adherent to Judaism). To me, one could in principle be religiously Christian and also ethnically Jewish (that's an unusual view among Jews), but to do that requires having an actual connection to the Jewish ethnicity (e.g. if one was raised ethnically Jewish and maintains a Jewish identity). My impression is that \"Messianic Jews\" are religiously and ethnically Christian who are importing Jewish practices into their otherwise non-Jewish identity. If OP's wife was born Jewish or converted prior becoming a \"Messianic Jew,\" I would stand corrected. If I, a very white person, start singing songs from Back churches, that doesn't make me Black. I wouldn't face the real-world struggles against racism of Black people, for example, and I think that's a useful hint when thinking about who is and isn't a member of a minority group like Jews. Likewise, acting out Jewish practices doesn't necessarily make one a Jew, and as one example it doesn't subject one to the sorts of anti-Semitism faced by Jews. I'm not saying facing anti-Semitism a necessary or sufficient condition for being a Jew, but if not that, then there must be something else that connects one to the Jewish ethnicity --- the interconnected people who believe they are Jews --- other than just by saying so. reply throaway2501 4 hours agorootparentprevIsrael doesn’t allow Messianic Jews to be citizens for this reason. reply noworriesnate 3 hours agorootparentSo I'm confused--are you saying that Israel thinks Messianic Jews are not Jews because they abandoned their faith or something like that, OR are you saying that Israel doesn't let Messianic Jews to be citizens because sometimes non-Jews convert to become Messianic Jews? reply lazide 1 hour agorootparentIt sounds like a variation of a - not so much that they abandoned their faith, per-se, but that the faith they espouse as being Jewish is not acceptably ‘in the same room’ as other Jewish faith. It would be somewhat like saying you were a Messianic Christian because you believed that Mohammed was a later prophet. There is a word for that kind of religion, and it isn’t Christianity. reply markovs_gun 4 hours agorootparentprevThere are essentially two completely different movements claiming the name of \"Messianic Judaism.\" The first are people who are Jewish- culturally, ethnically, and even religiously, who have converted to Christianity and believe that all other Jews should do the same. There is a small pocket of Messianic Jews of this definition in my hometown, so this is the version I was most familiar with. It wasn't until later that I learned that there is a second, much more popular movement under the name of Messianic Judaism which are people who are not ethnically or culturally Jewish who have determined that Christianity should return to its Jewish roots. These people have no historical connections to Judaism and usually grew up within a Christian cultural context. There is a lot of overlap with the \"Hebrew Roots\" movement that you mentioned, and in my opinion there isn't a real distinction between the two. Myself I feel kind of biased but I view the first kind as more \"legitimate\" since Judaism, isn't merely a religion, it's a living, breathing culture and it is super weird for someone to just roll up and claim it without having any connection to anyone who was doing it before. It's like if I decided I was going to be Indian and started wearing stereotypical Indian traditional dress and eating only curry because I think that's what Indians eat, without having any actual Indians in my movement. reply joshdata 3 hours agorootparentI agree that ethnic Jews with Christian religious beliefs is a legitimate concept. But I would rather call them Messianic Jews (or just Christian Jews) rather than adherents of \"Messianic Judaism.\" To say that \"Judaism\" can include Jesus erases the Jewish religion by leaving it without a name, conveniently benefiting the dominant Christian religion. (And Messianic Jews who are not Jews should be called something else entirely.) reply HarHarVeryFunny 4 hours agoparentprev> \"Holy Holy Holy\" is most definitely a reference to the (Hebrew) book of Isaiah, which was also quoted in the (Christian) book of Revelation aka Apocalypse (Greek, New Testament) Could you expand on that? Is there any specific reference to the book of Isaiah, and is \"holy\" (AGIOS in the Latin of the scroll) a good translation of the Hebrew word? reply markovs_gun 3 hours agorootparentAgios- direct transliteration from the Greek \"'άγιος\" which is the exact term used in Isaiah 6:3 in the popular Greek translation of the Old Testament, the Septuagint. If not a \"good\" translation, it's certainly an old one, being the word Christians and Jews in that part of the world would have been familiar with in the Book of Isaiah for hundreds of years before this amulet was made. reply vouaobrasil 8 hours agoparentprev> and they famously quarrelled quite a bit about how much of Judaism should be incorporated into the new religion, well documented in the New Testament itself and plenty of extra-biblical evidence. Just wondering what is the \"plenty of extra-biblical evidence\"? reply FearNotDaniel 7 hours agorootparentGood point, I didn’t fact check that part, I probably mixed up hazy memories of some other incidents I read about in the Didache and other early church writings. Wikipedia says there’s no evidence outside of Luke’s and Paul’s own words (Acts and Galatians respectively) and since Luke was hanging out with Paul for a lot of that time (see all the times Acts switches between “he” and “we”) we could be skating on thin ice as far as actual textual evidence goes. Good spot, thanks for calling me out. reply mytailorisrich 8 hours agoparentprevSome of the latin text is on the Wikipedia page [1]. Hopefully it will be updated to include more. [1] https://en.wikipedia.org/wiki/Frankfurt_silver_inscription reply vitus 5 hours agorootparentOne of the references on the wikipedia page seems to have a full transcription (along with German translation): https://archaeologisches-museum-frankfurt.de/index.php/de/?v... I personally cannot make heads or tails of the script used in the various images, but it seems about right. (Note that V and U are generally used interchangeably in Latin, since they were the same character. Same with I / J.) reply HarHarVeryFunny 4 hours agoparentprev> the Jewish tradition of replacing the Name with \"Adonai\" (Hebrew for \"Lord\") or its Greek/Latin equivalent Perhaps, but in this Latin inscription we have Jesus being referred to as \"IHS XP\" - a Greek(!) abbreviation of Jesus Christ, so not avoiding his name altogether. reply markovs_gun 7 hours agoparentprev> I'm not sure if this pre- or post- dates the Jewish tradition of replacing the Name with \"Adonai\" (Hebrew for \"Lord\") or its Greek/Latin equivalent, That taboo already existed even before the New Testament was written. The Septuagint, an early Greek translation of the Old Testament, was written around 260 BC and uses this convention, translating the Lord's name as \"kyrios\"- \"Lord.\" The authors of the New Testament itself extensively quote this translation, and firmly established this convention within Christianity as well, especially because most Christian converts wouldn't know Hebrew or be expected to learn Hebrew to hear (remember that literacy rates were very low in this era compared to now) Jewish scriptures in their own languages. Speaking of literacy, I notice that the Latin of this inscription is very messy. I don't know much Latin myself, but the handwriting is terrible, to the point where I wonder if the maker of this scroll was only semi-literate. reply af78 4 hours agorootparent> I notice that the Latin of this inscription is very messy To a modern eye (like mine), other examples of Roman cursive look hard to read as well: https://en.wikipedia.org/wiki/Roman_cursive reply markovs_gun 3 hours agorootparentThe examples on that page are way cleaner and easier to read than the scroll inscription. The letters in the scroll are not written consistently, and even the size of the letters changes dramatically as the inscription goes on. reply FearNotDaniel 7 hours agorootparentprev> only semi-literate Seems very possible when you consider that this is before the Roman Aristocracy decided to muscle in on the action and take over the church. Many of the original disciples and apostles were semi-literate working class types from the north country (see “nothing good could ever come from Nazareth”) and Paul, the one who wrote the most (but even then likely dictated a lot of it) was a late addition to the team. Sure he recruited a bunch of possibly “middle class” tradesmen and business owners to set up churches in their homes (Priscilla and Aquila, famously) but it was still mostly an underground movement among the slave and worker classes before Constantine decided he could put it to his own use. reply hoseja 8 hours agoparentprevInhumation isn't exclusively christian where did you even come up with that. https://en.wikipedia.org/wiki/%C3%9An%C4%9Btice_culture#Buri... reply FearNotDaniel 8 hours agorootparentDidn’t come up with it, didn’t claim it. Where did you come up with the idea that I said it was exclusive to Christianity? reply yndoendo 14 minutes agorootparentDisposing of the dead via burning or burial was an evolution means to protect your community from epidemics. Ancient generations didn't know about the of details of viruses and bacterium. All they learned through out the years was, _if you remove the dead there is a better chance of the community staying healthy_. Religion latched onto which ever means of disposing of their dead the locals already performed. No different than how religion took over local customs and traditions to help bring in more people into their fold. Communities that didn't properly dispose of their dead would of experience a net-positive when pushed to follow a religious which their funeral tradition helps prevent epidemics. Those people would most likely of uplifted the religion when they though divine intervention reduced their epidemics. In reality, it was as laws of physics reducing the propagation of contagions. Fun fact, disposal via vulture consumption is another good means to contain contagions. Their digestive system is like battery acid and kills mostly everything. Natures evolutionary animal that assists with preventing epidemics. A natural wake. reply ahaferburg 6 hours agorootparentprevYou wrote \"one could infer that this is an indicator of Here Be Christians\". reply noworriesnate 6 hours agorootparentThe local pre-Christian burial custom was burning, but other cultures in far-off places still buried their dead. So while Christianity isn't exclusive in its use of burial, it was supplanting religious customs that did not include burial throughout northern Europe. reply MaxGripe 7 hours agoprev [–] No such thing as „amulet” in Christianity reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [],
    "commentSummary": [
      "A silver amulet discovered in Frankfurt is the oldest evidence of Christianity north of the Alps, dating back to 230-270 CE.",
      "The amulet features a Latin inscription with Christian elements, including a reference to the New Testament and the Trisagion, a liturgical hymn.",
      "This discovery is significant for understanding the early spread and influence of Christianity in the region, highlighting its integration with local traditions."
    ],
    "points": 199,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1734510672
  },
  {
    "id": 42447053,
    "title": "The XOR Texture (2004)",
    "originLink": "https://lodev.org/cgtutor/xortexture.html",
    "originBody": "Lode's Computer Graphics Tutorial The XOR Texture Table of Contents Introduction The XOR Texture Colors AND and OR Conclusion Back to index Introduction The XOR texture is a very easy to generate texture that looks fine. However, it's so overused that it's not a good choice to use in in a demo or intro release. It isn't useful for games either, unless you want some fancy floor tiles. What it's useful for, is for testing a texture mapper you just wrote, in case you want to quickly test out a pattern without having to load an image file or write more complex texture generation code. This is an extremely small article, but the XOR Texture just couldn't be left out in a series of texture generation articles. The XOR Texture The XOR texture is simply generated by xor-ing the x and y coordinate of the current pixel. The '^' operator in C++ is the XOR operator. int main(int argc, char *argv[]) { screen(256, 256, 0, \"The XOR Texture\"); for(int y = 0; y < h; y++) for(int x = 0; x < w; x++) { Uint8 c = x ^ y; pset(x, y, ColorRGB(c, c, c)); } redraw(); sleep(); return 0; } That's it, if you run it, you see the XOR texture: There are 3 things you should keep in mind though: 1) The sizes of the texture should be a power of two, if they aren't, the texture doesn't look as good: 2) Color component values range from 0 to 255. The maximum color value generated by the XOR operation is the same as the dimensions of the texture if its size is a power of two. So if the size of your XOR pattern is smaller than 256, for example only 64, it'll be too dark (image on the left). Multiply the color with 4 to make it bright again (image on the right): 3) On the other hand, if the size is larger than 256, for example 512, you have to make sure the color is limited to a maximum value of 256. You can either modulo divide it through 256, but then it isn't a real XOR pattern anymore. Better is to divide it through 2. In any case, using a XOR texture larger than 256x256 doesn't increase the quality because there aren't enough distinct color values, unless you're using a color mode that allows more bits per channel. But who'd want to generate a 1024x1024 XOR texture anyway. The XOR operator takes the binary values of both integers, and does a binary XOR on every two corresponding bits. XOR or eXclusive OR returns 1 if both bits are different, and returns 0 if both bits are the same: \"Bit a is 1 OR bit 2 is 1, but not both\". In other words, it applies the following truth table to every two corresponding bits: XOR Bit_aBit_bResult 000 011 101 110 This is done on every bit of the integer, creating the many possible resulting values. For example, 5 XOR 13 = 8, because in binary 0101 XOR 1101 = 1000. Colors You can also try the XOR texture with different colors, by using different value for R, G and B. For example: int main(int argc, char *argv[]) { screen(256, 256, 0, \"The XOR Texture\"); ColorRGB color; for(int y = 0; y < h; y++) for(int x = 0; x < w; x++) { Uint8 c = (x ^ y); color.r = 255 - c; color.g = c; color.b = c % 128; pset(x, y, color); } redraw(); sleep(); return 0; } You can even use the xor value as hue for the HSVtoRGB function... int main(int argc, char *argv[]) { screen(256, 256, 0, \"The XOR Texture\"); ColorRGB color; for(int y = 0; y < h; y++) for(int x = 0; x < w; x++) { Uint8 c = (x ^ y); color = HSVtoRGB(ColorHSV(c, 255, 255)); pset(x, y, color); } redraw(); sleep(); return 0; } AND and OR The AND and the OR operator also generate a similar texture. The XOR operator returns 1 if both bits are different: XOR Bit_aBit_bResult 000 011 101 110 The AND operator, only returns 1 if both bits are 1 (bit a AND bit b are true) AND Bit_aBit_bResult 000 010 100 111 The OR operator returns 1 if any or both of the bits are 1 (bit a OR bit b is true) OR Bit_aBit_bResult 000 011 101 111 The AND operator is denoted '&' in C++, and the OR operator '|', replace the '^' operator with those to use the new operators. Here's the result of XOR, AND and OR respectively: It makes sense that the AND texture is darker, because it returns 1 only in a single case. The OR texture is brighter, because it returns 1 very often. The sum of the XOR texture and the AND texture is the OR texture. Conclusion It was shown how easy it is to create a XOR texture, which makes the XOR texture useful to test if a texture renderer is working. However, it's not suitable for applications such as art or games. Here, the XOR pattern was used as a 3D texture (x ^ y ^ z) to test if a planet texture renderer was working correctly: Last edited: 2004 Copyright (c) 2004-2007 by Lode Vandevenne. All rights reserved.",
    "commentLink": "https://news.ycombinator.com/item?id=42447053",
    "commentBody": "The XOR Texture (2004) (lodev.org)198 points by doener 18 hours agohidepastfavorite46 comments 256_ 5 hours agoI once made a small x86 asm program that generated an image with a similar technique, except with 1-bit colour. Instead of x ^ y, it was parity(x ^ y), i.e. if there are an even number of 1 bits, colour it one way, else colour it another. It had an interesting visual effect; it looks like a tiling that almost repeats but not perfectly. Edit: Just looked through some old files and found the program. It was written in fasm in 2019 and generates an XPM2 file (which I had to manually convert to XPM3 to view). Here's the resulting image: https://i.postimg.cc/FsFhXSHG/xortiles.png (I can post the code if anyone wants, though I don't know why you'd care.) reply msarnoff 3 hours agoprevA similar effect, when animated with a function like `color = (y == (x ^ t))` for varying values of t, is called “munching squares.” It was originally written for the PDP-1 in the early sixties. I’ve seen it demonstrated on the Computer History Museum’s PDP-1. I always wondered how the characteristic “XOR texture” could be produced if the PDP-1’s display can only plot points and does not use a bitmapped framebuffer. Turns out it takes advantage of the long persistence of the screen’s phosphor, and the brightness of each point decreases over time. The CHM has a video of it running online, but it does not capture the effect of the phosphor persistence: https://www.computerhistory.org/collections/catalog/10266415... Edit: here’s a video of it running in MAME that somewhat shows how phosphor persistence creates the XOR texture: https://youtu.be/AxJzUiaQ7xM?si=X9K47c4WyD6AisUp reply arcastroe 10 hours agoprevWhen I was in middle school, I had dabbled in coding but only knew how to make simple CLI applications that ran on the terminal. Then one day I stumbled on Lode's Computer Graphics Tutorial and I finally had easy to understand examples of how to open a window and draw some graphics on the screen. That led me to recreating a bunch of retro games (Pacman, Snake, Space Invaders, etc) that would not have been possible on the terminal. I credit this site for really kickstarting my career in software development from a somewhat early age. Big shout out and thank you to Lode. Back then, I practically memorized all the pages and examples in https://lodev.org/cgtutor/, even if some of the math went right over my head at the time reply MortyWaves 14 minutes agoprevIt mentions the other texture generation articles but I can’t find them anywhere. Anyone got the links? reply tashian 17 hours agoprevReminds me of the Hamming distance texture: https://chalkdustmagazine.com/features/the-hidden-harmonies-... reply mithametacs 16 hours agoparentReminds me of glitching the integer circle algorithm: https://nbickford.wordpress.com/2011/04/03/the-minsky-circle... reply Lerc 16 hours agoparentprevIf the Xor texture is Xor(x,y) then the hamming distance would be PopCount(Xor(x,y)) (I think, maybe?) reply Sharlin 12 hours agorootparentYep! reply pixelpoet 16 hours agoparentprevI hadn't heard of this one; great article and website, cheers :) reply grumpymuppet 5 hours agoprevI made a quilt that uses this texture. I used the same rainbow scale that one of the last pictures on the site illustrates, So it looks a lot like this. 6 ft by 6 ft decoration I've got hanging on the wall. reply granularity 3 hours agoparentOooo, link to a photo, please! reply nicknash 14 hours agoprevA fun fact: Each point in the XOR texture is the smallest integer not appearing above it, or to its left (Ducking while posting my own blog: https://nicknash.me/2012/10/26/happy-halloween/) reply zazaulola 11 hours agoprevThere is a website that contains thousands of such examples. https://www.dwitter.net/ Dwitter is like Twitter, but for one-line javascript examples using canvas. Users are limited to 140 bytes in their creations. reply rsiqueira 5 hours agoparentHere is a sample of an animated XOR texture in just 122 characters of JS code: https://www.dwitter.net/d/255 And here are several variations using other binary operators to create the Sierpinski triangle: https://www.dwitter.net/h/sierpinski reply elcaro 9 hours agoprevI wa recently playing with this pattern in J, where it can be expressed like so ~:\"1/~&.#:i.2^8 See it here: https://jsoftware.github.io/j-playground/bin/html2/#base64=b... reply fluoridation 46 minutes agoprevSimilar to this, if you fill the texture with (x & y ? white : black), where x and y are the 0-indexed coordinates of the pixel in question, you get a Sierpinsky triangle. reply Lerc 16 hours agoprevThat's quite a neat site. I recommend going up a level and browsing some of the other pages. Even though it is 20 years old, a lot of that stuff can still find a use somewhere, especially if you do shader work. reply vq 2 hours agoprevMy python+numpy+matplotlib version from when I was playing around with it: import numpy as np import matplotlib.pyplot as plt n = 2048 X, Y = np.mgrid[:n,:n] plt.imshow(X^Y, cmap=plt.cm.Spectral) plt.show() reply fabiensanglard 13 hours agoprevLode's website is how I learned how raytracing worked back in the days. Their website is pure gold. Also, I love the layout even more today. reply mg 10 hours agoprevWhat is the state of JavaScript sandboxing these days? I would like to build a site geared towards this kind of algorithmic art. Where one can paste the JS code snippets and see the resulting image. Similar to my html editor with instant preview: https://github.com/no-gravity/html_editor But with the ability to link to the code. Is it feasible these days to build something like this, but without the ability of the code to jump out of the result frame? Like no external http requests, no fiddling with the window etc? reply AgentME 8 hours agoparentIf you were not worried about preventing external requests and were okay with it being able to make requests as an arbitrary webpage unrelated to your site could if opened, then loading the code in an iframe with the sandbox=\"allow-scripts\" attribute is enough. If you needed tighter sandboxing than that, then I think WebAssembly is your best bet because you can control exactly what APIs are exposed to a WebAssembly module. You could then let users submit WebAssembly modules or let them submit JS that will be run in a JS interpreter running in WebAssembly. I think https://github.com/justjake/quickjs-emscripten or https://github.com/fermyon/StarlingMonkey (used by https://github.com/bytecodealliance/ComponentizeJS) look good for that. reply mg 6 hours agorootparentWow, sandbox=\"allow-scripts\" looks pretty good. Doing some additional research, it seems one can disallow all network requests via Content-Security-Policy directives:document.querySelector('iframe').srcdoc=`Hello document.querySelector('span').innerHTML+=\" world\"; fetch('/'); `; The JS runs, but no network requests are made. I wonder if that solves all headaches regarding the execution of user provided JS code? reply amiga386 5 hours agoparentprevYou could take notes from https://www.shadertoy.com/ and https://www.dwitter.net/ reply anyfoo 16 hours agoprevHeh, I assume you just read https://news.ycombinator.com/item?id=42414817 and stumbled upon XOR textures as well? reply CodeArtisan 7 hours agoprevYou may modify the pattern by simply adding a bitmask pixels[x][y] := (x OP y) BITWISE_AND mask for example, multiply with different bit masks : https://files.catbox.moe/vhfd9x.mp4 reply thesnide 1 hour agoprevI'm wondering what it does if one convert x and y to gray code before the XOR reply 0x69420 13 hours agoprevi frequently generate something resembling this and/or the hamming distance texture in a fairly dumb manual way, by just doing blend mode overlay on progressively smaller checkerboards. it's my go-to for lining up pixel-perfect uv maps for more geometric/mechanical 3d assets -- the recursive nature means you can have an easy time hitting, say, the exact corners or centers of luxels if you feel the need. reply eternityforest 17 hours agoprevNever heard of it, and I haven't seen it in long enough that it's no longer overused! Really cool! reply stevefan1999 17 hours agoprevAlso known as GF(2) texture :) That's why the texture looks cyclic reply jelorian 15 hours agoprevXOR Texture is the cover photo for my LED matrix project. I love the simple beauty of this texture https://github.com/jsheedy/matrix-display reply flohofwoe 7 hours agoprevA simplified use case is to generate a checkerboard texture, just compute (x ^ y) and look at bit zero: color = ((x ^ y) & 1) ? black : white; reply pavlov 7 hours agoparentI wonder if someone has written a GPU shader that can play a game of chess inside a 8x8 checkerboard texture. reply flohofwoe 7 hours agorootparentGoogling finds a shadertoy that's halfway there ;) (knows about chess rules, but can't play on its own): https://www.shadertoy.com/view/wstBz4 reply paulfharrison 11 hours agoprevIf you plot x^y against x+y, you get a Sierpinski triangle. reply cubefox 2 hours agoprevThis looks a bit like a fractal, specifically it reminds me of the Sierpinski triangle, though the XOR texture doesn't seem to be a proper fractal with an associated dimension. However, according to these replies here the XOR texture and the Sierpinski triangle/tetrahedron are indeed mathematically related: https://math.stackexchange.com/questions/1080223/what-do-bit... (Admittedly I don't understand the mathematics behind this connection) reply neontomo 16 hours agoprev> It was shown how easy it is to create a XOR texture, which makes the XOR texture useful to test if a texture renderer is working. > However, it's not suitable for applications such as art or games. uhhh why not suitable for art? I'm digging into it right now and made some trippy stuff! https://xor-pattern.netlify.app/ reply GuB-42 5 hours agoparentIt is a sizecoding/demoscene classic, which is a form of art. Using it as-is tends to be discouraged though, because it is considered unoriginal and lazy for all but the tiniest of intros. Variations on it are fine. reply w_for_wumbo 15 hours agoparentprevThat's a really neat demonstration! Would you mind if I use this code to jump off with my own tangent? (I want to hook the microphone audio into it, to control the patterns based off voice/music) The way the patterns looked, felt natural enough that my brain was trying to make sense of the chaos. reply neontomo 14 minutes agorootparentgo right ahead! i can make a repo for it if you have any trouble copying. PLEASE, for the love of god, send it to me later. I am extremely interested (not just saying that). tomomyrman@proton.me or reply here or, let's collab! reply detay 11 hours agoparentprevasked the same question. i think this is art itself! reply dgfitz 17 hours agoprevI must be missing something simple, where are h and w defined? Does the call to screen imply that somehow? reply AlotOfReading 17 hours agoparentHeight and width of the texture. They're whatever constants you choose. reply andrelaszlo 17 hours agoparentprevhttps://lodev.org/cgtutor/examples.html#screen They're set by screen, exactly! reply sedatk 17 hours agoprev(2004) reply 2shortplanks 11 hours agoprev [–] A lot of this article seems to be conflating two things: 1. The ability for the code to process the error and recover from it 2. The ability to sensibly log, trace, and later for a human to understand the error after the fact The later of these is best handled by using a tracing library systematically throughout your code to spit out open telemetr and “logging” the error within your local span. You can then debug the problem with a tool like honeycomb which’ll give you a much clearer idea of what’s going on. Having tracing in place will also help you debug in cases where you don’t have errors but your system is running slowly, doing something unexpected, etc. This greatly reduces the problem domain you have to solve in actual error handling to just having the computer recover when something is recoverable. And in these situations it turns out that most recoverable errors are best expressed as “non-errors” once they migrate any distance from the origin of the error (e.g. the record not found turns into a standard “user not known” status return value - it’s no longer an error, but an expected behavior of the system!) So for these “short lived” errors that are either handled locally or bubbled up all the way to the top and never handled, I’ve found that Go’s native basic error framework is fine. reply jamessb 9 hours agoparent [–] I think you probably meant to post this on https://news.ycombinator.com/item?id=42447762 reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "XOR textures are generated by applying the XOR operation on the x and y coordinates of a pixel, making them simple to create and useful for testing texture mappers.- While XOR textures are not suitable for demos or games due to their overuse, they can be adjusted using different RGB values or converted from HSV to RGB for varied color effects.- Similar textures can be created using AND and OR operations, with XOR returning 1 if bits differ, AND if both bits are 1, and OR if any bit is 1."
    ],
    "commentSummary": [
      "A user described creating an XOR texture using x86 assembly, resulting in a distinctive visual effect, sparking interest in similar techniques.",
      "The discussion referenced \"munching squares,\" a visual effect from the 1960s PDP-1 computer, highlighting the historical context of such graphics.",
      "Participants exchanged resources and experiences, including Lode's Computer Graphics Tutorial, and explored related topics like Hamming distance textures and glitching algorithms for creative projects."
    ],
    "points": 198,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1734482604
  },
  {
    "id": 42446846,
    "title": "Optimizing Ruby's JSON, Part 1",
    "originLink": "https://byroot.github.io/ruby/json/2024/12/15/optimizing-ruby-json-part-1.html",
    "originBody": "Optimizing Ruby's JSON, Part 1 Dec 15, 2024 I was recently made maintainer of the json gem, and aside from fixing some old bugs, I focused quite a bit on its performance, so that it is now the fastest JSON parser and generator for Ruby on most benchmarks. Contrary to what one might think, there wasn’t any black magic or deep knowledge involved. Most of the performance patches I applied were fairly simple optimizations driven by profiling. As such, I’d like to go over these changes to show how they are quite generic and that many don’t only apply to C code. But before I dive into these, let me explain why I came about working on this in the first place. There Should Be No Need For Alternatives My motivation was never really performance per se. ruby/json was indeed slower than popular alternatives such as oj, but not by that much. To take one benchmark as an example, parsing a JSON document consisting of one hundred tweets or 467kiB would take 1.9ms with json 2.7.2, and 1.6ms with oj. So not that big of a difference. On the generation side, json 2.7.2 would take 0.8ms to generate that document, and oj would take 0.4ms. Twice better, but unlikely to make a significant difference for the vast majority of use cases. In general what’s slow is the layer above the JSON serialization, the one that turns Active Record models into basic Ruby Hashes and Arrays to feed them to the JSON serializer. But the JSON serializer itself is generally negligible. And yet, oj is extremely popular, I highly suspect because of its speed, and is included in the vast majority of projects I know, including Shopify’s codebase, and that annoys me. This may surprise you, given generally when oj is mentioned online, all you can read is praises and how it’s just “free performance”, but my opinion differs very significantly here. Why? Because oj has caused me innumerable headaches over the years, so many I couldn’t list them all here, but I can mention a few. With Monkey Patching Comes Great Responsibility One way oj is frequently used is by monkey patching the json gem via Oj.mimic_JSON or ActiveSupport::JSON via Oj.optimize_rails. The premise of these methods is that they’re supposed to replace less efficient implementations of JSON and do the same thing but faster. For the most part, it holds true, but in some cases, it can go terribly wrong. For instance, one day I had to deal with a security issue caused by Oj.mimic_json. One gem was using JSON.dump(data, script_safe: true), to safely include a JSON document inside a tag: JSON.generate(\"\") # => JSON.generate(\"\", script_safe: true) # =>Except that oj doesn’t know about the script_safe option, and simply ignores it. So the gem was safe when ran alone, but once used in an application that called Oj.mimic_JSON, it would open the door to XSS attacks…: Oj.mimic_JSON JSON.generate(\"\", script_safe: true) # => This isn’t to say monkey patching is wrong in essence, but it should be done with great care, considering how the patched API may evolve in the future and how to safety fallback or at least explictly error when something is amiss. Oj.optimize_rails similarly can cause some very subtle differences in how objects are serialized, e.g. ActiveSupport::JSON::Encoding.time_precision = 0 t = Time.now puts ActiveSupport::JSON.encode(t) # => \"2024-12-16T16:00:51+01:00\" require 'oj' Oj.optimize_rails Oj.mimic_JSON puts ActiveSupport::JSON.encode(t) # => \"2024-12-16T16:00:51.790+01:00\" This one is a bit of a corner case caused by load order, but I had to waste a lot of time fighting with it in the past. And until very recently, it changed the behavior way more than that. Quite Unstable Another big reason I don’t recommend oj is that from my experience of running it at scale, it has been one of the most prominent sources of Ruby crashes for us, only second to grpc. I and my teammates had to submit quite several patches for weird crashes we ran into, which in itself isn’t a red flag, as we did as much for many other native gems, but oj is very actively developed, so we’d often run into new crashes and never felt like the gem was fixed. Writing a native gem isn’t inherently hard, but it does require some substantial understanding of how the Ruby VM works, especially its GC, to not cause crashes or worse, memory corruption. And while working on these patches for Oj, we’ve seen quite a few dirty hacks in the codebase that made us worried about trusting it. Just to give an example (that has been thankfully fixed since), oj used to disable GC in some cases to workaround a bug, which in addition to being worrying, also causes a major GC cycle to be triggered when GC is re-enabled later. This is the sort of code that makes for great results on micro-benchmarks, but tank performance in actual production code. That’s why a couple of years back I decided to remove Oj from Shopify’s monolith, and that’s when I discovered all the subtle differences between Oj.mimic_JSON and the real json. Ground Work So my motivation was to hopefully make ruby/json perform about as well as oj on both real-world and micro-benchmark so that users would no longer feel the need to monkey patch json for speed reasons. If they still feel like they need one of the more advanced oj APIs that’s fine, but Oj.mimic_JSON should no longer feel appealing. So the very first step was to setup a suite of benchmarks, comprising both micro-benchmarks and more meaty, real-world benchmarks. Thankfully, John Hawthorn’s rapidjson-ruby gem had such a benchmark suite, which I stole as a basis with some minor additions. With that, all I needed was a decent C profiler. There are several options, but my favorite is samply, which has the nice property of outputting Firefox Profiler compatible reports that are easy to share. Avoid Redundant Checks I then started profiling the JSON.dump benchmark with the twitter.json payload: Full profile You need to know Ruby internals a bit to understand it all, but almost immediately something that surprised me was 9% of the time spent in JSON’s own isLegalUTF8, and also 1.9% in rb_enc_str_asciionly_p, which is the C API version of String#ascii_only?. The reason this is surprising is that Ruby string have some internal property called a coderange. For most string operations, Ruby does need to known if it’s properly encoded, and for some operations, it can take shortcuts if the string only contains ASCII. Since scanning a string to validate its encoding is somewhat costly, it keeps that property around so a string is only scanned once as long as it’s not mutated. A coderange can be one of 4 values: ENC_CODERANGE_UNKNOWN: the string wasn’t scanned yet. ENC_CODERANGE_VALID: the string encoding is valid. ENC_CODERANGE_7BIT: the string encoding is valid and only contains ASCII characters. ENC_CODERANGE_INVALID: the string encoding is invalid. And some functions like rb_enc_str_asciionly_p are called, what they do is that if the coderange is unknown, they scan the string to compute it. After that, it’s a very cheap integer comparison against ENC_CODERANGE_7BIT. So convert_UTF8_to_JSON_ASCII had this weird thing where it would call rb_enc_str_asciionly_p at the very beginning, but then later it would manually scan the string to see if it contains valid UTF-8, doing redundant work already performed by rb_enc_str_asciionly_p. All this UTF-8 scanning could simply be replaced by a comparison of the string already computed coderange: int ascii_only = rb_enc_str_asciionly_p(string); if (!ascii_only) { if (RB_ENCODING_GET_INLINED(string) != rb_utf8_encindex() || RB_ENC_CODERANGE(string) != RUBY_ENC_CODERANGE_VALID) { rb_raise(rb_path2class(\"JSON::GeneratorError\"), \"source sequence is illegal/malformed utf-8\"); } } Since C extensions code can be a bit cryptic when you’re not familiar with it, the Ruby version of that is simply: unless string.ascii_only? if string.encoding != Encoding::UTF_8 || !string.valid_encoding? raise JSON::GeneratorError, \"source sequence is illegal/malformed utf-8\" end end Here both #ascii_only? and #valid_encoding? rely on the cached coderange, so the string would be scanned at most once, while previously it could be scanned twice. Unfortunately, that optimization didn’t perform as well as I initially expected: == Encoding twitter.json (466906 bytes) ruby 3.4.0rc1 (2024-12-12 master 29caae9991) +YJIT +PRISM [arm64-darwin23] Warming up -------------------------------------- after 105.000 i/100ms Calculating ------------------------------------- after 1.113k (± 0.8%) i/s (898.26 μs/i) - 5.670k in 5.093474s Comparison: before: 1077.3 i/s after: 1113.3 i/s - 1.03x faster Given that isLegalUTF8 was reported as being 9% of the overall runtime, you’d expect that skipping it would speed up the code by 9%, but it’s not that simple. A large part of the time that used to be spent in isLegalUTF8 instead went to convert_UTF8_to_JSON. While I’m not 100% sure, the likely reason is that the larger part of these 9% was spent loading the strings content from RAM into the CPU cache, and not processing it. Since we still go over these bytes later on, they still do the actually costly part of fetching the memory. Still, a 3% improvement was nice to see. Check the Cheaper, More Likely Condition First In parallel to the previous patch, another function I looked at was fbuffer_inc_capa, reported as 5.7% of total runtime. Full profile Looking at the profiler heat map of that function, I noticed that most of the time is spent checking if the buffer was already allocated or not: But this function is called every time we’re trying to write anything to the buffer and after the first call, the buffer is always already allocated. So that’s a lot of wasted effort for a condition that doesn’t match 99% of the time. Also, that condition is a bit redundant with the if (required > fb->capa) one, as if the buffer wasn’t allocated yet, fb->capa would be 0, hence, there’s no point checking it first, we should check it after we establish that the buffer capacity needs to be increased. Another thing to know about modern CPUs is that they’re “superscalar”, meaning they don’t actually perform instruction one by one, but concurrently, and when faced with a branch, they take an educated guess at which branch is more likely to be taken and start executing that one immediately. Based on that, it would be advantageous to instruct the CPU that both the if (required > fb->capa) and the if (!fb->ptr) conditions are very unlikely to match. To do that, compilers have various constructs, but Ruby helpfully exposes a macro to support most compilers with the same syntax: RB_LIKELY and RB_UNLIKELY. Combining all these, led me to rewrite that function as: static inline void fbuffer_inc_capa(FBuffer *fb, unsigned long requested) { if (RB_UNLIKELY(requested > fb->capa - fb->len)) { unsigned long required; if (RB_UNLIKELY(!fb->ptr)) { fb->ptr = ALLOC_N(char, fb->initial_length); fb->capa = fb->initial_length; } for (required = fb->capa; requested > required - fb->len; requiredfb->capa) { REALLOC_N(fb->ptr, char, required); fb->capa = required; } } } With this new version, we first check for the most common case, which is when the buffer still has enough capacity, and we instruct the CPU that it’s the most likely case. Also, the function is now marked as inline, to suggest to the compiler not to go through the cost of calling a function, but to directly embed that logic in the caller. As a result, the vast majority of the time, the work necessary to ensure the buffer is large enough is just a subtraction and a comparison, very much negligible on modern CPUs. That change led to a 15% improvement. == Encoding twitter.json (466906 bytes) ruby 3.4.0rc1 (2024-12-12 master 29caae9991) +YJIT +PRISM [arm64-darwin23] Warming up -------------------------------------- after 121.000 i/100ms Calculating ------------------------------------- after 1.225k (± 0.8%) i/s (816.54 μs/i) - 6.171k in 5.039186s Comparison: before: 1068.6 i/s after: 1224.7 i/s - 1.15x faster And if you think about it, it’s not that specific to C, you can apply the same general idea to Ruby code as well, by checking the cheapest and most likely conditions first. Reducing Setup Cost I also wasn’t alone in optimizing ruby/json, Yusuke Endoh aka Mame, a fellow Ruby committer also had an old open PR with numerous optimizations. Many of these reduced the “setup” cost of generating JSON. What I describe as setup cost, is all the busy work that needs to be done before you can get to do the work you want. In the case of JSON generation, it includes parsing the arguments, allocating the generator and associated structures, etc. ruby/json setup cost was quite higher than the alternative, and it’s because of this it always looked bad on micro-benchmarks. For instance JSON.generate has 3 options to allow to generate “pretty” JSON: >> puts JSON.generate({foo: [1]}, array_nl: \"\", object_nl: \"\", indent: \" \", space: \" \") { \"foo\": [ 1 ] } Before Mame’s changes, the provided strings would be used to precompute delimiters into dedicated buffers. A Ruby equivalent of the code would be: def initialize(opts) @array_delim = \",#{opts[:array_nl]}\" @object_delim = \",#{opts[:object_nl]}\" @object_delim2 = \":#{opts[:space]}\" end The idea makes sense, you precompute some string segments so you can append a single longer segment instead of two smaller ones. But in practice this ended up much slower, both because this precompute doesn’t really save much work, but also because most of the time these options aren’t used. So by essentially reverting this optimization, Mame reduced the setup cost significantly. On larger benchmarks, the difference isn’t big, but on micro-benchmarks, it’s quite massive: == Encoding small hash (65 bytes) ruby 3.4.0rc1 (2024-12-12 master 29caae9991) +YJIT +PRISM [arm64-darwin23] Warming up -------------------------------------- after 308.914k i/100ms Calculating ------------------------------------- after 3.199M (± 1.1%) i/s (312.57 ns/i) - 16.064M in 5.021536s Comparison: before: 2112189.3 i/s after: 3199311.0 i/s - 1.51x faster Avoid Chasing Pointers Another notable optimization in Mame’s pull request was to eliminate one call to rb_enc_get. In many places, JSON needs to check that strings are UTF-8 compatible, and was doing it this way: static int enc_utf8_compatible_p(rb_encoding *enc) { if (enc == rb_usascii_encoding()) return 1; if (enc == rb_utf8_encoding()) return 1; return 0; } // ... if (!enc_utf8_compatible_p(rb_enc_get(obj))) { // try to convert the string } At first sight, this might seem quite straightforward. But rb_enc_get is quite slow. Here’s most of its implementation: int rb_enc_get_index(VALUE obj) { int i = -1; VALUE tmp; if (SPECIAL_CONST_P(obj)) { if (!SYMBOL_P(obj)) return -1; obj = rb_sym2str(obj); } switch (BUILTIN_TYPE(obj)) { case T_STRING: case T_SYMBOL: case T_REGEXP: i = enc_get_index_str(obj); break; case T_FILE: tmp = rb_funcallv(obj, rb_intern(\"internal_encoding\"), 0, 0); if (NIL_P(tmp)) { tmp = rb_funcallv(obj, rb_intern(\"external_encoding\"), 0, 0); } if (is_obj_encoding(tmp)) { i = enc_check_encoding(tmp); } break; case T_DATA: if (is_data_encoding(obj)) { i = enc_check_encoding(obj); } break; default: break; } return i; } rb_encoding* rb_enc_get(VALUE obj) { return rb_enc_from_index(rb_enc_get_index(obj)); } As you can see, it’s a higher-level API implemented in a fairly defensive way, it performs a lot of type checks to ensure it won’t cause a crash and to be able to deal with different types of objects. All these conditionals don’t look like much, but as mentioned before, modern CPUs are very fast at computing things but pay a high price for conditionals unless they’re correctly predicted. Then the thing to know is that conceptually, Ruby strings have a reference to their encoding, e.g.: \"Hello World\".encoding # => Encoding::UTF_8 So conceptually, they have a reference to another object, which naively should be a full-on 64-bit pointer. But since there’s only a (not so) small number of possible encodings, instead of wasting a full 8 bytes to keep that reference, the Ruby VM instead stores a much smaller 7-bit number in a bitmap inside each String, which is called the encoding_index or enc_idx for short. That’s an offer you can use to then look up the actual encoding in a global array inside the virtual machine. In low-level code that’s what we tend to call “pointer chasing” as in we have an address of memory, and go fetch its content from RAM. If that RAM was recently loaded and is already in the CPU cache, it’s relatively fast, but if it isn’t, the CPU has to wait quite a long time for the data to be fetched. If you are mostly working with higher-level languages, that probably doesn’t sound like much, but with low-level programming, fetching memory from RAM is a bit like performing a SQL query for a Rails application, it’s way slower than doing a computation on already fetched data, so similarly, that’s something you try hard not to do in hot spots. In this case, there are several shortcuts json could take. First json already knows it is dealing with a String, as such it doesn’t need to go through all the checks in rb_enc_get_index and can directly use the lower level and much faster RB_ENCODING_GET. Then, since all it cares about is whether the String is encoded in either ASCII or UTF-8, it doesn’t need the real rb_encoding * pointer, and can directly check the returned index, skipping the need to load data from RAM. So here’s how Mame rewrote that code: static int enc_utf8_compatible_p(int enc_idx) { if (enc_idx == usascii_encindex) return 1; if (enc_idx == utf8_encindex) return 1; return 0; } // ... if (!enc_utf8_compatible_p(RB_ENCODING_GET(obj))) { // try to convert the string } Notice how it is now comparing encoding indexes instead of encoding pointers. That very small change improved the twitter.json benchmark by another 8%: == Encoding twitter.json (466906 bytes) ruby 3.4.0rc1 (2024-12-12 master 29caae9991) +YJIT +PRISM [arm64-darwin23] Warming up -------------------------------------- after 126.000 i/100ms Calculating ------------------------------------- after 1.253k (± 1.5%) i/s (797.91 μs/i) - 6.300k in 5.028081s Comparison: before: 1159.6 i/s after: 1253.3 i/s - 1.08x faster Lookup Tables Yet another patch in Mame’s PR was to use one of my favorite performance tricks, what’s called a “lookup table”. Dumping a string into JSON can be quite costly because for each character there are multiple checks to do first to know if the character can simply be copied or if it needs to be escaped. The naive way looks like this (implemented in Ruby for better readability): buffer = +\"\" string.each_char do |char| if char.ord < 0x20 # ASCII control character case char when \"\" buffer << \"\\\" when \"\\r\" buffer << \"\\\\r\" when \"\\t\" buffer << \"\\\\t\" when \"\\f\" buffer << \"\\\\f\" when \"\\b\" buffer << \"\\\\b\" else buffer << \"\\u00#{char.ord}\" end else case char when '\"' buffer << '\\\\\"' when '\\\\' buffer << '\\\\\\\\' else buffer << char end end end As you can see, it’s a lot of conditional, even in the fast path, we need to check for c < 0x20 and then for \" and \\ characters. The idea of lookup tables is that you precompute a static array with that algorithm so that instead of doing multiple comparisons per character, all you do is read a boolean at a dynamic offset. In Ruby that would look like this: JSON_ESCAPE_TABLE = Array.new(256, false) 0x20.times do |i| JSON_ESCAPE_TABLE[i] = true end JSON_ESCAPE_TABLE['\"'] = true JSON_ESCAPE_TABLE['\\\\'] = true buffer = +\"\" string.each_char do |char| if JSON_ESCAPE_TABLE[char] # do the slow thing else buffer << char end end This uses a bit more static memory, but that’s negligible and makes the loop much faster. With this, and based on the assumption that most strings don’t contain any character that needs to be escaped, Mame added a precondition to first cheaply check if we’re on the fast path, and if we are, directly copy the entire string in the buffer all at once, so something like: buffer = +\"\" if string.each_char.none? { |c| JSON_ESCAPE_TABLE[c] } buffer << string else # do the slow char by char escaping end You can see Mame’s patch, it’s a bit more cryptic because in C, but you should be able to see the same pattern as described here, and that alone made a massive 30% gain on the twitter.json benchmark: == Encoding twitter.json (466906 bytes) ruby 3.4.0rc1 (2024-12-12 master 29caae9991) +YJIT +PRISM [arm64-darwin23] Warming up -------------------------------------- after 164.000 i/100ms Calculating ------------------------------------- after 1.630k (± 2.3%) i/s (613.43 μs/i) - 8.200k in 5.032935s Comparison: before: 1258.1 i/s after: 1630.2 i/s - 1.30x faster To Be Continued I have way more optimizations than these ones to talk about, but I feel like it’s already a pretty packed blog post. So I’ll stop here and work on some followup soon, hopefully I won’t lose my motivation to write :). Edit: Looks like I didn’t, part two is here.",
    "commentLink": "https://news.ycombinator.com/item?id=42446846",
    "commentBody": "Optimizing Ruby's JSON, Part 1 (byroot.github.io)196 points by todsacerdoti 10 hours agohidepastfavorite42 comments semiquaver 2 hours agoPart 2 is available: https://byroot.github.io/ruby/json/2024/12/18/optimizing-rub... reply lexicality 1 hour agoprevPossibly I've missed it, but is there anything saying how long the new version takes to parse/encode the Twitter JSON dump with all optimisations applied? reply byroot 34 minutes agoparentThere's quite a few more commits to go before the final result, but you can see it in the release notes: - https://github.com/ruby/json/releases/tag/v2.7.3 - https://github.com/ruby/json/releases/tag/v2.8.0 reply meisel 2 hours agoprevVery fun read! I’m curious though, when it comes to non-Ruby-specific optimizations, like the lookup table for escape characters, why not instead leverage an existing library like simdjson that’s already doing this sort of thing? reply byroot 2 hours agoparentI somewhat answered that in https://news.ycombinator.com/item?id=42450085 In short, since `ruby/json` ships with Ruby, it has to be compatible with its constraints, which today means plain c99, and no c++. There would also probably be a licensing issue with simdjson (Apache 2), but not sure. Overall there's a bunch of really nice c++ libraries I'd love to use, like dragonbox, but just can't. Another thing is that last time I checked, simdjson only provided a parser, the ruby/json gem does both parsing and encoding so it would only help on half the problem space. reply meisel 1 hour agorootparentyyjson is a very fast C89 compliant C parser that can both parse and generate JSON reply hahahacorn 9 hours agoprevGreat read & great work from the author, is there any reason to use Oj going forward? reply byroot 9 hours agoparentAuthor here. Oj has an extremely large API that I have no intent on emulating in the default json gem, things such as \"SAJ\" (SAX style parsing), various escaping schemes etc. My goal is only to make it unnecessary for the 95% or so use case, so yes, Oj will remain useful to some people for a bunch of uses cases. reply onli 4 hours agorootparentSax style parsing is a godsend when dealing with large files, regardless of json or xml. It's indeed what made me switch to a different json library in a Ruby project of mine (I'd have to look it up, but probably to oj). reply mfkp 8 hours agoprevLove the write-up on this topic, very easy to follow and makes me want to benchmark and optimize some of my ruby code now. Thanks for putting in the effort and also writing the post, byroot! reply Lammy 42 minutes agoprevGreat work and great articles. > Yet another patch in Mame’s PR was to use one of my favorite performance tricks, what’s called a “lookup table”. One thing stood out to me here as a fellow lookup-table-liker that I would like to mention even though it is probably not relevant to a generic JSON generator/parser which has to handle arbitrary String Encodings. The example optimized code uses `String#each_char` which incurs an extra object allocation for each iteration compared to `String#each_codepoint` which works with Immediates. If you are parsing/generating something where the Encoding is guaranteed, defining the LUT in terms of codepoints saves a bunch of GC pressure from the throwaway single-character String objects which have to be collected. One of the pieces of example code even uses `#each_char` and then compares its `#ord`, so it's already halfway there. I don't feel like compiling 3.4-master to test it too, but I just verified this in Ruby 3.3.6: irb(main):001> \"あああ\".-@.each_char { p _1.object_id } 4440 4460 4480 => \"あああ\" irb(main):002> \"あああ\".-@.each_codepoint { p _1.object_id } 24709 24709 24709 => \"あああ\" irb(main):003> RUBY_VERSION => \"3.3.6\" Apologies for linking my own hobby codebase, but here are two examples of my own simple LUT parsers/generators where I achieved even more performance by collecting the codepoints and then turning it into a `String` in a single shot with `Array#pack`: - One from my filetype-guessing library that turns Media Type strings into key `Structs` both when parsing the shared-mime-info Type definitions and when taking user input to get the Type object for something like `image/jpeg`: https://github.com/okeeblow/DistorteD/blob/fbb987428ed14d710... (Comment contains some before-and-after allocation comparisons) - One from my support library that turns POSIX Globs into Ruby `Regexp` objects like Python's stdlib `fnmatch.translate`: https://github.com/okeeblow/DistorteD/blob/NEW%E2%80%85SENSA... Disclaimer: I haven't benchmarked this with YJIT which might render my entire experience invalid :) reply byroot 28 minutes agoparent> The example optimized code uses `String#each_char` which incurs an extra object allocation for each iteration You're right. To be closer to the real C code, I should have used `each_byte`, given the C code works with bytes and not codepoints nor characters. But this is mostly meant as pseudo-code to convey the general idea, not as actually efficient code, so not a big deal. reply thiago_fm 8 hours agoprevI love byroot's work. I'm always surpised not only by the kind of contributions he does but the sheer size of how much he does, insane productivity. Wish he would write more often, I've tried to get into ruby-core type of work more than once, but never found something that matched my skills so I could positively contribute and after a few weeks of no results the motivation would wear off, as it's really difficult to have the context he has shared in the article, for example. If more Ruby C people would write more often, I bet there'd be more people with the skills that are needed to improve Ruby further. The C profiler advice was great. Maybe I could just get a Ruby gem with C code and start playing again on optimizations :-) reply benoittgt 7 hours agoparentThere is this great serie of Peter Zhu too. https://blog.peterzhu.ca/ruby-c-ext/ Even if it's C extension, it helps understanding some concepts. But I agree with you. reply thiago_fm 5 hours agorootparentThat's awesome, I personally wasn't aware of that series from Peter Zhu. Thanks! reply wkjagt 5 hours agoparentprev> insane productivity He's insanely productive, but also insanely smart. I used to work in the same office as him at Shopify, and he's the kind of person whose level just seems unattainable. reply richardlblair 3 hours agorootparentFully agree. He's also really patient and kind. He's the type of person who's really really smart and doesn't make you feel really really dumb. He takes the time to thoroughly explain things, without being condescending. I always enjoyed when our paths crossed because I knew I was going to learn something. reply rfl890 4 hours agoprevIIRC the branch predictor hint is useless on modern CPUs reply Someone 39 minutes agoparentIt was useless on modern CPUs, but has become somewhat useful again on some CPUs. https://www.phoronix.com/news/GCC-Clang-Intel-x86-Branch-Hin...: “Starting with the Redwood Cove microarchitecture, if the predictor has no stored information about a branch, the branch has the Intel SSE2 branch taken hint (i.e., instruction prefix 3EH), When the codec decodes the branch, it flips the branch’s prediction from not-taken to taken. It then flushes the pipeline in front of it and steers this pipeline to fetch the taken path of the branch. ... The hint is only used when the predictor does not have stored information about the branch. To avoid code bloat and reducing the instruction fetch bandwidth, don’t add the hint to a branch in hot code—for example, a branch inside a loop with a high iteration count—because the predictor will likely have stored information about that branch. Ideally, the hint should only be added to infrequently executed branches that are mostly taken, but identifying those branches may be difficult. Compilers are advised to add the hints as part of profile-guided optimization, where the one-sided execution path cannot be laid out as a fall-through. The Redwood Cove microarchitecture introduces new performance monitoring events to guide hint placement.” reply bornelsewhere 7 hours agoprevDoes ruby json use intrinsics? Could it? Also, how does this play with the various JITs? reply byroot 7 hours agoparentNot too sure what you mean by intrinsincs. The `json` gem is implemented in C, so it's a black box for YJIT (the reference implementation's JIT). The TruffleRuby JIT used to interpret C extensions with sulong so it could JIT across languages barrier, but AFAIK they recently stopped doing that because of various compatibility issues. Also on TruffleRuby the JSON parser is implemented in C, but the encoder is in pure Ruby [0] [0] https://github.com/ruby/json/blob/e1f6456499d497f33f69ae4c1a... reply bornelsewhere 7 hours agorootparentThanks! Sorry about misuse of “intrinsics”. There is a simdjson library that uses SIMD instructions for speed. Would such an approach be feasible in the ruby json library? reply byroot 6 hours agorootparentAh I see. TL;DR; it's possible, but lots of work, and not that huge of a gain in the context of a Ruby JSON parser. `ruby/json` doesn't use explicit SIMD instructions, some routines are written in a way that somewhat expects compilers to be able to auto-vectorize, but it's never a given. In theory using SIMD would be possible as proven by SIMDjson, but it's very (edit) UNlikely we'll do it because of multiple reasons. First for portability, we have to stick with raw C99, no C++ allowed, so that prevent using SIMDjson outright. In theory, we could implement the same sort of logic with support for various processors that have various level of SIMD support and have runtime dispatch for it would be terribly tedious. So it's not a reasonable amount of complexity for the amount of time I and other people are willing to spend on the library. Then there's the fact that it wouldn't do as big as a difference as you'd think. I do happen to have made some bindings for simdjson in https://github.com/Shopify/heap-profiler, because I had an use case for parsing gigabytes of JSON, and it helps quite a bit there. But I'll hopefully touch on that in a future blog post, the actual JSON parsing part is entirely dwarfed by the work needed to build the resulting Ruby objects tree. reply thiago_fm 5 hours agorootparentCurious about the next post. My naive/clueless mind always wonders if it wouldn't make sense to make a new class of Ruby objects that are much simpler and would yield both less memory consumption and GC optimizations that could be used for such cases. Without a different object model it's hard to imagine optimizations that could greatly improve Ruby execution speed for CRuby, or make the GC much faster (huge issue for big applications), but maybe it's because I don't know much :-) reply izietto 7 hours agoprevFirst, if the author is going to read this, let me thank you for your work. As a Rails developer, I find the premises very relatable. Again, as a Rails developer, a pain point is different naming conventions regarding Ruby hash keys versus JS/JSON object keys. JavaScript/JSON typically uses camelCase, while Ruby uses snake_case. This forces me to perform tedious and often disliked transformations between these conventions in my Rails projects, requiring remapping for every JSON object. This process is both annoying and potentially performance-intensive. What alternative approaches exist, and are there ways to improve the performance of these transformations? reply rajaravivarma_r 7 hours agoparentI don't have a solution for the performance problem. But for the camelCase to snake_case conversion, I can see potential solutions. 1. If you are using axios or other fetch based library, then you can use an interceptor that converts the camelCase JavaScript objects to 'snake_case' for request and vice versa for response. 2. If you want to control that on the app side, then you can use a helper method in ApplicationController, say `json_params`, that returns the JSON object with snake_case keys. Similarly wrap the `render json: json_object` into a helper method like `render_camel_case_json_response` and use that in all the controllers. You can write a custom Rubocop to make this behaviour consistent. 3. Handle the case transformation in a Rack middleware. This way you don't have to enforce developers to use those helper methods. reply thiago_fm 5 hours agorootparentI believe his point is that this transformation could be done maybe in C and therefore have better performance, it could be a flag to the JSON conversion. I find the idea good, maybe it even already exists? reply byroot 5 hours agorootparentIt could be done relatively efficiently in C indeed, but it would be yet another option, imposing et another conditional, and as I mention in the post (and will keep hammering in the followups) conditions is something you want to avoid for performance. IMO that's the sort of conversion that would be better handled by the \"presentation\" layer (as in ActiveModel::Serializers and al). In these gems you usually define something like: class UserSerializerAgain, as a Rails developer, a pain point is different naming conventions regarding Ruby hash keys versus JS/JSON object keys. JavaScript/JSON typically uses camelCase, while Ruby uses snake_case. Most APIs I've come across use snake_case for their keys in JSON requests and responses. I rarely come across camelCase in JSON keys. So I'm happy to just write snake_case keys and let my backend stay simple and easy, and let the API consumer handle any transformations. I use the same approach another comment points out, using Axios transformers to convert back and forth as necessary. reply SkyPuncher 4 hours agoparentprevI love Rails, but if I could go back in time and tell them to avoid one thing it would be their strict adherence to naming conventions. I've spent more time in my career debugging the magic than I would have by simply defining explicit references. reply caseyohara 3 hours agorootparent> if I could go back in time and tell them to avoid one thing it would be their strict adherence to naming conventions Monkey paw curls. Rails probably wouldn’t have reached popularity were it not for the strict adherence to naming conventions. The Rails value prop is productivity and the ethos of “convention over configuration” is what makes that possible. “Convention over configuration” was coined by DHH himself. https://en.wikipedia.org/wiki/Convention_over_configuration Without it, you don’t have Rails. reply jkmcf 3 hours agorootparentprevI'm ok with most of the naming conventions, but the pluralization is one I loathe. The necessity of custom inflections should have been a strong smell, IMO. reply regularfry 2 hours agorootparentSemantically it makes sense. It's not Rails' fault the English language is a terrible serialisation format. reply dmurray 2 hours agorootparentBut it can be Rails' fault for choosing to default to a terrible serialisation format. reply ysavir 2 hours agorootparentWhat would you propose as an alternative? reply BurningFrog 1 hour agoparentprevSounds like something you could fix once and for all with some metaprogramming converting between the two case cases? reply xcskier56 5 hours agoparentprevWe use a gem called olive branch. Yes it’s going to give you a performance hit, but it keeps you sane which is very worthwhile reply izietto 5 hours agorootparentThis one? https://github.com/vigetlabs/olive_branch Looks interesting, unfortunately its latest update is from 3 years ago reply sensanaty 5 hours agorootparentIf you look at the source [1], you'll see what it's doing is very simple (the file I linked is basically the whole library, everything else is Gem-specific things and tests). You can even skip the gem and implement it yourself, not a big dependency at all, so no need for constant maintenance in this case :p [1] https://github.com/vigetlabs/olive_branch/blob/main/lib/oliv... reply werdnapk 5 hours agorootparentprevI don't understand the issue with it not being updated for 3 years. Perhaps it's stable and requires no updates? If the author says it's no longer maintained, then that's something different. reply revskill 5 hours agoparentprevMe too. And even crystal language has the same issue. reply azaras 8 hours agoprev [2 more] [flagged] viraptor 8 hours agoparent [–] New Ruby version comes out around every Christmas. A bunch of related things get talked about too. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "The maintainer of the Ruby json gem has focused on enhancing its performance, aiming to make it the fastest JSON parser and generator for Ruby.- The improvements aim to reduce reliance on alternatives like oj, which, although faster, have issues with monkey patching and instability.- Optimizations include avoiding redundant checks, prioritizing likely conditions, reducing setup costs, and using lookup tables, resulting in up to a 30% increase in speed."
    ],
    "commentSummary": [
      "The article explores performance improvements in Ruby's JSON handling, addressing parsing times and comparisons with other libraries such as simdjson.",
      "It highlights the challenges of optimizing JSON in Ruby, including the use of lookup tables, SIMD (Single Instruction, Multiple Data) instructions, and the constraints of using C99 instead of C++.",
      "The discussion also covers naming conventions in JSON and Ruby, offering suggestions for handling camelCase and snake_case transformations, and is part of a series with further insights available in a subsequent article."
    ],
    "points": 196,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1734480532
  }
]
