[
  {
    "id": 42445037,
    "title": "एफटीसी ने होटल और इवेंट टिकट की कीमतों में छिपे हुए जंक फीस पर प्रतिबंध लगाया",
    "originLink": "https://www.cnbc.com/2024/12/17/ftc-bans-hidden-junk-fees-in-hotel-event-ticket-prices-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42445037",
    "commentBody": "",
    "originSummary": [
      "FTC ने होटल और इवेंट टिकट की कीमतों में छिपे हुए शुल्कों पर प्रतिबंध लगाने वाला एक नियम लागू किया है, जिसमें विक्रेताओं को कुल लागत पहले से ही स्पष्ट करने की आवश्यकता होती है।",
      "यह पहल राष्ट्रपति बाइडेन के व्यापक प्रयास का हिस्सा है, जिसका उद्देश्य उन अनावश्यक शुल्कों को समाप्त करना है जो उपभोक्ता लागत को अनावश्यक रूप से बढ़ाते हैं।",
      "नियम यह अनिवार्य करता है कि सेवा और रिसॉर्ट शुल्क विज्ञापित कीमतों में शामिल किए जाएं, जिससे उपभोक्ताओं का काफी समय बच सकता है, हालांकि यह भविष्य के प्रशासन और कांग्रेस से चुनौतियों का सामना कर सकता है।"
    ],
    "commentSummary": [
      "संघीय व्यापार आयोग (FTC) ने होटल और इवेंट टिकट मूल्य निर्धारण में छिपी हुई अनावश्यक शुल्कों पर प्रतिबंध लगा दिया है, जिससे यह अनिवार्य हो गया है कि सभी शुल्क उपभोक्ताओं को पहले से ही स्पष्ट रूप से बताए जाएं।- इस विनियमन का उद्देश्य मूल्य पारदर्शिता को बढ़ाना और व्यापारियों द्वारा भ्रामक प्रथाओं से उपभोक्ताओं की रक्षा करना है।- इस निर्णय ने निष्पक्ष प्रतिस्पर्धा को बढ़ावा देने और छिपे हुए लागतों के माध्यम से उपभोक्ता शोषण को रोकने के लिए विनियमों की आवश्यकता पर बातचीत शुरू कर दी है।"
    ],
    "points": 490,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1734467767
  },
  {
    "id": 42447071,
    "title": "एर्गो चैट – गो में लिखा गया एक आधुनिक आईआरसी सर्वर",
    "originLink": "https://github.com/ergochat/ergo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447071",
    "commentBody": "",
    "originSummary": [
      "एर्गो, जिसे पहले ओरागोनो के नाम से जाना जाता था, एक आधुनिक इंटरनेट रिले चैट (IRC) सर्वर है जो गो प्रोग्रामिंग भाषा में विकसित किया गया है, और यह सेटअप और उपयोग में आसानी प्रदान करता है।",
      "यह एक IRC डेमन (ircd), सेवाओं के ढांचे, और बाउंसर की विशेषताओं को एकीकृत करता है, IRCv3 के समर्थन के साथ, और एक YAML कॉन्फ़िगरेशन फ़ाइल के माध्यम से अनुकूलन योग्य है।",
      "एर्गो एर्गोनोमैडिक आईआरसी डेमन का एक फोर्क है और इसमें जेरेमी लैट, एडमंड ह्यूबर, डैनियल ओक्स, और शिवराम लिंगमनेनी जैसे डेवलपर्स के योगदान शामिल हैं।"
    ],
    "commentSummary": [
      "एर्गो चैट एक समकालीन आईआरसी (इंटरनेट रिले चैट) सर्वर है जिसे गो में विकसित किया गया है, जो इसकी होस्टिंग में सरलता, न्यूनतम संसाधन उपयोग, और उन्नत विशेषताओं जैसे v3 चैथिस्ट्री और हमेशा चालू मल्टी-क्लाइंट समर्थन के लिए जाना जाता है।",
      "यह अंतर्निर्मित वेबस्केट समर्थन शामिल करता है, जो वेब क्लाइंट की आसान पहुंच को सुविधाजनक बनाता है, और एक आधुनिक चैट अनुभव प्रदान करता है जिसे उपयोगकर्ता IRC के रूप में पहचान नहीं सकते।",
      "चर्चाओं में IRC के खुले प्रोटोकॉल और लचीलापन की तुलना प्लेटफार्म जैसे Discord से की जाती है, और IRC की स्थायी चैट इतिहास की कमी पर बहस होती है, जिसे कुछ लोग अस्थायी वार्तालापों को बनाए रखने के लिए एक विशेषता के रूप में देखते हैं।"
    ],
    "points": 248,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1734482779
  },
  {
    "id": 42448939,
    "title": "चांदी का ताबीज आल्प्स के उत्तर में ईसाई धर्म का सबसे पुराना प्रमाण है।",
    "originLink": "https://archaeologymag.com/2024/12/oldest-evidence-of-christianity-north-of-the-alps/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42448939",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "फ्रैंकफर्ट में खोजा गया एक चांदी का ताबीज अल्प्स के उत्तर में ईसाई धर्म का सबसे पुराना प्रमाण है, जो 230-270 ईस्वी के समय का है।",
      "अमूल्य में लैटिन शिलालेख के साथ ईसाई तत्व शामिल हैं, जिसमें नए नियम और त्रिसागियन, एक धार्मिक भजन का संदर्भ शामिल है।",
      "यह खोज क्षेत्र में ईसाई धर्म के प्रारंभिक प्रसार और प्रभाव को समझने के लिए महत्वपूर्ण है, जो स्थानीय परंपराओं के साथ इसके एकीकरण को उजागर करती है।"
    ],
    "points": 199,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1734510672
  },
  {
    "id": 42447053,
    "title": "एक्सओआर टेक्सचर (2004)",
    "originLink": "https://lodev.org/cgtutor/xortexture.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447053",
    "commentBody": "",
    "originSummary": [
      "XOR बनावटें एक पिक्सेल के x और y निर्देशांक पर XOR ऑपरेशन लागू करके उत्पन्न की जाती हैं, जिससे उन्हें बनाना सरल होता है और बनावट मैपर्स का परीक्षण करने के लिए उपयोगी होता है।- हालांकि, XOR बनावटें डेमो या गेम्स के लिए उपयुक्त नहीं होती हैं क्योंकि उनका अत्यधिक उपयोग होता है, इन्हें विभिन्न RGB मानों का उपयोग करके समायोजित किया जा सकता है या विविध रंग प्रभावों के लिए HSV से RGB में परिवर्तित किया जा सकता है।- समान बनावटें AND और OR ऑपरेशनों का उपयोग करके बनाई जा सकती हैं, जिसमें XOR 1 लौटाता है यदि बिट्स भिन्न होते हैं, AND यदि दोनों बिट्स 1 होते हैं, और OR यदि कोई भी बिट 1 होता है।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने x86 असेंबली का उपयोग करके एक XOR टेक्सचर बनाने का वर्णन किया, जिससे एक विशिष्ट दृश्य प्रभाव उत्पन्न हुआ, और इसी तरह की तकनीकों में रुचि जागृत हुई।",
      "चर्चा में \"मंचिंग स्क्वेयर\" का उल्लेख किया गया, जो 1960 के दशक के PDP-1 कंप्यूटर से एक दृश्य प्रभाव है, जो इस तरह के ग्राफिक्स के ऐतिहासिक संदर्भ को उजागर करता है।",
      "प्रतिभागियों ने संसाधनों और अनुभवों का आदान-प्रदान किया, जिसमें लोड का कंप्यूटर ग्राफिक्स ट्यूटोरियल शामिल था, और रचनात्मक परियोजनाओं के लिए हैमिंग दूरी बनावट और ग्लिचिंग एल्गोरिदम जैसे संबंधित विषयों का अन्वेषण किया।"
    ],
    "points": 198,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1734482604
  },
  {
    "id": 42446846,
    "title": "रूबी के JSON का अनुकूलन, भाग 1",
    "originLink": "https://byroot.github.io/ruby/json/2024/12/15/optimizing-ruby-json-part-1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42446846",
    "commentBody": "",
    "originSummary": [
      "रूबी जेसन जेम के मेंटेनर ने इसके प्रदर्शन को बढ़ाने पर ध्यान केंद्रित किया है, जिसका उद्देश्य इसे रूबी के लिए सबसे तेज़ JSON पार्सर और जनरेटर बनाना है।- सुधारों का उद्देश्य ओजे जैसे विकल्पों पर निर्भरता को कम करना है, जो कि तेज़ होने के बावजूद, मंकी पैचिंग और अस्थिरता के मुद्दों से ग्रस्त हैं।- अनुकूलन में अनावश्यक जांच से बचना, संभावित स्थितियों को प्राथमिकता देना, सेटअप लागत को कम करना, और लुकअप टेबल का उपयोग करना शामिल है, जिससे गति में 30% तक की वृद्धि हुई है।"
    ],
    "commentSummary": [
      "लेख में रूबी की JSON हैंडलिंग में प्रदर्शन सुधार की जांच की गई है, जिसमें पार्सिंग समय और अन्य लाइब्रेरियों जैसे कि simdjson के साथ तुलना की गई है।",
      "यह रूबी में JSON को अनुकूलित करने की चुनौतियों को उजागर करता है, जिसमें लुकअप टेबल्स का उपयोग, SIMD (सिंगल इंस्ट्रक्शन, मल्टीपल डेटा) निर्देश, और C++ के बजाय C99 का उपयोग करने की बाधाएं शामिल हैं।",
      "चर्चा में JSON और रूबी में नामकरण सम्मेलनों को भी शामिल किया गया है, जिसमें camelCase और snake_case रूपांतरणों को संभालने के लिए सुझाव दिए गए हैं, और यह एक श्रृंखला का हिस्सा है जिसमें आगे की अंतर्दृष्टियाँ एक आगामी लेख में उपलब्ध हैं।"
    ],
    "points": 196,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1734480532
  }
]
