[
  {
    "id": 42445037,
    "title": "FTC ஹோட்டல், நிகழ்ச்சி டிக்கெட் விலைகளில் மறைக்கப்பட்ட குப்பை கட்டணங்களை தடை செய்கிறது",
    "originLink": "https://www.cnbc.com/2024/12/17/ftc-bans-hidden-junk-fees-in-hotel-event-ticket-prices-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42445037",
    "commentBody": "",
    "originSummary": [
      "FTC ஹோட்டல் மற்றும் நிகழ்ச்சி டிக்கெட் விலைகளில் மறைக்கப்பட்ட கட்டணங்களைத் தடை செய்யும் விதியை அமல்படுத்தியுள்ளது, விற்பனையாளர்கள் மொத்த செலவுகளை முன்கூட்டியே வெளிப்படுத்த வேண்டும் என்று கோருகிறது.",
      "இந்த முயற்சி, நுகர்வோர் செலவுகளை தேவையற்ற முறையில் அதிகரிக்கும் குப்பை கட்டணங்களை நீக்குவதற்கான ஜனாதிபதி பைடனின் விரிவான முயற்சியின் ஒரு பகுதியாகும்.",
      "TEXT: அந்த விதி, சேவை மற்றும் விடுதி கட்டணங்கள் விளம்பரப்படுத்தப்பட்ட விலைகளில் சேர்க்கப்பட வேண்டும் என்று கட்டாயமாக்குகிறது, இது நுகர்வோருக்கு முக்கியமான நேரத்தை மிச்சப்படுத்தக்கூடும், ஆனால் இது எதிர்கால நிர்வாகங்கள் மற்றும் காங்கிரஸில் இருந்து சவால்களை எதிர்கொள்ளக்கூடும். TEXT:"
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். அமெரிக்க வணிக ஆணையம் (FTC) ஹோட்டல் மற்றும் நிகழ்ச்சி டிக்கெட் விலைகளில் மறைக்கப்பட்ட குப்பை கட்டணங்களை தடை செய்துள்ளது, அனைத்து கட்டணங்களும் நுகர்வோருக்கு முன்கூட்டியே வெளிப்படுத்தப்பட வேண்டும் என்று கட்டாயமாக்கியுள்ளது.- இந்த ஒழுங்குமுறை விலை வெளிப்படைத்தன்மையை மேம்படுத்தவும் வணிகர்களின் தவறான நடைமுறைகளிலிருந்து நுகர்வோரைக் காக்கவும் நோக்கமாகக் கொண்டுள்ளது.- இந்த முடிவு நியாயமான போட்டியை ஊக்குவிக்கவும் மறைக்கப்பட்ட செலவுகளின் மூலம் நுகர்வோர் சுரண்டலைத் தடுக்கவும் ஒழுங்குமுறைகளின் அவசியம் குறித்து உரையாடல்களைத் தொடங்கியுள்ளது."
    ],
    "points": 490,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1734467767
  },
  {
    "id": 42447071,
    "title": "எர்கோ சந்தை – கோ மொழியில் எழுதப்பட்ட ஒரு நவீன IRC சேவையகம்",
    "originLink": "https://github.com/ergochat/ergo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447071",
    "commentBody": "",
    "originSummary": [
      "எர்கோ, முந்தைய பெயர் ஓராகோனோ, ஒரு நவீன இன்டர்நெட் ரிலே சாட் (IRC) சர்வர் ஆகும், இது கோ நிரல்மொழியில் உருவாக்கப்பட்டுள்ளது மற்றும் அமைப்பதற்கும் பயன்படுத்துவதற்கும் எளிமையை வழங்குகிறது.",
      "இது IRC டீமன் (ircd), சேவைகள் கட்டமைப்பு, மற்றும் பவுன்சர் ஆகியவற்றின் அம்சங்களை ஒருங்கிணைக்கிறது, IRCv3 க்கு ஆதரவுடன், மற்றும் ஒரு YAML கட்டமைப்பு கோப்பின் மூலம் தனிப்பயனாக்கக்கூடியது.",
      "Ergo என்பது Ergonomadic IRC டீமனின் ஒரு கிளை ஆகும் மற்றும் ஜெரமி லாட், எட்மண்ட் ஹூபர், டேனியல் ஓக்ஸ் மற்றும் சிவராம் லிங்கம்நேனி போன்ற டெவலப்பர்களின் பங்களிப்புகளை உள்ளடக்கியது."
    ],
    "commentSummary": [
      "Ergo Chat என்பது Go மொழியில் உருவாக்கப்பட்ட ஒரு நவீன IRC (Internet Relay Chat) சர்வர் ஆகும், இது ஹோஸ்டிங் எளிமை, குறைந்த வள பயன்பாடு மற்றும் v3 chathistory மற்றும் எப்போதும் செயல்பாட்டில் இருக்கும் பல கிளையண்ட் ஆதரவு போன்ற மேம்பட்ட அம்சங்களுக்காக அறியப்படுகிறது.",
      "இது உட்பொதிக்கப்பட்ட வெப்சாக்கெட் ஆதரவை உள்ளடக்கியது, எளிதான வலை கிளையண்ட் அணுகலை எளிதாக்குகிறது, மேலும் பயனர்கள் IRC என அடையாளம் காணக்கூடாத ஒரு நவீன அரட்டை அனுபவத்தை வழங்குகிறது.",
      "தமிழில் எழுத வேண்டும். சர்ச்சைகள் IRC இன் திறந்த நெறிமுறை மற்றும் தளங்களான டிஸ்கோர்டுடன் ஒப்பிடுகையில் அதன் நெகிழ்வுத்தன்மையை வலியுறுத்துகின்றன, மேலும் IRC இன் நிலைத்திருக்கும் உரையாடல் வரலாற்றின்欠பாவத்தைப் பற்றிய விவாதம், சிலர் தற்காலிக உரையாடல்களை பராமரிக்க ஒரு அம்சமாகக் காண்கிறார்கள்."
    ],
    "points": 248,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1734482779
  },
  {
    "id": 42448939,
    "title": "வெள்ளி தாயத்து ஆல்ப்ஸ் மலைகளின் வடக்கே கிறிஸ்தவத்தின் பழமையான சான்றாகும்",
    "originLink": "https://archaeologymag.com/2024/12/oldest-evidence-of-christianity-north-of-the-alps/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42448939",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பிராங்க்பர்ட்டில் கண்டுபிடிக்கப்பட்ட ஒரு வெள்ளி தாயத்து, ஆல்ப்ஸ் மலைகளின் வடக்கே கிறிஸ்தவத்தின் பழமையான சான்றாகும், இது கி.பி 230-270 காலத்தைச் சேர்ந்ததாகும்.",
      "தமிழில் எழுத வேண்டும். அமுலெட்டில் கிறிஸ்தவ கூறுகளுடன் லத்தீன் கல்வெட்டு உள்ளது, அதில் புதிய ஏற்பாடு மற்றும் திரிசாகியோன் என்ற ஒரு வழிபாட்டு பாடல் குறித்த குறிப்பும் அடங்கும்.",
      "இந்த கண்டுபிடிப்பு, அந்தப் பகுதியில் கிறிஸ்தவத்தின் ஆரம்ப பரவல் மற்றும் தாக்கத்தைப் புரிந்துகொள்வதற்குப் பெரிதும் முக்கியமானது, இது உள்ளூர் பாரம்பரியங்களுடன் அதன் ஒருங்கிணைப்பை வெளிப்படுத்துகிறது."
    ],
    "points": 199,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1734510672
  },
  {
    "id": 42447053,
    "title": "XOR அமைப்பு (2004)",
    "originLink": "https://lodev.org/cgtutor/xortexture.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447053",
    "commentBody": "",
    "originSummary": [
      "XOR அமைப்புகள் ஒரு பிக்சலின் x மற்றும் y இணைக்கோள்களில் XOR செயல்பாட்டை பயன்படுத்தி உருவாக்கப்படுகின்றன, அவற்றை உருவாக்க எளிதாகவும் அமைப்பு வரைபடங்களை சோதிக்க பயனுள்ளதாகவும் ஆக்குகின்றன.- XOR அமைப்புகள் அவற்றின் அதிகப்படியான பயன்பாட்டினால் டெமோக்கள் அல்லது விளையாட்டுகளுக்கு பொருத்தமற்றவை, ஆனால் அவற்றை மாறுபட்ட நிற விளைவுகளுக்காக வேறு RGB மதிப்புகளைப் பயன்படுத்தி அல்லது HSV இல் இருந்து RGB க்கு மாற்றி சரிசெய்யலாம்.- AND மற்றும் OR செயல்பாடுகளைப் பயன்படுத்தி இதே போன்ற அமைப்புகளை உருவாக்கலாம், XOR பிட்டுகள் மாறுபட்டால் 1 ஐத் திருப்பும், AND இரு பிட்டுகளும் 1 ஆக இருந்தால், மற்றும் OR எந்த பிட்டும் 1 ஆக இருந்தால்."
    ],
    "commentSummary": [
      "ஒரு பயனர் x86 அசெம்ப்ளி பயன்படுத்தி ஒரு XOR அமைப்பை உருவாக்கியதை விவரித்தார், இது தனித்துவமான காட்சித் தாக்கத்தை ஏற்படுத்தியது, இதே போன்ற நுட்பங்களில் ஆர்வத்தை தூண்டியது.",
      "1960களின் PDP-1 கணினியில் இருந்து \"மஞ்சிங் ஸ்கொயர்ஸ்\" என்ற காட்சித் தாக்கத்தை விவாதம் குறிப்பிட்டது, இத்தகைய கிராபிக்ஸின் வரலாற்று சூழலை வெளிப்படுத்துகிறது.",
      "பங்கேற்பாளர்கள் வளங்களையும் அனுபவங்களையும் பரிமாறிக் கொண்டனர், அதில் Lode's Computer Graphics Tutorial உட்பட, மற்றும் தொடர்புடைய தலைப்புகளை ஆராய்ந்தனர், உதாரணமாக ஹாம்மிங் தூரம் அமைப்புகள் மற்றும் படைப்பாற்றல் திட்டங்களுக்கான குளிட்சிங் ஆல்கொரிதம்கள்."
    ],
    "points": 198,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1734482604
  },
  {
    "id": 42446846,
    "title": "ரூபியின் JSON-ஐ மேம்படுத்தல், பகுதி 1",
    "originLink": "https://byroot.github.io/ruby/json/2024/12/15/optimizing-ruby-json-part-1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42446846",
    "commentBody": "",
    "originSummary": [
      "ரூபி json ஜெம் பராமரிப்பாளர் அதன் செயல்திறனை மேம்படுத்துவதில் கவனம் செலுத்தியுள்ளார், ரூபிக்கான அதிவேக JSON பார்சர் மற்றும் ஜெனரேட்டராக அதை உருவாக்குவதை நோக்கமாகக் கொண்டுள்ளார்.- இந்த மேம்பாடுகள், வேகமானவை என்றாலும், மங்கிக்கோடுதல் மற்றும் நிலைத்தன்மையின்மை போன்ற பிரச்சினைகள் உள்ள oj போன்ற மாற்று வழிமுறைகளின் மீது சார்ந்திருப்பதை குறைக்க நோக்கமாகக் கொண்டுள்ளன.- மேம்பாடுகளில், தேவையற்ற சரிபார்ப்புகளை தவிர்ப்பது, சாத்தியமான நிலைகளை முன்னுரிமை அளிப்பது, அமைப்பு செலவுகளை குறைப்பது மற்றும் தேடல் அட்டவணைகளைப் பயன்படுத்துவது ஆகியவை அடங்கும், இதனால் வேகம் 30% வரை அதிகரிக்கிறது."
    ],
    "commentSummary": [
      "கட்டுரை, Ruby இன் JSON கையாளலில் செயல்திறன் மேம்பாடுகளை ஆராய்கிறது, பார்சிங் நேரங்கள் மற்றும் simdjson போன்ற பிற நூலகங்களுடன் ஒப்பீடுகளை குறிப்பிடுகிறது.",
      "தமிழில் எழுத வேண்டும். இது ருபியில் JSON ஐ மேம்படுத்துவதற்கான சவால்களை வெளிப்படுத்துகிறது, இதில் தேடல் அட்டவணைகள், SIMD (ஒற்றை கட்டளை, பல தரவு) கட்டளைகள் மற்றும் C++ இற்கு பதிலாக C99 ஐப் பயன்படுத்துவதற்கான கட்டுப்பாடுகள் ஆகியவை அடங்கும்.",
      "தமிழில் எழுத வேண்டும். இந்த விவாதம் JSON மற்றும் Ruby இல் பெயரிடும் மரபுகளைப் பற்றியும், camelCase மற்றும் snake_case மாற்றங்களை கையாளுவதற்கான பரிந்துரைகளை வழங்குவதையும் உள்ளடக்கியது, மேலும் தொடர்ச்சியான கட்டுரையில் மேலும் உள்ளடக்கங்கள் கிடைக்கின்றன."
    ],
    "points": 196,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1734480532
  }
]
