[
  {
    "id": 42445037,
    "title": "تحظر لجنة التجارة الفيدرالية الرسوم المخفية في أسعار الفنادق وتذاكر الفعاليات",
    "originLink": "https://www.cnbc.com/2024/12/17/ftc-bans-hidden-junk-fees-in-hotel-event-ticket-prices-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42445037",
    "commentBody": "",
    "originSummary": [
      "قامت لجنة التجارة الفيدرالية بتنفيذ قاعدة تحظر الرسوم المخفية في أسعار الفنادق وتذاكر الفعاليات، مما يتطلب من البائعين الكشف عن التكاليف الإجمالية مقدمًا.",
      "تأتي هذه المبادرة كجزء من جهود الرئيس بايدن الأوسع للقضاء على الرسوم الزائدة التي تزيد من تكاليف المستهلكين بشكل غير ضروري.",
      "تنص القاعدة على ضرورة تضمين رسوم الخدمة والمنتجع في الأسعار المعلنة، مما قد يوفر للمستهلكين وقتًا كبيرًا، رغم أنها قد تواجه تحديات من الإدارات المستقبلية والكونغرس."
    ],
    "commentSummary": [
      "حظرت لجنة التجارة الفيدرالية (FTC) الرسوم الخفية في تسعير الفنادق وتذاكر الفعاليات، مما يلزم بالكشف عن جميع الرسوم مقدمًا للمستهلكين. تهدف هذه اللوائح إلى تعزيز شفافية الأسعار وحماية المستهلكين من الممارسات المضللة من قبل التجار. وقد أثار هذا القرار محادثات حول ضرورة وجود لوائح لتعزيز المنافسة العادلة ومنع استغلال المستهلكين من خلال التكاليف المخفية."
    ],
    "points": 490,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1734467767
  },
  {
    "id": 42447071,
    "title": "Ergo Chat – خادم IRC حديث مكتوب بلغة Go",
    "originLink": "https://github.com/ergochat/ergo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447071",
    "commentBody": "",
    "originSummary": [
      "إرغو، المعروف سابقًا باسم أوراغونو، هو خادم دردشة عبر الإنترنت (IRC) حديث تم تطويره بلغة البرمجة Go، ويوفر سهولة في الإعداد والاستخدام.",
      "يتكامل مع ميزات خادم IRC (ircd)، وإطار عمل الخدمات، ووسيط، مع دعم IRCv3، ويمكن تخصيصه من خلال ملف تكوين YAML.",
      "Ergo هو تفرع من خادم Ergonomadic IRC ويشمل مساهمات من مطورين مثل جيريمي لات، إدموند هوبر، دانيال أوكس، وشيفارام لينجامنيني."
    ],
    "commentSummary": [
      "إرغو شات هو خادم IRC (الدردشة عبر الإنترنت) معاصر تم تطويره بلغة Go، ويشتهر ببساطته في الاستضافة، واستخدامه المحدود للموارد، وميزاته المتقدمة مثل سجل الدردشة v3 ودعم متعدد العملاء الدائم.",
      "يتضمن دعمًا مدمجًا للويب سوكيت، مما يسهل الوصول إلى العميل عبر الويب، ويقدم تجربة دردشة حديثة قد لا يتعرف عليها المستخدمون كـ IRC.",
      "تسلط المناقشات الضوء على بروتوكول IRC المفتوح ومرونته مقارنة بمنصات مثل Discord، والنقاش حول افتقار IRC إلى سجل محادثات دائم، والذي يراه البعض كميزة للحفاظ على المحادثات العابرة."
    ],
    "points": 248,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1734482779
  },
  {
    "id": 42448939,
    "title": "التميمة الفضية هي أقدم دليل على المسيحية شمال جبال الألب",
    "originLink": "https://archaeologymag.com/2024/12/oldest-evidence-of-christianity-north-of-the-alps/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42448939",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم اكتشاف تميمة فضية في فرانكفورت تُعد أقدم دليل على المسيحية شمال جبال الألب، وتعود إلى الفترة ما بين 230-270 ميلادي.",
      "تحتوي التميمة على نقش لاتيني بعناصر مسيحية، بما في ذلك إشارة إلى العهد الجديد والتريساجيون، وهو ترنيمة ليتورجية.",
      "هذا الاكتشاف مهم لفهم الانتشار المبكر وتأثير المسيحية في المنطقة، مما يبرز اندماجها مع التقاليد المحلية."
    ],
    "points": 199,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1734510672
  },
  {
    "id": 42447053,
    "title": "نسيج XOR (2004)",
    "originLink": "https://lodev.org/cgtutor/xortexture.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447053",
    "commentBody": "",
    "originSummary": [
      "يتم إنشاء أنسجة XOR عن طريق تطبيق عملية XOR على إحداثيات x و y للبكسل، مما يجعلها سهلة الإنشاء ومفيدة لاختبار أدوات رسم الأنسجة. وعلى الرغم من أن أنسجة XOR ليست مناسبة للعروض التوضيحية أو الألعاب بسبب استخدامها المفرط، إلا أنه يمكن تعديلها باستخدام قيم RGB مختلفة أو تحويلها من HSV إلى RGB للحصول على تأثيرات لونية متنوعة. يمكن إنشاء أنسجة مشابهة باستخدام عمليات AND و OR، حيث تعيد XOR القيمة 1 إذا كانت البتات مختلفة، وAND إذا كانت كلا البتتين 1، وOR إذا كانت أي بتة 1."
    ],
    "commentSummary": [
      "وصف مستخدم إنشاء نسيج XOR باستخدام تجميع x86، مما أدى إلى تأثير بصري مميز، وأثار الاهتمام بتقنيات مماثلة.",
      "أشار النقاش إلى \"مضغ المربعات\"، وهو تأثير بصري من حاسوب PDP-1 في الستينيات، مما يبرز السياق التاريخي لمثل هذه الرسوم البيانية.",
      "تبادل المشاركون الموارد والخبرات، بما في ذلك دليل لود لرسومات الكمبيوتر، واستكشفوا مواضيع ذات صلة مثل نسيج مسافة هامنج وخوارزميات الخلل للمشاريع الإبداعية."
    ],
    "points": 198,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1734482604
  },
  {
    "id": 42446846,
    "title": "تحسين JSON في روبي، الجزء الأول",
    "originLink": "https://byroot.github.io/ruby/json/2024/12/15/optimizing-ruby-json-part-1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42446846",
    "commentBody": "",
    "originSummary": [
      "ركز المسؤول عن صيانة مكتبة json في لغة روبي على تحسين أدائها، بهدف جعلها أسرع محلل ومولد JSON للغة روبي. تهدف التحسينات إلى تقليل الاعتماد على البدائل مثل oj، التي رغم أنها أسرع، إلا أنها تواجه مشاكل مع التعديل الديناميكي وعدم الاستقرار. تشمل التحسينات تجنب الفحوصات الزائدة، وإعطاء الأولوية للظروف المحتملة، وتقليل تكاليف الإعداد، واستخدام جداول البحث، مما يؤدي إلى زيادة في السرعة تصل إلى 30%."
    ],
    "commentSummary": [
      "يستكشف المقال تحسينات الأداء في معالجة JSON بلغة روبي، مع التركيز على أوقات التحليل والمقارنات مع مكتبات أخرى مثل simdjson.",
      "يسلط الضوء على تحديات تحسين JSON في روبي، بما في ذلك استخدام جداول البحث، وتعليمات SIMD (تعليمات واحدة، بيانات متعددة)، والقيود المتعلقة باستخدام C99 بدلاً من C++.",
      "تتناول المناقشة أيضًا قواعد التسمية في JSON وRuby، وتقدم اقتراحات للتعامل مع التحويلات بين camelCase وsnake_case، وهي جزء من سلسلة تحتوي على مزيد من الرؤى المتاحة في مقال لاحق."
    ],
    "points": 196,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1734480532
  }
]
