[
  {
    "id": 42445037,
    "title": "FTC kieltää piilotetut roskamaksut hotellien ja tapahtumalippujen hinnoissa",
    "originLink": "https://www.cnbc.com/2024/12/17/ftc-bans-hidden-junk-fees-in-hotel-event-ticket-prices-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42445037",
    "commentBody": "",
    "originSummary": [
      "FTC on ottanut käyttöön säännön, joka kieltää piilotetut maksut hotellien ja tapahtumalippujen hinnoissa, ja vaatii myyjiä ilmoittamaan kokonaiskustannukset etukäteen.",
      "Tämä aloite on osa presidentti Bidenin laajempaa pyrkimystä poistaa roskamaksut, jotka tarpeettomasti lisäävät kuluttajien kustannuksia.",
      "Yleissääntö edellyttää, että palvelu- ja lomakeskusmaksut sisällytetään mainostettuihin hintoihin, mikä voi säästää kuluttajilta merkittävästi aikaa, vaikka se saattaa kohdata haasteita tulevilta hallinnoilta ja kongressilta."
    ],
    "commentSummary": [
      "Yhdysvaltain liittovaltion kauppakomissio (FTC) on kieltänyt piilotetut lisämaksut hotellien ja tapahtumalippujen hinnoittelussa, vaatien, että kaikki maksut ilmoitetaan etukäteen kuluttajille. Tämä sääntely on tarkoitettu parantamaan hintojen läpinäkyvyyttä ja suojaamaan kuluttajia kauppiaiden harhaanjohtavilta käytännöiltä. Päätös on käynnistänyt keskusteluja sääntelyn tarpeellisuudesta edistää reilua kilpailua ja estää kuluttajien hyväksikäyttö piilotettujen kustannusten kautta."
    ],
    "points": 490,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1734467767
  },
  {
    "id": 42447071,
    "title": "Ergo Chat – Moderni IRC-palvelin, joka on kirjoitettu Go-kielellä",
    "originLink": "https://github.com/ergochat/ergo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447071",
    "commentBody": "",
    "originSummary": [
      "Ergo, aiemmin tunnettu nimellä Oragono, on moderni Internet Relay Chat (IRC) -palvelin, joka on kehitetty Go-ohjelmointikielellä ja tarjoaa helpon asennuksen ja käytön.",
      "Se yhdistää IRC-daemonin (ircd), palvelukehyksen ja bouncerin ominaisuudet, tukee IRCv3:ta ja on muokattavissa YAML-konfiguraatiotiedoston avulla.",
      "Ergo on Ergonomadic IRC -demonin haarukka ja sisältää kehittäjien kuten Jeremy Latt, Edmund Huber, Daniel Oaks ja Shivaram Lingamneni panoksia."
    ],
    "commentSummary": [
      "Ergo Chat on nykyaikainen IRC (Internet Relay Chat) -palvelin, joka on kehitetty Go-kielellä. Se tunnetaan helppokäyttöisyydestään isännöinnissä, vähäisestä resurssien käytöstä ja edistyneistä ominaisuuksista, kuten v3 chathistory ja aina päällä oleva moniasiakastuki.",
      "Se sisältää sisäänrakennetun websocket-tuen, mikä helpottaa verkkoklienttien käyttöä, ja tarjoaa modernin chat-kokemuksen, jota käyttäjät eivät välttämättä tunnista IRC:ksi.",
      "Keskusteluissa korostetaan IRC:n avointa protokollaa ja joustavuutta verrattuna alustoihin kuten Discord, sekä väittelyä IRC:n pysyvän keskusteluhistorian puutteesta, jota jotkut pitävät ominaisuutena hetkellisten keskustelujen ylläpitämiseksi."
    ],
    "points": 248,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1734482779
  },
  {
    "id": 42448939,
    "title": "Hopea-amuletit ovat vanhimmat todisteet kristinuskosta Alppien pohjoispuolella.",
    "originLink": "https://archaeologymag.com/2024/12/oldest-evidence-of-christianity-north-of-the-alps/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42448939",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Frankfurtista löydetty hopea-amuletit on vanhin todiste kristinuskosta Alppien pohjoispuolella, ja se on peräisin vuosilta 230-270 jaa.",
      "Amuletissa on latinankielinen kaiverrus, jossa on kristillisiä elementtejä, mukaan lukien viittaus Uuteen testamenttiin ja Trisagioniin, liturgiseen hymniin.",
      "Tämä löytö on merkittävä kristinuskon varhaisen leviämisen ja vaikutuksen ymmärtämiseksi alueella, korostaen sen integroitumista paikallisiin perinteisiin."
    ],
    "points": 199,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1734510672
  },
  {
    "id": 42447053,
    "title": "XOR-tekstuuri (2004)",
    "originLink": "https://lodev.org/cgtutor/xortexture.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42447053",
    "commentBody": "",
    "originSummary": [
      "XOR-tekstuurit luodaan soveltamalla XOR-operaatiota pikselin x- ja y-koordinaatteihin, mikä tekee niistä yksinkertaisia luoda ja hyödyllisiä tekstuurikartoituksen testaamiseen. Vaikka XOR-tekstuurit eivät sovellu demoihin tai peleihin niiden liiallisen käytön vuoksi, niitä voidaan säätää käyttämällä erilaisia RGB-arvoja tai muuntamalla HSV:stä RGB:ksi vaihtelevien väritehosteiden saavuttamiseksi. Samankaltaisia tekstuureja voidaan luoda käyttämällä AND- ja OR-operaatioita, joissa XOR palauttaa 1, jos bitit eroavat, AND, jos molemmat bitit ovat 1, ja OR, jos mikä tahansa bitti on 1."
    ],
    "commentSummary": [
      "Eräs käyttäjä kuvaili luoneensa XOR-tekstuurin x86-kokoonpanokielellä, mikä johti erottuvaan visuaaliseen efektiin ja herätti kiinnostusta samankaltaisiin tekniikoihin.",
      "Keskustelussa viitattiin \"munching squares\" -ilmiöön, joka oli 1960-luvun PDP-1-tietokoneen visuaalinen efekti, korostaen tällaisten grafiikoiden historiallista kontekstia.",
      "Osallistujat vaihtoivat resursseja ja kokemuksia, mukaan lukien Loden tietokonegrafiikan opas, ja tutkivat aiheeseen liittyviä aiheita, kuten Hamming-etäisyystekstuureja ja glitching-algoritmeja luoviin projekteihin."
    ],
    "points": 198,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1734482604
  },
  {
    "id": 42446846,
    "title": "Rubyn JSONin optimointi, Osa 1",
    "originLink": "https://byroot.github.io/ruby/json/2024/12/15/optimizing-ruby-json-part-1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42446846",
    "commentBody": "",
    "originSummary": [
      "Ruby json -gemmin ylläpitäjä on keskittynyt parantamaan sen suorituskykyä, tavoitteenaan tehdä siitä nopein JSON-jäsennin ja -generaattori Rubylle. Parannukset pyrkivät vähentämään riippuvuutta vaihtoehdoista, kuten oj:sta, joka on nopeampi, mutta jolla on ongelmia monkey patching -menetelmän ja epävakauden kanssa. Optimoinnit sisältävät tarpeettomien tarkistusten välttämisen, todennäköisten ehtojen priorisoinnin, asennuskustannusten vähentämisen ja hakutaulukoiden käytön, mikä johtaa jopa 30 % nopeuden kasvuun."
    ],
    "commentSummary": [
      "Artikkeli tutkii suorituskyvyn parannuksia Rubyn JSON-käsittelyssä, käsitellen jäsennysaikoja ja vertailuja muihin kirjastoihin, kuten simdjsoniin.",
      "Se korostaa JSONin optimoinnin haasteita Rubyssa, mukaan lukien hakutaulukoiden käyttö, SIMD (Single Instruction, Multiple Data) -ohjeet ja C99:n käytön rajoitukset C++:n sijaan.",
      "Keskustelu kattaa myös nimeämiskäytännöt JSON:ssa ja Rubyssa, tarjoten ehdotuksia camelCase- ja snake_case-muunnosten käsittelyyn, ja se on osa sarjaa, jossa on lisäoivalluksia saatavilla seuraavassa artikkelissa."
    ],
    "points": 196,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1734480532
  }
]
