[
  {
    "id": 42865527,
    "title": "OpenAI raivoissaan, DeepSeek saattaa olla varastanut kaikki tiedot, jotka OpenAI varasti meiltä",
    "originLink": "https://www.404media.co/openai-furious-deepseek-might-have-stolen-all-the-data-openai-stole-from-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42865527",
    "commentBody": "",
    "originSummary": [
      "OpenAI, Microsoft ja tekoälyasiantuntija David Sacks väittävät, että DeepSeek käytti epäreilusti OpenAI:n dataa kehittääkseen paremman kielimallin.",
      "Tutkimukset, joita Bloomberg ja Financial Times tekevät, selvittävät, kouluttiko DeepSeek R1-malliaan sopimattomasti OpenAI:n tuotosten avulla, mahdollisesti käyttämällä tekniikkaa nimeltä \"tislauksella\", joka poimii tietoa olemassa olevista malleista.",
      "Tilanne on merkittävä, sillä OpenAI, jota usein kritisoidaan luvattomasta datan käytöstä, on nyt nostamassa esiin huolia muiden vastaavista käytännöistä."
    ],
    "commentSummary": [
      "OpenAI tutkii väitteitä, joiden mukaan DeepSeek on saattanut käyttää tietoja väärin kouluttaakseen R1-malliaan.",
      "Väitteet siitä, että OpenAI olisi \"raivoissaan\", pidetään perusteettomina ja niitä pidetään klikkiotsikoina.",
      "Hacker News korostaa tarkkojen raporttien merkitystä ja vastustaa harhaanjohtavia otsikoita."
    ],
    "points": 1241,
    "commentCount": 6,
    "retryCount": 0,
    "time": 1738162354
  },
  {
    "id": 42862246,
    "title": "Pidän yhä Sublime Textistä",
    "originLink": "https://ohdoylerules.com/workflows/why-i-still-like-sublime-text-in-2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42862246",
    "commentBody": "",
    "originSummary": [
      "Sublime Text on edelleen suosittu valinta vuonna 2025 sen nopeuden, monialustayhteensopivuuden ja ominaisuuksien, kuten Language Server Protocol (LSP), koodinpätkät ja useat kursorit, ansiosta.",
      "Ohjelmistoa pidetään \"valmiina\", mikä tarkoittaa, että se on vakaa ja luotettava, ja uusin päivitys julkaistiin tammikuussa 2025, mikä ylläpitää sen ajankohtaisuutta ja tehokkuutta.",
      "Sublime Text on vaikuttanut merkittävästi nykyaikaisiin editoreihin, ja sen yksinkertaisuus sekä häiriötön ympäristö houkuttelevat yhä käyttäjiä, jotka etsivät nopeaa ja tehokasta koodauskokemusta."
    ],
    "commentSummary": [
      "Sublime Text on suosittu sen nopeuden, yksinkertaisuuden ja kevyen luonteen vuoksi, mikä tekee siitä ihanteellisen nopeisiin muokkauksiin ja pienimuotoisiin koodaustehtäviin. Vaikka jotkut käyttäjät ovat siirtyneet IDE:ihin kuten VS Code tai Zed edistyneempien ominaisuuksien, kuten etäkehityksen ja tekoälyn integroinnin vuoksi, Sublime Text on edelleen suosittu vakauden ja tehokkuuden ansiosta. Työkalua käytetään usein yhdessä ominaisuuksiltaan rikkaampien IDE:iden kanssa, mikä korostaa sen roolia täydentävänä työkaluna kehittäjän työkalupakissa."
    ],
    "points": 807,
    "commentCount": 433,
    "retryCount": 0,
    "time": 1738133023
  },
  {
    "id": 42862118,
    "title": "Science YouTuber physicsgirl (Dianna Cowern) seisoo ensimmäistä kertaa kahteen vuoteen",
    "originLink": "https://www.youtube.com/shorts/2ntx91cOYEc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42862118",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Tiedetubettaja Physics Girl, Dianna Cowern, nousi ensimmäistä kertaa kahteen vuoteen pitkän COVID-taistelun jälkeen, mikä herätti keskusteluja toipumiskokemuksista. Yhteisö jakoi erilaisia hoitoja ja elämäntapamuutoksia, kuten ruokavalion muutoksia, liikuntaa ja lisäravinteita, korostaen henkilökohtaisia toipumismatkoja. Keskusteluissa käsiteltiin myös haasteita riittävän terveydenhuollon saamisessa ja turhautumista, kun terveydenhuollon ammattilaiset vähättelevät tilannetta, mikä loi toivoa ja kannustusta muille samanlaisten terveysongelmien kanssa kamppaileville."
    ],
    "points": 639,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1738131374
  },
  {
    "id": 42866201,
    "title": "Miksi DeepSeekin piti olla avoimen lähdekoodin",
    "originLink": "https://www.getlago.com/blog/deepseek-open-source",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42866201",
    "commentBody": "",
    "originSummary": [
      "DeepSeek, kiinalainen tekoälylaboratorio, on avannut lähdekoodinsa päättelymallilleen R1, joka on verrattavissa OpenAI:n o1:een, rakentaakseen luottamusta länsimarkkinoilla ja vastatakseen kiinalaiseen teknologiaan kohdistuvaan skeptisyyteen, erityisesti tietoturvan osalta. R1:n lähdekoodin avaaminen on myös strateginen siirto innovoida tehokkaasti edistyneiden sirujen vientirajoitusten keskellä, korostaen avoimen lähdekoodin mallien kustannusetua verrattuna omistettuihin, kuten OpenAI:n malleihin. Avoimen lähdekoodin mallit, kuten DeepSeekin R1, tarjoavat muokattavuutta ja alhaisempia kustannuksia, haastavat omistetut mallit, vaikka OpenAI säilyttää johtoasemansa markkinoille ensimmäisenä tulijan edun ja resurssiensa ansiosta."
    ],
    "commentSummary": [
      "DeepSeekin avoimen lähdekoodin tekoälymalli on käynnistänyt keskusteluja tekoälyyn liittyvistä tietokäytännöistä, erityisesti sen jälkeen, kun OpenAI käytti kiistanalaisesti YouTube-dataa.",
      "DeepSeek tarjoaa ilmaisen vaihtoehdon OpenAI:n kalliille malleille, mikä saa käyttäjät siirtymään sen pariin, vaikka sen koko koulutusprosessi pysyy paljastamattomana, mikä herättää kysymyksiä \"avoimen lähdekoodin\" määritelmästä tekoälyssä.",
      "Keskustelu korostaa jatkuvaa jännitettä suljettujen ja avoimen lähdekoodin tekoälymallien välillä, kun DeepSeek haastaa nykyisiä normeja ja tekee tekoälystä helpommin saatavilla, mutta näiden mallien tuleva tasapaino on edelleen epävarma."
    ],
    "points": 446,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1738165051
  },
  {
    "id": 42864854,
    "title": "En halua, että tekoäly \"kiillottaa\" minua",
    "originLink": "https://thebloggess.com/2025/01/28/no-i-do-not-want-ai-to-polish-me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42864854",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kirjoittaja kritisoi tekoälyn kirjoitustyökaluja siitä, että ne tekevät tekstistä liian muodollista ja persoonatonta, verraten niitä epäsuosittuun Microsoft Clippyyn.",
      "Vaikka tekoälytyökalut voivat auttaa ei-äidinkielenään puhujia, on huoli siitä, että ne johtavat tylsään ja yhtenäiseen viestintään, riistäen yksilöllisyyden.",
      "Teknologia-alan AI-ominaisuuksien kehittämistä pidetään markkinavetoisena pikemminkin kuin todellisiin käyttäjätarpeisiin perustuvana, ja käyttäjät suosivat aitoa inhimillistä viestintää."
    ],
    "points": 364,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1738158630
  },
  {
    "id": 42858552,
    "title": "Kysymykset, jotka DeepSeek on sensuroinut",
    "originLink": "https://www.promptfoo.dev/blog/deepseek-censorship/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42858552",
    "commentBody": "",
    "originSummary": [
      "DeepSeek-R1, Kiinasta peräisin oleva avoimen lähdekoodin malli, on tarkastelun kohteena, koska sen epäillään olevan Kiinan kommunistisen puolueen (CCP) sensuurin alainen, ja huolta herättää sen kieltäytymisaste arkaluonteisista aiheista. Mallin testaamiseen käytettiin 1 360 kehotteen tietojoukkoa, ja tulokset osoittivat, että noin 85 % kehotteista, jotka käsittelivät esimerkiksi Taiwanin itsenäisyyttä, sensuroitiin. Kuitenkin jailbreaking-yritykset osoittivat, että sensuurin pystyi helposti kiertämään. Tulevissa arvioinneissa verrataan arkaluonteisten aiheiden käsittelyä kiinalaisten ja amerikkalaisten mallien välillä, mikä korostaa eroja sensuurissa ja sisällön moderoinnissa."
    ],
    "commentSummary": [
      "DeepSeek, kiinalainen tekoälymalli, sensuroi Kiinan hallitukselle arkaluonteisia aiheita, kuten Tiananmenin aukion verilöylyä, poistamalla sisältöä, joka laukaistaan tietyillä avainsanoilla.",
      "DeepSeekin isännöidyt versiot osoittavat enemmän sensuuria verrattuna paikallisiin versioihin, mikä on herättänyt keskusteluja tekoälyn sensuurista ja vertailuja länsimaisiin malleihin, kuten ChatGPT:hen.",
      "Tilanne korostaa laajempaa ongelmaa, jossa tekoälymallit muotoutuvat niiden kehityksen kulttuuristen ja poliittisten kontekstien mukaan."
    ],
    "points": 349,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1738101276
  },
  {
    "id": 42860113,
    "title": "Hyvästi, Slopify",
    "originLink": "https://alexeystar.com/blog/slopify/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860113",
    "commentBody": "",
    "originSummary": [
      "Eräs käyttäjä ilmaisee tyytymättömyytensä Spotifyn Discover Weekly soittolistaan, joka sisältää nyt tekoälyn luomaa musiikkia ja covereita. Käyttäjä kritisoi Spotifyn sovellusta paisuneeksi ja kömpelöksi, mikä johti heidän päätökseensä lopettaa tilaus. Tämä tilanne korostaa kasvavaa huolta tekoälyn luoman sisällön vaikutuksesta musiikin suoratoistopalveluissa ja sen vaikutuksesta käyttäjäkokemukseen sekä oikeiden artistien tukemiseen."
    ],
    "commentSummary": [
      "Spotifyn keskittyminen algoritmipohjaiseen soittolistojen räätälöintiin ja tekoälyn luomaan musiikkiin on johtanut käyttäjien tyytymättömyyteen, mikä on saanut osan käyttäjistä jättämään alustan. Käyttäjät ovat ilmaisseet turhautumisensa ongelmista, kuten virheellisestä metadatasta, ei-toivotuista podcast-mainoksista ja puuttuvista ominaisuuksista, kuten profiilin vaihdosta perhesuunnitelmissa. Tämän seurauksena monet käyttäjät tutkivat vaihtoehtoja, kuten Apple Music, Tidal ja Qobuz, jotka tarjoavat parempaa tukea artisteille ja vähemmän riippuvuutta algoritmeista."
    ],
    "points": 329,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1738111885
  },
  {
    "id": 42863262,
    "title": "Bakteeerit (ja niiden metaboliitit) ja masennus",
    "originLink": "https://www.science.org/content/blog-post/bacteria-and-their-metabolites-and-depression",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42863262",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "On olemassa mahdollinen yhteys bakteerien, niiden metaboliittien ja masennuksen välillä, ja jotkut henkilöt raportoivat mielialan parantumisesta paaston jälkeen, mahdollisesti mikrobiomin muutosten vuoksi.",
      "Keskustelu korostaa ruokavalion muutosten, kuten vehnän ja sokerin poistamisen, vaikutusta mielenterveyteen sekä suolistobakteerien, genetiikan ja elämäntapojen roolia kokonaisvaltaisessa hyvinvoinnissa.",
      "Kasvava kiinnostus kohdistuu suoliston terveyden ja mielialan välisen yhteyden ymmärtämiseen sekä henkilökohtaisen genomiikan tutkimiseen terveydenhallinnan parantamiseksi."
    ],
    "points": 328,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1738144473
  },
  {
    "id": 42858741,
    "title": "DeepSeekin monipäinen latentti huomio ja muut KV-välimuistin temput",
    "originLink": "https://www.pyspur.dev/blog/multi-head-latent-attention-kv-cache-paper-list",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42858741",
    "commentBody": "",
    "originSummary": [
      "Avain-arvo (KV) välimuistit parantavat kielimallien, kuten ChatGPT:n, nopeutta vähentämällä tarpeettomia laskutoimituksia, mikä parantaa päättelyn tehokkuutta.",
      "KV-välimuisti vähentää laskennallista monimutkaisuutta 𝑂(𝑛³):sta 𝑂(𝑛²):een tallentamalla avain ja arvoinformaation jokaiselle tokenille, vaikka se lisääkin muistin käyttöä.",
      "Innovaatiot tokenien valinnassa, pakkauksessa ja arkkitehtuurin uudelleenmuotoiluissa, kuten Multi-head Latent Attention, vastaavat KV-välimuistin muistivaatimuksiin optimoimalla Transformer-pohjaisia malleja."
    ],
    "commentSummary": [
      "DeepSeekin artikkeli monipäälatenttihuomiosta ja KV (Key-Value) välimuistitekniikoista herätti vilkasta keskustelua, tuoden esiin sekä kritiikkiä että arvostusta tekoälyn tuottamalle sisällölle.",
      "Artikkeli, joka on kirjoitettu yhdessä tekoälyn kanssa, pyrki tarjoamaan tiiviin yhteenvedon monimutkaisesta tutkimuksesta, hyödyntäen PySpuria sen visuaalisen vetovoiman ja silmukkatuen vuoksi, sekä ehdotuksia lisäparannuksille.",
      "Keskustelussa korostettiin läpinäkyvyyden merkitystä tekoälyn tuottamassa sisällössä ja tekoälyn potentiaalia parantaa kirjoittamisen tehokkuutta."
    ],
    "points": 278,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1738102296
  },
  {
    "id": 42857293,
    "title": "Parkinson-potilas \"tuntee olevansa parantunut\" uuden adaptiivisen syväaivostimulaatiolaitteen avulla",
    "originLink": "https://www.bbc.com/news/articles/ckgn49r069wo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42857293",
    "commentBody": "",
    "originSummary": [
      "Kevin Hill, Parkinsonin tautia sairastava potilas, kertoo tuntevansa itsensä \"parantuneeksi\" saatuaan uraauurtavan aivoimplantin, joka lähettää sähköisiä signaaleja hänen aivoihinsa ja lievittää merkittävästi hänen oireitaan.",
      "Medtronicin kehittämä mukautuva syväaivostimulaatiojärjestelmä säätää automaattisesti hoitoa aivojen toiminnan perusteella, tarjoten mahdollisia parannuksia potilaiden elämänlaatuun.",
      "Yhdistyneessä kuningaskunnassa Parkinsonin tauti vaikuttaa noin 153 000 ihmiseen, joten tämä innovaatio voisi olla merkittävä, sillä tapausten määrän odotetaan kasvavan."
    ],
    "commentSummary": [
      "Uuden adaptiivisen syvän aivostimulaation (DBS) laitteen kerrotaan lievittävän merkittävästi Parkinsonin oireita, ja yksi potilas väittää tuntevansa itsensä \"parantuneeksi\", vaikka skeptisyyttä esiintyy edelleen. Kriitikot varoittavat, että tällaiset raportit voivat tarjota väärää toivoa, sillä DBS-hoidot eivät ole yleisesti saatavilla tai edullisia, eivätkä ne käsittele kaikkia oireita, kuten dementiaa tai psykoosia. Vaikka DBS:ää on käytetty vuosia ja se näyttää lupaavalta, tarvitaan lisää kliinisiä kokeita sen tehokkuuden vahvistamiseksi, ja on tärkeää huomata, että se ei ole parannuskeino Parkinsonin tautiin."
    ],
    "points": 262,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1738094832
  },
  {
    "id": 42864788,
    "title": "Seagate: 'uudet' kiintolevyt käytetty kymmeniä tuhansia tunteja",
    "originLink": "https://www.tomshardware.com/pc-components/hdds/german-seagate-customers-say-their-new-hard-drives-were-actually-used-resold-hdds-reportedly-used-for-tens-of-thousands-of-hours",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42864788",
    "commentBody": "",
    "originSummary": [
      "Saksalaiset asiakkaat ovat raportoineet ostaneensa \"uusia\" Seagate-kovalevyjä, jotka olivatkin käytettyjä, ja joissakin oli merkittäviä käyttötunteja.",
      "Asia havaittiin Heise.de:n toimesta useiden raporttien jälkeen, jotka koskivat Seagate Exos kiintolevyjä, joita myytiin uusina, mutta joista puuttui tavanomainen viiden vuoden takuu.",
      "Seagate tutkii mahdollista petosta, sillä asemien SMART (Self-Monitoring, Analysis, and Reporting Technology) tilastot on nollattu, ja asiaan liittyy useita jälleenmyyjiä, mukaan lukien Amazon ja Mindfactory."
    ],
    "commentSummary": [
      "Seagate-kiintolevyjen, joita markkinoitiin \"uusina\" Saksassa, havaittiin olleen aiemmin käytössä pitkiä aikoja, ja niiden SMART-tiedot oli nollattu aiemman käytön salaamiseksi. Ongelma näyttää koskevan useita jälleenmyyjiä, mikä viittaa mahdolliseen jakelijan virheeseen tai petolliseen toimintaan. Kuluttajia kehotetaan tarkistamaan levyn käyttö smartctl:n FARM-lokien avulla, vaikka tämä vaatii päivitettyjä ohjelmistoversioita, jotka eivät ole yleisesti saatavilla, mikä herättää huolta kiintolevyjen ostamisesta tietyiltä jälleenmyyjiltä, erityisesti alustoilla kuten Amazon."
    ],
    "points": 231,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1738158123
  },
  {
    "id": 42860128,
    "title": "Discovery Coding",
    "originLink": "https://jimmyhmiller.github.io/discovery-coding",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860128",
    "commentBody": "",
    "originSummary": [
      "Discovery-koodaus on ohjelmointimenetelmä, jossa koodarit kirjoittavat koodia ymmärtääkseen ongelman, samoin kuin discovery-kirjoittamisessa fiktiossa, jossa tarina kehittyy kirjoitusprosessin aikana.",
      "Tämä lähestymistapa saattaa vaikuttaa vähemmän järjestelmälliseltä verrattuna rakenteelliseen suunnitteluun, mutta se voi silti tuottaa perusteellisia ja tehokkaita lopputuotteita keskittymällä järjestelmän rajoitteiden ymmärtämiseen.",
      "Ohjelmointiyhteisöä kannustetaan tunnistamaan ja hyväksymään monimuotoisia lähestymistapoja ohjelmistosuunnitteluun, tunnustaen, että ei ole olemassa yhtä ainoaa oikeaa menetelmää, sillä se on inhimillinen prosessi, joka vaihtelee yksilöiden välillä."
    ],
    "commentSummary": [
      "Discovery-koodaus on menetelmä, jossa ohjelmoijat kirjoittavat koodia tutkiakseen ja ymmärtääkseen ongelmaa sen sijaan, että luottaisivat pelkästään suunnitteludokumentteihin.",
      "Tämä lähestymistapa voi johtaa tarkempiin aika-arvioihin ja ratkaisuihin tarjoamalla käytännön ymmärryksen ongelma-alueesta.",
      "Vaikka se saattaa johtaa keskeneräisten ratkaisujen toimittamiseen, sitä pidetään myös innovaation ja sopeutumiskyvyn edistäjänä, erityisesti dynaamisissa ympäristöissä."
    ],
    "points": 228,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1738112010
  },
  {
    "id": 42860752,
    "title": "Apple ja SpaceX yhdistävät voimansa tukeakseen Starlink-satelliittiverkkoa iPhoneissa",
    "originLink": "https://www.bloomberg.com/news/articles/2025-01-29/apple-and-spacex-link-up-to-support-starlink-satellite-network-on-iphones",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860752",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Apple tekee yhteistyötä T-Mobilen kanssa tukeakseen Starlink-satelliittiverkkoa iPhoneissa, tavoitteenaan parantaa yhteyksiä syrjäisillä alueilla.",
      "Tämä yhteistyö heijastaa laajempaa trendiä, jossa satelliittiteknologiaa integroidaan älypuhelimiin tekoälyn (AI) kehityksen rinnalla.",
      "Jotkut käyttäjät ovat huolissaan Applen yhteistyöstä Elon Muskin kanssa, kun taas toiset pitävät sitä strategisena siirtona palvelutarjonnan parantamiseksi."
    ],
    "points": 225,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1738117342
  },
  {
    "id": 42860240,
    "title": "Kirjastot ja hyvinvointi: Tapaustutkimus New Yorkin julkisesta kirjastosta",
    "originLink": "https://lithub.com/its-official-research-has-found-that-libraries-make-everything-better/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860240",
    "commentBody": "",
    "originSummary": [
      "New Yorkin julkisen kirjaston tutkimus paljastaa, että kirjastot parantavat merkittävästi hyvinvointia ja yhteisöllisyyttä, erityisesti pienituloisilla alueilla. Keskeiset havainnot osoittavat, että 92 % käyttäjistä tuntee olonsa rauhalliseksi vierailun jälkeen, 74 % tuntee olevansa paremmin varustautunut elämään ja 90 % nauttii oppimisesta enemmän. Kirjastot tunnistetaan paikoiksi, jotka edistävät optimismia, empatiaa ja yhteisöllisyyttä, ja ne toimivat voimakkaana vastalääkkeenä nykyajan stressitekijöille."
    ],
    "commentSummary": [
      "Yhdysvaltain kirjastot kokevat muutoksen, kun yliopistojärjestelmät vähentävät fyysisiä kokoelmia ja valitsevat digitaalisen pääsyn fyysisten kirjojen kysynnän vähenemisen vuoksi. Julkiset kirjastot kohtaavat lisähaasteita, sillä ne toimivat usein myös kodittomien suojina, mikä voi vaikuttaa niiden ensisijaiseen rooliin palvella yhteisöä. Näistä ongelmista huolimatta kirjastot jatkavat sopeutumista ottamalla käyttöön moderneja mukavuuksia, kuten maker-tiloja, mikä korostaa jatkuvaa keskustelua perinteisten toimintojen ja muuttuvien yhteiskunnallisten tarpeiden tasapainottamisesta."
    ],
    "points": 222,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1738113068
  },
  {
    "id": 42864595,
    "title": "Puhelimemme tappavat kykymme tuntea itsemme seksikkäiksi (2024)",
    "originLink": "https://catherineshannon.substack.com/p/your-phone-is-why-you-dont-feel-sexy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42864595",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Artikkeli käsittelee sitä, kuinka älypuhelimet voivat vähentää seksikkyyden tunnetta edistämällä jatkuvaa digitaalista uppoutumista, mikä vie huomiota pois tosielämän sosiaalisista vuorovaikutuksista ja spontaaniudesta.",
      "Se väittää, että älypuhelimet edistävät elämäntapaa, joka keskittyy välittömään tyydytykseen, mikä johtaa elinvoimaisuuden ja henkilökohtaisen vastuun vähenemiseen puhelimen käytössä.",
      "Kappale tutkii myös laajempia yhteiskunnallisia kysymyksiä, mukaan lukien teknologian vaikutusta henkilökohtaiseen vastuuseen ja modernin elämän monimutkaisuuksia."
    ],
    "points": 195,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1738156913
  }
]
