[
  {
    "id": 42865527,
    "title": "OpenAI rasande 칬ver att DeepSeek kan ha stulit all data som OpenAI stal fr친n oss",
    "originLink": "https://www.404media.co/openai-furious-deepseek-might-have-stolen-all-the-data-openai-stole-from-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42865527",
    "commentBody": "",
    "originSummary": [
      "OpenAI, Microsoft och AI-experten David Sacks p친st친r att DeepSeek or칛ttvist anv칛nde OpenAIs data f칬r att utveckla en 칬verl칛gsen spr친kmodell.",
      "Unders칬kningar av Bloomberg och Financial Times granskar om DeepSeek otillb칬rligt tr칛nade sin R1-modell med hj칛lp av OpenAI-utdata, eventuellt genom en teknik kallad \"destillation,\" som extraherar kunskap fr친n befintliga modeller.",
      "Situationen 칛r anm칛rkningsv칛rd eftersom OpenAI, som ofta kritiseras f칬r att anv칛nda data utan tillst친nd, nu uttrycker oro 칬ver liknande metoder av andra."
    ],
    "commentSummary": [
      "OpenAI unders칬ker anklagelser om att DeepSeek kan ha anv칛nt data p친 ett otillb칬rligt s칛tt f칬r att tr칛na sin R1-modell.",
      "P친st친enden om att OpenAI 칛r \"rasande\" anses vara ogrundade och ses som klickbete.",
      "Hacker News betonar vikten av korrekt rapportering och avr친der fr친n vilseledande rubriker."
    ],
    "points": 1241,
    "commentCount": 6,
    "retryCount": 0,
    "time": 1738162354
  },
  {
    "id": 42862246,
    "title": "Jag gillar fortfarande Sublime Text",
    "originLink": "https://ohdoylerules.com/workflows/why-i-still-like-sublime-text-in-2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42862246",
    "commentBody": "",
    "originSummary": [
      "Sublime Text f칬rblir ett f칬redraget val 친r 2025 tack vare dess snabbhet, plattformsoberoende kompatibilitet och funktioner som Language Server Protocol (LSP), snippets och flera mark칬rer.",
      "Programvaran anses vara \"f칛rdig\", vilket inneb칛r att den 칛r stabil och p친litlig, med den senaste uppdateringen sl칛ppt i januari 2025, vilket bibeh친ller dess relevans och effektivitet.",
      "Sublime Text har haft en betydande inverkan p친 moderna redigerare, och dess enkelhet och distraktionsfria milj칬 forts칛tter att attrahera anv칛ndare som s칬ker en snabb och effektiv kodningsupplevelse."
    ],
    "commentSummary": [
      "Sublime Text 칛r omtyckt f칬r sin snabbhet, enkelhet och l칛ttviktiga natur, vilket g칬r det idealiskt f칬r snabba redigeringar och sm친skaliga kodningsuppgifter. 츿ven om vissa anv칛ndare har 칬verg친tt till IDE:er som VS Code eller Zed f칬r avancerade funktioner som fj칛rrutveckling och AI-integration, f칬rblir Sublime Text popul칛rt f칬r sin stabilitet och effektivitet. Verktyget anv칛nds ofta tillsammans med mer funktionsrika IDE:er, vilket framh칛ver dess roll som ett komplement칛rt verktyg i en utvecklares verktygsl친da."
    ],
    "points": 807,
    "commentCount": 433,
    "retryCount": 0,
    "time": 1738133023
  },
  {
    "id": 42862118,
    "title": "Vetenskaps-YouTubern physicsgirl (Dianna Cowern) st친r upp f칬r f칬rsta g친ngen p친 2 친r",
    "originLink": "https://www.youtube.com/shorts/2ntx91cOYEc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42862118",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Vetenskaps-YouTubern Physics Girl, Dianna Cowern, stod upp f칬r f칬rsta g친ngen p친 tv친 친r efter att ha k칛mpat mot l친ngtidscovid, vilket v칛ckte diskussioner om 친terh칛mtningserfarenheter. Gemenskapen delade olika behandlingar och livsstilsf칬r칛ndringar, inklusive kostjusteringar, motion och kosttillskott, och belyste personliga 친terh칛mtningsresor. Samtalen tog ocks친 upp utmaningar med att f친 adekvat medicinsk v친rd och frustrationen 칬ver att bli avf칛rdad av v친rdpersonal, vilket skapade hopp och uppmuntran f칬r andra som st친r inf칬r liknande h칛lsoproblem."
    ],
    "points": 639,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1738131374
  },
  {
    "id": 42866201,
    "title": "Varf칬r DeepSeek var tvungen att vara 칬ppen k칛llkod",
    "originLink": "https://www.getlago.com/blog/deepseek-open-source",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42866201",
    "commentBody": "",
    "originSummary": [
      "DeepSeek, ett kinesiskt AI-laboratorium, har gjort sin resonemangsmodell R1 칬ppen k칛llkod, vilket 칛r j칛mf칬rbart med OpenAI:s o1, f칬r att bygga f칬rtroende p친 v칛sterl칛ndska marknader och bem칬ta skepsis mot kinesisk teknik, s칛rskilt n칛r det g칛ller datas칛kerhet. Att g칬ra R1 칬ppen k칛llkod 칛r ocks친 ett strategiskt drag f칬r att effektivt innovera mitt i exportkontroller p친 avancerade chips, vilket framh칛ver kostnadsf칬rdelen med 칬ppen k칛llkod-modeller j칛mf칬rt med propriet칛ra som OpenAI. 칐ppen k칛llkod-modeller, s친som DeepSeeks R1, erbjuder anpassningsbarhet och l칛gre kostnader, vilket utmanar propriet칛ra modeller, 칛ven om OpenAI beh친ller en ledande position tack vare sin f칬rdel som f칬rst p친 marknaden och sina resurser."
    ],
    "commentSummary": [
      "DeepSeeks 칬ppen k칛llkod AI-modell har inlett diskussioner om AI-datapraxis, s칛rskilt efter OpenAIs omstridda anv칛ndning av YouTube-data.",
      "DeepSeek erbjuder ett gratis alternativ till OpenAIs dyra modeller, vilket leder till ett skifte bland anv칛ndare, 칛ven om dess fullst칛ndiga tr칛ningsprocess f칬rblir odokumenterad, vilket ifr친gas칛tter definitionen av \"칬ppen k칛llkod\" inom AI.",
      "Debatten understryker den p친g친ende sp칛nningen mellan propriet칛ra och 칬ppen k칛llkod AI-modeller, d칛r DeepSeek utmanar befintliga normer och g칬r AI mer tillg칛nglig, men den framtida balansen mellan dessa modeller f칬rblir os칛ker."
    ],
    "points": 446,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1738165051
  },
  {
    "id": 42864854,
    "title": "Jag vill inte att AI ska \"polera\" mig",
    "originLink": "https://thebloggess.com/2025/01/28/no-i-do-not-want-ai-to-polish-me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42864854",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "F칬rfattaren kritiserar AI-skrivverktyg f칬r att g칬ra texten alltf칬r formell och opersonlig, och j칛mf칬r dem med den impopul칛ra Microsoft Clippy.",
      "츿ven om AI-verktyg kan hj칛lpa icke-modersm친lstalare, finns det en oro f칬r att de resulterar i intets칛gande och enhetlig kommunikation, vilket tar bort individualitet.",
      "Trycket f칬r AI-funktioner inom teknikindustrin uppfattas som marknadsdrivet snarare 칛n baserat p친 faktiska anv칛ndarbehov, med en preferens f칬r 칛kta m칛nsklig kommunikation."
    ],
    "points": 364,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1738158630
  },
  {
    "id": 42858552,
    "title": "Fr친gor censurerade av DeepSeek",
    "originLink": "https://www.promptfoo.dev/blog/deepseek-censorship/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42858552",
    "commentBody": "",
    "originSummary": [
      "DeepSeek-R1, en 칬ppen k칛llkodsmodell fr친n Kina, granskas f칬r att vara f칬rem친l f칬r censur av Kinas kommunistiska parti (KKP), med oro 칬ver dess v칛gran att hantera k칛nsliga 칛mnen. En dataset med 1 360 uppmaningar anv칛ndes f칬r att testa modellen, vilket avsl칬jade att cirka 85 % av uppmaningarna om 칛mnen som taiwanesisk sj칛lvst칛ndighet censurerades, men f칬rs칬k att kringg친 detta visade att censuren l칛tt kunde 칬vervinnas. Framtida utv칛rderingar kommer att j칛mf칬ra hanteringen av k칛nsliga 칛mnen mellan kinesiska och amerikanska modeller, vilket belyser skillnader i censur och inneh친llsmoderering."
    ],
    "commentSummary": [
      "DeepSeek, en kinesisk AI-modell, censurerar 칛mnen k칛nsliga f칬r den kinesiska regeringen, s친som massakern p친 Himmelska fridens torg, genom att radera inneh친ll som utl칬ses av specifika nyckelord.",
      "Hostade versioner av DeepSeek uppvisar mer censur j칛mf칬rt med lokala versioner, vilket v칛cker diskussioner om AI-censur och j칛mf칬relser med v칛sterl칛ndska modeller som ChatGPT.",
      "Situationen understryker det bredare problemet med att AI-modeller formas av de kulturella och politiska sammanhangen i deras utveckling."
    ],
    "points": 349,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1738101276
  },
  {
    "id": 42860113,
    "title": "Adj칬, Slopify",
    "originLink": "https://alexeystar.com/blog/slopify/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860113",
    "commentBody": "",
    "originSummary": [
      "En anv칛ndare uttrycker missn칬je med Spotifys Discover Weekly-spellista, som nu inkluderar AI-genererad musik och covers. Anv칛ndaren kritiserar Spotifys app f칬r att vara 칬verbelastad och klumpig, vilket leder till deras beslut att avsluta prenumerationen. Denna situation belyser en v칛xande oro 칬ver AI-genererat inneh친ll i musikstr칬mningstj칛nster och dess p친verkan p친 anv칛ndarupplevelsen och st칬det f칬r riktiga artister."
    ],
    "commentSummary": [
      "Spotifys fokus p친 algoritmdriven spellisteanpassning och AI-genererad musik har lett till missn칬je bland anv칛ndare, vilket har f친tt vissa att l칛mna plattformen. Anv칛ndare har uttryckt frustration 칬ver problem som felaktig metadata, o칬nskade podcastreklam och saknade funktioner som profilswitching p친 familjeplaner. Som ett resultat utforskar m친nga anv칛ndare alternativ som Apple Music, Tidal och Qobuz, som erbjuder b칛ttre st칬d f칬r artister och mindre beroende av algoritmer."
    ],
    "points": 329,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1738111885
  },
  {
    "id": 42863262,
    "title": "Bakterier (och deras metaboliter) och depression",
    "originLink": "https://www.science.org/content/blog-post/bacteria-and-their-metabolites-and-depression",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42863262",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Det finns en potentiell koppling mellan bakterier, deras metaboliter och depression, d칛r vissa individer rapporterar f칬rb칛ttringar i hum칬ret efter fasta, m칬jligen p친 grund av f칬r칛ndringar i mikrobiomet.",
      "Diskussionen belyser effekten av kostf칬r칛ndringar, s친som att ta bort vete och socker, p친 mental h칛lsa, samt tarmbakteriernas, genetikens och livsstilens roll i det allm칛nna v칛lbefinnandet.",
      "Det finns ett v칛xande intresse f칬r att f칬rst친 kopplingen mellan tarmh칛lsa och hum칬r, samt att utforska personlig genomik f칬r f칬rb칛ttrad h칛lsov친rd."
    ],
    "points": 328,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1738144473
  },
  {
    "id": 42858741,
    "title": "DeepSeeks multi-head latent attention och andra KV cache-tricks",
    "originLink": "https://www.pyspur.dev/blog/multi-head-latent-attention-kv-cache-paper-list",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42858741",
    "commentBody": "",
    "originSummary": [
      "Nyckel-v칛rde (KV) cacheminnen 칬kar hastigheten hos spr친kmodeller, s친som ChatGPT, genom att minska redundanta ber칛kningar, vilket f칬rb칛ttrar inferenseffektiviteten.",
      "KV-cachning minskar den ber칛kningsm칛ssiga komplexiteten fr친n 洧녝(洧녵췁) till 洧녝(洧녵) genom att lagra nyckel och v칛rdeinformation f칬r varje token, 칛ven om det 칬kar minnesanv칛ndningen.",
      "Innovationer inom tokenval, kompression och arkitektoniska omdesignar, s친som Multi-head Latent Attention, hanterar minneskraven f칬r KV-caching och optimerar Transformer-baserade modeller."
    ],
    "commentSummary": [
      "DeepSeeks artikel om multi-head latent attention och KV (Key-Value) cache-tekniker genererade en livlig diskussion, som lyfte fram b친de kritik och uppskattning f칬r AI-genererat inneh친ll.",
      "Artikeln, som medf칬rfattades med AI, syftade till att erbjuda en kortfattad sammanfattning av komplex forskning, med anv칛ndning av PySpur f칬r dess visuella tilltal och loopst칬d, med f칬rslag p친 ytterligare f칬rb칛ttringar.",
      "Diskussionen betonade vikten av transparens i AI-genererat inneh친ll och potentialen f칬r AI att f칬rb칛ttra skriveffektiviteten."
    ],
    "points": 278,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1738102296
  },
  {
    "id": 42857293,
    "title": "Parkinsonpatient \"k칛nner sig botad\" med ny adaptiv djup hj칛rnstimuleringsenhet",
    "originLink": "https://www.bbc.com/news/articles/ckgn49r069wo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42857293",
    "commentBody": "",
    "originSummary": [
      "Kevin Hill, en Parkinsonpatient, rapporterar att han k칛nner sig \"botad\" efter att ha f친tt ett banbrytande hj칛rnimplantat som skickar elektriska signaler till hans hj칛rna, vilket avsev칛rt lindrar hans symtom.",
      "Det adaptiva djup hj칛rnstimuleringssystemet, utvecklat av Medtronic, justerar automatiskt behandlingen baserat p친 hj칛rnaktivitet, vilket erbjuder potentiella f칬rb칛ttringar i patienters livskvalitet.",
      "Med cirka 153 000 personer i Storbritannien som drabbas av Parkinsons, kan denna innovation ha en betydande inverkan eftersom antalet fall f칬rv칛ntas 칬ka."
    ],
    "commentSummary": [
      "En ny adaptiv deep brain stimulation (DBS)-enhet rapporteras avsev칛rt lindra Parkinsons symtom, med en patient som h칛vdar att de \"k칛nner sig botade\", 칛ven om skepsis kvarst친r. Kritiker varnar f칬r att s친dana rapporter kan ge falska f칬rhoppningar, eftersom DBS-behandlingar inte 칛r universellt tillg칛ngliga eller 칬verkomliga, och de adresserar inte alla symtom som demens eller psykos. 츿ven om DBS har anv칛nts i flera 친r och visar lovande resultat, beh칬vs fler kliniska pr칬vningar f칬r att bekr칛fta dess effektivitet, och det 칛r viktigt att notera att det inte 칛r ett botemedel mot Parkinsons sjukdom."
    ],
    "points": 262,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1738094832
  },
  {
    "id": 42864788,
    "title": "Seagate: 'nya' h친rddiskar anv칛nda i tiotusentals timmar",
    "originLink": "https://www.tomshardware.com/pc-components/hdds/german-seagate-customers-say-their-new-hard-drives-were-actually-used-resold-hdds-reportedly-used-for-tens-of-thousands-of-hours",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42864788",
    "commentBody": "",
    "originSummary": [
      "De tyska kunderna har rapporterat att de k칬pt \"nya\" Seagate-h친rddiskar som faktiskt var begagnade, d칛r vissa visade omfattande anv칛ndningstimmar.",
      "Problemet identifierades av Heise.de efter flera rapporter om Seagate Exos HDD:er, som s친ldes som nya men saknade den standardm칛ssiga fem친rsgarantin.",
      "Seagate utreder potentiellt bedr칛geri, eftersom h친rddiskarnas SMART (Self-Monitoring, Analysis, and Reporting Technology) statistik har 친terst칛llts, och problemet involverar flera 친terf칬rs칛ljare, inklusive Amazon och Mindfactory."
    ],
    "commentSummary": [
      "Seagate-h친rddiskar som marknadsf칬rs som \"nya\" i Tyskland har uppt칛ckts ha anv칛nts under l칛ngre perioder tidigare, med deras SMART-data 친terst칛llda f칬r att d칬lja tidigare anv칛ndning. Problemet verkar involvera flera 친terf칬rs칛ljare, vilket indikerar ett potentiellt distribut칬rsfel eller bedr칛glig aktivitet. Konsumenter rekommenderas att verifiera h친rddiskens anv칛ndning med hj칛lp av smartctl:s FARM-loggar, 칛ven om detta kr칛ver uppdaterade mjukvaruversioner som inte 칛r allm칛nt tillg칛ngliga, vilket v칛cker oro 칬ver att k칬pa h친rddiskar fr친n vissa 친terf칬rs칛ljare, s칛rskilt p친 plattformar som Amazon."
    ],
    "points": 231,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1738158123
  },
  {
    "id": 42860128,
    "title": "Uppt칛cktskodning",
    "originLink": "https://jimmyhmiller.github.io/discovery-coding",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860128",
    "commentBody": "",
    "originSummary": [
      "Discovery Coding 칛r en programmeringsmetod d칛r kodare skriver kod f칬r att f칬rst친 ett problem, liknande discovery writing inom sk칬nlitteratur, d칛r ber칛ttelsen utvecklas under skrivprocessen.",
      "Denna metod kan verka mindre organiserad j칛mf칬rt med strukturerad planering men kan 칛nd친 ge rigor칬sa och effektiva slutprodukter genom att fokusera p친 att f칬rst친 systembegr칛nsningar.",
      "Programmeringsgemenskapen uppmuntras att erk칛nna och acceptera olika tillv칛gag친ngss칛tt f칬r mjukvarudesign, med insikten att det inte finns n친gon enda korrekt metod, eftersom det 칛r en m칛nsklig process som varierar mellan individer."
    ],
    "commentSummary": [
      "Uppt칛ckande kodning 칛r en metod d칛r programmerare skriver kod f칬r att utforska och f칬rst친 ett problem, snarare 칛n att enbart f칬rlita sig p친 designdokument.",
      "Denna metod kan leda till mer exakta tidsuppskattningar och l칬sningar genom att ge en praktisk f칬rst친else av problemomr친det.",
      "츿ven om det kan resultera i att ofullst칛ndiga l칬sningar skickas, ses det ocks친 som att fr칛mja innovation och anpassningsf칬rm친ga, s칛rskilt i dynamiska milj칬er."
    ],
    "points": 228,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1738112010
  },
  {
    "id": 42860752,
    "title": "Apple och SpaceX samarbetar f칬r att st칬dja Starlink-satellitn칛tverket p친 iPhones",
    "originLink": "https://www.bloomberg.com/news/articles/2025-01-29/apple-and-spacex-link-up-to-support-starlink-satellite-network-on-iphones",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860752",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Apple samarbetar med T-Mobile f칬r att st칬dja Starlink-satellitn칛tverket p친 iPhones, med m친let att f칬rb칛ttra anslutningen i avl칛gsna omr친den.",
      "Denna samverkan speglar en bredare trend av att integrera satellitteknik i smartphones, tillsammans med framsteg inom artificiell intelligens (AI).",
      "Vissa anv칛ndare 칛r oroade 칬ver Apples koppling till Elon Musk, medan andra ser det som ett strategiskt drag f칬r att f칬rb칛ttra tj칛nsteutbudet."
    ],
    "points": 225,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1738117342
  },
  {
    "id": 42860240,
    "title": "Bibliotek och v칛lbefinnande: En fallstudie fr친n New York Public Library",
    "originLink": "https://lithub.com/its-official-research-has-found-that-libraries-make-everything-better/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42860240",
    "commentBody": "",
    "originSummary": [
      "En studie av New York Public Library avsl칬jar att bibliotek avsev칛rt f칬rb칛ttrar v칛lbefinnande och gemenskap, s칛rskilt i omr친den med l칛gre inkomster. Viktiga resultat visar att 92% av anv칛ndarna k칛nner sig lugna efter ett bes칬k, 74% k칛nner sig b칛ttre rustade att hantera livet, och 90% tycker om att l칛ra sig mer. Bibliotek identifieras som platser som fr칛mjar optimism, empati och gemenskap, och fungerar som ett kraftfullt motgift mot moderna stressfaktorer."
    ],
    "commentSummary": [
      "Bibliotek i USA upplever en f칬r칛ndring n칛r universitetssystemen minskar sina fysiska samlingar och v칛ljer digital tillg친ng p친 grund av minskad efterfr친gan p친 fysiska b칬cker. Offentliga bibliotek st친r inf칬r ytterligare utmaningar, ofta genom att fungera som h칛rb칛rgen f칬r heml칬sa, vilket kan p친verka deras prim칛ra roll att tj칛na samh칛llet. Trots dessa problem forts칛tter biblioteken att anpassa sig genom att inf칬rliva moderna bekv칛mligheter som makerspaces, vilket belyser den p친g친ende debatten om att balansera traditionella funktioner med f칬r칛ndrade samh칛llsbehov."
    ],
    "points": 222,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1738113068
  },
  {
    "id": 42864595,
    "title": "V친ra telefoner d칬dar v친r f칬rm친ga att k칛nna oss sexiga (2024)",
    "originLink": "https://catherineshannon.substack.com/p/your-phone-is-why-you-dont-feel-sexy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42864595",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Artikeln diskuterar hur smartphones kan minska v친r k칛nsla av sexighet genom att fr칛mja st칛ndig digital f칬rdjupning, vilket avleder fr친n verkliga sociala interaktioner och spontanitet.",
      "Den h칛vdar att smartphones fr칛mjar en livsstil inriktad p친 omedelbar tillfredsst칛llelse, vilket leder till en minskning av livfullhet och personligt ansvar f칬r telefonanv칛ndning.",
      "Stycket utforskar ocks친 bredare samh칛llsfr친gor, inklusive teknikens p친verkan p친 personligt ansvar och komplexiteten i det moderna livet."
    ],
    "points": 195,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1738156913
  }
]
