[
  {
    "id": 42232040,
    "title": "RFC 35140: HTTP لا تطعن (2023)",
    "originLink": "https://www.5snb.club/posts/2023/do-not-stab/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42232040",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ينتقد RFC 35140 بشكل فكاهي إلغاء استخدام ترويسة HTTP \"عدم الطعن\"، التي تم التخلي عنها بعد أن أثرت الإعدادات الافتراضية لأحد المتصفحات سلبًا على صناعة الطعن الخيالية.",
      "يُسخر تقديم عنوان \"التحكم في الاعتداء العام\"، الذي يتطلب الانسحاب الصريح، من آليات موافقة المستخدم وتحويل المسؤولية من المؤسسات إلى الأفراد.",
      "يتناول السخرية قضايا مجتمعية أوسع، بما في ذلك الخصوصية، وتتبع البيانات، وصعوبات فرض اللوائح ضد المصالح التجارية."
    ],
    "points": 738,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1732495383
  },
  {
    "id": 42230103,
    "title": "ستارلينك مباشر إلى الخلية",
    "originLink": "https://www.starlink.com/business/direct-to-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230103",
    "commentBody": "",
    "originSummary": [
      "ستارلينك دايركت تو سيل هو خدمة جديدة من سبيس إكس تقدم الوصول العالمي للنصوص والصوت والبيانات لهواتف LTE، مما يضمن الاتصال على اليابسة والبحيرات والمياه الساحلية.",
      "ستبدأ الخدمة بخدمات النصوص في عام 2024، تليها دعم الصوت والبيانات وإنترنت الأشياء (IoT) في عام 2025، دون الحاجة إلى تغييرات في الأجهزة أو تطبيقات خاصة.",
      "يبرز هذا التطور توسع شركة سبيس إكس في مجال الاتصالات، مما يوفر اتصالاً سلسًا دون الحاجة إلى معدات إضافية."
    ],
    "commentSummary": [
      "يضع التكامل الرأسي والإطلاقات ذات التكلفة الفعالة لشركة ستارلينك في موقع قوة رائدة في صناعة الإنترنت عبر الأقمار الصناعية، حيث تواجه منافسة قليلة.",
      "بينما يرى البعض أن هيمنة ستارلينك احتكارية، يعتقد آخرون أن الابتكار والدعم العسكري الأجنبي قد يعززان المنافسة في المستقبل.",
      "التكلفة العالية لإطلاق الأقمار الصناعية تشكل عقبة رئيسية، لكن التقدم في تكنولوجيا الصواريخ القابلة لإعادة الاستخدام يمكن أن يغير المشهد التنافسي."
    ],
    "points": 649,
    "commentCount": 714,
    "retryCount": 0,
    "time": 1732478914
  },
  {
    "id": 42230392,
    "title": "يستضاف هذا الموقع على بلوسكاي",
    "originLink": "https://danielmangum.com/posts/this-website-is-hosted-on-bluesky/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230392",
    "commentBody": "",
    "originSummary": [
      "يدعم بروتوكول AT، المستخدم من قبل Bluesky، الاستضافة عبر خوادم البيانات الشخصية (PDS)، مما يبرز مرونته بما يتجاوز الاستخدامات المقصودة. يتم تنظيم المحتوى على Bluesky في سجلات وكتل بيانات، حيث تكون الكتل بيانات أكبر مثل الوسائط، والتي يجب تحميلها قبل الإشارة إليها في السجلات. تتيح قابلية تمديد البروتوكول تطبيقات إبداعية، مثل استضافة المواقع الإلكترونية، مما قد يؤدي إلى استخدامات جديدة في المستقبل."
    ],
    "commentSummary": [
      "بدأ الموقع المستضاف على Bluesky مناقشات حول استخداماته المحتملة، بما في ذلك استضافة خلاصات RSS وتخزين بيانات مثل DOOM WADs، بالإضافة إلى مخاوف بشأن مراقبة المحتوى والقضايا القانونية.",
      "تُجرى مقارنات مع منصات سابقة مثل MySpace، مما يبرز الطبيعة العامة لبروتوكول AT وإمكانياته لتخزين البيانات بشكل لامركزي.",
      "ينقسم المستخدمون، حيث يشكك البعض في قدرات بلوسكاي على الإشراف، بينما يرى آخرون أنها منصة جديدة واعدة."
    ],
    "points": 636,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1732481013
  },
  {
    "id": 42233524,
    "title": "كيف أقوم بتكوين هويات Git الخاصة بي",
    "originLink": "https://www.benji.dog/articles/git-config/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42233524",
    "commentBody": "",
    "originSummary": [
      "يتناول المنشور كيفية تكوين هويات Git باستخدام `includeIf` لتكوينات شرطية، مما يسمح بإعدادات مختلفة بناءً على مسارات الدليل أو عناوين URL البعيدة.",
      "يشارك المؤلف طريقة لإدارة هويات Git متعددة ومفاتيح SSH باستخدام قيم `Host` مختلفة في `~/.ssh/config` وتعديل تكوينات Git باستخدام `insteadOf`.",
      "تسلط المشاركة الضوء على نهج جديد يستخدم `hasconfig:remote.*.url:!` لتكوينات Git الشرطية بناءً على عناوين URL البعيدة، مما يعزز المرونة في إدارة هويات Git."
    ],
    "commentSummary": [
      "تسمح توجيهات `includeIf` في إعدادات Git بالتطبيق التلقائي لإعدادات مختلفة بناءً على عنوان URL للمستودع، مما يسهل إدارة الهوية.",
      "تُمكّن هذه الطريقة المستخدمين من تعيين تفاصيل مستخدم محددة ومفاتيح SSH للمستودعات المتعلقة بالعمل، مما يسهل التبديل السلس بين المشاريع الشخصية ومشاريع العمل.",
      "يمكن تعزيز الأمن والخصوصية بشكل أكبر من خلال استخدام أجهزة أو حسابات مستخدم منفصلة للمشاريع العملية والشخصية."
    ],
    "points": 387,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1732512753
  },
  {
    "id": 42232000,
    "title": "SQLiteStudio: إنشاء وتحرير وتصفح قواعد بيانات SQLite",
    "originLink": "https://sqlitestudio.pl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42232000",
    "commentBody": "",
    "originSummary": [
      "أصدرت SQLiteStudio النسخة 3.4.6، حيث تم معالجة مشكلة \"السطر الأسود في كود SQL\" من النسخة السابقة 3.4.5 وحل مشكلتين إضافيتين.",
      "هذا البرنامج مفتوح المصدر، متعدد المنصات، ومحمول، متاح مجانًا تحت رخصة GPL، ومتوافق مع أنظمة Windows وLinux وMacOS X.",
      "من الجدير بالذكر أن SQLiteStudio لا يتطلب أي تثبيت، مما يجعله مريحًا للمستخدمين لإنشاء وتحرير واستعراض قواعد بيانات SQLite."
    ],
    "commentSummary": [
      "SQLiteStudio هو أداة سهلة الاستخدام مصممة لإنشاء وتحرير وتصفح قواعد بيانات SQLite، وتُشيد بميزاتها القوية وقابليتها للنقل.",
      "يتضمن دعمًا لمخططات الكيان-العلاقة (ERD)، مما يساعد في التعامل مع مهام قواعد البيانات المعقدة ويوفر تغذية راجعة بصرية، مما يفيد كل من المحترفين والطلاب.",
      "بينما واجه بعض المستخدمين مشكلات خاصة بالمنصة، يُعتبر SQLiteStudio بشكل عام أداة موثوقة وفعالة لإدارة SQLite."
    ],
    "points": 316,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1732495006
  },
  {
    "id": 42231489,
    "title": "الفصيلان في لغة C++",
    "originLink": "https://herecomesthemoon.net/2024/11/two-factions-of-cpp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42231489",
    "commentBody": "",
    "originSummary": [
      "ينقسم مجتمع C++ بين شركات التكنولوجيا الحديثة التي تسعى للحصول على ميزات متقدمة والمستخدمين القدامى الذين يعتمدون على أنظمة قديمة، مما يخلق توترًا في تطور اللغة. يركز فريق عمل تطور C++ على التوافق العكسي، مما يتعارض مع الطلب على الميزات الحديثة والسلامة، مما يؤدي إلى عدم الرضا بين بعض اللاعبين الرئيسيين في مجال التكنولوجيا. استجابة لهذه التحديات، تستكشف الحكومة الأمريكية وشركات مثل جوجل أو تطور لغات بديلة، مثل Rust، التي تعطي الأولوية للسلامة والقدرات الحديثة على حساب التوافق العكسي."
    ],
    "commentSummary": [
      "ينقسم مجتمع C++ بين الحفاظ على قواعد الأكواد القديمة واعتماد ميزات اللغة الحديثة والأكثر أمانًا، مع التركيز على تحديات إعادة الهيكلة دون اختبار آلي.",
      "تسلط المقالة الضوء على التأثير الكبير لشركة جوجل في لجنة معايير لغة C++ والصعوبة في تطوير اللغة دون التأثير على الشيفرات الحالية.",
      "تمت ملاحظة انقسامات فئوية مماثلة وتعقيدات في تطور اللغة في لغات برمجة أخرى مثل بايثون وراست."
    ],
    "points": 314,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1732490496
  },
  {
    "id": 42231148,
    "title": "بلوسكاي على وشك التفوق على ثريدز في جميع الجوانب المهمة",
    "originLink": "https://mashable.com/article/bluesky-gaining-ground-on-competitor-meta-threads",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42231148",
    "commentBody": "",
    "originSummary": [
      "بلوسكاي، وهي منصة لامركزية كانت مرتبطة في البداية بجاك دورسي، تكتسب زخمًا ولديها الآن 3.5 مليون مستخدم نشط يوميًا، مما يقترب من منصة ثريدز التابعة لشركة ميتا.",
      "شهدت المنصة زيادة بنسبة 300% في عدد المستخدمين منذ انتخابات الخامس من نوفمبر، حيث ينتقل الصحفيون والأكاديميون من منصة إيلون ماسك X، بحثًا عن حوار عام أكثر انفتاحًا.",
      "تواجه نمو بلوسكاي تحديات مثل الانقطاعات والاحتيالات، لكن جاذبيتها تعززت بقرار الرئيس التنفيذي لشركة ميتا، مارك زوكربيرغ، بتقييد المحتوى السياسي على منصة ثريدز."
    ],
    "commentSummary": [
      "تجذب Bluesky المستخدمين بميزات مثل التسميات المخصصة، واختيار الخوارزمية، وتغذية زمنية، مما يوفر تجربة أكثر تحكمًا للمستخدم مقارنة بـ Threads.",
      "يُنظر إليه كبديل محتمل لـ X (المعروف سابقًا بتويتر) نظرًا لتركيزه على اختيار المستخدم وتقليل التدخل الخوارزمي.",
      "على الرغم من شعبيته المتزايدة، لا تزال المخاوف بشأن استدامة ومونتاج بلوسكاي قائمة، حيث لا يزال في مراحله التطويرية المبكرة مقارنة بالمنصات الأكثر استقرارًا."
    ],
    "points": 280,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1732486994
  },
  {
    "id": 42230355,
    "title": "دفع نسيج إنفينيتي من AMD إلى حده الأقصى",
    "originLink": "https://chipsandcheese.com/p/pushing-amds-infinity-fabric-to-its",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230355",
    "commentBody": "",
    "originSummary": [
      "يعد Infinity Fabric من AMD، جزءًا من بنية Zen، حيث يربط بين نوى المعالج ويدير زمن الوصول للذاكرة، مع إظهار Zen 5 تحسينًا في التعامل مع عرض النطاق الترددي بفضل DDR5 الأسرع وإدارة حركة المرور بشكل أفضل.",
      "يوفر Zen 2 رؤى حول اختناقات مجمع النواة (CCX) ومجمع النواة على الشريحة (CCD)، على الرغم من أنه يعد بنية قديمة.",
      "في حين أن التطبيقات النموذجية مثل الألعاب لا تضغط على عرض النطاق الترددي، فإن أعباء العمل الشاقة مثل RawTherapee يمكن أن تكشف عن نقاط القوة والقيود في إدارة التأخير، خاصة في Zen 4 تحت الحمل الثقيل."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول تقنية Infinity Fabric من AMD وقيود عرض النطاق الترددي للذاكرة، مع مقارنات بقدرات معالجات Apple Silicon.",
      "يناقش المستخدمون مدى إمكانية تحقيق ادعاءات مثل وصول شريحة M1 Max من آبل إلى عرض نطاق ترددي يبلغ 400 جيجابايت/ثانية، مشيرين إلى الفروقات في استخدام النواة بين معمارية Zen 3 من AMD ومعمارية آبل.",
      "تسلط المحادثة الضوء أيضًا على أهمية تكوين الوصول غير المتجانس للذاكرة (NUMA) وتعقيدات تحسين البرمجيات للمعماريات الجديدة لوحدات المعالجة المركزية."
    ],
    "points": 210,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1732480741
  },
  {
    "id": 42230384,
    "title": "SQLite: أمثلة غريبة على الاستعلامات التكرارية",
    "originLink": "https://www.sqlite.org/lang_with.html#outlandish_recursive_query_examples",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230384",
    "commentBody": "",
    "originSummary": [
      "تُستخدم تعبيرات الجدول الشائعة (CTEs) في SQL كطرق عرض مؤقتة لبيان واحد، مع نوعين: العادي والتكراري، حيث تبسط الاستعلامات المعقدة وتعالج البيانات الهرمية، على التوالي.",
      "يتم إنشاء CTEs باستخدام عبارة WITH ويمكن أن تتضمن عدة CTEs في بيان واحد، مع أن CTEs التكرارية تتطلب قواعد محددة مثل استخدام مشغلي UNION أو UNION ALL.",
      "تلميحات التجسيد، المتوفرة في إصدار SQLite 3.35.0 وما بعده، توجه مخطط الاستعلام حول تنفيذ CTE، مع وجود قيود مثل عدم القدرة على استخدام WITH في CREATE TRIGGER."
    ],
    "commentSummary": [
      "تعمل تعبيرات الجداول المشتركة المتكررة (CTEs) في SQLite مثل الحلقات، مما يسمح للاستعلامات بالإشارة إلى نفسها، وهو أمر مفيد للمهام المعقدة مثل حل ألغاز السودوكو أو حساب الإغلاقات الانتقالية.",
      "إتقان بناء الجملة، خاصة \"WITH\" و \"WITH RECURSIVE\"، ضروري لاستخدام CTEs التكرارية بشكل فعال، حيث تعمل عن طريق بدء استعلام وتنفيذه بشكل تكراري حتى لا يتم توليد نتائج جديدة.",
      "بالنسبة لأولئك الذين يجدون أن العبارات الشجرية التكرارية (CTEs) صعبة، فإن الموارد مثل دليل O'Reilly SQL Pocket Guide وفهم قوي للجبر العلائقي يمكن أن يكون مفيدًا في تبسيط استعلامات SQL المعقدة."
    ],
    "points": 193,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1732480962
  },
  {
    "id": 42236841,
    "title": "مهلاً، انتظر - هل أداء الموظفين يتبع التوزيع الغاوسي؟",
    "originLink": "https://timdellinger.substack.com/p/hey-wait-is-employee-performance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42236841",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تتحدى المقالة الافتراض بأن أداء الموظفين يتبع توزيعًا غاوسيًا (طبيعيًا)، مشيرة إلى أن هذا الرأي قد يؤدي إلى ممارسات إدارة أداء قديمة في الشركات.",
      "ينتقد ممارسة تقليص نسبة 5% الأدنى من الموظفين، ويدعو إلى التركيز على الإنتاجية المشتركة بدلاً من الأداء الفردي، ويقترح أن الأداء قد يتبع توزيع باريتو، حيث يساهم عدد قليل من الموظفين بشكل كبير في الإنتاج.",
      "تشمل المناقشة وجهات نظر مختلفة حول تقييم الأداء، وممارسات التوظيف، ودور الإدارة في التأثير على نجاح الموظفين."
    ],
    "points": 180,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1732547019
  },
  {
    "id": 42233565,
    "title": "يوم في الحياة: جدول BGP العالمي",
    "originLink": "https://articles.foletta.org/post/2024-01-08-a-day-in-the-life-the-bgp-table/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42233565",
    "commentBody": "",
    "originSummary": [
      "يتناول المقال التقلبات اليومية في جدول BGP (بروتوكول البوابة الحدودية) العالمي، مع التركيز على السلوكيات قصيرة المدى مثل سمات المسارات غير المعتادة والمسارات المتذبذبة.",
      "باستخدام أداة تسمى bgpsee، يقوم المؤلف بتحليل رسائل BGP للكشف عن رؤى حول تحديثات المسارات، والسلوكيات الدورية، وأطوال المسارات القصوى لنظام AS (النظام المستقل).",
      "تسلط الاستكشاف الضوء على تعقيد ومرونة نظام BGP، مشددًا على الديناميكيات المعقدة لتوجيه الإنترنت العالمي على الرغم من إثارة المزيد من الأسئلة أكثر من الإجابات."
    ],
    "commentSummary": [
      "تتناول المقالة جدول بروتوكول بوابة الحدود العالمي (BGP)، مع التركيز على قضايا مثل تقلب المسارات وممارسة تخفيف المسارات للحد من الاضطراب المفرط في BGP.",
      "يشير أحد المستخدمين إلى تذبذب البادئة EpicUp 140.99.244.0/23، مقترحًا أنه يجب تخفيفه، بينما يلاحظ آخر أن تخفيف المسار أصبح أقل شيوعًا الآن بسبب الأخطاء السابقة في التكوين وقدرات أجهزة التوجيه المحسنة.",
      "تشمل المناقشة غرائب بروتوكول بوابة الحدود (BGP)، ورؤى تاريخية من مزودي خدمات الإنترنت (ISPs)، وموارد لأولئك المهتمين بتحليل بيانات BGP، مع اقتراحات لمشاريع محتملة."
    ],
    "points": 158,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1732513305
  },
  {
    "id": 42232289,
    "title": "تقنيات مراقبة الحياة البرية المستخدمة لتخويف النساء والتجسس عليهن",
    "originLink": "https://www.cam.ac.uk/research/news/wildlife-monitoring-technologies-used-to-intimidate-and-spy-on-women-study-finds",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42232289",
    "commentBody": "",
    "originSummary": [
      "اكتشف باحثون من كامبريدج أن تقنيات مراقبة الحياة البرية، مثل الكاميرات الفخية والطائرات بدون طيار، تُستخدم بشكل غير صحيح في الهند للتجسس على النساء، مما يؤثر على صحتهن النفسية وسلامتهن. - هذه التقنيات، التي كانت تهدف في الأصل لأغراض الحفظ، يُقال إنها تُستخدم من قبل السلطات المحلية لترهيب النساء، مما ينتهك حقوقهن. - تؤكد الدراسة على الحاجة إلى النظر بعناية في التأثيرات الاجتماعية لنشر مثل هذه التقنيات."
    ],
    "commentSummary": [
      "تُستخدم تقنيات مراقبة الحياة البرية، مثل الكاميرات الفخية، بشكل خاطئ في الغابات الهندية لتخويف النساء والتجسس عليهن، مما يثير مخاوف كبيرة بشأن الخصوصية والصحة النفسية. - يبرز هذا الاستخدام الخاطئ قضايا أوسع نطاقًا تتعلق بالمراقبة والخصوصية على مستوى العالم، خاصة في المناطق التي تواجه تحديات في حقوق المرأة، ولا يقتصر الأمر على الهند وحدها. - يتطلب معالجة هذه القضايا حلولًا معقدة، بما في ذلك تنفيذ قوانين أكثر صرامة وتغييرات ثقافية لحماية الخصوصية وضمان السلامة لجميع الأفراد."
    ],
    "points": 142,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1732497881
  }
]
