[
  {
    "id": 42232040,
    "title": "RFC 35140: HTTP Bıçaklamama (2023)",
    "originLink": "https://www.5snb.club/posts/2023/do-not-stab/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42232040",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "RFC 35140, bir tarayıcının varsayılan ayarının kurgusal bıçaklama endüstrisini olumsuz etkilemesinin ardından terk edilen \"Bıçaklamama\" HTTP başlığının kullanım dışı bırakılmasını mizahi bir şekilde eleştirir.",
      "Bir \"Genel Saldırı Kontrolü\" başlığının tanıtılması, açıkça vazgeçmeyi gerektiren, kullanıcı rıza mekanizmalarını ve sorumluluğun kurumlardan bireylere kaydırılmasını hicvediyor.",
      "Bu hiciv, mahremiyet, veri takibi ve kurumsal çıkarlara karşı düzenlemelerin uygulanmasındaki zorluklar da dahil olmak üzere daha geniş toplumsal sorunları ele alıyor."
    ],
    "points": 738,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1732495383
  },
  {
    "id": 42230103,
    "title": "Starlink Doğrudan Hücreye",
    "originLink": "https://www.starlink.com/business/direct-to-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230103",
    "commentBody": "",
    "originSummary": [
      "Starlink Direct to Cell, SpaceX tarafından sunulan yeni bir hizmet olup, LTE telefonlar için küresel metin, ses ve veri erişimi sağlayarak karada, göllerde ve kıyı sularında bağlantı sağlamaktadır.",
      "Servis, 2024 yılında metin hizmetleriyle başlayacak, ardından 2025 yılında ses, veri ve IoT (Nesnelerin İnterneti) desteği ile devam edecek ve donanım değişiklikleri veya özel uygulamalara ihtiyaç duymayacak.",
      "Bu gelişme, SpaceX'in telekomünikasyon alanındaki genişlemesini vurgulamakta olup, ek ekipman gerektirmeden kesintisiz bağlantı sağlamaktadır."
    ],
    "commentSummary": [
      "Starlink'in dikey entegrasyonu ve maliyet etkin fırlatmaları, onu uydu internet endüstrisinde lider bir güç olarak konumlandırıyor ve minimal rekabetle karşı karşıya bırakıyor.",
      "Kimileri Starlink'in hakimiyetini tekelci olarak görürken, diğerleri yenilik ve yabancı askeri desteğin gelecekte rekabeti teşvik edebileceğine inanıyor.",
      "Uydu fırlatmalarının yüksek maliyeti büyük bir engel teşkil ediyor, ancak yeniden kullanılabilir roket teknolojisindeki ilerlemeler rekabet ortamını değiştirebilir."
    ],
    "points": 649,
    "commentCount": 714,
    "retryCount": 0,
    "time": 1732478914
  },
  {
    "id": 42230392,
    "title": "Bu web sitesi Bluesky üzerinde barındırılmaktadır.",
    "originLink": "https://danielmangum.com/posts/this-website-is-hosted-on-bluesky/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230392",
    "commentBody": "",
    "originSummary": [
      "Bluesky tarafından kullanılan AT Protokolü, Kişisel Veri Sunucuları (PDS) aracılığıyla barındırmayı destekleyerek, amaçlanan kullanımların ötesindeki esnekliğini sergiler.- Bluesky'deki içerik, kayıtlar ve bloblar olarak organize edilir; bloblar, medya gibi daha büyük veriler olup, kayıtlarda referans verilmeden önce yüklenmelidir.- Protokolün genişletilebilirliği, web sitelerinin barındırılması gibi yaratıcı uygulamalara olanak tanır ve gelecekte yeni kullanım durumlarına yol açabilir."
    ],
    "commentSummary": [
      "Bluesky'de barındırılan web sitesi, RSS beslemelerinin barındırılması ve DOOM WAD'leri gibi verilerin depolanması da dahil olmak üzere potansiyel kullanımları hakkında tartışmalar başlattı ve içerik denetimi ile yasal sorunlar hakkında endişeler dile getirildi.",
      "Karşılaştırmalar, AT Protokolü'nün kamusal doğasını ve merkezi olmayan veri depolama potansiyelini vurgulayarak, MySpace gibi geçmiş platformlarla yapılmaktadır.",
      "Kullanıcılar, bazıları Bluesky'nin moderasyon yetenekleri konusunda şüpheci iken, diğerleri onu umut verici yeni bir platform olarak görüyor."
    ],
    "points": 636,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1732481013
  },
  {
    "id": 42233524,
    "title": "Git kimliklerimi nasıl yapılandırırım",
    "originLink": "https://www.benji.dog/articles/git-config/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42233524",
    "commentBody": "",
    "originSummary": [
      "Yazı, dizin yollarına veya uzak URL'lere dayalı olarak farklı ayarların yapılmasına olanak tanıyan koşullu yapılandırmalar için `includeIf` kullanarak Git kimliklerinin yapılandırılmasını tartışıyor.",
      "Yazar, `~/.ssh/config` dosyasında farklı `Host` değerleri kullanarak ve Git yapılandırmalarını `insteadOf` ile ayarlayarak birden fazla Git kimliğini ve SSH anahtarını yönetme yöntemini paylaşıyor.",
      "Bu gönderi, uzak URL'lere dayalı koşullu Git yapılandırmaları için `hasconfig:remote.*.url:!` kullanarak yeni bir yaklaşımı vurguluyor ve Git kimliklerini yönetmede esnekliği artırıyor."
    ],
    "commentSummary": [
      "Git yapılandırmasındaki `includeIf` yönergesi, kimlik yönetimini kolaylaştırarak, depo URL'sine dayalı olarak farklı ayarların otomatik olarak uygulanmasına olanak tanır.",
      "Bu yöntem, kullanıcıların iş ile ilgili depolar için belirli kullanıcı ayrıntılarını ve SSH anahtarlarını ayarlamalarını sağlar, kişisel ve iş projeleri arasında sorunsuz geçişi kolaylaştırır.",
      "Çalışma ve kişisel projeler için ayrı makineler veya kullanıcı hesapları kullanarak güvenlik ve gizliliği daha da artırabilirsiniz."
    ],
    "points": 387,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1732512753
  },
  {
    "id": 42232000,
    "title": "SQLiteStudio: SQLite veritabanlarını oluşturun, düzenleyin, göz atın",
    "originLink": "https://sqlitestudio.pl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42232000",
    "commentBody": "",
    "originSummary": [
      "SQLiteStudio, önceki sürüm 3.4.5'teki \"siyah SQL kod satırı\" sorununu ele alan ve iki ek sorunu çözen 3.4.6 sürümünü yayınladı.",
      "Bu yazılım, açık kaynaklı, platformlar arası ve taşınabilir olup, GPL lisansı altında ücretsiz olarak sunulmakta ve Windows, Linux ve MacOS X ile uyumludur.",
      "Özellikle, SQLiteStudio kurulum gerektirmez, bu da kullanıcılar için SQLite veritabanlarını oluşturmayı, düzenlemeyi ve gözden geçirmeyi kolaylaştırır."
    ],
    "commentSummary": [
      "SQLiteStudio, taşınabilirliği ve güçlü özellikleriyle övülen, SQLite veritabanlarını oluşturmak, düzenlemek ve göz atmak için tasarlanmış kullanıcı dostu bir araçtır.",
      "Bu, karmaşık veritabanı görevlerini yönetmeye yardımcı olan ve hem profesyonellere hem de öğrencilere görsel geri bildirim sunan Varlık-İlişki Diyagramları (ERD) desteğini içerir.",
      "Bazı kullanıcılar platforma özgü sorunlarla karşılaşmış olsa da, SQLiteStudio genellikle güvenilir ve verimli bir SQLite yönetim aracı olarak kabul edilir."
    ],
    "points": 316,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1732495006
  },
  {
    "id": 42231489,
    "title": "C++'un iki fraksiyonu",
    "originLink": "https://herecomesthemoon.net/2024/11/two-factions-of-cpp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42231489",
    "commentBody": "",
    "originSummary": [
      "C++ topluluğu, gelişmiş özellikler arayan modern teknoloji şirketleri ile eski sistemlere bağımlı olan eski kullanıcılar arasında bölünmüş durumda ve bu durum dilin evriminde bir gerilim yaratıyor.- C++ Evrim Çalışma Grubu'nun geriye dönük uyumluluğa odaklanması, modern özellikler ve güvenlik talebiyle çelişiyor ve bu da bazı büyük teknoloji oyuncuları arasında memnuniyetsizliğe yol açıyor.- Bu zorluklara yanıt olarak, ABD hükümeti ve Google gibi şirketler, geriye dönük uyumluluktan ziyade güvenlik ve modern yeteneklere öncelik veren Rust gibi alternatif dilleri araştırıyor veya geliştiriyor."
    ],
    "commentSummary": [
      "C++ topluluğu, eski kod tabanlarını koruma ve modern, daha güvenli dil özelliklerini benimseme arasında bölünmüş durumda, otomatik test olmadan yeniden yapılandırma zorluklarına odaklanıyor.",
      "Makale, Google'ın C++ standartlar komitesindeki önemli etkisini ve mevcut kodu bozmadan dili geliştirmenin zorluğunu vurguluyor.",
      "Benzer hizip bölünmeleri ve dil evrimindeki karmaşıklıklar, Python ve Rust gibi diğer programlama dillerinde de gözlemlenmektedir."
    ],
    "points": 314,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1732490496
  },
  {
    "id": 42231148,
    "title": "Bluesky, önemli olan tüm açılardan Threads'i geçmenin eşiğinde.",
    "originLink": "https://mashable.com/article/bluesky-gaining-ground-on-competitor-meta-threads",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42231148",
    "commentBody": "",
    "originSummary": [
      "Bluesky, başlangıçta Jack Dorsey ile ilişkilendirilen merkeziyetsiz bir platform, ivme kazanıyor ve şu anda Meta'nın Threads'ine yaklaşarak 3,5 milyon günlük aktif kullanıcıya sahip.",
      "Platform, gazeteciler ve akademisyenlerin daha açık bir kamu söylemi arayışıyla Elon Musk'ın X'inden göç etmesiyle, 5 Kasım seçimlerinden bu yana %300 kullanıcı artışı yaşadı.",
      "Bluesky'nin büyümesi, kesintiler ve dolandırıcılıklar gibi sorunlarla karşı karşıya kalsa da, Meta CEO'su Mark Zuckerberg'in Threads'te siyasi içeriği sınırlama kararı, cazibesini artırıyor."
    ],
    "commentSummary": [
      "Bluesky, kullanıcıları özel etiketler, algoritma seçimi ve kronolojik akış gibi özelliklerle cezbediyor ve Threads'e kıyasla daha kullanıcı kontrollü bir deneyim sunuyor.",
      "Bu, kullanıcı tercihine odaklanması ve algoritmik müdahaleyi azaltması nedeniyle X'e (eski adıyla Twitter) potansiyel bir alternatif olarak görülmektedir.",
      "Artan popülaritesine rağmen, Bluesky'nin sürdürülebilirliği ve para kazanma potansiyeli hakkındaki endişeler devam ediyor, çünkü daha köklü platformlarla karşılaştırıldığında hala erken geliştirme aşamalarında bulunuyor."
    ],
    "points": 280,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1732486994
  },
  {
    "id": 42230355,
    "title": "AMD'nin Infinity Fabric'ini Sınırlarına Zorlamak",
    "originLink": "https://chipsandcheese.com/p/pushing-amds-infinity-fabric-to-its",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230355",
    "commentBody": "",
    "originSummary": [
      "AMD'nin Zen mimarisinin bir parçası olan Infinity Fabric, CPU çekirdeklerini bağlar ve bellek gecikmesini yönetir. Zen 5, daha hızlı DDR5 ve daha iyi trafik yönetimi sayesinde geliştirilmiş bant genişliği yönetimi gösteriyor.",
      "Zen 2, daha eski bir mimari olmasına rağmen, Çekirdek Kompleksi (CCX) ve Çekirdek Kompleksi Yonga (CCD) darboğazları hakkında içgörüler sağlar.",
      "Tipik uygulamalar, oyunlar gibi, bant genişliğini zorlamazken, RawTherapee gibi zorlu iş yükleri, özellikle Zen 4'te ağır yük altında gecikme yönetimi güçlü ve sınırlamalarını ortaya çıkarabilir."
    ],
    "commentSummary": [
      "Bu tartışma, AMD'nin Infinity Fabric'i ve bellek bant genişliği kısıtlamaları üzerinde yoğunlaşıyor ve Apple'ın Silicon yetenekleriyle karşılaştırmalar yapılıyor.",
      "Kullanıcılar, Apple'ın M1 Max'inin 400GB/s bant genişliğine ulaşma iddiasının uygulanabilirliğini tartışıyor ve AMD'nin Zen 3 ile Apple'ın mimarisi arasındaki çekirdek kullanımı farklarına dikkat çekiyor.",
      "Konuşma ayrıca, Heterojen Bellek Erişimi (NUMA) yapılandırmasının önemini ve yeni ortaya çıkan CPU mimarileri için yazılımı optimize etmenin karmaşıklıklarını vurgulamaktadır."
    ],
    "points": 210,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1732480741
  },
  {
    "id": 42230384,
    "title": "SQLite: Alışılmadık Özyinelemeli Sorgu Örnekleri",
    "originLink": "https://www.sqlite.org/lang_with.html#outlandish_recursive_query_examples",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42230384",
    "commentBody": "",
    "originSummary": [
      "SQL'deki Ortak Tablo İfadeleri (CTE'ler), tek bir ifade için geçici görünümler olarak hizmet eder ve iki türü vardır: sıradan ve özyinelemeli, sırasıyla karmaşık sorguları basitleştirir ve hiyerarşik verileri işler.",
      "CTE'ler, WITH ifadesi kullanılarak oluşturulur ve tek bir ifadede birden fazla CTE içerebilir, özyinelemeli CTE'ler ise UNION veya UNION ALL operatörlerini kullanmak gibi belirli kurallar gerektirir.",
      "Materyalizasyon ipuçları, SQLite sürüm 3.35.0 ve sonrasında mevcut olup, sorgu planlayıcısına CTE uygulaması konusunda rehberlik eder, CREATE TRIGGER içinde WITH kullanılamaması gibi sınırlamaları vardır."
    ],
    "commentSummary": [
      "SQLite'nin özyinelemeli Ortak Tablo İfadeleri (CTE'ler), sorguların kendilerine referans vermesine izin vererek döngüler gibi çalışır, bu da Sudoku bulmacalarını çözmek veya geçiş kapanışlarını hesaplamak gibi karmaşık görevler için kullanışlıdır.",
      "Özellikle \"WITH\" ve \"WITH RECURSIVE\" sözdiziminin ustalığı, bir sorguyu başlatıp yeni sonuçlar üretilmeyene kadar özyinelemeli olarak çalıştıran özyinelemeli CTE'leri etkili bir şekilde kullanmak için esastır.",
      "Özyinelemeli CTE'leri zor bulanlar için, O'Reilly SQL Cep Kılavuzu gibi kaynaklar ve ilişkisel cebir hakkında sağlam bir anlayış, karmaşık SQL sorgularını basitleştirmede faydalı olabilir."
    ],
    "points": 193,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1732480962
  },
  {
    "id": 42236841,
    "title": "Hey, bekle – çalışan performansı Gauss dağılımı gösteriyor mu?",
    "originLink": "https://timdellinger.substack.com/p/hey-wait-is-employee-performance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42236841",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Makale, çalışan performansının Gauss (normal) dağılımını izlediği varsayımına meydan okuyor ve bu görüşün, şirketlerde modası geçmiş performans yönetimi uygulamalarına yol açabileceğini öne sürüyor.",
      "Çalışanların en alt %5'ini elemenin eleştirisini yaparak, bireysel performans yerine birleşik verimliliğe odaklanmayı savunur ve performansın, az sayıda çalışanın çıktıya önemli ölçüde daha fazla katkıda bulunduğu bir Pareto dağılımını takip edebileceğini önerir.",
      "Bu tartışma, performans değerlendirmesi, işe alım uygulamaları ve yönetimin çalışan başarısını etkilemedeki rolü üzerine çeşitli bakış açılarını kapsamaktadır."
    ],
    "points": 180,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1732547019
  },
  {
    "id": 42233565,
    "title": "Bir Gün: Küresel BGP Tablosu",
    "originLink": "https://articles.foletta.org/post/2024-01-08-a-day-in-the-life-the-bgp-table/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42233565",
    "commentBody": "",
    "originSummary": [
      "Makale, küresel BGP (Sınır Geçidi Protokolü) tablosunun günlük dalgalanmalarını inceleyerek, alışılmadık yol öznitelikleri ve dalgalanan yollar gibi kısa vadeli davranışlara odaklanıyor.",
      "Yazar, bgpsee adlı bir aracı kullanarak BGP mesajlarını analiz eder ve yol güncellemeleri, döngüsel davranışlar ve aşırı AS (Otonom Sistem) yol uzunlukları hakkında içgörüler ortaya çıkarır.",
      "BGP sisteminin karmaşıklığını ve dayanıklılığını vurgulayan bu keşif, küresel internet yönlendirmesinin karmaşık dinamiklerini vurgularken, cevaplardan çok daha fazla soru ortaya çıkarıyor."
    ],
    "commentSummary": [
      "Makale, aşırı BGP dalgalanmasını azaltmak için rota dalgalanması ve rota sönümleme uygulaması gibi konulara odaklanarak küresel Sınır Geçidi Protokolü (BGP) tablosunu ele alıyor.",
      "Bir kullanıcı, EpicUp 140.99.244.0/23 ön ekinin dalgalanmasını vurgulayarak bunun azaltılması gerektiğini öne sürerken, bir diğeri ise geçmişteki yanlış yapılandırmalar ve gelişmiş yönlendirici yetenekleri nedeniyle rota azaltmanın artık daha az yaygın olduğunu belirtiyor.",
      "BGP tuhaflıkları, İnternet Servis Sağlayıcılarından (ISP'ler) tarihsel bilgiler ve BGP verilerini analiz etmekle ilgilenenler için kaynaklar, potansiyel projeler için önerilerle birlikte tartışmaya dahil edilmiştir."
    ],
    "points": 158,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1732513305
  },
  {
    "id": 42232289,
    "title": "Kadınları korkutmak ve gözetlemek için kullanılan yaban hayatı izleme teknolojileri",
    "originLink": "https://www.cam.ac.uk/research/news/wildlife-monitoring-technologies-used-to-intimidate-and-spy-on-women-study-finds",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42232289",
    "commentBody": "",
    "originSummary": [
      "Cambridge araştırmacıları, Hindistan'da yaban hayatı izleme teknolojilerinin, örneğin kamera tuzakları ve dronların, kadınları gözetlemek için kötüye kullanıldığını keşfetti; bu durum, kadınların ruh sağlığını ve güvenliğini etkiliyor.- Başlangıçta koruma amaçlı tasarlanan bu teknolojilerin, yerel yetkililer tarafından kadınları sindirmek için kullanıldığı ve haklarının ihlal edildiği bildiriliyor.- Çalışma, bu tür teknolojilerin uygulanmasının sosyal etkilerinin dikkatlice değerlendirilmesi gerektiğini vurguluyor."
    ],
    "commentSummary": [
      "Yaban hayatı izleme teknolojileri, örneğin kamera tuzakları, Hindistan ormanlarında kadınları korkutmak ve gözetlemek için kötüye kullanılıyor, bu da önemli mahremiyet ve ruh sağlığı endişelerini artırıyor. Bu kötüye kullanım, özellikle mevcut kadın hakları sorunları olan bölgelerde, gözetim ve mahremiyetle ilgili daha geniş küresel sorunları vurguluyor ve yalnızca Hindistan ile sınırlı değil. Bu sorunların ele alınması, mahremiyeti korumak ve tüm bireylerin güvenliğini sağlamak için daha sıkı yasaların uygulanması ve kültürel değişimler gibi karmaşık çözümler gerektiriyor."
    ],
    "points": 142,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1732497881
  }
]
