[
  {
    "id": 42592910,
    "title": "Självkörande 1993 Volvo med open pilot",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "Ett kompisgäng deltog i Carbage Run 2025 Winter edition, en 6-dagars rally genom Sverige till polcirkeln och tillbaka till Helsingfors, där bilarna måste vara minst 20 år gamla och värderade under 1000 €.",
      "De förvandlade en Volvo 940 Estate från 1993 till ett självkörande fordon med hjälp av openpilot från comma.ai, och integrerade moderna komponenter som elektrisk servostyrning, en Bosch iBooster och en Tesla radarsensor.",
      "Framtida uppdateringar kommer att inkludera detaljer om kablage, en anpassad motorstyrningsenhet (ECU) och planer på att göra koden öppen källkod, vilket belyser projektets innovativa tillvägagångssätt för att eftermontera äldre fordon med autonom teknik."
    ],
    "commentSummary": [
      "En Volvo 940 från 1993 utrustades med OpenPilot, en självkörande teknik, vilket belyser korsningen mellan klassisk bildesign och modern teknik.",
      "Projektet stötte på utmaningar, inklusive uppdatering av broms- och styrsystemen, vilket väckte juridiska och säkerhetsmässiga bekymmer, särskilt med gör-det-själv-modifikationer som att svetsa styrkolonnen.",
      "Diskussionen utvidgades till bilregleringar i Europa, minskningen av hotrods i USA och kulturella skillnader i friheten att modifiera bilar, med projektet betraktat som en inspirerande gör-det-själv-insats trots säkerhetsbekymmer."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: Terrängrenderingsalgoritm på mindre än 20 rader kod (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "NovaLogics spel Comanche från 1992 använde Voxel Space-motorn, en 2.5D-renderingsteknik baserad på ray casting, för att skapa detaljerade terränger med skuggning och skuggor.",
      "Voxel Space-motorn använde höjd- och färgkartor samt en enkel renderingsalgoritm, som ritade vertikala linjer från bak till fram, vilket kunde optimeras för prestanda.",
      "Motorns kod är tillgänglig under MIT-licensen, men teknologin kan fortfarande vara patenterad i vissa regioner."
    ],
    "commentSummary": [
      "VoxelSpace är en terrängrenderingsalgoritm som är anmärkningsvärd för sin enkelhet, kräver mindre än 20 rader kod, och väcker nostalgi för innovativ spelutveckling under hårdvarubegränsade epoker.",
      "Moderna AAA-spel fokuserar på komplexa optimeringar och marknadstrender, ofta på bekostnad av originalitet, medan indiespel och plattformar som PICO-8 erbjuder mer kreativ frihet.",
      "Trots teknologiska framsteg känner vissa utvecklare och spelare att den \"magi\" som fanns i äldre spel saknas, även om innovativa projekt som voxelrendering fortsätter att inspirera kreativitet."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Så ritar du en kontur i ett videospel",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Artikeln diskuterar fem tekniker för att rendera konturer i Unity, en populär plattform för spelutveckling, och lyfter fram deras användning i spel som Sable och The Last of Us. - Teknikerna inkluderar Rim Effects, Vertex Extrusion, Blurred Buffer, Jump Flood Algorithm och Edge Detection, var och en med unika fördelar och kompromisser när det gäller prestanda och visuell kvalitet. - Artikeln ger insikter i hur man balanserar dessa metoder för optimal spelestetik och spelstöd, med ytterligare resurser och krediter för 3D-modeller inkluderade."
    ],
    "commentSummary": [
      "Artikeln utforskar avancerade tekniker för att rita konturer i videospel, med betoning på effektiviteten hos Jump Flood Algorithm (JFA) och Signed Distance Fields (SDFs) jämfört med traditionella metoder. - Den fördjupar sig i stiliserad 3D-grafik, diskuterar renderingstekniker och den potentiella användningen av neurala nätverk för belysning och styling. - Bidragsgivare ger insikter i den historiska utvecklingen av cel shading i spel, såsom Jet Set Radio, och belyser den ständigt utvecklande korsningen mellan teknik och konst i 3D-grafik."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Jag slutar på Washington Post",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Författaren lämnar Washington Post på grund av dess oförmåga att anpassa sig till det föränderliga medielandskapet och dess sätt att presentera frågor, vilket de anser är ineffektivt för kritiska ämnen som demokrati.",
      "Traditionella medier, särskilt lokala tidningar, kämpar ekonomiskt, vilket leder till partisk rapportering och en minskning av allmänhetens förtroende, medan sociala medier inte kan ersätta det noggranna arbetet inom journalistik.",
      "Det uttrycks oro över inflytandet från förmögna individer, såsom Jeff Bezos, på mediekanaler, och effekten av företagsintressen på mediernas roll i att hålla makten ansvarig."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity har fått annonser",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity har infört annonser, vilket har lett till diskussioner om oundvikligheten av annonser i onlinetjänster på grund av konsumenters ovilja att betala för annonsfria upplevelser. - Vissa användare tycker att annonser är påträngande och föredrar prenumerationsbaserade tjänster som Kagi, som erbjuder annonsfri sökning, medan andra fortsätter att välja gratis, annonsstödda alternativ. - Denna situation understryker den pågående debatten mellan annonsstödda och prenumerationsbaserade modeller i digitala tjänster."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
