[
  {
    "id": 42592910,
    "title": "1993 model kendi kendine giden Volvo, açık pilot ile",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "Bir grup arkadaş, 2025 Kış edisyonu Carbage Run'a katıldı; bu, İsveç üzerinden kutup dairesine ve ardından Helsinki'ye geri dönen, arabaların en az 20 yaşında ve değeri 1000 €'nun altında olmasını gerektiren 6 günlük bir rallidir.",
      "1993 model bir Volvo 940 Estate'i, comma.ai'den openpilot kullanarak kendi kendine giden bir araca dönüştürdüler ve elektrikli direksiyon, Bosch iBooster ve Tesla radar sensörü gibi modern bileşenler eklediler.",
      "Gelecekteki güncellemeler, kablolama detayları, özel bir Motor Kontrol Ünitesi (ECU) ve kodu açık kaynak yapma planlarını içerecek, projenin eski araçları otonom teknoloji ile donatma konusundaki yenilikçi yaklaşımını vurgulayacak."
    ],
    "commentSummary": [
      "1993 model bir Volvo 940, klasik otomobil tasarımı ile modern teknolojinin kesişimini vurgulayan bir otonom sürüş teknolojisi olan OpenPilot ile donatıldı.",
      "Proje, direksiyon kolonunun kaynakla birleştirilmesi gibi kendin yap (DIY) modifikasyonlarıyla ilgili yasal ve güvenlik endişelerini artıran fren ve direksiyon sistemlerinin güncellenmesi de dahil olmak üzere zorluklarla karşılaştı.",
      "Avrupa'daki araba düzenlemeleri, ABD'de hotrodların azalması ve araba modifikasyonu özgürlüklerindeki kültürel farklılıklar üzerine tartışma genişledi, proje güvenlik endişelerine rağmen ilham verici bir DIY çabası olarak görüldü."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: 20 satırdan daha az kodla arazi işleme algoritması (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "NovaLogic'in 1992 yapımı Comanche oyunu, gölgelendirme ve gölgelerle detaylı araziler oluşturmak için ışın dökümüne dayanan 2.5D bir işleme tekniği olan Voxel Space motorunu kullandı.",
      "Voxel Space motoru, yükseklik ve renk haritalarını ve basit bir işleme algoritmasını kullanarak, performans için optimize edilebilecek şekilde arkadan öne doğru dikey çizgiler çiziyordu.",
      "Motorun kodu MIT lisansı altında mevcuttur, ancak teknoloji belirli bölgelerde hala patentli olabilir."
    ],
    "commentSummary": [
      "VoxelSpace, 20 satırdan az kod gerektiren sadeliğiyle dikkat çeken bir arazi işleme algoritmasıdır ve donanımın sınırlı olduğu dönemlerdeki yenilikçi oyun geliştirme çalışmalarına nostalji uyandırır.",
      "Modern AAA oyunlar, genellikle özgünlük pahasına karmaşık optimizasyonlara ve pazar trendlerine odaklanırken, bağımsız oyunlar ve PICO-8 gibi platformlar daha fazla yaratıcı özgürlük sunar.",
      "Teknolojik ilerlemelere rağmen, bazı geliştiriciler ve oyuncular eski oyunların \"büyüsünün\" eksik olduğunu hissediyor, ancak voxel renderleme gibi yenilikçi projeler yaratıcılığı ilham vermeye devam ediyor."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Bir video oyununda ana hat nasıl çizilir",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Makale, popüler bir oyun geliştirme platformu olan Unity'de dış hatları oluşturmak için beş tekniği tartışıyor ve bunların Sable ve The Last of Us gibi oyunlarda kullanımını vurguluyor. - Teknikler arasında Kenar Efektleri, Vertex Ekstrüzyonu, Bulanık Tampon, Sıçrama Taşkın Algoritması ve Kenar Algılama yer alıyor ve her biri performans ve görsel kalite açısından benzersiz avantajlar ve ödünleşimler sunuyor. - Makale, bu yöntemleri optimal oyun estetiği ve oyun desteği için dengeleme konusunda içgörüler sağlıyor ve ek kaynaklar ile 3D modeller için krediler içeriyor."
    ],
    "commentSummary": [
      "Makale, video oyunlarında dış hatları çizmek için gelişmiş teknikleri araştırıyor ve Geleneksel yöntemlere göre Jump Flood Algoritması (JFA) ve İmzalı Mesafe Alanlarının (SDF'ler) verimliliğini vurguluyor. - Stilize 3D grafiklere dalarak, render tekniklerini ve aydınlatma ve stil için sinir ağlarının potansiyel kullanımını tartışıyor. - Katkıda bulunanlar, Jet Set Radio gibi oyunlarda cel gölgelemenin tarihsel gelişimine dair içgörüler sunarak, 3D grafiklerde teknolojinin ve sanatın gelişen kesişimini vurguluyor."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Washington Post'tan ayrılıyorum",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yazar, Washington Post'tan ayrılıyor çünkü gazetenin gelişen medya ortamına uyum sağlayamaması ve konuları sunma yaklaşımının demokrasi gibi kritik konular için etkisiz olduğuna inanıyor.",
      "Yerel gazeteler başta olmak üzere geleneksel medya mali açıdan zorlanıyor, bu da taraflı haberciliğe ve kamu güveninde azalmaya yol açıyor, oysa sosyal medya gazeteciliğin titiz çalışmasının yerini alamaz.",
      "Zengin bireylerin, örneğin Jeff Bezos gibi, medya kuruluşları üzerindeki etkisi ve kurumsal çıkarların medyanın gücü hesap verme sorumluluğuna tabi tutma rolü üzerindeki etkisi hakkında endişeler dile getirilmektedir."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity reklam aldı",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity, reklamlara yer vermeye başladı ve bu durum, çevrimiçi hizmetlerde reklamsız deneyimler için ödeme yapma konusundaki tüketici isteksizliği nedeniyle reklamların kaçınılmazlığı hakkında tartışmalara yol açtı. - Bazı kullanıcılar reklamları rahatsız edici buluyor ve reklamsız arama sunan Kagi gibi abonelik tabanlı hizmetleri tercih ediyor, diğerleri ise ücretsiz, reklam destekli seçenekleri tercih etmeye devam ediyor. - Bu durum, dijital hizmetlerde reklam destekli ve abonelik tabanlı modeller arasındaki süregelen tartışmayı vurguluyor."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
