[
  {
    "id": 42592910,
    "title": "Zelfrijdende Volvo uit 1993 met open piloot",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "Een groep vrienden nam deel aan de Carbage Run 2025 Wintereditie, een 6-daagse rally door Zweden naar de poolcirkel en terug naar Helsinki, waarbij auto's minstens 20 jaar oud moesten zijn en een waarde van minder dan €1000 moesten hebben.",
      "Ze hebben een Volvo 940 Estate uit 1993 omgebouwd tot een zelfrijdend voertuig met behulp van openpilot van comma.ai, waarbij ze moderne componenten zoals elektrische stuurbekrachtiging, een Bosch iBooster en een Tesla-radarsensor hebben geïntegreerd.",
      "Toekomstige updates zullen details bevatten over bedrading, een aangepaste Engine Control Unit (ECU), en plannen om de code open-source te maken, waarbij de innovatieve benadering van het project om oudere voertuigen uit te rusten met autonome technologie wordt benadrukt."
    ],
    "commentSummary": [
      "Een Volvo 940 uit 1993 werd uitgerust met OpenPilot, een zelfrijdende technologie, wat de kruising tussen klassiek autodesign en moderne technologie benadrukt.",
      "Het project stond voor uitdagingen, waaronder het updaten van de rem- en stuursystemen, wat juridische en veiligheidsproblemen met zich meebracht, vooral bij doe-het-zelf-aanpassingen zoals het lassen van de stuurkolom.",
      "De discussie breidde zich uit naar autoreglementen in Europa, de afname van hotrods in de VS en culturele verschillen in de vrijheid van autowijzigingen, waarbij het project werd gezien als een inspirerende doe-het-zelf-inspanning ondanks veiligheidszorgen."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: Terrainterenderingsalgoritme i mindre enn 20 linjer med kode (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "NovaLogics spill Comanche fra 1992 brukte Voxel Space-motoren, en 2.5D gjengivelsesteknikk basert på strålekasting, for å skape detaljerte terreng med skyggelegging og skygger.",
      "De Voxel Space-motoren brukte høyde- og fargekart og en enkel gjengivelsesalgoritme, som tegnet vertikale linjer fra bak til front, noe som kunne optimaliseres for ytelse.",
      "De code van motoren er tilgjengelig under MIT-lisensen, men teknologien kan fortsatt være patentert i visse regioner."
    ],
    "commentSummary": [
      "VoxelSpace is een terreinrenderingsalgoritme dat opvalt door zijn eenvoud, met minder dan 20 regels code, en roept nostalgie op voor innovatieve spelontwikkeling tijdens hardware-beperkte tijdperken.",
      "Moderne AAA-spill fokuserer på komplekse optimaliseringer og markedstrender, ofte på bekostning av originalitet, mens indie-spill og plattformer som PICO-8 gir mer kreativ frihet.",
      "Ondanks technologische vooruitgang voelen sommige ontwikkelaars en spelers dat de 'magie' van oudere spellen ontbreekt, hoewel innovatieve projecten zoals voxel rendering creativiteit blijven inspireren."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Hoe teken je een omtrek in een videospel",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Het artikel bespreekt vijf technieken voor het weergeven van contouren in Unity, een populair platform voor game-ontwikkeling, en benadrukt hun gebruik in games zoals Sable en The Last of Us. - Technieken omvatten Rim Effects, Vertex Extrusion, Blurred Buffer, Jump Flood Algorithm en Edge Detection, elk met unieke voordelen en afwegingen op het gebied van prestaties en visuele kwaliteit. - Het artikel biedt inzichten in het balanceren van deze methoden voor optimale game-esthetiek en gameplay-ondersteuning, met aanvullende bronnen en credits voor 3D-modellen inbegrepen."
    ],
    "commentSummary": [
      "Artikkelen utforsker avanserte teknikker for å tegne konturer i videospill, med vekt på effektiviteten til Jump Flood Algorithm (JFA) og Signed Distance Fields (SDFs) sammenlignet med tradisjonelle metoder. - Den går i dybden på stiliserte 3D-grafikk, diskuterer renderingsteknikker og den potensielle bruken av nevrale nettverk for belysning og styling. - Bidragsytere gir innsikt i den historiske utviklingen av cel shading i spill, som Jet Set Radio, og fremhever det stadig utviklende samspillet mellom teknologi og kunst i 3D-grafikk."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Ik stop bij de Washington Post",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "De auteur forlater Washington Post på grunn av avisens manglende evne til å tilpasse seg det stadig skiftende medielandskapet og dens tilnærming til å presentere saker, som de mener er ineffektiv for kritiske emner som demokrati.",
      "Traditionele media, met name lokale kranten, hebben het financieel moeilijk, wat leidt tot bevooroordeelde berichtgeving en een afname van het publieke vertrouwen, terwijl sociale media het rigoureuze werk van de journalistiek niet kunnen vervangen.",
      "Er zijn bekymringer over innflytelsen fra velstående individer, som Jeff Bezos, på mediekanaler, og virkningen av bedriftsinteresser på medienes rolle i å holde makten ansvarlig."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity heeft advertenties gekregen",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity har introdusert annonser, noe som har ført til diskusjoner om uunngåeligheten av annonser i nettjenester på grunn av forbrukernes motvilje mot å betale for annonsefrie opplevelser. - Noen brukere finner annonser påtrengende og foretrekker abonnementsbaserte tjenester som Kagi, som tilbyr annonsefri søk, mens andre fortsetter å velge gratis, annonsebaserte alternativer. - Denne situasjonen understreker den pågående debatten mellom annonsebaserte og abonnementsbaserte modeller i digitale tjenester."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
