[
  {
    "id": 42592910,
    "title": "Selvkørende 1993 Volvo med open pilot",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "En gruppe venner deltog i Carbage Run 2025 Winter-udgaven, et 6-dages rally gennem Sverige til polarcirklen og tilbage til Helsinki, hvor bilerne skulle være mindst 20 år gamle og have en værdi under €1000.",
      "De omdannede en 1993 Volvo 940 Estate til et selvkørende køretøj ved hjælp af openpilot fra comma.ai, og integrerede moderne komponenter som elektrisk servostyring, en Bosch iBooster og en Tesla radarsensor.",
      "Fremtidige opdateringer vil inkludere detaljer om ledningsføring, en specialfremstillet motorstyringsenhed (ECU) og planer om at open-source koden, hvilket fremhæver projektets innovative tilgang til at eftermontere ældre køretøjer med autonom teknologi."
    ],
    "commentSummary": [
      "En Volvo 940 fra 1993 blev eftermonteret med OpenPilot, en selvkørende teknologi, hvilket fremhæver krydsfeltet mellem klassisk bildesign og moderne teknologi.",
      "Projektet stod over for udfordringer, herunder opdatering af bremse- og styresystemerne, hvilket rejste juridiske og sikkerhedsmæssige bekymringer, især med gør-det-selv-modifikationer som svejsning af ratstammen.",
      "Diskussionen udvidede sig til bilreguleringer i Europa, tilbagegangen af hotrods i USA og kulturelle forskelle i friheden til bilmodifikationer, med projektet betragtet som en inspirerende gør-det-selv-indsats trods sikkerhedsbekymringer."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: Terrænrenderingsalgoritme på mindre end 20 linjer kode (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "NovaLogics spil Comanche fra 1992 anvendte Voxel Space-motoren, en 2.5D renderingsteknik baseret på ray casting, til at skabe detaljerede terræner med skygger og skyggeeffekter.",
      "Voxel Space-motoren brugte højde- og farvekort samt en simpel renderingsalgoritme, der tegnede lodrette linjer fra bag til front, hvilket kunne optimeres for ydeevne.",
      "Motorens kode er tilgængelig under MIT-licensen, men teknologien kan stadig være patenteret i visse regioner."
    ],
    "commentSummary": [
      "VoxelSpace er en terrænrenderingsalgoritme kendt for sin enkelhed, da den kræver mindre end 20 linjer kode, og den vækker nostalgi for innovativ spiludvikling i perioder med begrænset hardware.",
      "Moderne AAA-spil fokuserer på komplekse optimeringer og markedstendenser, ofte på bekostning af originalitet, mens indie-spil og platforme som PICO-8 giver mere kreativ frihed.",
      "På trods af teknologiske fremskridt føler nogle udviklere og spillere, at \"magien\" fra ældre spil mangler, selvom innovative projekter som voxel-rendering fortsat inspirerer til kreativitet."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Sådan tegner du en omrids i et videospil",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Artiklen diskuterer fem teknikker til at gengive konturer i Unity, en populær spiludviklingsplatform, og fremhæver deres anvendelse i spil som Sable og The Last of Us. - Teknikkerne inkluderer Rim Effects, Vertex Extrusion, Blurred Buffer, Jump Flood Algorithm og Edge Detection, hver med unikke fordele og kompromiser i forhold til ydeevne og visuel kvalitet. - Artiklen giver indsigt i at balancere disse metoder for optimal spilæstetik og gameplay-understøttelse, med yderligere ressourcer og krediteringer for 3D-modeller inkluderet."
    ],
    "commentSummary": [
      "Artiklen udforsker avancerede teknikker til at tegne konturer i videospil, med vægt på effektiviteten af Jump Flood Algorithm (JFA) og Signed Distance Fields (SDFs) i forhold til traditionelle metoder. - Den går i dybden med stiliseret 3D-grafik, diskuterer renderingsteknikker og den potentielle brug af neurale netværk til belysning og styling. - Bidragydere giver indsigt i den historiske udvikling af cel shading i spil, såsom Jet Set Radio, og fremhæver det udviklende samspil mellem teknologi og kunst i 3D-grafik."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Jeg stopper på Washington Post",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Forfatteren forlader Washington Post på grund af avisens manglende evne til at tilpasse sig det skiftende medielandskab og dens tilgang til at præsentere emner, som de mener er ineffektiv for kritiske emner som demokrati.",
      "Traditionelle medier, især lokale aviser, kæmper økonomisk, hvilket fører til partisk rapportering og et fald i offentlighedens tillid, mens sociale medier ikke kan erstatte det grundige arbejde, som journalistik kræver.",
      "Bekymringer rejses om indflydelsen fra velhavende individer, såsom Jeff Bezos, på medievirksomheder, og virkningen af virksomheders interesser på mediernes rolle i at holde magten ansvarlig."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity har fået annoncer",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity har introduceret reklamer, hvilket har ført til diskussioner om uundgåeligheden af reklamer i onlinetjenester på grund af forbrugernes modvilje mod at betale for reklamefri oplevelser. - Nogle brugere finder reklamer påtrængende og foretrækker abonnementsbaserede tjenester som Kagi, der tilbyder reklamefri søgning, mens andre fortsætter med at vælge gratis, reklameunderstøttede muligheder. - Denne situation understreger den igangværende debat mellem reklameunderstøttede og abonnementsbaserede modeller i digitale tjenester."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
