[
  {
    "id": 42592910,
    "title": "Самоуправляемый Volvo 1993 года с открытым пилотом",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "Группа друзей приняла участие в зимнем издании Carbage Run 2025, шестидневном ралли через Швецию до полярного круга и обратно в Хельсинки, требующем, чтобы автомобили были не моложе 20 лет и оценивались менее чем в 1000 евро.",
      "Они превратили Volvo 940 Estate 1993 года в автономное транспортное средство, используя openpilot от comma.ai, интегрировав современные компоненты, такие как электрический усилитель руля, Bosch iBooster и радарный датчик Tesla.",
      "Будущие обновления будут включать детали по проводке, специальный блок управления двигателем (ECU) и планы по открытию исходного кода, подчеркивая инновационный подход проекта к модернизации старых автомобилей с использованием автономных технологий."
    ],
    "commentSummary": [
      "В 1993 году Volvo 940 была переоборудована с использованием OpenPilot, технологии для автономного вождения, что подчеркивает пересечение классического автомобильного дизайна и современных технологий.",
      "Проект столкнулся с трудностями, включая обновление тормозной и рулевой систем, что вызвало юридические и вопросы безопасности, особенно с самодельными модификациями, такими как сварка рулевой колонки.",
      "Обсуждение затронуло автомобильные регламенты в Европе, снижение популярности хот-родов в США и культурные различия в свободе модификации автомобилей, при этом проект рассматривался как вдохновляющее усилие своими руками, несмотря на опасения по поводу безопасности."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: Алгоритм рендеринга ландшафта менее чем в 20 строках кода (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "Игра Comanche от NovaLogic, выпущенная в 1992 году, использовала движок Voxel Space, технику рендеринга 2.5D, основанную на трассировке лучей, для создания детализированных ландшафтов с тенями и затенением.",
      "Движок Voxel Space использовал карты высот и цвета, а также простой алгоритм рендеринга, рисуя вертикальные линии от заднего плана к переднему, что могло быть оптимизировано для повышения производительности.",
      "Код двигателя доступен по лицензии MIT, но технология все еще может быть запатентована в некоторых регионах."
    ],
    "commentSummary": [
      "VoxelSpace — это алгоритм рендеринга ландшафта, примечательный своей простотой, требующий менее 20 строк кода, и вызывающий ностальгию по инновационной разработке игр в эпохи с ограниченными аппаратными возможностями.",
      "Современные AAA-игры сосредоточены на сложных оптимизациях и рыночных тенденциях, часто в ущерб оригинальности, тогда как инди-игры и платформы, такие как PICO-8, предоставляют больше творческой свободы.",
      "Несмотря на технологические достижения, некоторые разработчики и игроки считают, что «магия» старых игр отсутствует, хотя инновационные проекты, такие как воксельный рендеринг, продолжают вдохновлять на творчество."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Как нарисовать контур в видеоигре",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Статья обсуждает пять техник для рендеринга контуров в Unity, популярной платформе для разработки игр, подчеркивая их использование в таких играх, как Sable и The Last of Us. - Техники включают эффекты ободка, экструзию вершин, размытие буфера, алгоритм Jump Flood и обнаружение краев, каждая из которых имеет уникальные преимущества и компромиссы с точки зрения производительности и визуального качества. - Статья предоставляет информацию о том, как сбалансировать эти методы для оптимальной эстетики игры и поддержки игрового процесса, с дополнительными ресурсами и кредитами для 3D-моделей."
    ],
    "commentSummary": [
      "Статья исследует передовые методы создания контуров в видеоиграх, подчеркивая эффективность алгоритма Jump Flood (JFA) и полей подписанных расстояний (SDF) по сравнению с традиционными методами. - Она углубляется в стилизованную 3D-графику, обсуждая методы рендеринга и потенциальное использование нейронных сетей для освещения и стилизации. - Участники предоставляют информацию о историческом развитии цел-шейдинга в играх, таких как Jet Set Radio, подчеркивая развивающееся пересечение технологий и искусства в 3D-графике."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Я ухожу из Washington Post",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Автор покидает Washington Post из-за неспособности издания адаптироваться к изменяющемуся медийному ландшафту и его подходу к освещению проблем, который, по их мнению, неэффективен для критических тем, таких как демократия.",
      "Традиционные СМИ, особенно местные газеты, испытывают финансовые трудности, что приводит к предвзятой подаче новостей и снижению доверия общественности, в то время как социальные сети не могут заменить тщательную работу журналистики.",
      "Выражаются опасения по поводу влияния состоятельных лиц, таких как Джефф Безос, на средства массовой информации и воздействия корпоративных интересов на роль СМИ в привлечении власти к ответственности."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity получила рекламу",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity ввела рекламу, что привело к обсуждениям о неизбежности рекламы в онлайн-сервисах из-за нежелания потребителей платить за опыт без рекламы. - Некоторые пользователи считают рекламу навязчивой и предпочитают подписные сервисы, такие как Kagi, которые предлагают поиск без рекламы, в то время как другие продолжают выбирать бесплатные, поддерживаемые рекламой варианты. - Эта ситуация подчеркивает продолжающуюся дискуссию между моделями, поддерживаемыми рекламой, и подписными моделями в цифровых сервисах."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
