[
  {
    "id": 42592910,
    "title": "Xe Volvo tự lái 1993 với hệ thống lái mở",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "Một nhóm bạn đã tham gia Carbage Run 2025 phiên bản mùa đông, một cuộc đua kéo dài 6 ngày qua Thụy Điển đến vòng cực và trở lại Helsinki, yêu cầu các xe phải ít nhất 20 năm tuổi và có giá trị dưới 1000 €.",
      "Họ đã biến đổi một chiếc Volvo 940 Estate năm 1993 thành một phương tiện tự lái bằng cách sử dụng openpilot từ comma.ai, tích hợp các thành phần hiện đại như hệ thống lái trợ lực điện, Bosch iBooster và cảm biến radar của Tesla.",
      "Những cập nhật trong tương lai sẽ bao gồm chi tiết về hệ thống dây điện, một Bộ Điều Khiển Động Cơ (ECU) tùy chỉnh, và kế hoạch mã nguồn mở, nhấn mạnh cách tiếp cận sáng tạo của dự án trong việc trang bị công nghệ tự động cho các phương tiện cũ."
    ],
    "commentSummary": [
      "Một chiếc Volvo 940 năm 1993 đã được trang bị OpenPilot, một công nghệ tự lái, làm nổi bật sự giao thoa giữa thiết kế xe cổ điển và công nghệ hiện đại.",
      "Theo dự án đã gặp phải những thách thức, bao gồm việc cập nhật hệ thống phanh và lái, làm dấy lên những lo ngại về pháp lý và an toàn, đặc biệt là với các sửa đổi tự làm như hàn cột lái.",
      "Cuộc thảo luận mở rộng đến các quy định về ô tô ở châu Âu, sự suy giảm của hotrods ở Mỹ, và sự khác biệt văn hóa trong tự do sửa đổi ô tô, với dự án được xem như một nỗ lực DIY đầy cảm hứng mặc dù có những lo ngại về an toàn."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: Thuật toán kết xuất địa hình trong chưa đầy 20 dòng mã (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "Trò chơi Comanche của NovaLogic năm 1992 đã sử dụng công cụ Voxel Space, một kỹ thuật dựng hình 2.5D dựa trên ray casting, để tạo ra các địa hình chi tiết với đổ bóng và bóng đổ.",
      "Động cơ Voxel Space sử dụng bản đồ độ cao và màu sắc cùng với một thuật toán kết xuất đơn giản, vẽ các đường thẳng đứng từ sau ra trước, có thể được tối ưu hóa để cải thiện hiệu suất.",
      "Đoạn mã của động cơ có sẵn theo giấy phép MIT, nhưng công nghệ này có thể vẫn được cấp bằng sáng chế ở một số khu vực nhất định."
    ],
    "commentSummary": [
      "VoxelSpace là một thuật toán dựng địa hình nổi bật với sự đơn giản của nó, chỉ cần chưa đến 20 dòng mã, và gợi nhớ về sự phát triển trò chơi sáng tạo trong những thời kỳ phần cứng bị giới hạn.",
      "Những trò chơi AAA hiện đại tập trung vào tối ưu hóa phức tạp và xu hướng thị trường, thường là đánh đổi sự độc đáo, trong khi các trò chơi indie và các nền tảng như PICO-8 mang lại nhiều tự do sáng tạo hơn.",
      "Mặc dù có những tiến bộ công nghệ, một số nhà phát triển và người chơi cảm thấy rằng \"phép màu\" của các trò chơi cũ đang thiếu, mặc dù các dự án sáng tạo như kết xuất voxel tiếp tục truyền cảm hứng cho sự sáng tạo."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Vẽ một đường viền trong trò chơi điện tử như thế nào",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Theo bài viết, có năm kỹ thuật để tạo đường viền trong Unity, một nền tảng phát triển game phổ biến, được sử dụng trong các trò chơi như Sable và The Last of Us. - Các kỹ thuật bao gồm Hiệu ứng Vành, Đùn Đỉnh, Bộ đệm Mờ, Thuật toán Lũ Nhảy, và Phát hiện Cạnh, mỗi kỹ thuật có những ưu điểm và nhược điểm riêng về hiệu suất và chất lượng hình ảnh. - Bài viết cung cấp cái nhìn sâu sắc về việc cân bằng các phương pháp này để đạt được thẩm mỹ trò chơi tối ưu và hỗ trợ lối chơi, kèm theo các tài nguyên bổ sung và ghi nhận cho các mô hình 3D."
    ],
    "commentSummary": [
      "Theo bài viết, các kỹ thuật tiên tiến để vẽ đường viền trong trò chơi điện tử được khám phá, nhấn mạnh sự hiệu quả của Thuật toán Jump Flood (JFA) và Trường Khoảng Cách Có Dấu (SDFs) so với các phương pháp truyền thống. - Bài viết đi sâu vào đồ họa 3D phong cách, thảo luận về các kỹ thuật kết xuất và tiềm năng sử dụng mạng nơ-ron cho ánh sáng và phong cách. - Các cộng tác viên cung cấp cái nhìn sâu sắc về sự phát triển lịch sử của cel shading trong trò chơi, như Jet Set Radio, làm nổi bật sự giao thoa đang phát triển giữa công nghệ và nghệ thuật trong đồ họa 3D."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Tôi sẽ nghỉ việc tại Washington Post",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Người viết đang rời khỏi Washington Post do tờ báo này không thể thích nghi với bối cảnh truyền thông đang phát triển và cách tiếp cận trong việc trình bày các vấn đề, mà họ cho là không hiệu quả đối với các chủ đề quan trọng như dân chủ.",
      "Truyền thông truyền thống, đặc biệt là các tờ báo địa phương, đang gặp khó khăn về tài chính, dẫn đến việc đưa tin thiên lệch và sự suy giảm niềm tin của công chúng, trong khi mạng xã hội không thể thay thế công việc nghiêm túc của báo chí.",
      "Những lo ngại được nêu ra về ảnh hưởng của các cá nhân giàu có, như Jeff Bezos, đối với các cơ quan truyền thông, và tác động của lợi ích doanh nghiệp đến vai trò của truyền thông trong việc buộc quyền lực phải chịu trách nhiệm."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity có quảng cáo",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity đã giới thiệu quảng cáo, dẫn đến các cuộc thảo luận về sự tất yếu của quảng cáo trong các dịch vụ trực tuyến do người tiêu dùng không muốn trả tiền cho trải nghiệm không có quảng cáo. - Một số người dùng thấy quảng cáo gây phiền nhiễu và thích các dịch vụ dựa trên đăng ký như Kagi, cung cấp tìm kiếm không có quảng cáo, trong khi những người khác tiếp tục chọn các tùy chọn miễn phí có hỗ trợ quảng cáo. - Tình huống này nhấn mạnh cuộc tranh luận đang diễn ra giữa các mô hình hỗ trợ quảng cáo và dựa trên đăng ký trong các dịch vụ kỹ thuật số."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
