[
  {
    "id": 42592910,
    "title": "รถวอลโว่ปี 1993 ที่ขับเคลื่อนด้วยตัวเองพร้อมระบบโอเพ่นไพลอต",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "กลุ่มเพื่อนกลุ่มหนึ่งได้เข้าร่วมการแข่งขัน Carbage Run 2025 ฉบับฤดูหนาว ซึ่งเป็นการแข่งรถ 6 วันผ่านสวีเดนไปยังวงกลมขั้วโลกและกลับมาที่เฮลซิงกิ โดยมีข้อกำหนดว่ารถต้องมีอายุอย่างน้อย 20 ปีและมีมูลค่าต่ำกว่า €1000",
      "พวกเขาได้เปลี่ยน Volvo 940 Estate ปี 1993 ให้กลายเป็นยานพาหนะขับเคลื่อนอัตโนมัติโดยใช้ openpilot จาก comma.ai รวมถึงการติดตั้งส่วนประกอบสมัยใหม่ เช่น พวงมาลัยไฟฟ้า Bosch iBooster และเซ็นเซอร์เรดาร์ของ Tesla",
      "การอัปเดตในอนาคตจะรวมถึงรายละเอียดเกี่ยวกับการเดินสายไฟ, หน่วยควบคุมเครื่องยนต์ (ECU) ที่ปรับแต่งเอง, และแผนการเปิดซอร์สโค้ด ซึ่งเน้นย้ำถึงแนวทางที่เป็นนวัตกรรมของโครงการในการปรับปรุงยานพาหนะรุ่นเก่าด้วยเทคโนโลยีอัตโนมัติ"
    ],
    "commentSummary": [
      "รถ Volvo 940 ปี 1993 ได้รับการติดตั้ง OpenPilot ซึ่งเป็นเทคโนโลยีขับเคลื่อนอัตโนมัติ แสดงให้เห็นถึงการผสมผสานระหว่างการออกแบบรถคลาสสิกกับเทคโนโลยีสมัยใหม่",
      "โครงการนี้เผชิญกับความท้าทาย รวมถึงการอัปเดตระบบเบรกและพวงมาลัย ซึ่งก่อให้เกิดความกังวลด้านกฎหมายและความปลอดภัย โดยเฉพาะอย่างยิ่งกับการดัดแปลงด้วยตนเอง เช่น การเชื่อมคอพวงมาลัย",
      "การสนทนาขยายไปถึงกฎระเบียบเกี่ยวกับรถยนต์ในยุโรป การลดลงของรถฮ็อตร็อดในสหรัฐอเมริกา และความแตกต่างทางวัฒนธรรมในเสรีภาพในการดัดแปลงรถยนต์ โดยโครงการนี้ถูกมองว่าเป็นความพยายาม DIY ที่สร้างแรงบันดาลใจแม้จะมีความกังวลด้านความปลอดภัยก็ตาม"
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: อัลกอริทึมการเรนเดอร์ภูมิประเทศในโค้ดน้อยกว่า 20 บรรทัด (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "เกม Comanche ของ NovaLogic ในปี 1992 ใช้เอนจิน Voxel Space ซึ่งเป็นเทคนิคการเรนเดอร์แบบ 2.5D ที่อิงจากการแคสต์เรย์ เพื่อสร้างภูมิประเทศที่มีรายละเอียดพร้อมการแรเงาและเงา",
      "เอนจิน Voxel Space ใช้แผนที่ความสูงและสีพร้อมกับอัลกอริธึมการเรนเดอร์แบบง่าย ๆ โดยการวาดเส้นแนวตั้งจากด้านหลังไปด้านหน้า ซึ่งสามารถปรับแต่งเพื่อเพิ่มประสิทธิภาพได้",
      "โค้ดของเครื่องยนต์มีให้ใช้งานภายใต้ใบอนุญาต MIT แต่เทคโนโลยีอาจยังคงได้รับการจดสิทธิบัตรในบางภูมิภาค"
    ],
    "commentSummary": [
      "VoxelSpace เป็นอัลกอริธึมการเรนเดอร์ภูมิประเทศที่โดดเด่นในด้านความเรียบง่าย โดยต้องการโค้ดน้อยกว่า 20 บรรทัด และกระตุ้นความคิดถึงสำหรับการพัฒนาเกมที่สร้างสรรค์ในยุคที่ฮาร์ดแวร์มีข้อจำกัด",
      "เกม AAA สมัยใหม่มุ่งเน้นไปที่การปรับแต่งที่ซับซ้อนและแนวโน้มตลาด ซึ่งมักจะแลกมาด้วยความแปลกใหม่ ในขณะที่เกมอินดี้และแพลตฟอร์มอย่าง PICO-8 มอบอิสระในการสร้างสรรค์มากกว่า",
      "แม้จะมีความก้าวหน้าทางเทคโนโลยี แต่บางนักพัฒนาและผู้เล่นรู้สึกว่า \"มนต์เสน่ห์\" ของเกมเก่าหายไป แม้ว่าโครงการนวัตกรรมอย่างการเรนเดอร์แบบ voxel ยังคงสร้างแรงบันดาลใจให้กับความคิดสร้างสรรค์"
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "วิธีการวาดเส้นขอบในวิดีโอเกม",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "บทความนี้กล่าวถึงเทคนิคห้าอย่างในการสร้างเส้นขอบใน Unity ซึ่งเป็นแพลตฟอร์มพัฒนาเกมยอดนิยม โดยเน้นการใช้งานในเกมอย่าง Sable และ The Last of Us - เทคนิคต่างๆ ประกอบด้วย Rim Effects, Vertex Extrusion, Blurred Buffer, Jump Flood Algorithm และ Edge Detection ซึ่งแต่ละเทคนิคมีข้อดีและข้อเสียเฉพาะตัวในแง่ของประสิทธิภาพและคุณภาพภาพ - บทความนี้ให้ข้อมูลเชิงลึกเกี่ยวกับการปรับสมดุลวิธีการเหล่านี้เพื่อความสวยงามของเกมและการสนับสนุนการเล่นเกมที่เหมาะสม พร้อมทั้งมีแหล่งข้อมูลเพิ่มเติมและเครดิตสำหรับโมเดล 3D ที่รวมอยู่ด้วย"
    ],
    "commentSummary": [
      "บทความนี้สำรวจเทคนิคขั้นสูงในการวาดเส้นขอบในวิดีโอเกม โดยเน้นถึงประสิทธิภาพของอัลกอริทึม Jump Flood (JFA) และ Signed Distance Fields (SDFs) เมื่อเทียบกับวิธีการแบบดั้งเดิม - มันเจาะลึกถึงกราฟิก 3D แบบสไตล์ โดยพูดคุยเกี่ยวกับเทคนิคการเรนเดอร์และการใช้เครือข่ายประสาทเทียมที่มีศักยภาพสำหรับการจัดแสงและการสไตล์ - ผู้ร่วมเขียนให้ข้อมูลเชิงลึกเกี่ยวกับการพัฒนาประวัติศาสตร์ของ cel shading ในเกม เช่น Jet Set Radio โดยเน้นถึงการบรรจบกันที่พัฒนาไปของเทคโนโลยีและศิลปะในกราฟิก 3D"
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "ฉันกำลังลาออกจากวอชิงตันโพสต์",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ผู้เขียนกำลังจะออกจาก Washington Post เนื่องจากความล้มเหลวในการปรับตัวให้เข้ากับภูมิทัศน์สื่อที่เปลี่ยนแปลงและวิธีการนำเสนอประเด็นต่าง ๆ ซึ่งพวกเขาเชื่อว่าไม่มีประสิทธิภาพสำหรับหัวข้อสำคัญเช่นประชาธิปไตย",
      "สื่อดั้งเดิม โดยเฉพาะหนังสือพิมพ์ท้องถิ่น กำลังประสบปัญหาทางการเงิน ซึ่งนำไปสู่การรายงานข่าวที่มีอคติและความเชื่อมั่นของสาธารณชนที่ลดลง ในขณะที่สื่อสังคมออนไลน์ไม่สามารถทดแทนงานที่เข้มงวดของการสื่อสารมวลชนได้",
      "มีความกังวลเกี่ยวกับอิทธิพลของบุคคลที่ร่ำรวย เช่น เจฟฟ์ เบโซส ต่อสื่อมวลชน และผลกระทบของผลประโยชน์ทางธุรกิจต่อบทบาทของสื่อในการตรวจสอบอำนาจ"
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity มีโฆษณา",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity ได้แนะนำโฆษณา ซึ่งนำไปสู่การอภิปรายเกี่ยวกับความหลีกเลี่ยงไม่ได้ของโฆษณาในบริการออนไลน์เนื่องจากผู้บริโภคไม่เต็มใจที่จะจ่ายเงินเพื่อประสบการณ์ที่ไม่มีโฆษณา - ผู้ใช้บางคนพบว่าโฆษณารบกวนและชอบบริการที่มีการสมัครสมาชิกเช่น Kagi ซึ่งเสนอการค้นหาแบบไม่มีโฆษณา ในขณะที่คนอื่น ๆ ยังคงเลือกตัวเลือกที่ฟรีและมีโฆษณาสนับสนุน - สถานการณ์นี้เน้นย้ำถึงการถกเถียงอย่างต่อเนื่องระหว่างโมเดลที่มีโฆษณาสนับสนุนและโมเดลที่มีการสมัครสมาชิกในบริการดิจิทัล"
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
