[
  {
    "id": 42592910,
    "title": "سيارة فولفو 1993 ذاتية القيادة مع نظام الطيار المفتوح",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "شارك مجموعة من الأصدقاء في سباق Carbage Run 2025 النسخة الشتوية، وهو سباق يستمر لمدة 6 أيام عبر السويد إلى الدائرة القطبية والعودة إلى هلسنكي، ويتطلب أن تكون السيارات لا تقل عن 20 عامًا وتقدر قيمتها بأقل من 1000 يورو.",
      "قاموا بتحويل سيارة فولفو 940 Estate موديل 1993 إلى مركبة ذاتية القيادة باستخدام نظام openpilot من comma.ai، مع دمج مكونات حديثة مثل نظام التوجيه الكهربائي، وiBooster من بوش، ومستشعر رادار من تسلا.",
      "ستتضمن التحديثات المستقبلية تفاصيل حول الأسلاك، ووحدة التحكم في المحرك المخصصة (ECU)، وخطط لجعل الشفرة مفتوحة المصدر، مما يبرز النهج المبتكر للمشروع في تحديث المركبات القديمة بتكنولوجيا القيادة الذاتية."
    ],
    "commentSummary": [
      "تم تعديل سيارة فولفو 940 موديل 1993 بتقنية OpenPilot، وهي تقنية قيادة ذاتية، مما يبرز التقاء تصميم السيارات الكلاسيكية مع التكنولوجيا الحديثة.",
      "واجه المشروع تحديات، بما في ذلك تحديث أنظمة الفرامل والتوجيه، مما أثار مخاوف قانونية وسلامة، خاصة مع التعديلات التي يقوم بها الأفراد بأنفسهم مثل لحام عمود التوجيه.",
      "امتدت المناقشة إلى تنظيمات السيارات في أوروبا، وتراجع سيارات الهوت رود في الولايات المتحدة، والاختلافات الثقافية في حريات تعديل السيارات، حيث يُنظر إلى المشروع كجهد ملهم في مجال الأعمال اليدوية رغم المخاوف المتعلقة بالسلامة."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: خوارزمية عرض التضاريس في أقل من 20 سطرًا من الكود (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "استخدمت لعبة Comanche التي أصدرتها NovaLogic في عام 1992 محرك Voxel Space، وهي تقنية عرض ثلاثية الأبعاد تعتمد على تقنية تتبع الأشعة، لإنشاء تضاريس مفصلة مع تظليل وظلال.",
      "استخدم محرك Voxel Space خرائط الارتفاع والألوان وخوارزمية رسم بسيطة، حيث كان يرسم خطوطًا عمودية من الخلف إلى الأمام، مما يمكن تحسينه لأداء أفضل.",
      "يتوفر كود المحرك بموجب رخصة MIT، ولكن قد تكون التكنولوجيا لا تزال محمية ببراءات اختراع في بعض المناطق."
    ],
    "commentSummary": [
      "VoxelSpace هو خوارزمية لتصيير التضاريس تتميز ببساطتها، حيث تتطلب أقل من 20 سطرًا من الشيفرة، وتثير الحنين إلى تطوير الألعاب المبتكر خلال العصور التي كانت فيها الأجهزة محدودة.",
      "تركز الألعاب الحديثة من فئة AAA على تحسينات معقدة واتجاهات السوق، غالبًا على حساب الأصالة، في حين توفر الألعاب المستقلة والمنصات مثل PICO-8 حرية إبداعية أكبر.",
      "على الرغم من التقدم التكنولوجي، يشعر بعض المطورين واللاعبين بأن \"السحر\" الذي كان في الألعاب القديمة مفقود، إلا أن المشاريع المبتكرة مثل التصيير الفوكسيلي تستمر في إلهام الإبداع."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "كيفية رسم مخطط في لعبة فيديو",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "تناقش المقالة خمس تقنيات لتقديم الخطوط العريضة في Unity، وهي منصة تطوير ألعاب شهيرة، مع تسليط الضوء على استخدامها في ألعاب مثل Sable وThe Last of Us. - تشمل التقنيات تأثيرات الحواف، بثق الرؤوس، المخزن المؤقت الضبابي، خوارزمية القفز الفيضاني، واكتشاف الحواف، ولكل منها مزايا فريدة ومقايضات من حيث الأداء والجودة البصرية. - توفر المقالة رؤى حول موازنة هذه الأساليب لتحقيق جمالية اللعبة المثلى ودعم اللعب، مع موارد إضافية وائتمانات لنماذج ثلاثية الأبعاد مرفقة."
    ],
    "commentSummary": [
      "يستكشف المقال تقنيات متقدمة لرسم الخطوط العريضة في ألعاب الفيديو، مع التركيز على كفاءة خوارزمية القفز الفيضاني (JFA) وحقول المسافة الموقعة (SDFs) مقارنة بالطرق التقليدية. - يتعمق في الرسومات ثلاثية الأبعاد ذات الطابع الخاص، مناقشًا تقنيات التصيير والاستخدام المحتمل للشبكات العصبية في الإضاءة والتصميم. - يقدم المساهمون رؤى حول التطور التاريخي لتظليل الخلايا في الألعاب، مثل Jet Set Radio، مسلطين الضوء على التقاطع المتطور بين التكنولوجيا والفن في الرسومات ثلاثية الأبعاد."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "أنا أستقيل من صحيفة واشنطن بوست",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يترك الكاتب صحيفة واشنطن بوست بسبب فشلها في التكيف مع المشهد الإعلامي المتغير ونهجها في تقديم القضايا، الذي يعتقدون أنه غير فعال بالنسبة للمواضيع الحرجة مثل الديمقراطية.",
      "تواجه وسائل الإعلام التقليدية، وخاصة الصحف المحلية، صعوبات مالية، مما يؤدي إلى تقارير متحيزة وتراجع في ثقة الجمهور، في حين لا يمكن لوسائل التواصل الاجتماعي أن تحل محل العمل الدقيق للصحافة.",
      "تُثار مخاوف بشأن تأثير الأفراد الأثرياء، مثل جيف بيزوس، على وسائل الإعلام، وتأثير المصالح التجارية على دور الإعلام في محاسبة السلطة."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "حصلت Perplexity على إعلانات",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أدخلت Perplexity الإعلانات، مما أدى إلى مناقشات حول حتمية الإعلانات في الخدمات عبر الإنترنت بسبب تردد المستهلكين في الدفع مقابل تجارب خالية من الإعلانات. - يجد بعض المستخدمين الإعلانات متطفلة ويفضلون الخدمات القائمة على الاشتراك مثل Kagi، التي تقدم بحثًا خاليًا من الإعلانات، بينما يواصل آخرون اختيار الخيارات المجانية المدعومة بالإعلانات. - يبرز هذا الوضع النقاش المستمر بين النماذج المدعومة بالإعلانات وتلك القائمة على الاشتراك في الخدمات الرقمية."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
