[
  {
    "id": 42592910,
    "title": "Αυτοοδηγούμενο Volvo του 1993 με ανοιχτό πιλότο",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "Μια ομάδα φίλων συμμετείχε στην Χειμερινή έκδοση του Carbage Run 2025, έναν 6ήμερο αγώνα ράλι μέσω της Σουηδίας προς τον πολικό κύκλο και πίσω στο Ελσίνκι, απαιτώντας τα αυτοκίνητα να είναι τουλάχιστον 20 ετών και να έχουν αξία κάτω από €1000.",
      "Μετέτρεψαν ένα Volvo 940 Estate του 1993 σε αυτοκινούμενο όχημα χρησιμοποιώντας το openpilot από την comma.ai, ενσωματώνοντας σύγχρονα εξαρτήματα όπως ηλεκτρικό τιμόνι, ένα Bosch iBooster και έναν αισθητήρα ραντάρ από Tesla.",
      "Οι μελλοντικές ενημερώσεις θα περιλαμβάνουν λεπτομέρειες για την καλωδίωση, μια προσαρμοσμένη Μονάδα Ελέγχου Κινητήρα (ECU) και σχέδια για την ανοιχτή διάθεση του κώδικα, υπογραμμίζοντας την καινοτόμο προσέγγιση του έργου για την αναβάθμιση παλαιότερων οχημάτων με αυτόνομη τεχνολογία."
    ],
    "commentSummary": [
      "Ένα Volvo 940 του 1993 εξοπλίστηκε με OpenPilot, μια τεχνολογία αυτόνομης οδήγησης, αναδεικνύοντας τη διασταύρωση του κλασικού σχεδιασμού αυτοκινήτων με τη σύγχρονη τεχνολογία.",
      "Το έργο αντιμετώπισε προκλήσεις, συμπεριλαμβανομένης της ενημέρωσης των συστημάτων φρένων και διεύθυνσης, εγείροντας νομικές και θέματα ασφάλειας, ιδιαίτερα με τροποποιήσεις DIY όπως η συγκόλληση της κολώνας διεύθυνσης.",
      "Η συζήτηση επεκτάθηκε στους κανονισμούς αυτοκινήτων στην Ευρώπη, την πτώση των hotrods στις ΗΠΑ και τις πολιτισμικές διαφορές στις ελευθερίες τροποποίησης αυτοκινήτων, με το έργο να θεωρείται ως μια εμπνευσμένη προσπάθεια DIY παρά τις ανησυχίες για την ασφάλεια."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: Αλγόριθμος απόδοσης εδάφους σε λιγότερες από 20 γραμμές κώδικα (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "Το παιχνίδι Comanche της NovaLogic το 1992 χρησιμοποίησε τη μηχανή Voxel Space, μια τεχνική απόδοσης 2.5D βασισμένη στο ray casting, για να δημιουργήσει λεπτομερείς τοπογραφίες με σκίαση και σκιές.",
      "Η μηχανή Voxel Space χρησιμοποιούσε χάρτες ύψους και χρώματος και έναν απλό αλγόριθμο απόδοσης, σχεδιάζοντας κάθετες γραμμές από πίσω προς τα εμπρός, που μπορούσαν να βελτιστοποιηθούν για απόδοση.",
      "Ο κώδικας της μηχανής είναι διαθέσιμος υπό την άδεια MIT, αλλά η τεχνολογία μπορεί να είναι ακόμα κατοχυρωμένη με δίπλωμα ευρεσιτεχνίας σε ορισμένες περιοχές."
    ],
    "commentSummary": [
      "Το VoxelSpace είναι ένας αλγόριθμος απόδοσης εδάφους που ξεχωρίζει για την απλότητά του, απαιτώντας λιγότερες από 20 γραμμές κώδικα, και προκαλεί νοσταλγία για την καινοτόμο ανάπτυξη παιχνιδιών κατά τις εποχές με περιορισμούς στο υλικό.",
      "Τα σύγχρονα παιχνίδια AAA επικεντρώνονται σε πολύπλοκες βελτιστοποιήσεις και τάσεις της αγοράς, συχνά εις βάρος της πρωτοτυπίας, ενώ τα ανεξάρτητα παιχνίδια και πλατφόρμες όπως το PICO-8 παρέχουν περισσότερη δημιουργική ελευθερία.",
      "Παρά τις τεχνολογικές εξελίξεις, κάποιοι προγραμματιστές και παίκτες αισθάνονται ότι η \"μαγεία\" των παλαιότερων παιχνιδιών λείπει, αν και καινοτόμα έργα όπως η απόδοση voxel συνεχίζουν να εμπνέουν δημιουργικότητα."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "Πώς να σχεδιάσετε ένα περίγραμμα σε ένα βιντεοπαιχνίδι",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "Το άρθρο συζητά πέντε τεχνικές για την απόδοση περιγραμμάτων στο Unity, μια δημοφιλή πλατφόρμα ανάπτυξης παιχνιδιών, επισημαίνοντας τη χρήση τους σε παιχνίδια όπως το Sable και το The Last of Us. - Οι τεχνικές περιλαμβάνουν Rim Effects, Vertex Extrusion, Blurred Buffer, Jump Flood Algorithm και Edge Detection, καθεμία με μοναδικά πλεονεκτήματα και συμβιβασμούς όσον αφορά την απόδοση και την οπτική ποιότητα. - Το άρθρο παρέχει πληροφορίες για την εξισορρόπηση αυτών των μεθόδων για βέλτιστη αισθητική παιχνιδιού και υποστήριξη παιχνιδιού, με επιπλέον πόρους και πιστώσεις για 3D μοντέλα που περιλαμβάνονται."
    ],
    "commentSummary": [
      "Το άρθρο εξερευνά προηγμένες τεχνικές για τη σχεδίαση περιγραμμάτων σε βιντεοπαιχνίδια, δίνοντας έμφαση στην αποδοτικότητα του Αλγορίθμου Άλματος Πλημμύρας (JFA) και των Υπογεγραμμένων Πεδίων Απόστασης (SDFs) σε σχέση με τις παραδοσιακές μεθόδους. - Εμβαθύνει στα στυλιζαρισμένα 3D γραφικά, συζητώντας τεχνικές απόδοσης και τη δυνητική χρήση νευρωνικών δικτύων για φωτισμό και στυλιζάρισμα. - Οι συνεισφέροντες παρέχουν πληροφορίες για την ιστορική ανάπτυξη του cel shading στα παιχνίδια, όπως το Jet Set Radio, υπογραμμίζοντας τη συνεχώς εξελισσόμενη διασταύρωση της τεχνολογίας και της τέχνης στα 3D γραφικά."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "Παρατάω την Washington Post",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Ο συγγραφέας αποχωρεί από την Washington Post λόγω της αποτυχίας της να προσαρμοστεί στο εξελισσόμενο τοπίο των μέσων ενημέρωσης και της προσέγγισής της στην παρουσίαση θεμάτων, την οποία θεωρεί αναποτελεσματική για κρίσιμα ζητήματα όπως η δημοκρατία.",
      "Τα παραδοσιακά μέσα ενημέρωσης, ιδιαίτερα οι τοπικές εφημερίδες, αντιμετωπίζουν οικονομικές δυσκολίες, οδηγώντας σε μεροληπτική αναφορά και μείωση της εμπιστοσύνης του κοινού, ενώ τα μέσα κοινωνικής δικτύωσης δεν μπορούν να αντικαταστήσουν την αυστηρή εργασία της δημοσιογραφίας.",
      "Εγείρονται ανησυχίες σχετικά με την επιρροή πλούσιων ατόμων, όπως ο Jeff Bezos, στα μέσα ενημέρωσης, και τον αντίκτυπο των εταιρικών συμφερόντων στον ρόλο των μέσων ενημέρωσης να λογοδοτούν την εξουσία."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Η Perplexity απέκτησε διαφημίσεις",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Η Perplexity έχει εισαγάγει διαφημίσεις, οδηγώντας σε συζητήσεις για την αναπόφευκτη παρουσία διαφημίσεων στις διαδικτυακές υπηρεσίες λόγω της απροθυμίας των καταναλωτών να πληρώσουν για εμπειρίες χωρίς διαφημίσεις. - Ορισμένοι χρήστες θεωρούν τις διαφημίσεις ενοχλητικές και προτιμούν υπηρεσίες με συνδρομή όπως το Kagi, που προσφέρουν αναζήτηση χωρίς διαφημίσεις, ενώ άλλοι συνεχίζουν να επιλέγουν δωρεάν επιλογές που υποστηρίζονται από διαφημίσεις. - Αυτή η κατάσταση υπογραμμίζει τη συνεχιζόμενη συζήτηση μεταξύ μοντέλων που υποστηρίζονται από διαφημίσεις και αυτών που βασίζονται σε συνδρομές στις ψηφιακές υπηρεσίες."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
