[
  {
    "id": 42592910,
    "title": "স্বয়ংচালিত ১৯৯৩ ভলভো ওপেন পাইলট সহ",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "একদল বন্ধু কারবেজ রান ২০২৫ শীতকালীন সংস্করণে অংশগ্রহণ করেছিল, যা সুইডেনের মধ্য দিয়ে মেরু বৃত্ত পর্যন্ত এবং হেলসিঙ্কিতে ফিরে আসার জন্য ৬ দিনের একটি র্যালি, যেখানে গাড়িগুলির বয়স কমপক্ষে ২০ বছর হতে হবে এবং মূল্য €১০০০ এর নিচে হতে হবে।",
      "তারা একটি ১৯৯৩ সালের ভলভো ৯৪০ এস্টেটকে স্বয়ংচালিত গাড়িতে রূপান্তরিত করেছে, কমা.এআই-এর ওপেনপাইলট ব্যবহার করে, যেখানে আধুনিক উপাদান যেমন বৈদ্যুতিক পাওয়ার স্টিয়ারিং, একটি বোশ আইবুস্টার এবং একটি টেসলা রাডার সেন্সর অন্তর্ভুক্ত করা হয়েছে।",
      "ভবিষ্যতের আপডেটগুলিতে তারের বিশদ, একটি কাস্টম ইঞ্জিন কন্ট্রোল ইউনিট (ইসিইউ) এবং কোডটি ওপেন-সোর্স করার পরিকল্পনা অন্তর্ভুক্ত থাকবে, যা পুরানো যানবাহনগুলিকে স্বয়ংক্রিয় প্রযুক্তির সাথে রেট্রোফিট করার প্রকল্পের উদ্ভাবনী পদ্ধতির উপর আলোকপাত করবে।"
    ],
    "commentSummary": [
      "একটি ১৯৯৩ সালের ভলভো ৯৪০ ওপেনপাইলট, একটি স্বয়ংক্রিয় চালনা প্রযুক্তি, দিয়ে পুনরায় সজ্জিত করা হয়েছিল, যা ক্লাসিক গাড়ির নকশা এবং আধুনিক প্রযুক্তির সংযোগকে তুলে ধরে।",
      "প্রকল্পটি চ্যালেঞ্জের সম্মুখীন হয়েছিল, যার মধ্যে ব্রেক এবং স্টিয়ারিং সিস্টেম আপডেট করা, বিশেষ করে স্টিয়ারিং কলাম ওয়েল্ডিংয়ের মতো DIY পরিবর্তনের সাথে আইনি এবং নিরাপত্তা উদ্বেগ উত্থাপন করা অন্তর্ভুক্ত ছিল।",
      "আলোচনাটি ইউরোপে গাড়ির নিয়মাবলী, মার্কিন যুক্তরাষ্ট্রে হটরডের পতন এবং গাড়ি পরিবর্তনের স্বাধীনতায় সাংস্কৃতিক পার্থক্যগুলিতে বিস্তৃত হয়েছিল, যেখানে প্রকল্পটি নিরাপত্তা উদ্বেগ সত্ত্বেও একটি অনুপ্রেরণামূলক DIY প্রচেষ্টা হিসাবে দেখা হয়েছিল।"
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "ভক্সেলস্পেস: ২০ লাইনের কম কোডে ভূখণ্ড রেন্ডারিং অ্যালগরিদম (২০২০)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "NovaLogic-এর ১৯৯২ সালের গেম Comanche Voxel Space ইঞ্জিন ব্যবহার করেছিল, যা রে কাস্টিং-এর উপর ভিত্তি করে একটি ২.৫ডি রেন্ডারিং কৌশল, যা ছায়া এবং শেডিং সহ বিস্তারিত ভূখণ্ড তৈরি করেছিল।",
      "ভক্সেল স্পেস ইঞ্জিন উচ্চতা এবং রঙের মানচিত্র এবং একটি সহজ রেন্ডারিং অ্যালগরিদম ব্যবহার করত, যা পিছন থেকে সামনে পর্যন্ত উল্লম্ব রেখা আঁকত, যা কর্মক্ষমতার জন্য অপ্টিমাইজ করা যেতে পারত।",
      "ইঞ্জিনের কোডটি এমআইটি লাইসেন্সের অধীনে উপলব্ধ, তবে প্রযুক্তিটি এখনও কিছু অঞ্চলে পেটেন্ট করা হতে পারে।"
    ],
    "commentSummary": [
      "ভক্সেলস্পেস একটি ভূখণ্ড রেন্ডারিং অ্যালগরিদম যা তার সরলতার জন্য উল্লেখযোগ্য, যা ২০ লাইনের কম কোড প্রয়োজন এবং হার্ডওয়্যার-সীমাবদ্ধ যুগে উদ্ভাবনী গেম ডেভেলপমেন্টের জন্য নস্টালজিয়া উদ্রেক করে।",
      "আধুনিক AAA গেমগুলি জটিল অপ্টিমাইজেশন এবং বাজারের প্রবণতার উপর মনোযোগ কেন্দ্রীভূত করে, যা প্রায়শই মৌলিকতার ক্ষতির কারণ হয়, যেখানে ইন্ডি গেম এবং PICO-8 এর মতো প্ল্যাটফর্মগুলি আরও সৃজনশীল স্বাধীনতা প্রদান করে।",
      "প্রযুক্তিগত অগ্রগতির পরেও, কিছু ডেভেলপার এবং খেলোয়াড় মনে করেন যে পুরনো গেমগুলোর \"জাদু\" অনুপস্থিত, যদিও ভক্সেল রেন্ডারিংয়ের মতো উদ্ভাবনী প্রকল্পগুলি সৃজনশীলতাকে অনুপ্রাণিত করতে থাকে।"
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "ভিডিও গেমে একটি আউটলাইন কীভাবে আঁকবেন",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "প্রবন্ধটি ইউনিটি, একটি জনপ্রিয় গেম ডেভেলপমেন্ট প্ল্যাটফর্মে আউটলাইন রেন্ডার করার পাঁচটি কৌশল নিয়ে আলোচনা করে, যা সেবল এবং দ্য লাস্ট অফ আস-এর মতো গেমে তাদের ব্যবহারের উপর আলোকপাত করে। - কৌশলগুলির মধ্যে রয়েছে রিম ইফেক্টস, ভার্টেক্স এক্সট্রুশন, ব্লার্ড বাফার, জাম্প ফ্লাড অ্যালগরিদম, এবং এজ ডিটেকশন, প্রতিটি পারফরম্যান্স এবং ভিজ্যুয়াল গুণমানের ক্ষেত্রে অনন্য সুবিধা এবং ট্রেড-অফ সহ। - প্রবন্ধটি এই পদ্ধতিগুলিকে ভারসাম্যপূর্ণ করার অন্তর্দৃষ্টি প্রদান করে যাতে গেমের নান্দনিকতা এবং গেমপ্লে সমর্থনের জন্য সর্বোত্তম হয়, অতিরিক্ত সম্পদ এবং 3D মডেলের জন্য ক্রেডিট সহ।"
    ],
    "commentSummary": [
      "প্রবন্ধটি ভিডিও গেমসে আউটলাইন আঁকার উন্নত কৌশলগুলি অন্বেষণ করে, যেখানে জাম্প ফ্লাড অ্যালগরিদম (JFA) এবং সাইনড ডিস্ট্যান্স ফিল্ডস (SDFs) এর দক্ষতাকে প্রচলিত পদ্ধতির তুলনায় জোর দেওয়া হয়েছে। - এটি স্টাইলাইজড 3D গ্রাফিক্সে গভীরভাবে আলোচনা করে, রেন্ডারিং কৌশল এবং আলোকসজ্জা ও স্টাইলিংয়ের জন্য নিউরাল নেটওয়ার্কের সম্ভাব্য ব্যবহারের কথা বলে। - অবদানকারীরা গেমসে সেল শেডিংয়ের ঐতিহাসিক বিকাশের অন্তর্দৃষ্টি প্রদান করেন, যেমন জেট সেট রেডিও, যেখানে 3D গ্রাফিক্সে প্রযুক্তি এবং শিল্পের ক্রমবর্ধমান সংযোগকে তুলে ধরা হয়েছে।"
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "আমি ওয়াশিংটন পোস্ট ছেড়ে দিচ্ছি",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "লেখক ওয়াশিংটন পোস্ট ছেড়ে যাচ্ছেন কারণ এটি পরিবর্তনশীল মিডিয়া প্রেক্ষাপটে খাপ খাওয়াতে ব্যর্থ হয়েছে এবং বিষয়গুলি উপস্থাপনের পদ্ধতি, যা তারা বিশ্বাস করেন যে গণতন্ত্রের মতো গুরুত্বপূর্ণ বিষয়গুলির জন্য অকার্যকর।",
      "প্রচলিত গণমাধ্যম, বিশেষ করে স্থানীয় সংবাদপত্রগুলি, আর্থিকভাবে সংগ্রাম করছে, যার ফলে পক্ষপাতদুষ্ট প্রতিবেদন এবং জনসাধারণের আস্থার হ্রাস ঘটছে, যখন সামাজিক মাধ্যম সাংবাদিকতার কঠোর কাজের বিকল্প হতে পারে না।",
      "ধনী ব্যক্তিদের, যেমন জেফ বেজোস, মিডিয়া আউটলেটগুলোর উপর প্রভাব এবং কর্পোরেট স্বার্থের কারণে ক্ষমতাকে জবাবদিহিতার মধ্যে রাখার ক্ষেত্রে মিডিয়ার ভূমিকার উপর প্রভাব নিয়ে উদ্বেগ প্রকাশ করা হয়েছে।"
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "পারপ্লেক্সিটি বিজ্ঞাপন পেয়েছে",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "পারপ্লেক্সিটি বিজ্ঞাপন চালু করেছে, যা অনলাইন পরিষেবাগুলিতে বিজ্ঞাপনের অনিবার্যতা সম্পর্কে আলোচনা শুরু করেছে কারণ গ্রাহকরা বিজ্ঞাপন-মুক্ত অভিজ্ঞতার জন্য অর্থ প্রদান করতে অনিচ্ছুক। - কিছু ব্যবহারকারী বিজ্ঞাপনকে অনধিকারপ্রবেশকারী মনে করেন এবং কাগির মতো সাবস্ক্রিপশন-ভিত্তিক পরিষেবাগুলিকে পছন্দ করেন, যা বিজ্ঞাপন-মুক্ত অনুসন্ধান প্রদান করে, অন্যদিকে অন্যরা বিনামূল্যে, বিজ্ঞাপন-সমর্থিত বিকল্পগুলি বেছে নিতে থাকে। - এই পরিস্থিতি ডিজিটাল পরিষেবাগুলিতে বিজ্ঞাপন-সমর্থিত এবং সাবস্ক্রিপশন-ভিত্তিক মডেলের মধ্যে চলমান বিতর্ককে তুলে ধরে।"
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
