[
  {
    "id": 42592910,
    "title": "오픈 파일럿이 장착된 1993년식 볼보 자율주행차",
    "originLink": "https://practicapp.com/carbagepilot-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42592910",
    "commentBody": "",
    "originSummary": [
      "친구들 그룹이 2025년 겨울 에디션 카베이지 런에 참가했습니다. 이 행사는 스웨덴을 통해 북극권까지 갔다가 헬싱키로 돌아오는 6일간의 랠리로, 참가 차량은 최소 20년 이상 된 차량이어야 하며 가치가 €1000 이하이어야 합니다.",
      "그들은 1993년식 볼보 940 에스테이트를 comma.ai의 오픈파일럿을 사용하여 자율주행 차량으로 변환했으며, 전자식 파워 스티어링, 보쉬 iBooster, 테슬라 레이더 센서와 같은 현대적인 부품을 통합했습니다.",
      "향후 업데이트에는 배선, 맞춤형 엔진 제어 장치(ECU)에 대한 세부 정보와 코드 오픈 소스 계획이 포함되어 있으며, 이는 오래된 차량에 자율 주행 기술을 장착하는 프로젝트의 혁신적인 접근 방식을 강조합니다."
    ],
    "commentSummary": [
      "1993년식 볼보 940에 자율주행 기술인 오픈파일럿이 장착되어 고전적인 자동차 디자인과 현대 기술의 교차점을 강조하고 있다.",
      "프로젝트는 브레이크 및 조향 시스템의 업데이트를 포함한 여러 도전에 직면했으며, 특히 조향 칼럼을 용접하는 DIY 수정과 같은 경우 법적 및 안전 문제를 제기했습니다.",
      "논의는 유럽의 자동차 규제, 미국에서의 핫로드 감소, 자동차 개조 자유에 대한 문화적 차이로 확장되었으며, 이 프로젝트는 안전 문제에도 불구하고 영감을 주는 DIY 노력으로 간주되었습니다."
    ],
    "points": 384,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735972224
  },
  {
    "id": 42588956,
    "title": "VoxelSpace: 20줄 미만의 코드로 구현된 지형 렌더링 알고리즘 (2020)",
    "originLink": "https://github.com/s-macke/VoxelSpace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42588956",
    "commentBody": "",
    "originSummary": [
      "NovaLogic의 1992년 게임 Comanche는 Voxel Space 엔진을 사용하여 레이 캐스팅에 기반한 2.5D 렌더링 기법으로 음영과 그림자가 있는 상세한 지형을 만들었습니다.",
      "Voxel Space 엔진은 높이 및 색상 맵과 간단한 렌더링 알고리즘을 사용하여 뒤에서 앞으로 수직선을 그렸으며, 이는 성능 최적화를 위해 조정될 수 있었습니다.",
      "엔진의 코드는 MIT 라이선스 하에 제공되지만, 기술은 여전히 특정 지역에서 특허를 받을 수 있습니다."
    ],
    "commentSummary": [
      "VoxelSpace는 20줄 미만의 코드로 구현할 수 있는 간단함으로 유명한 지형 렌더링 알고리즘으로, 하드웨어가 제한된 시대의 혁신적인 게임 개발에 대한 향수를 불러일으킵니다.",
      "현대 AAA 게임은 종종 독창성을 희생하면서 복잡한 최적화와 시장 동향에 중점을 두는 반면, 인디 게임과 PICO-8과 같은 플랫폼은 더 많은 창의적 자유를 제공합니다.",
      "기술 발전에도 불구하고 일부 개발자와 플레이어들은 구형 게임의 '마법'이 사라졌다고 느끼지만, 복셀 렌더링과 같은 혁신적인 프로젝트는 여전히 창의력을 고취시키고 있다."
    ],
    "points": 302,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735934489
  },
  {
    "id": 42593614,
    "title": "비디오 게임에서 윤곽선을 그리는 방법",
    "originLink": "https://ameye.dev/notes/rendering-outlines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42593614",
    "commentBody": "",
    "originSummary": [
      "이 기사는 인기 있는 게임 개발 플랫폼인 유니티에서 윤곽선을 렌더링하는 다섯 가지 기법을 논의하며, Sable과 The Last of Us와 같은 게임에서의 사용을 강조합니다. - 기법에는 Rim Effects, Vertex Extrusion, Blurred Buffer, Jump Flood Algorithm, Edge Detection이 포함되며, 각각 성능과 시각적 품질 측면에서 고유한 장점과 절충점을 가지고 있습니다. - 이 기사는 최적의 게임 미학과 게임 플레이 지원을 위해 이러한 방법을 균형 있게 사용하는 방법에 대한 통찰력을 제공하며, 추가 리소스와 3D 모델에 대한 크레딧도 포함되어 있습니다."
    ],
    "commentSummary": [
      "이 기사는 비디오 게임에서 윤곽선을 그리는 고급 기술을 탐구하며, 전통적인 방법보다 점프 플러드 알고리즘(JFA)과 서명 거리 필드(SDF)의 효율성을 강조합니다. - 스타일화된 3D 그래픽을 깊이 있게 다루며, 렌더링 기술과 조명 및 스타일링을 위한 신경망의 잠재적 사용에 대해 논의합니다. - 기고자들은 Jet Set Radio와 같은 게임에서 셀 셰이딩의 역사적 발전에 대한 통찰력을 제공하며, 3D 그래픽에서 기술과 예술의 진화하는 교차점을 강조합니다."
    ],
    "points": 290,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1735982068
  },
  {
    "id": 42591221,
    "title": "저는 워싱턴 포스트를 그만둡니다",
    "originLink": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42591221",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "그 저자는 워싱턴 포스트가 변화하는 미디어 환경에 적응하지 못하고 문제를 제시하는 접근 방식이 비효율적이라고 믿기 때문에 민주주의와 같은 중요한 주제에 대해 떠나고 있습니다.",
      "전통적인 미디어, 특히 지역 신문은 재정적으로 어려움을 겪고 있어 편향된 보도와 대중의 신뢰 하락을 초래하고 있으며, 소셜 미디어는 저널리즘의 철저한 작업을 대체할 수 없습니다.",
      "부유한 개인, 예를 들어 제프 베조스와 같은 인물들이 미디어 매체에 미치는 영향과 기업의 이익이 권력을 책임지게 하는 미디어의 역할에 미치는 영향에 대한 우려가 제기되고 있습니다."
    ],
    "points": 251,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1735952515
  },
  {
    "id": 42589863,
    "title": "Perplexity에 광고가 생겼다",
    "originLink": "https://twitter.com/damengchen/status/1875296442417607072",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42589863",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Perplexity는 광고를 도입하여, 소비자들이 광고 없는 경험을 위해 비용을 지불하는 것을 꺼리기 때문에 온라인 서비스에서 광고의 불가피성에 대한 논의를 불러일으켰습니다. - 일부 사용자는 광고가 성가시다고 느끼며 광고 없는 검색을 제공하는 Kagi와 같은 구독 기반 서비스를 선호하는 반면, 다른 사람들은 여전히 무료로 광고가 지원되는 옵션을 선택합니다. - 이 상황은 디지털 서비스에서 광고 지원 모델과 구독 기반 모델 간의 지속적인 논쟁을 강조합니다."
    ],
    "points": 209,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1735941282
  }
]
