[
  {
    "id": 42259278,
    "title": "Zararlı yazılım, ThinkPad X230 üzerinde gösterildiği gibi, web kamerası LED'ini kapatabilir ve video kaydedebilir.",
    "originLink": "https://github.com/xairy/lights-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259278",
    "commentBody": "",
    "originSummary": [
      "Depo, bir ThinkPad X230 üzerindeki web kamerası LED'ini manipüle etmek için araçlar sunarak, kötü amaçlı yazılımların LED bildirimi olmadan video kaydedebileceğini göstermektedir. - Süreç, USB üzerinden web kamerası yazılımını yeniden flaşlamayı içerir; bu teknik, yazılım manipülasyonu ve LED kontrolü için betikler kullanılarak çeşitli dizüstü bilgisayarlara uygulanabilir. - Web kamerası, bir Ricoh R5U8710 kontrolcüsü kullanır ve yeniden flaşlama web kamerasına zarar verebileceğinden dikkatli olunması tavsiye edilir; daha fazla bilgi, POC 2024'teki \"Lights Out\" konuşmasında mevcuttur."
    ],
    "commentSummary": [
      "Zararlı yazılımlar, bir ThinkPad X230 üzerinde gösterildiği gibi, kullanıcı bilgisi olmadan web kamerası LED'lerini devre dışı bırakma ve video kaydetme yeteneğine sahiptir. MacBook'ların aksine, kamera kullanımını sinyal veren donanımsal LED'lere sahip olan birçok diğer dizüstü bilgisayar bu özelliğe sahip değildir, bu da gizlilik endişelerini artırmaktadır. Güvenliği artırmak için uzmanlar, yetkisiz erişimi önlemek ve hassas bilgileri korumak amacıyla web kameraları ve mikrofonlar için fiziksel kapaklar veya anahtarlar kullanmayı önermektedir."
    ],
    "points": 915,
    "commentCount": 482,
    "retryCount": 0,
    "time": 1732738255
  },
  {
    "id": 42264427,
    "title": "Hetzner, ABD VPS'lerinde trafiği azaltıyor",
    "originLink": "https://news.ycombinator.com/item?id=42264427",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264427",
    "commentBody": "",
    "originSummary": [
      "ABD'nin Ashburn ve Hillsboro bölgelerindeki Bulut sunucuları (CCX ve CPX hatları) ve Yük dengeleyiciler için tarife yapısı güncelleniyor. - Yeni fiyatlar ve trafik miktarları, 1 Aralık 2024'ten itibaren yeni oluşturulan ve yeniden ölçeklendirilen sunucular için geçerli olacak, mevcut sunucular ise 1 Şubat 2025'ten itibaren değişiklikleri görecek. - Güncelleme, yerel koşullara dayalı olarak daha adil fiyatlandırma sağlamayı amaçlarken, trafik aşım fiyatları değişmeden kalacak."
    ],
    "commentSummary": [
      "Hetzner, ABD'deki Bulut sunucuları ve Yük dengeleyicileri için fiyatlandırma modelini revize ediyor, dahil edilen trafiği 20TB'den 1TB'ye kadar düşürüyor ve fiyatları artırıyor.",
      "Değişiklikler, düşük ve yüksek kaynak kullanıcıları arasında maliyetleri dengelemeyi amaçlayarak, yeni sunucular için Aralık 2024'te ve mevcut olanlar için Şubat 2025'te yürürlüğe girecek.",
      "Karar, adalet ve iş stratejileri hakkında tartışmalara yol açtı, bazı kullanıcılar dahil edilen trafikteki keskin azalmadan memnun değil."
    ],
    "points": 236,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1732792964
  },
  {
    "id": 42264733,
    "title": "Avustralya: Senato yasaları geçirdikten sonra 16 yaş altı çocukların sosyal medyaya girmesi yasaklanacak",
    "originLink": "https://www.abc.net.au/news/2024-11-28/social-media-age-ban-passes-parliament/104647138",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264733",
    "commentBody": "",
    "originSummary": [
      "Avustralya, 16 yaşın altındaki çocukların sosyal medya kullanmasını yasaklayan yeni bir yasayı kabul etti, bu da zihinsel sağlığı korumayı amaçlıyor.",
      "Uyum sağlamak için sosyal medya şirketlerinin bir yılı var, uyumsuzluk durumunda 50 milyon dolara kadar para cezası ile karşı karşıya kalacaklar, ancak kullanıcılar ve ebeveynler herhangi bir ceza ile karşılaşmayacak.",
      "Yasa, mesajlaşma uygulamaları, çevrimiçi oyunlar veya eğitim hizmetleri için geçerli değildir ve ruh sağlığı uzmanları, politikacılar ve teknoloji şirketlerinden karışık tepkiler almıştır."
    ],
    "commentSummary": [
      "Avustralya, 16 yaşın altındaki çocukların sosyal medya kullanımını yasaklamaya hazırlanıyor ve bu durum, yaş doğrulaması için kimlik doğrulaması gerektirecek, bu da gizlilik endişelerini tetikledi.",
      "Eleştirmenler, bunun hükümete sosyal medya verilerine erişim sağlayabileceğinden ve kullanıcı anonimliğini azaltabileceğinden endişe ediyor, bazıları ise geleneksel medyanın sosyal medya rekabetini sınırlamak için yasayı desteklediğini öne sürüyor.",
      "Yasanın etkinliği ve uygulanması belirsiz olup, uygulanmasında potansiyel boşluklar ve zorluklar bulunmaktadır."
    ],
    "points": 234,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1732796901
  },
  {
    "id": 42259184,
    "title": "QwQ: Alibaba'nın O1 Benzeri Akıl Yürütme LLM'si",
    "originLink": "https://qwenlm.github.io/blog/qwq-32b-preview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259184",
    "commentBody": "",
    "originSummary": [
      "QwQ (Sorularla Qwen), merak ve felsefi sorgulama ile problemleri keşfetmek için tasarlanmış, sürekli olarak varsayımlarını sorgulayan bir yapay zeka modelidir.",
      "QwQ, dil karışımı ve yinelemeli akıl yürütme döngüleri gibi sınırlamalara rağmen, GPQA, AIME, MATH-500 ve LiveCodeBench gibi ölçütlerde yüksek puanlar elde ederek teknik alanlarda üstünlük sağlar.",
      "Model, matematik ve programlamada güçlü problem çözme yetenekleri sergileyerek, AI akıl yürütme ve makine zekasını anlama yolculuğuna katkıda bulunmaktadır."
    ],
    "commentSummary": [
      "Alibaba'nın QwQ'su, bir akıl yürütme büyük dil modeli (LLM), MacBook'lar da dahil olmak üzere çeşitli donanımlarda etkileyici performansı ve karmaşık görevleri ayrıntılı açıklamalarla çözme yeteneği ile dikkat çekiyor.",
      "QwQ ile ilgili tartışmalar, donanım gereksinimlerini, hassas konularda potansiyel sansür sorunlarını ve bazı sınırlamaları olmasına rağmen açıklık ve akıl yürütme yeteneklerini içerir.",
      "Açık kaynaklı LLM'lerin daha geniş etkilerini ve yapay zeka geliştirme alanındaki rekabetçi dinamikleri vurgulayan bir konuşma."
    ],
    "points": 233,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1732737625
  },
  {
    "id": 42263834,
    "title": "Yazının Övgüsü: Epistemolojik Çöküş Çağında Okumak Esastır",
    "originLink": "https://lithub.com/in-praise-of-print-why-reading-remains-essential-in-an-era-of-epistemological-collapse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42263834",
    "commentBody": "",
    "originSummary": [
      "Ed Simon, Sven Birkerts'in \"The Gutenberg Elegies\" eserine atıfta bulunarak, basılı okumanın kalıcı önemini vurguluyor ve dijital medyanın derin okuma ve yanlış bilgilendirme üzerindeki etkileri konusundaki endişelere dikkat çekiyor.",
      "Simon, basılı kitapların dijital medyanın tekrarlayamayacağı benzersiz, sürükleyici bir deneyim sunduğunu, internetin sürekli gürültüsünden uzaklaşarak iç gözlem ve mahremiyeti teşvik ettiğini savunuyor.",
      "Okuryazarlığı ve derin okumayı korumanın, bireysel düşünceyi sürdürmek ve dijital teknolojinin yaygın etkisine direnmek için hayati olduğunu sonucuna varıyor."
    ],
    "commentSummary": [
      "Basılı ve dijital okuma arasındaki tartışma, dijital medyanın içerikle derinlemesine etkileşim üzerindeki etkileri konusundaki endişelere odaklanmaktadır. Dijital okuma savunucuları, kolaylık ve erişilebilirliği öne sürerken, eleştirmenler bunun eleştirel düşünme ve dikkat süreleri üzerindeki etkilerinden endişe duymaktadır. Bu tartışma, teknolojinin bilgi tüketimi üzerindeki etkisi ve teknolojik ilerleme ile geleneksel bilgi edinimi arasındaki denge gibi daha geniş konuları yansıtmaktadır."
    ],
    "points": 225,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732785781
  },
  {
    "id": 42261909,
    "title": "Voice-Pro – AI Ses Klonlama Sihri: Herhangi Bir Sesi 15 Saniyede Dönüştürün",
    "originLink": "https://github.com/abus-aikorea/voice-pro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261909",
    "commentBody": "",
    "originSummary": [
      "Voice-Pro, sıfırdan ses klonlama ve 50'den fazla ünlü sesi içeren bir ses değiştirici de dahil olmak üzere gelişmiş ses manipülasyonu için tasarlanmış açık kaynaklı bir Gradio WebUI'dir.",
      "Whisper motorlarını kullanarak YouTube ses indirme, vokal izolasyonu, çok dilli metin okuma ve çeviri gibi özellikler sunar.",
      "Voice-Pro, içerik oluşturucular, geliştiriciler ve ses meraklıları için özellikle faydalıdır; GitHub'da kaynaklar ve YouTube'da video eğitimleri mevcuttur."
    ],
    "commentSummary": [
      "Voice-Pro, 15 saniyede ses klonlamayı mümkün kılan açık kaynaklı bir yapay zeka aracıdır ve sıfırdan ses klonlama ile 50'den fazla ünlü sesine sahip bir ses değiştirici özelliğine sahiptir. YouTube ses indirme, vokal izolasyonu ve çok dilli metin okuma ve çeviri gibi işlevleri içerir ve Whisper motorları tarafından desteklenmektedir, GitHub'da mevcuttur. Yaratıcı potansiyeline rağmen, kimlik hırsızlığı ve dolandırıcılık için kötüye kullanım endişeleri bulunmaktadır ve şu anda Linux veya MacOS desteği yoktur, kurulum ve gizli maliyetler hakkında sorular bulunmaktadır."
    ],
    "points": 197,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1732761421
  },
  {
    "id": 42260027,
    "title": "Londra'nın 850 yıllık gıda pazarları kapanacak",
    "originLink": "https://www.bbc.co.uk/news/articles/cje050wz22qo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260027",
    "commentBody": "",
    "originSummary": [
      "Londra'nın tarihi Smithfield ve Billingsgate pazarları, 850 yıllık geçmişleriyle önemli olan, City of London Corporation'ın desteğini çekmesiyle 2028 yılına kadar kapanacak. İngiltere'nin en büyük toptan et ve iç su balığı pazarları olarak bilinen bu pazarlar, yeni gelişmelerle değiştirilecek ve tüccarlara tazminat ve taşınma yardımı sağlanacak. Pazarların Dagenham'a taşınma planları yüksek maliyetler nedeniyle terk edildi ve bu durum Londra'da balık arzının geleceği hakkında endişeleri artırarak bir geleneğin kaybını işaret ediyor."
    ],
    "commentSummary": [
      "Londra'nın tarihi gıda pazarları, Smithfield ve Billingsgate gibi, kapanmayı planlıyor ve City of London Corporation bunu tüccarlar için \"olumlu yeni bir bölüm\" olarak tanıtıyor.- Eleştirmenler, kapanışların gayrimenkul gelişimini kolaylaştırmak ve bölgeyi ticari bir merkez haline getirmek amacıyla yapıldığını öne sürerek kültürel miras kaybı konusunda endişelerini dile getiriyor.- Karar, yerel işletmeler üzerindeki potansiyel olumsuz etkiyle ilgili endişelerle birlikte parlamento onayını bekliyor."
    ],
    "points": 192,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1732743398
  },
  {
    "id": 42262734,
    "title": "picoCAD – küçük modeller için küçük bir modelleyici",
    "originLink": "https://store.steampowered.com/app/2800590/picoCAD/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42262734",
    "commentBody": "",
    "originSummary": [
      "picoCAD, retro tarzı modeller oluşturmak için bir 3D modelleme aracı, Apskeppet tarafından 27 Kasım 2024'te hem yeni başlayanlar hem de uzmanlar için piyasaya sürüldü.- Araç, Windows ve macOS için mevcut olup, 4 Aralık 2024'e kadar tanıtım fiyatı olarak 5,09 $'a sunulmaktadır.- Kullanıcılar, picoCAD ile yaratıcılıklarını artırmak için topluluğa katılmaya ve eğitimleri keşfetmeye teşvik edilmektedir."
    ],
    "commentSummary": [
      "picoCAD, özellikle düşük poli modeller oluşturmak için basitliği ve kullanım kolaylığı nedeniyle tercih edilen, daha karmaşık yazılımlar olan Blender gibi programlara kıyasla daha basit bir 3D modelleme aracıdır.- Johan Peitz tarafından geliştirilen picoCAD, obj/mtl formatlarına dışa aktarmaya izin verir, ancak Picotron üzerinde yerel ikili dışa aktarma özelliği yoktur.- Kullanıcılar, benzersiz estetiği ve sadeliği nedeniyle onu Crocotile ve Kenney Shape gibi diğer araçlarla sıkça karşılaştırmaktadır."
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1732772100
  },
  {
    "id": 42260030,
    "title": "Yüzen Kendi Kendine Etiketleme",
    "originLink": "https://arxiv.org/abs/2411.16544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260030",
    "commentBody": "",
    "originSummary": [
      "Makale, veri alanından ödün vermeden dinamik diller için bellek düzenini optimize eden, 64 bitlik nesneler içinde tür bilgilerini kodlamak için bir yöntem olan \"kendi kendine etiketleme\"yi tanıtmaktadır.",
      "Öz etiketleme, Scheme'de 2.3 kat ve JavaScript'te 2.7 kat daha hızlı çalışarak, işaretli işaretçiler ve NaN etiketleme gibi mevcut yöntemlere daha verimli bir alternatif sunarak, kayan nokta ağırlıklı kıyaslamalarda yürütme süresini iyileştirir.",
      "Bu yaklaşım, hem verilerin hem de türün verimli bir şekilde kodlanmasına olanak tanır, performansı artırırken diğer işlemleri etkilemez ve dinamik dillerde 64-bit IEEE754 çift hassasiyetli kayan nokta sayılarının işlenmesi için umut verici bir çözüm sunar."
    ],
    "commentSummary": [
      "Makale, dinamik programlama dillerinde float depolamayı optimize etmeyi amaçlayan ve yüksek bitleri etiketleme için kullanarak çoğu float'ın kutusuz kalmasına ve performansın iyileştirilmesine olanak tanıyan bir teknik olan \"Float Self-Tagging\"i tanıtmaktadır.",
      "Makalenin eleştirmenleri, karşılaştırmalarının kusurlu olduğunu ve NaN (Sayı Değil) değerlerinde ek bilgileri kodlamak için bir teknik olan NaN etiketleme gibi yerleşik yöntemlere karşı test edilmesini önermektedir.",
      "Teknik, sadeliği ve potansiyeli ile dikkat çekiyor; benzer yöntemler Koka ve CRuby gibi dillerde zaten uygulanmış durumda ve Apple'ın Objective-C'si ve Java Sanal Makinesi (JVM) gibi sistemlerde ilgili optimizasyonlar görülüyor."
    ],
    "points": 164,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1732743412
  },
  {
    "id": 42260017,
    "title": "Bir kanser ilacını Büyük İlaç Şirketleri olmadan geliştirmek: bu hastane bunun yapılabileceğini gösteriyor",
    "originLink": "https://www.ftm.nl/artikelen/ruzie-tussen-ziekenhuis-en-farma-industrie-over-goedkeuring-kankermedicijn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260017",
    "commentBody": "",
    "originSummary": [
      "Artan sağlık hizmetleri maliyetleri Hollanda'da bürokrasi, israf ve gereksiz bakıma atfedilmekte olup, sistemik verimsizlikleri vurgulamaktadır.",
      "Hollandalı bir hastane, büyük ilaç şirketlerinden bağımsız olarak bir kanser ilacı geliştirdi ve bu, benzer bir Amerikan tedavisinden beş kat daha ucuz bir tedavi sunarak, kâr amacı gütmeyen hastanelerin sağlık maliyetlerini düşürme potansiyelini gösterdi.",
      "Yeniliğe rağmen, pahalı ve karmaşık Avrupa İlaç Ajansı (EMA) kayıt süreci hastaneleri caydırıyor; ancak AVL hastanesi, pahalı ilaç rekabetine karşı uygun fiyatlı tedavilerini sürdürmek amacıyla EMA onayını hedefleyerek bağışlar yoluyla bir faz 3 çalışmasını finanse etti."
    ],
    "commentSummary": [
      "Bir hastane, büyük ilaç şirketlerinin katılımı olmadan ilaç geliştirme sürecinin gerçekleşebileceğini göstererek bağımsız olarak bir kanser ilacı geliştirmeyi başardı.- Geleneksel ilaç geliştirme süreci, maliyetli olması ve ego ile politika gibi bilim dışı faktörlerden etkilenmesi nedeniyle eleştirilmektedir.- Tartışma, ilaç geliştirmedeki karmaşıklıklara, düzenleyici zorluklara ve klinik denemeler sırasında ilaçların yüksek başarısızlık oranına vurgu yapmaktadır."
    ],
    "points": 154,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1732743349
  },
  {
    "id": 42261053,
    "title": "MIT Alüminyum Bisiklet Projesi 1974 (2016)",
    "originLink": "https://www.sheldonbrown.com/AluminumBikeProject.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261053",
    "commentBody": "",
    "originSummary": [
      "1974 yılında M.I.T., Marc Rosenbaum ve Harriet Fell'in de aralarında bulunduğu katılımcıların alüminyum bisiklet çerçeveleri inşa ettiği bir kursa ev sahipliği yaptı. Rosenbaum'un tasarımı, o dönemdeki en hafif pist bisikleti oldu. 6061-T6 alüminyum ve titanyumdan yapılan Rosenbaum'un bisikleti, daha büyük çaplı tüpler ve hassas rulmanlar içeriyordu, 12 lbs. 5 oz. ağırlığındaydı ve şu anda M.I.T. Müzesi'nde sergileniyor. Harriet Fell'in çerçevesi, Cannondale ve Klein arasında bir patent anlaşmazlığına karıştı; Cannondale, Klein'in patentine karşı önceden var olan bir sanat eseri olduğunu iddia ederek bu çerçeveyi kullandı."
    ],
    "commentSummary": [
      "1974 yılında MIT, bisiklet çerçeveleri için alüminyumu değerlendirdi, magnezyumun kırılganlığı ve korozyon sorunları nedeniyle reddetti, ancak modern magnezyum alaşımları LPSO gibi potansiyel gösteriyor. Kirk'ünki gibi magnezyum çerçevelerle yapılan tarihsel denemeler, genellikle malzeme zayıflıkları nedeniyle başarısız oldu, oysa karbon fiber ve titanyum güç ve esneklikleri nedeniyle tercih ediliyor. Malzemelerdeki gelişmelere rağmen, ağırlık bisiklet tasarımında odak noktası olmaya devam ediyor ve aerodinamik ile sürücü konforuna artan bir vurgu yapılıyor."
    ],
    "points": 152,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1732751978
  },
  {
    "id": 42261707,
    "title": "Dell, web sitelerine imzasız güncellemeler yüklüyor ve bu güncellemeler yüklenemiyor.",
    "originLink": "https://infosec.exchange/@0xabad1dea/113543212666056329",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261707",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Dell, web sitelerinde imzasız güncellemeler yayınlıyor, bu da kurulum hatalarına yol açıyor ve bilgisayar korsanları tarafından potansiyel istismar konusunda güvenlik endişeleri yaratıyor.",
      "Kullanıcılar, güncelleme katalogları ve imzaları arasında uyumsuzluklar bildirdi, bazı sorunlar şikayetlerin ardından çözüldü, ancak Dell'in güncelleme yönetimiyle ilgili eleştiriler devam ediyor.",
      "Durum, Apple ve Linux dahil olmak üzere çeşitli platformlarda güvenlik ve güvenilirliği sağlamak için yazılım güncellemelerinin doğrulanmasının kritik önemini vurgulamaktadır."
    ],
    "points": 150,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732759401
  },
  {
    "id": 42260364,
    "title": "IBM'in Otomatik Fabrikayı Nasıl İcat Ettiğinin Unutulmuş Hikayesi",
    "originLink": "https://spectrum.ieee.org/semiconductor-fabrication",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260364",
    "commentBody": "",
    "originSummary": [
      "1970 yılında, IBM'den Bill Harding, entegre devreleri (IC'ler) bir günden kısa sürede üretmek amacıyla wafer-fabrikasyonunu otomatikleştirmeyi hedefleyen Proje SWIFT'i başlattı, bu da tipik olarak bir ay süren sürecin önemli ölçüde kısaltılması anlamına geliyordu. SWIFT, katman başına 5 saatlik bir dönüş süresi elde etti, bu hala aşılamamış bir başarıdır ve modern yarı iletken üretiminin temeli olan otomatik işleme ve gerçek zamanlı kontrol gibi yenilikler getirdi. Kısa ömrüne rağmen, Proje SWIFT'in ilerlemeleri ve Harding'in vizyoner liderliği, yarı iletken üretim tekniklerinin evrimini önemli ölçüde etkiledi."
    ],
    "commentSummary": [
      "IBM, bir zamanlar otomatik üretimde öncülük ederek, ham maddelerden yazılıma kadar tam dikey entegrasyon hedefliyor ve özel çipleri standart seçeneklerden daha uygulanabilir hale getiriyordu. Teknolojiyi ilerletmenin yüksek maliyetleri nedeniyle, IBM de dahil olmak üzere birçok şirket üretimi dış kaynaklara devretmiş veya üretim tesislerini ayırmıştır. Jim Keller'in Atomic Semi gibi mevcut çabalar, küçük üretim serilerini ekonomik hale getirmeye odaklanarak, maliyetleri düşürmek ve özel silikon erişimini iyileştirmek için yapılandırılmış ASIC'ler (Uygulamaya Özel Entegre Devreler) ve maskesiz litografi gibi yenilikleri araştırmaktadır."
    ],
    "points": 147,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1732745938
  },
  {
    "id": 42259133,
    "title": "ABD telif hakkı ofisi, oyun koruma için büyük bir çabayı reddetti.",
    "originLink": "https://www.gamesradar.com/games/publishers-are-absolutely-terrified-preserved-video-games-would-be-used-for-recreational-purposes-so-the-us-copyright-office-has-struck-down-a-major-effort-for-game-preservation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259133",
    "commentBody": "",
    "originSummary": [
      "ABD Telif Hakkı Ofisi, Video Oyun Tarihi Vakfı (VGHF) ve Yazılım Koruma Ağı tarafından yürütülen üç yıllık bir kampanyayı sonuçlandırarak, kütüphanelerin korunmuş video oyunlarına dijital erişimi uzaktan paylaşmasına izin vermeyi amaçlayan bir DMCA muafiyet talebini reddetti.",
      "Önerilen muafiyet, tarihçiler ve araştırmacılar için baskısı tükenmiş oyunlara erişim sağlayacak bir dijital kütüphaneyi kolaylaştıracaktı, ancak endüstri gruplarının öne sürdüğü potansiyel eğlence amaçlı kullanım ve piyasa zararına ilişkin endişeler nedeniyle reddedildi.",
      "VGHF, kararı sanayi lobiciliğinin etkisi altında kalmakla eleştirerek, sanayi çıkarlarını tarihi oyunlara kamu erişiminin önüne koyduğu için hayal kırıklığını dile getirdi."
    ],
    "commentSummary": [
      "ABD Telif Hakkı Ofisi, bu oyunların korunma yerine eğlence amaçlı kullanılabileceği endişesi nedeniyle video oyunlarını korumayı amaçlayan bir teklifi reddetti.",
      "Bu karar, eski oyunların modern oyunlara kıyasla daha fazla keyif ve nostalji sağladığını savunan retro oyun meraklıları arasında tartışmalara yol açtı.",
      "Kararın eleştirmenleri, mevcut telif hakkı yasalarının aşırı derecede kısıtlayıcı olduğunu, kültürel ve tarihi medyanın korunmasını engellediğini düşünüyor ve telif hakkı sürelerinin kısaltılarak yeniliğin teşvik edilmesini ve eski eserlerin daha erken kamu malı haline gelmesini öneriyorlar."
    ],
    "points": 140,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1732737261
  },
  {
    "id": 42259185,
    "title": "Plastisiteden önceki sinirsel aktiviteyi çıkarsamak, geri yayılımın ötesinde öğrenme için",
    "originLink": "https://www.nature.com/articles/s41593-023-01514-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259185",
    "commentBody": "",
    "originSummary": [
      "Makale, öğrenmede geleneksel geri yayılım yöntemine alternatif olarak yeni bir kredi atama ilkesi olan \"olası yapılandırma\"yı tanıtmaktadır.",
      "Öngörülen yapılandırma, sinir ağlarının sinaptik ağırlıkları ayarlamadan önce istenen sinirsel aktivite kalıplarını tahmin etmesini içerir, bu da öğrenmede verimliliği ve etkililiği artırır.",
      "Bu yöntem, insan ve hayvan çalışmalarında gözlemlenen sinirsel aktiviteyle daha yakından uyum sağlar ve geri yayılıma göre hem biyolojik hem de yapay öğrenme sistemlerinde avantajlar sunabilir."
    ],
    "commentSummary": [
      "Yeni bir teori olan \"olası yapılandırma\", beynin kredi atama problemini nasıl ele aldığını açıklamak için önerilmektedir ve bu, yapay sinir ağlarında (YSA'lar) kullanılan geri yayılım yönteminden farklıdır.",
      "Teori, sinaptik ağırlık değişikliklerinden önce nöral aktivite değişikliklerinin geldiğini öne sürer, bu da ağırlık değişikliklerinin değişen nöral aktiviteye yol açtığı geri yayılım ile çelişir.",
      "Bu yaklaşım, biyolojik süreçlerle daha iyi uyum sağlayabilir ve daha verimli öğrenme algoritmalarının geliştirilmesine dair içgörüler sunabilir, AI ve insan beyni öğrenme benzerlikleri ve farklılıkları üzerine tartışmalara katkıda bulunabilir."
    ],
    "points": 138,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1732737627
  }
]
