[
  {
    "id": 42259278,
    "title": "मैलवेयर वेबकैम की एलईडी को बंद कर सकता है और वीडियो रिकॉर्ड कर सकता है, जैसा कि थिंकपैड X230 पर प्रदर्शित किया गया है।",
    "originLink": "https://github.com/xairy/lights-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259278",
    "commentBody": "",
    "originSummary": [
      "यह रिपॉजिटरी थिंकपैड X230 पर वेबकैम LED को नियंत्रित करने के उपकरण प्रदान करती है, यह दर्शाते हुए कि कैसे मैलवेयर संभावित रूप से बिना LED सूचना के वीडियो रिकॉर्ड कर सकता है। - इस प्रक्रिया में USB के माध्यम से वेबकैम फर्मवेयर को फिर से फ्लैश करना शामिल है, एक तकनीक जो विभिन्न लैपटॉप पर लागू की जा सकती है, फर्मवेयर हेरफेर और LED नियंत्रण के लिए स्क्रिप्ट का उपयोग करके। - वेबकैम एक Ricoh R5U8710 नियंत्रक का उपयोग करता है, और सावधानी बरतने की सलाह दी जाती है क्योंकि फिर से फ्लैश करने से वेबकैम को नुकसान हो सकता है; \"लाइट्स आउट\" टॉक में POC 2024 में और अंतर्दृष्टि उपलब्ध है।"
    ],
    "commentSummary": [
      "मैलवेयर में वेबकैम एलईडी को निष्क्रिय करने और उपयोगकर्ता की जानकारी के बिना वीडियो रिकॉर्ड करने की क्षमता होती है, जैसा कि थिंकपैड X230 पर प्रदर्शित किया गया है।- मैकबुक के विपरीत, जिनमें कैमरा उपयोग का संकेत देने के लिए हार्डवायर्ड एलईडी होती है, कई अन्य लैपटॉप में यह सुविधा नहीं होती है, जिससे गोपनीयता संबंधी चिंताएं बढ़ जाती हैं।- सुरक्षा बढ़ाने के लिए, विशेषज्ञ वेबकैम और माइक्रोफोन के लिए भौतिक कवर या स्विच का उपयोग करने की सलाह देते हैं ताकि अनधिकृत पहुंच को रोका जा सके और संवेदनशील जानकारी की सुरक्षा की जा सके।"
    ],
    "points": 915,
    "commentCount": 482,
    "retryCount": 0,
    "time": 1732738255
  },
  {
    "id": 42264427,
    "title": "हेत्ज़नर ने अमेरिकी वीपीएस पर ट्रैफिक में कटौती की",
    "originLink": "https://news.ycombinator.com/item?id=42264427",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264427",
    "commentBody": "",
    "originSummary": [
      "क्लाउड सर्वरों (CCX और CPX लाइनों) और लोड बैलेंसर्स के लिए टैरिफ संरचना एशबर्न और हिल्सबोरो, अमेरिका में अपडेट की जा रही है।- नए मूल्य और ट्रैफिक मात्रा 1 दिसंबर, 2024 से नए बनाए गए और पुनः स्केल किए गए सर्वरों पर लागू होंगे, जबकि मौजूदा सर्वरों में परिवर्तन 1 फरवरी, 2025 से देखे जाएंगे।- यह अपडेट स्थानीय परिस्थितियों के आधार पर अधिक न्यायसंगत मूल्य निर्धारण प्रदान करने का लक्ष्य रखता है, जबकि ट्रैफिक ओवरएज की कीमतें अपरिवर्तित रहेंगी।"
    ],
    "commentSummary": [
      "हेत्ज़नर अमेरिका में क्लाउड सर्वर और लोड बैलेंसर के लिए अपनी मूल्य निर्धारण मॉडल को संशोधित कर रहा है, जिसमें शामिल ट्रैफिक को 20TB से घटाकर 1TB तक कर दिया गया है और कीमतें बढ़ाई जा रही हैं।",
      "परिवर्तन दिसंबर 2024 में नए सर्वरों के लिए और फरवरी 2025 में मौजूदा सर्वरों के लिए प्रभावी होंगे, जिसका उद्देश्य कम और उच्च संसाधन उपयोगकर्ताओं के बीच लागत को संतुलित करना है।",
      "इस निर्णय ने निष्पक्षता और व्यापार रणनीतियों के बारे में बहस छेड़ दी है, क्योंकि कुछ उपयोगकर्ता शामिल ट्रैफिक में भारी कमी से नाखुश हैं।"
    ],
    "points": 236,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1732792964
  },
  {
    "id": 42264733,
    "title": "ऑस्ट्रेलिया: सीनेट द्वारा कानून पारित करने के बाद 16 वर्ष से कम उम्र के बच्चों को सोशल मीडिया से प्रतिबंधित किया जाएगा",
    "originLink": "https://www.abc.net.au/news/2024-11-28/social-media-age-ban-passes-parliament/104647138",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264733",
    "commentBody": "",
    "originSummary": [
      "ऑस्ट्रेलिया ने मानसिक स्वास्थ्य की सुरक्षा के उद्देश्य से 16 वर्ष से कम उम्र के बच्चों के सोशल मीडिया उपयोग पर प्रतिबंध लगाने वाला नया कानून पारित किया है।",
      "सोशल मीडिया कंपनियों के पास अनुपालन के लिए एक वर्ष है, गैर-अनुपालन के लिए $50 मिलियन तक के जुर्माने का सामना करना पड़ेगा, जबकि उपयोगकर्ताओं और माता-पिता को कोई दंड नहीं होगा।",
      "यह कानून मैसेजिंग ऐप्स, ऑनलाइन गेमिंग, या शैक्षिक सेवाओं पर लागू नहीं होता है, और इसे मानसिक स्वास्थ्य विशेषज्ञों, राजनेताओं, और तकनीकी कंपनियों से मिश्रित प्रतिक्रियाएं मिली हैं।"
    ],
    "commentSummary": [
      "ऑस्ट्रेलिया 16 वर्ष से कम उम्र के बच्चों को सोशल मीडिया का उपयोग करने से प्रतिबंधित करने की तैयारी में है, जिसके लिए आयु की पुष्टि के लिए आईडी सत्यापन की आवश्यकता होगी, जिससे गोपनीयता संबंधी चिंताएं उत्पन्न हुई हैं।",
      "आलोचकों को चिंता है कि इससे सरकार को सोशल मीडिया डेटा तक पहुंच मिल सकती है और उपयोगकर्ता की गुमनामी कम हो सकती है, कुछ का सुझाव है कि पारंपरिक मीडिया इस कानून का समर्थन कर रहा है ताकि सोशल मीडिया की प्रतिस्पर्धा को सीमित किया जा सके।",
      "कानून की प्रभावशीलता और प्रवर्तन अनिश्चित हैं, इसके कार्यान्वयन में संभावित खामियां और चुनौतियाँ हो सकती हैं।"
    ],
    "points": 234,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1732796901
  },
  {
    "id": 42259184,
    "title": "QwQ: अलीबाबा का O1 जैसा तर्कशील LLM",
    "originLink": "https://qwenlm.github.io/blog/qwq-32b-preview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259184",
    "commentBody": "",
    "originSummary": [
      "QwQ (क्वेन विद क्वेश्चन्स) एक एआई मॉडल है जिसे समस्याओं को जिज्ञासा और दार्शनिक जांच के साथ खोजने के लिए डिज़ाइन किया गया है, जो लगातार अपनी धारणाओं पर सवाल उठाता है।",
      "भाषा मिश्रण और पुनरावृत्त तर्क लूप जैसी सीमाओं के बावजूद, QwQ तकनीकी क्षेत्रों में उत्कृष्ट प्रदर्शन करता है, GPQA, AIME, MATH-500, और LiveCodeBench जैसे बेंचमार्क पर उच्च स्कोर प्राप्त करता है।",
      "मॉडल गणित और प्रोग्रामिंग में मजबूत समस्या-समाधान क्षमताओं का प्रदर्शन करता है, जो एआई तर्क और मशीन इंटेलिजेंस की समझ की निरंतर यात्रा में योगदान देता है।"
    ],
    "commentSummary": [
      "अलीबाबा का QwQ, एक तर्कसंगत बड़े भाषा मॉडल (LLM), अपने प्रभावशाली प्रदर्शन के लिए ध्यान आकर्षित कर रहा है, जिसमें मैकबुक सहित विभिन्न हार्डवेयर पर काम करने की क्षमता और जटिल कार्यों को विस्तृत व्याख्याओं के साथ हल करने की क्षमता शामिल है।",
      "QwQ के बारे में चर्चाओं में इसके हार्डवेयर आवश्यकताओं, संवेदनशील विषयों पर संभावित सेंसरशिप मुद्दों, और इसकी खुलापन और तर्क क्षमताओं को शामिल किया गया है, हालांकि कुछ सीमाओं को भी नोट किया गया है।",
      "यह बातचीत ओपन-सोर्स LLMs के व्यापक प्रभावों और कृत्रिम बुद्धिमत्ता विकास के क्षेत्र में प्रतिस्पर्धात्मक गतिशीलता को उजागर करती है।"
    ],
    "points": 233,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1732737625
  },
  {
    "id": 42263834,
    "title": "प्रिंट की प्रशंसा में: ज्ञानमीमांसीय पतन के युग में पढ़ना आवश्यक है",
    "originLink": "https://lithub.com/in-praise-of-print-why-reading-remains-essential-in-an-era-of-epistemological-collapse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42263834",
    "commentBody": "",
    "originSummary": [
      "एड साइमन प्रिंट पढ़ने के स्थायी महत्व पर जोर देते हैं, स्वेन बिर्कर्ट्स की \"द गुटेनबर्ग एलीजीज\" का संदर्भ देते हुए यह बताने के लिए कि डिजिटल मीडिया का गहन पढ़ाई और गलत सूचना पर क्या प्रभाव पड़ता है।",
      "साइमन का तर्क है कि प्रिंट किताबें एक अनोखा, गहन अनुभव प्रदान करती हैं जिसे डिजिटल मीडिया दोहरा नहीं सकता, और यह इंटरनेट के लगातार शोर से दूर आत्मनिरीक्षण और गोपनीयता को बढ़ावा देता है।",
      "वह निष्कर्ष निकालते हैं कि साक्षरता और गहन पठन को संरक्षित करना व्यक्तिगत विचार को बनाए रखने और डिजिटल प्रौद्योगिकी के व्यापक प्रभाव का विरोध करने के लिए आवश्यक है।"
    ],
    "commentSummary": [
      "प्रिंट और डिजिटल पढ़ाई के बीच की बहस डिजिटल मीडिया के गहन सामग्री जुड़ाव पर प्रभाव को लेकर केंद्रित है।- डिजिटल पढ़ाई के समर्थक सुविधा और पहुंच का हवाला देते हैं, जबकि आलोचक इसके आलोचनात्मक सोच और ध्यान अवधि पर प्रभाव को लेकर चिंतित हैं।- यह चर्चा प्रौद्योगिकी के सूचना उपभोग पर प्रभाव और तकनीकी प्रगति और पारंपरिक ज्ञान अधिग्रहण के बीच संतुलन के व्यापक मुद्दों को दर्शाती है।"
    ],
    "points": 225,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732785781
  },
  {
    "id": 42261909,
    "title": "वॉइस-प्रो – एआई वॉइस क्लोनिंग मैजिक: किसी भी आवाज को 15 सेकंड में बदलें",
    "originLink": "https://github.com/abus-aikorea/voice-pro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261909",
    "commentBody": "",
    "originSummary": [
      "वॉइस-प्रो एक ओपन-सोर्स ग्रेडियो वेबयूआई है जो उन्नत ऑडियो हेरफेर के लिए डिज़ाइन किया गया है, जिसमें शून्य-शॉट वॉइस क्लोनिंग और 50 से अधिक सेलिब्रिटी आवाजों के साथ एक वॉइस चेंजर शामिल है।",
      "यह यूट्यूब ऑडियो डाउनलोडिंग, वोकल आइसोलेशन, बहुभाषी टेक्स्ट-टू-स्पीच, और अनुवाद जैसी सुविधाएँ प्रदान करता है, जो व्हिस्पर इंजन का उपयोग करता है।",
      "वॉयस-प्रो विशेष रूप से सामग्री निर्माताओं, डेवलपर्स और ऑडियो उत्साही लोगों के लिए लाभकारी है, जिसमें गिटहब पर उपलब्ध संसाधन और यूट्यूब पर वीडियो ट्यूटोरियल शामिल हैं।"
    ],
    "commentSummary": [
      "वॉइस-प्रो एक ओपन-सोर्स एआई टूल है जो 15 सेकंड में वॉइस क्लोनिंग को सक्षम बनाता है, जिसमें ज़ीरो-शॉट वॉइस क्लोनिंग और 50 से अधिक सेलिब्रिटी आवाज़ों के साथ एक वॉइस चेंजर शामिल है।- इसमें यूट्यूब ऑडियो डाउनलोडिंग, वोकल आइसोलेशन, और मल्टी-लैंग्वेज टेक्स्ट-टू-स्पीच और अनुवाद जैसी कार्यक्षमताएँ शामिल हैं, जो व्हिस्पर इंजन द्वारा संचालित हैं, और यह गिटहब पर उपलब्ध है।- इसके रचनात्मक संभावनाओं के बावजूद, पहचान की चोरी और धोखाधड़ी के लिए दुरुपयोग की चिंताएँ हैं, और वर्तमान में यह लिनक्स या मैकोएस के लिए समर्थन नहीं करता है, स्थापना और छिपी लागतों के बारे में प्रश्नों के साथ।"
    ],
    "points": 197,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1732761421
  },
  {
    "id": 42260027,
    "title": "लंदन के 850 साल पुराने खाद्य बाजार बंद होंगे",
    "originLink": "https://www.bbc.co.uk/news/articles/cje050wz22qo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260027",
    "commentBody": "",
    "originSummary": [
      "लंदन के ऐतिहासिक स्मिथफील्ड और बिलिंग्सगेट बाजार, जो अपनी 850 साल की इतिहासिकता के लिए महत्वपूर्ण हैं, 2028 तक बंद हो जाएंगे क्योंकि सिटी ऑफ लंदन कॉरपोरेशन ने समर्थन वापस ले लिया है।- ये बाजार, जो यूके के सबसे बड़े थोक मांस और अंतर्देशीय मछली बाजार के रूप में जाने जाते हैं, नए विकासों द्वारा प्रतिस्थापित किए जाएंगे, जिसमें व्यापारियों को मुआवजा और पुनर्वास सहायता मिलेगी।- बाजारों को डैगेनहैम स्थानांतरित करने की योजनाएं उच्च लागत के कारण छोड़ दी गईं, जिससे लंदन में मछली की भविष्य की आपूर्ति के बारे में चिंताएं बढ़ गईं और परंपरा के नुकसान का संकेत मिला।"
    ],
    "commentSummary": [
      "लंदन के ऐतिहासिक खाद्य बाजार, जैसे स्मिथफील्ड और बिलिंग्सगेट, बंद होने की योजना है, जिसे सिटी ऑफ लंदन कॉरपोरेशन व्यापारियों के लिए एक \"सकारात्मक नया अध्याय\" के रूप में प्रचारित कर रहा है।- आलोचकों का सुझाव है कि ये बंदी रियल एस्टेट विकास को सुविधाजनक बनाने के लिए की जा रही हैं, जिससे इस क्षेत्र को एक वाणिज्यिक केंद्र में बदल दिया जाएगा, जिससे सांस्कृतिक विरासत के नुकसान की चिंताएं बढ़ रही हैं।- इस निर्णय को संसदीय मंजूरी का इंतजार है, स्थानीय व्यवसायों पर संभावित नकारात्मक प्रभाव को लेकर चिंताएं हैं।"
    ],
    "points": 192,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1732743398
  },
  {
    "id": 42262734,
    "title": "picoCAD – छोटे मॉडलों के लिए एक छोटा मॉडलर",
    "originLink": "https://store.steampowered.com/app/2800590/picoCAD/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42262734",
    "commentBody": "",
    "originSummary": [
      "पिकोकैड, एक 3डी मॉडलिंग टूल जो रेट्रो-स्टाइल मॉडल बनाने के लिए है, 27 नवंबर, 2024 को अप्सकेपेट द्वारा जारी किया गया था, जो शुरुआती और विशेषज्ञ दोनों के लिए उपयुक्त है।- यह टूल विंडोज और मैकोएस के लिए उपलब्ध है, जिसकी प्रारंभिक कीमत 5.09 डॉलर है जो 4 दिसंबर, 2024 तक मान्य है।- उपयोगकर्ताओं को समुदाय में शामिल होने और पिकोकैड के साथ अपनी रचनात्मकता को बढ़ाने के लिए ट्यूटोरियल्स का अन्वेषण करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "picoCAD एक सरल 3D मॉडलिंग टूल है जो अपनी सादगी और उपयोग में आसानी के लिए पसंद किया जाता है, विशेष रूप से कम-पॉली मॉडल बनाने के लिए, जैसे कि अधिक जटिल सॉफ़्टवेयर ब्लेंडर की तुलना में।- जोहान पीट्ज़ द्वारा विकसित, picoCAD obj/mtl प्रारूपों में निर्यात की अनुमति देता है, हालांकि इसमें Picotron पर मूल बाइनरी निर्यात की कमी है।- उपयोगकर्ता इसकी अनूठी सौंदर्यशास्त्र और सादगी की सराहना करते हैं, अक्सर इसकी तुलना अन्य उपकरणों जैसे Crocotile और Kenney Shape से करते हैं।"
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1732772100
  },
  {
    "id": 42260030,
    "title": "फ्लोट सेल्फ-टैगिंग",
    "originLink": "https://arxiv.org/abs/2411.16544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260030",
    "commentBody": "",
    "originSummary": [
      "यह पेपर \"स्वयं-टैगिंग\" को प्रस्तुत करता है, जो 64-बिट ऑब्जेक्ट्स के भीतर प्रकार की जानकारी को एन्कोड करने की एक विधि है, जो डेटा स्थान का त्याग किए बिना गतिशील भाषाओं के लिए मेमोरी लेआउट को अनुकूलित करता है।",
      "स्वयं-टैगिंग स्कीम में फ्लोट-हेवी बेंचमार्क्स के निष्पादन समय को 2.3 गुना और जावास्क्रिप्ट में 2.7 गुना सुधारती है, जो टैग्ड पॉइंटर्स और NaN-टैगिंग जैसी मौजूदा विधियों के लिए एक अधिक कुशल विकल्प प्रदान करती है।",
      "यह दृष्टिकोण डेटा और प्रकार दोनों के कुशल एन्कोडिंग की अनुमति देता है, जिससे प्रदर्शन में सुधार होता है बिना अन्य संचालन को प्रभावित किए, और यह गतिशील भाषाओं में 64-बिट IEEE754 डबल-प्रिसिजन फ्लोट्स को संभालने के लिए एक आशाजनक समाधान बनाता है।"
    ],
    "commentSummary": [
      "यह पेपर \"फ्लोट सेल्फ-टैगिंग\" नामक एक तकनीक प्रस्तुत करता है, जिसका उद्देश्य डायनामिक प्रोग्रामिंग भाषाओं में फ्लोट स्टोरेज को अनुकूलित करना है। यह तकनीक उच्च बिट्स का उपयोग टैगिंग के लिए करती है, जिससे अधिकांश फ्लोट्स बिना बॉक्सिंग के रहते हैं और प्रदर्शन में सुधार होता है।",
      "पेपर के आलोचक तर्क देते हैं कि इसकी तुलना त्रुटिपूर्ण है और वे स्थापित विधियों जैसे कि NaN-टैगिंग के खिलाफ परीक्षण की सिफारिश करते हैं, जो फ्लोटिंग-पॉइंट संख्याओं के NaN (नंबर नहीं) मानों में अतिरिक्त जानकारी को एन्कोड करने की एक तकनीक है।",
      "इस तकनीक को इसकी सरलता और संभावनाओं के लिए जाना जाता है, जिसमें कोका और सीरूबी जैसी भाषाओं में पहले से ही समान विधियाँ लागू की गई हैं, और एप्पल के ऑब्जेक्टिव-सी और जावा वर्चुअल मशीन (JVM) जैसे सिस्टम में संबंधित अनुकूलन देखे गए हैं।"
    ],
    "points": 164,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1732743412
  },
  {
    "id": 42260017,
    "title": "बड़ी फार्मा कंपनियों के बिना कैंसर की दवा विकसित करना: यह अस्पताल दिखाता है कि यह किया जा सकता है",
    "originLink": "https://www.ftm.nl/artikelen/ruzie-tussen-ziekenhuis-en-farma-industrie-over-goedkeuring-kankermedicijn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260017",
    "commentBody": "",
    "originSummary": [
      "नीदरलैंड में बढ़ती स्वास्थ्य देखभाल लागत का कारण नौकरशाही, अपव्यय और अनावश्यक देखभाल है, जो प्रणालीगत अक्षमताओं को उजागर करता है।",
      "एक डच अस्पताल ने प्रमुख फार्मास्युटिकल कंपनियों से स्वतंत्र रूप से एक कैंसर दवा विकसित की, जो एक तुलनीय अमेरिकी थेरेपी की तुलना में पांच गुना सस्ती है, यह दिखाते हुए कि गैर-लाभकारी अस्पताल स्वास्थ्य देखभाल लागत को कम करने की क्षमता रखते हैं।",
      "नवाचार के बावजूद, महंगा और जटिल यूरोपीय मेडिसिन एजेंसी (EMA) पंजीकरण प्रक्रिया अस्पतालों को हतोत्साहित करती है; हालांकि, AVL अस्पताल ने दान के माध्यम से एक चरण 3 अध्ययन को वित्तपोषित किया है, जिसका उद्देश्य महंगी फार्मास्युटिकल प्रतिस्पर्धा के खिलाफ अपनी सस्ती चिकित्सा को बनाए रखने के लिए EMA की मंजूरी प्राप्त करना है।"
    ],
    "commentSummary": [
      "एक अस्पताल ने स्वतंत्र रूप से एक कैंसर दवा का सफलतापूर्वक विकास किया है, यह दर्शाते हुए कि दवा विकास प्रमुख फार्मास्युटिकल कंपनियों की भागीदारी के बिना भी हो सकता है।- पारंपरिक दवा विकास प्रक्रिया की आलोचना की जाती है क्योंकि यह महंगी होती है और अहंकार और राजनीति जैसे गैर-वैज्ञानिक कारकों से प्रभावित होती है।- चर्चा दवा विकास की जटिलताओं पर जोर देती है, जिसमें नियामक चुनौतियाँ और नैदानिक परीक्षणों के दौरान दवाओं की उच्च विफलता दर शामिल है।"
    ],
    "points": 154,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1732743349
  },
  {
    "id": 42261053,
    "title": "एमआईटी एल्युमिनियम साइकिल परियोजना 1974 (2016)",
    "originLink": "https://www.sheldonbrown.com/AluminumBikeProject.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261053",
    "commentBody": "",
    "originSummary": [
      "1974 में, एम.आई.टी. ने एक कोर्स की मेजबानी की जिसमें प्रतिभागियों, जिनमें मार्क रोसेनबाम और हैरियट फेल शामिल थे, ने एल्यूमीनियम साइकिल फ्रेम बनाए। रोसेनबाम की डिजाइन उस समय की सबसे हल्की ट्रैक साइकिल थी। रोसेनबाम की साइकिल, 6061-T6 एल्यूमीनियम और टाइटेनियम से बनी, बड़े व्यास के ट्यूब और सटीक बियरिंग्स के साथ, 12 पाउंड 5 औंस वजन की थी, और अब यह एम.आई.टी. संग्रहालय में प्रदर्शित है। हैरियट फेल के फ्रेम को कैननडेल और क्लेन के बीच एक पेटेंट विवाद में शामिल किया गया था, जिसमें कैननडेल ने इसे क्लेन के पेटेंट के खिलाफ पूर्व कला का दावा करने के लिए उपयोग किया।"
    ],
    "commentSummary": [
      "1974 में, एमआईटी ने साइकिल फ्रेम के लिए एल्यूमीनियम पर विचार किया, जबकि मैग्नीशियम को उसकी भंगुरता और संक्षारण समस्याओं के कारण अस्वीकार कर दिया, हालांकि आधुनिक मैग्नीशियम मिश्र धातु जैसे एलपीएसओ संभावनाएं दिखाते हैं।- मैग्नीशियम फ्रेम के साथ ऐतिहासिक प्रयास, जैसे कि किर्क के, अक्सर सामग्री की कमजोरियों के कारण विफल हो गए, जबकि कार्बन फाइबर और टाइटेनियम को उनकी मजबूती और लचीलेपन के लिए पसंद किया जाता है।- सामग्री में प्रगति के बावजूद, साइकिल डिजाइन में वजन एक ध्यान केंद्रित बिंदु बना हुआ है, जिसमें वायुगतिकी और सवार की आराम पर बढ़ती जोर दिया जा रहा है।"
    ],
    "points": 152,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1732751978
  },
  {
    "id": 42261707,
    "title": "डेल अपनी वेबसाइट पर बिना हस्ताक्षर वाले अपडेट पोस्ट कर रहा है जो इंस्टॉल होने में विफल हो रहे हैं।",
    "originLink": "https://infosec.exchange/@0xabad1dea/113543212666056329",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261707",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "डेल अपनी वेबसाइट पर बिना हस्ताक्षर वाले अपडेट जारी कर रहा है, जिससे इंस्टॉलेशन में विफलताएं हो रही हैं और हैकर्स द्वारा संभावित शोषण के बारे में सुरक्षा चिंताएं बढ़ रही हैं।",
      "उपयोगकर्ताओं ने अपडेट कैटलॉग और हस्ताक्षरों के बीच असंगतियों की रिपोर्ट की है, कुछ समस्याएं शिकायतों के बाद हल हो गई हैं, लेकिन डेल के अपडेट प्रबंधन के संबंध में आलोचना बनी हुई है।",
      "यह स्थिति विभिन्न प्लेटफार्मों, जिनमें एप्पल और लिनक्स शामिल हैं, पर सुरक्षा और विश्वसनीयता सुनिश्चित करने के लिए सॉफ़्टवेयर अपडेट की सत्यापन की महत्वपूर्ण आवश्यकता को रेखांकित करती है।"
    ],
    "points": 150,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732759401
  },
  {
    "id": 42260364,
    "title": "कैसे आईबीएम ने स्वचालित फैब का आविष्कार किया, इसकी भूली हुई कहानी",
    "originLink": "https://spectrum.ieee.org/semiconductor-fabrication",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260364",
    "commentBody": "",
    "originSummary": [
      "1970 में, IBM के बिल हार्डिंग ने प्रोजेक्ट SWIFT की शुरुआत की, जिसका उद्देश्य वेफर-फैब्रिकेशन को स्वचालित करना था ताकि एक दिन से भी कम समय में इंटीग्रेटेड सर्किट्स (ICs) का उत्पादन किया जा सके, जो कि सामान्यतः महीने भर की प्रक्रिया से काफी कम था। SWIFT ने प्रति लेयर 5 घंटे का टर्नअराउंड हासिल किया, जो आज भी अप्रतिम है, और इसने स्वचालित प्रोसेसिंग और रियल-टाइम कंट्रोल जैसी नवाचारों को पेश किया, जो आधुनिक सेमीकंडक्टर निर्माण के लिए बुनियादी हैं। अपनी संक्षिप्त अवधि के बावजूद, प्रोजेक्ट SWIFT की प्रगति और हार्डिंग के दूरदर्शी नेतृत्व ने सेमीकंडक्टर उत्पादन तकनीकों के विकास को महत्वपूर्ण रूप से प्रभावित किया।"
    ],
    "commentSummary": [
      "आईबीएम ने एक समय में स्वचालित निर्माण में अग्रणी भूमिका निभाई थी, जिसका उद्देश्य कच्चे माल से लेकर सॉफ्टवेयर तक पूर्ण ऊर्ध्वाधर एकीकरण करना था, जिससे कस्टम चिप्स को मानक विकल्पों की तुलना में अधिक व्यवहार्य बनाना था।- प्रौद्योगिकी को आगे बढ़ाने की उच्च लागत के कारण, कई कंपनियों, जिनमें आईबीएम भी शामिल है, ने उत्पादन को आउटसोर्स कर दिया है या अपने निर्माण सुविधाओं को अलग कर दिया है।- वर्तमान प्रयास, जैसे कि जिम केलर का एटॉमिक सेमी, छोटे निर्माण रन को आर्थिक रूप से व्यवहार्य बनाने पर ध्यान केंद्रित कर रहे हैं, संरचित एएसआईसी (एप्लिकेशन-स्पेसिफिक इंटीग्रेटेड सर्किट्स) और मास्कलेस लिथोग्राफी जैसी नवाचारों का अन्वेषण कर रहे हैं ताकि लागत को कम किया जा सके और कस्टम सिलिकॉन तक पहुंच में सुधार किया जा सके।"
    ],
    "points": 147,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1732745938
  },
  {
    "id": 42259133,
    "title": "अमेरिकी कॉपीराइट कार्यालय ने गेम संरक्षण के लिए एक प्रमुख प्रयास को खारिज कर दिया है।",
    "originLink": "https://www.gamesradar.com/games/publishers-are-absolutely-terrified-preserved-video-games-would-be-used-for-recreational-purposes-so-the-us-copyright-office-has-struck-down-a-major-effort-for-game-preservation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259133",
    "commentBody": "",
    "originSummary": [
      "अमेरिकी कॉपीराइट कार्यालय ने एक DMCA छूट अनुरोध को खारिज कर दिया है, जिसका उद्देश्य लाइब्रेरियों को संरक्षित वीडियो गेम्स की डिजिटल पहुंच को दूरस्थ रूप से साझा करने की अनुमति देना था। यह निर्णय वीडियो गेम हिस्ट्री फाउंडेशन (VGHF) और सॉफ्टवेयर प्रिजर्वेशन नेटवर्क द्वारा चलाए गए तीन साल के अभियान का समापन करता है।",
      "प्रस्तावित छूट से इतिहासकारों और शोधकर्ताओं के लिए एक डिजिटल लाइब्रेरी की सुविधा मिलती, जिससे वे प्रिंट से बाहर हो चुके खेलों तक पहुंच सकते, लेकिन इसे उद्योग समूहों द्वारा संभावित मनोरंजक उपयोग और बाजार को होने वाले नुकसान की चिंताओं के कारण अस्वीकार कर दिया गया।",
      "वीजीएचएफ ने निराशा व्यक्त की, इस निर्णय की आलोचना करते हुए कहा कि यह उद्योग लॉबिंग से अत्यधिक प्रभावित था, जिसने ऐतिहासिक खेलों तक सार्वजनिक पहुंच की तुलना में उद्योग के हितों को प्राथमिकता दी।"
    ],
    "commentSummary": [
      "अमेरिकी कॉपीराइट कार्यालय ने वीडियो गेम्स के संरक्षण के उद्देश्य से एक प्रस्ताव को अस्वीकार कर दिया है, क्योंकि इस बात की चिंता है कि इन खेलों का उपयोग संरक्षण के बजाय मनोरंजन के लिए किया जा सकता है।",
      "इस निर्णय ने रेट्रो गेम प्रेमियों के बीच चर्चाओं को जन्म दिया है, जो तर्क देते हैं कि पुराने खेल आधुनिक खेलों की तुलना में अधिक आनंद और नॉस्टेल्जिया प्रदान करते हैं।",
      "निर्णय के आलोचकों का मानना है कि वर्तमान कॉपीराइट कानून अत्यधिक प्रतिबंधात्मक हैं, जो सांस्कृतिक और ऐतिहासिक मीडिया के संरक्षण में बाधा डालते हैं, और वे नवाचार को बढ़ावा देने और पुराने कार्यों को जल्द ही सार्वजनिक डोमेन में प्रवेश करने की अनुमति देने के लिए कॉपीराइट अवधि को कम करने का सुझाव देते हैं।"
    ],
    "points": 140,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1732737261
  },
  {
    "id": 42259185,
    "title": "बैकप्रोपेगेशन से परे सीखने के लिए प्लास्टिसिटी से पहले न्यूरल गतिविधि का अनुमान लगाना",
    "originLink": "https://www.nature.com/articles/s41593-023-01514-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259185",
    "commentBody": "",
    "originSummary": [
      "लेख \"प्रॉस्पेक्टिव कॉन्फ़िगरेशन\" को एक नए क्रेडिट असाइनमेंट सिद्धांत के रूप में प्रस्तुत करता है, जो पारंपरिक बैकप्रोपेगेशन विधि के विकल्प के रूप में सीखने में उपयोगी है।",
      "भावी विन्यास में न्यूरल नेटवर्क्स वांछित न्यूरल गतिविधि पैटर्न की भविष्यवाणी करते हैं, इससे पहले कि वे सिनैप्टिक वज़न को समायोजित करें, जिससे सीखने में दक्षता और प्रभावशीलता बढ़ती है।",
      "यह विधि मानव और पशु अध्ययनों में देखी गई न्यूरल गतिविधि के साथ अधिक निकटता से मेल खाती है और बैकप्रोपेगेशन की तुलना में जैविक और कृत्रिम शिक्षण प्रणालियों में लाभ प्रदान कर सकती है।"
    ],
    "commentSummary": [
      "एक नया सिद्धांत, \"प्रॉस्पेक्टिव कॉन्फ़िगरेशन,\" प्रस्तावित किया गया है जो यह समझाने के लिए है कि मस्तिष्क क्रेडिट असाइनमेंट समस्या को कैसे हल करता है, जो कृत्रिम न्यूरल नेटवर्क (ANNs) में उपयोग की जाने वाली बैकप्रोपेगेशन विधि से भिन्न है।",
      "सिद्धांत यह सुझाव देता है कि न्यूरल गतिविधि में परिवर्तन सिनैप्टिक वजन संशोधनों से पहले होते हैं, जो बैकप्रोपेगेशन के विपरीत है जहां वजन में परिवर्तन से न्यूरल गतिविधि में बदलाव होता है।",
      "यह दृष्टिकोण जैविक प्रक्रियाओं के साथ बेहतर तालमेल बिठा सकता है और अधिक कुशल सीखने के एल्गोरिदम विकसित करने में अंतर्दृष्टि प्रदान कर सकता है, जो एआई और मानव मस्तिष्क के सीखने की समानताओं और भिन्नताओं पर बहस में योगदान कर सकता है।"
    ],
    "points": 138,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1732737627
  }
]
