[
  {
    "id": 42259278,
    "title": "„A rosszindulatú szoftverek képesek kikapcsolni a webkamera LED-jét és videót rögzíteni, amit egy ThinkPad X230-on mutattak be.”",
    "originLink": "https://github.com/xairy/lights-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259278",
    "commentBody": "",
    "originSummary": [
      "„A tároló eszközöket kínál a ThinkPad X230 webkamera LED-jének manipulálására, bemutatva, hogyan rögzíthetne a rosszindulatú szoftver videót LED értesítés nélkül. - A folyamat magában foglalja a webkamera firmware-ének újraflashelését USB-n keresztül, egy olyan technikát, amely különböző laptopokra alkalmazható, firmware manipulációs és LED vezérlési szkriptek használatával. - A webkamera egy Ricoh R5U8710 vezérlőt használ, és óvatosság ajánlott, mivel az újraflashelés károsíthatja a webkamerát; további betekintés a \"Lights Out\" előadásban érhető el a POC 2024-en.”"
    ],
    "commentSummary": [
      "„A rosszindulatú szoftverek képesek letiltani a webkamera LED-jeit és videót rögzíteni a felhasználó tudta nélkül, ahogyan azt egy ThinkPad X230-on bemutatták. - Ellentétben a MacBookokkal, amelyeknél a LED-ek hardveresen jelzik a kamera használatát, sok más laptopnál hiányzik ez a funkció, ami adatvédelmi aggályokat vet fel. - A biztonság fokozása érdekében a szakértők javasolják a webkamerák és mikrofonok fizikai fedőinek vagy kapcsolóinak használatát, hogy megakadályozzák az illetéktelen hozzáférést és védjék az érzékeny információkat.”"
    ],
    "points": 915,
    "commentCount": 482,
    "retryCount": 0,
    "time": 1732738255
  },
  {
    "id": 42264427,
    "title": "„A Hetzner csökkenti a forgalmat az amerikai VPS-eken”",
    "originLink": "https://news.ycombinator.com/item?id=42264427",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264427",
    "commentBody": "",
    "originSummary": [
      "„A felhőalapú szerverek (CCX és CPX vonalak) és a terheléselosztók díjszabási struktúrája Ashburnben és Hillsboróban, az Egyesült Államokban frissítésre kerül. - Az új árak és forgalmi mennyiségek 2024. december 1-jétől vonatkoznak az újonnan létrehozott és átméretezett szerverekre, míg a meglévő szerverek változásait 2025. február 1-jétől tapasztalják. - A frissítés célja, hogy igazságosabb árazást biztosítson a helyi feltételek alapján, miközben a forgalmi túllépési árak változatlanok maradnak.”"
    ],
    "commentSummary": [
      "„A Hetzner felülvizsgálja az Egyesült Államokban található felhő szerverek és terheléselosztók árazási modelljét, csökkentve a tartalmazott forgalmat 20TB-ról akár 1TB-ra, és emelve az árakat.”",
      "„A változások 2024 decemberében lépnek életbe az új szerverek esetében, és 2025 februárjában a meglévőknél, azzal a céllal, hogy kiegyensúlyozzák a költségeket az alacsony és magas erőforrás-felhasználók között.”",
      "„A döntés vitákat váltott ki a méltányosságról és az üzleti stratégiákról, mivel néhány felhasználó elégedetlen a tartalmazott forgalom drasztikus csökkentése miatt.”"
    ],
    "points": 236,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1732792964
  },
  {
    "id": 42264733,
    "title": "„Ausztrália: A 16 év alatti gyerekeket kitiltják a közösségi médiából, miután a Szenátus elfogadta a törvényeket”",
    "originLink": "https://www.abc.net.au/news/2024-11-28/social-media-age-ban-passes-parliament/104647138",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264733",
    "commentBody": "",
    "originSummary": [
      "„Ausztrália új törvényt fogadott el, amely megtiltja a 16 év alatti gyermekek számára a közösségi média használatát, a mentális egészség védelme érdekében.”",
      "„A közösségi média cégeknek egy évük van a megfelelésre, ellenkező esetben akár 50 millió dolláros bírsággal is szembesülhetnek, míg a felhasználók és a szülők nem kapnak büntetést.”",
      "„A törvény nem vonatkozik az üzenetküldő alkalmazásokra, az online játékokra vagy az oktatási szolgáltatásokra, és vegyes reakciókat váltott ki mentálhigiénés szakértőkből, politikusokból és technológiai vállalatokból.”"
    ],
    "commentSummary": [
      "„Ausztrália arra készül, hogy megtiltsa a 16 év alatti gyermekek számára a közösségi média használatát, amihez életkoruk igazolására személyazonosság-ellenőrzés szükséges, ami adatvédelmi aggályokat vetett fel.”",
      "„A kritikusok attól tartanak, hogy ez lehetővé teheti a kormány számára a közösségi média adatokhoz való hozzáférést, és csökkentheti a felhasználók anonimitását, egyesek pedig azt sugallják, hogy a hagyományos média támogatja a törvényt, hogy korlátozza a közösségi média versenyét.”",
      "„A törvény hatékonysága és végrehajtása bizonytalan, mivel lehetséges kiskapuk és kihívások merülhetnek fel a megvalósítás során.”"
    ],
    "points": 234,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1732796901
  },
  {
    "id": 42259184,
    "title": "„QwQ: Alibaba O1-szerű érvelő LLM-je”",
    "originLink": "https://qwenlm.github.io/blog/qwq-32b-preview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259184",
    "commentBody": "",
    "originSummary": [
      "„A QwQ (Qwen with Questions) egy AI modell, amelyet arra terveztek, hogy kíváncsisággal és filozófiai vizsgálódással fedezze fel a problémákat, folyamatosan megkérdőjelezve saját feltételezéseit.”",
      "„Annak ellenére, hogy korlátai vannak, mint például a nyelvkeveredés és a rekurzív érvelési hurkok, a QwQ kiemelkedően teljesít a technikai területeken, magas pontszámokat ér el olyan mércék alapján, mint a GPQA, AIME, MATH-500 és a LiveCodeBench.”",
      "„A modell erős problémamegoldó képességeket mutat a matematikában és a programozásban, hozzájárulva az AI érvelés és a gépi intelligencia megértésének folyamatos útjához.”"
    ],
    "commentSummary": [
      "„Az Alibaba QwQ, egy érvelő nagy nyelvi modell (LLM), figyelmet kelt lenyűgöző teljesítményével különféle hardvereken, beleértve a MacBookokat is, valamint azzal a képességével, hogy összetett feladatokat old meg részletes magyarázatokkal.”",
      "„A QwQ-val kapcsolatos megbeszélések magukban foglalják a hardverkövetelményeket, az érzékeny témák esetleges cenzúrázásának kérdéseit, valamint a nyitottságát és érvelési képességeit, annak ellenére, hogy néhány korlátozást megjegyeztek.”",
      "„A beszélgetés rávilágít a nyílt forráskódú LLM-ek tágabb következményeire és a mesterséges intelligencia fejlesztés területén tapasztalható versenydinamikára.”"
    ],
    "points": 233,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1732737625
  },
  {
    "id": 42263834,
    "title": "„A nyomtatott anyag dicsérete: Az olvasás elengedhetetlen az ismeretelméleti összeomlás korszakában”",
    "originLink": "https://lithub.com/in-praise-of-print-why-reading-remains-essential-in-an-era-of-epistemological-collapse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42263834",
    "commentBody": "",
    "originSummary": [
      "„Ed Simon hangsúlyozza a nyomtatott olvasás maradandó jelentőségét, hivatkozva Sven Birkerts „The Gutenberg Elegies” című művére, hogy kiemelje a digitális média mélyolvasásra és félretájékoztatásra gyakorolt hatásával kapcsolatos aggodalmakat.”",
      "„Simon azzal érvel, hogy a nyomtatott könyvek egyedi, elmélyült élményt nyújtanak, amelyet a digitális média nem tud megismételni, elősegítve az önvizsgálatot és a magánéletet az internet állandó zajától távol.”",
      "„Arra a következtetésre jut, hogy az írástudás és a mély olvasás megőrzése elengedhetetlen az egyéni gondolkodás fenntartásához és a digitális technológia átható befolyásának ellenállásához.”"
    ],
    "commentSummary": [
      "„A nyomtatott és digitális olvasás közötti vita középpontjában a digitális média tartalommal való mély elköteleződésre gyakorolt hatása áll. A digitális olvasás támogatói a kényelemre és hozzáférhetőségre hivatkoznak, míg a kritikusok aggódnak a kritikai gondolkodásra és a figyelem tartamára gyakorolt hatásai miatt. Ez a vita a technológia információfogyasztásra gyakorolt hatásának és a technológiai fejlődés és a hagyományos tudásszerzés közötti egyensúly szélesebb körű kérdéseit tükrözi.”"
    ],
    "points": 225,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732785781
  },
  {
    "id": 42261909,
    "title": "„Voice-Pro – AI Hangklónozó Varázslat: Alakítson Át Bármilyen Hangot 15 Másodperc Alatt”",
    "originLink": "https://github.com/abus-aikorea/voice-pro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261909",
    "commentBody": "",
    "originSummary": [
      "„A Voice-Pro egy nyílt forráskódú Gradio WebUI, amely fejlett hangmanipulációra lett tervezve, beleértve a zéró-shot hangklónozást és egy hangváltót több mint 50 híresség hangjával.”",
      "„Olyan funkciókat kínál, mint a YouTube hangletöltés, a vokális izoláció, a többnyelvű szövegfelolvasás és a fordítás, a Whisper motorok használatával.”",
      "„A Voice-Pro különösen előnyös a tartalomkészítők, fejlesztők és audio rajongók számára, mivel források érhetők el a GitHubon és videó oktatóanyagok a YouTube-on.”"
    ],
    "commentSummary": [
      "„A Voice-Pro egy nyílt forráskódú AI eszköz, amely lehetővé teszi a hangklónozást 15 másodperc alatt, és tartalmaz nulla-shot hangklónozást, valamint egy hangváltót több mint 50 híresség hangjával. Funkciói közé tartozik a YouTube hangletöltés, a vokális izoláció, valamint a többnyelvű szövegfelolvasás és fordítás, amelyet Whisper motorok hajtanak, és elérhető a GitHubon. Annak ellenére, hogy kreatív potenciállal bír, aggályok merülnek fel a személyazonosság-lopás és csalások miatt történő visszaélés lehetősége miatt, és jelenleg nem támogatja a Linux vagy MacOS rendszereket, valamint kérdések merülnek fel a telepítéssel és rejtett költségekkel kapcsolatban.”"
    ],
    "points": 197,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1732761421
  },
  {
    "id": 42260027,
    "title": "„London 850 éves élelmiszerpiacai bezárnak”",
    "originLink": "https://www.bbc.co.uk/news/articles/cje050wz22qo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260027",
    "commentBody": "",
    "originSummary": [
      "„London történelmi Smithfield és Billingsgate piacai, amelyek 850 éves történelmük miatt jelentősek, 2028-ig bezárnak, mivel a City of London Corporation visszavonja támogatását. A piacok, amelyeket az Egyesült Királyság legnagyobb nagykereskedelmi hús- és belvízi halpiacaként ismernek, új fejlesztésekkel lesznek helyettesítve, a kereskedők pedig kártérítést és áthelyezési segítséget kapnak. A piacok Dagenhambe költöztetésének terveit a magas költségek miatt elvetették, ami aggodalmakat vet fel a londoni halellátás jövőjével kapcsolatban, és a hagyományok elvesztését jelzi.”"
    ],
    "commentSummary": [
      "„London történelmi élelmiszerpiacai, mint például a Smithfield és a Billingsgate, bezárásra kerülnek, miközben a City of London Corporation ezt a kereskedők számára „pozitív új fejezetként” hirdeti. Kritikusok szerint a bezárások célja az ingatlanfejlesztés elősegítése, azzal, hogy a területet kereskedelmi központtá alakítják, ami aggodalmakat vet fel a kulturális örökség elvesztése miatt. A döntés parlamenti jóváhagyásra vár, miközben aggályok merülnek fel a helyi vállalkozásokra gyakorolt esetleges negatív hatás miatt.”"
    ],
    "points": 192,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1732743398
  },
  {
    "id": 42262734,
    "title": "„picoCAD – egy apró modellező apró modellekhez”",
    "originLink": "https://store.steampowered.com/app/2800590/picoCAD/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42262734",
    "commentBody": "",
    "originSummary": [
      "„A picoCAD, egy 3D modellező eszköz retro stílusú modellek készítéséhez, 2024. november 27-én jelent meg az Apskeppet kiadásában, mind kezdők, mind szakértők számára. Az eszköz elérhető Windows és macOS rendszerekre, bevezető ára 5,09 dollár december 4-ig, 2024-ig. A felhasználókat arra ösztönzik, hogy csatlakozzanak a közösséghez és fedezzék fel a bemutatókat, hogy fokozzák kreativitásukat a picoCAD segítségével.”"
    ],
    "commentSummary": [
      "„A picoCAD egy egyszerű 3D modellező eszköz, amelyet a felhasználók a könnyű kezelhetősége és egyszerűsége miatt kedvelnek, különösen alacsony poligonszámú modellek készítésére, szemben a bonyolultabb szoftverekkel, mint például a Blender. Johan Peitz által fejlesztett picoCAD lehetővé teszi az obj/mtl formátumokba történő exportálást, bár a Picotronon nincs natív bináris exportálási lehetőség. A felhasználók értékelik egyedi esztétikáját és egyszerűségét, gyakran hasonlítva más eszközökhöz, mint például a Crocotile és a Kenney Shape.”"
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1732772100
  },
  {
    "id": 42260030,
    "title": "„Önmegjelölő lebegés”",
    "originLink": "https://arxiv.org/abs/2411.16544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260030",
    "commentBody": "",
    "originSummary": [
      "„A tanulmány bemutatja az „öncímkézést”, egy módszert a típusinformációk kódolására 64 bites objektumokon belül, amely optimalizálja a memóriakiosztást dinamikus nyelvek esetén anélkül, hogy feláldozná az adatterületet.”",
      "„Az öncímkézés 2,3-szorosára javítja a végrehajtási időt a lebegőpontos benchmarkokban Scheme-ben és 2,7-szeresére JavaScript-ben, hatékonyabb alternatívát kínálva a meglévő módszerekhez, mint például a címkézett mutatók és a NaN-címkézés.”",
      "„Ez a megközelítés lehetővé teszi mind az adatok, mind a típus hatékony kódolását, javítva a teljesítményt anélkül, hogy más műveleteket befolyásolna, így ígéretes megoldást jelent a 64 bites IEEE754 dupla pontosságú lebegőpontos számok kezelésére dinamikus nyelvekben.”"
    ],
    "commentSummary": [
      "„A tanulmány bemutatja a „Float Self-Tagging” technikát, amelynek célja a lebegőpontos számok tárolásának optimalizálása dinamikus programozási nyelvekben a magas bitek címkézésre való használatával, lehetővé téve a legtöbb lebegőpontos szám kicsomagolás nélküli tárolását és a teljesítmény javítását.”",
      "„A cikk kritikusai azt állítják, hogy az összehasonlításai hibásak, és azt javasolják, hogy teszteljék bevált módszerekkel, például a NaN-címkézéssel, amely egy olyan technika, amely további információk kódolására szolgál a lebegőpontos számok NaN (Not-a-Number) értékeiben.”",
      "„A technikát egyszerűsége és potenciálja miatt említik, hasonló módszereket már alkalmaztak olyan nyelvekben, mint a Koka és a CRuby, valamint kapcsolódó optimalizációk figyelhetők meg olyan rendszerekben, mint az Apple Objective-C és a Java Virtual Machine (JVM).”"
    ],
    "points": 164,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1732743412
  },
  {
    "id": 42260017,
    "title": "„Egy rákgyógyszer kifejlesztése a nagy gyógyszergyárak nélkül: ez a kórház megmutatja, hogy lehetséges”",
    "originLink": "https://www.ftm.nl/artikelen/ruzie-tussen-ziekenhuis-en-farma-industrie-over-goedkeuring-kankermedicijn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260017",
    "commentBody": "",
    "originSummary": [
      "„A növekvő egészségügyi költségeket Hollandiában a bürokráciának, a pazarlásnak és a szükségtelen ellátásnak tulajdonítják, ami a rendszerbeli hatékonysághiányokat emeli ki.”",
      "„Egy holland kórház egy rákellenes gyógyszert fejlesztett ki a nagy gyógyszergyártó cégektől függetlenül, amely ötször olcsóbb kezelést kínál, mint egy hasonló amerikai terápia, ezzel bemutatva a non-profit kórházak lehetőségét az egészségügyi költségek csökkentésére.”",
      "„A megújulás ellenére a drága és összetett Európai Gyógyszerügynökség (EMA) regisztrációs folyamat elriasztja a kórházakat; azonban az AVL kórház adományok révén finanszírozott egy 3. fázisú tanulmányt, amelynek célja az EMA jóváhagyás megszerzése, hogy fenntarthassák megfizethető terápiájukat a költséges gyógyszeripari versennyel szemben.”"
    ],
    "commentSummary": [
      "„Egy kórház sikeresen kifejlesztett egy rákgyógyszert önállóan, ezzel bizonyítva, hogy a gyógyszerfejlesztés megvalósítható nagy gyógyszergyárak bevonása nélkül is. A hagyományos gyógyszerfejlesztési folyamatot kritizálják, mivel költséges és nem tudományos tényezők, mint például az ego és a politika, befolyásolják. A vita hangsúlyozza a gyógyszerfejlesztés összetettségét, beleértve a szabályozási kihívásokat és a klinikai vizsgálatok során a gyógyszerek magas kudarcarányát.”"
    ],
    "points": 154,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1732743349
  },
  {
    "id": 42261053,
    "title": "„MIT Alumínium Kerékpár Projekt 1974 (2016)”",
    "originLink": "https://www.sheldonbrown.com/AluminumBikeProject.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261053",
    "commentBody": "",
    "originSummary": [
      "„1974-ben az M.I.T. egy olyan kurzust tartott, ahol a résztvevők, köztük Marc Rosenbaum és Harriet Fell, alumínium kerékpárvázakat készítettek, Rosenbaum terve pedig a kor legkönnyebb pályakerékpárja volt. Rosenbaum kerékpárja 6061-T6 alumíniumból és titánból készült, nagyobb átmérőjű csövekkel és precíziós csapágyakkal rendelkezett, súlya 12 font 5 uncia volt, és jelenleg az M.I.T. Múzeumban van kiállítva. Harriet Fell váza egy szabadalmi vitában vett részt a Cannondale és a Klein között, ahol a Cannondale azt használta fel, hogy a Klein szabadalmát megelőző műként támadja.”"
    ],
    "commentSummary": [
      "„1974-ben az MIT fontolóra vette az alumínium használatát kerékpárvázakhoz, elutasítva a magnéziumot annak törékenysége és korróziós problémái miatt, bár a modern magnéziumötvözetek, mint például az LPSO, ígéretesek. A magnézium vázakkal kapcsolatos történelmi próbálkozások, mint például a Kirké, gyakran kudarcot vallottak az anyag gyengeségei miatt, míg a szénszál és a titán kedvelt a szilárdságuk és rugalmasságuk miatt. Az anyagok fejlődése ellenére a súly továbbra is központi szerepet játszik a kerékpártervezésben, egyre nagyobb hangsúlyt fektetve az aerodinamikára és a kerékpáros kényelmére.”"
    ],
    "points": 152,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1732751978
  },
  {
    "id": 42261707,
    "title": "„A Dell aláíratlan frissítéseket tesz közzé a weboldalán, amelyek nem települnek.”",
    "originLink": "https://infosec.exchange/@0xabad1dea/113543212666056329",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261707",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„A Dell aláíratlan frissítéseket tett közzé a weboldalán, ami telepítési hibákhoz vezetett, és biztonsági aggályokat vetett fel a hackerek általi esetleges kihasználás miatt.”",
      "„A felhasználók eltéréseket jelentettek a frissítési katalógusok és aláírások között, néhány probléma megoldódott a panaszok nyomán, de a kritika továbbra is fennáll a Dell frissítéskezelésével kapcsolatban.”",
      "„A helyzet rávilágít a szoftverfrissítések ellenőrzésének kritikus fontosságára, hogy biztosítsuk a biztonságot és megbízhatóságot különböző platformokon, beleértve az Apple-t és a Linuxot.”"
    ],
    "points": 150,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732759401
  },
  {
    "id": 42260364,
    "title": "„Az elfeledett történet arról, hogyan találta fel az IBM az automatizált gyárat”",
    "originLink": "https://spectrum.ieee.org/semiconductor-fabrication",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260364",
    "commentBody": "",
    "originSummary": [
      "„1970-ben az IBM munkatársa, Bill Harding elindította a SWIFT projektet, amelynek célja az volt, hogy automatizálja a lapkagyártást, és kevesebb mint egy nap alatt állítson elő integrált áramköröket (IC-ket), ami jelentős csökkenést jelentett a tipikusan egy hónapos folyamathoz képest. A SWIFT projekt 5 órás átfutási időt ért el rétegenként, ami még mindig páratlan teljesítmény, és olyan újításokat vezetett be, mint az automatizált feldolgozás és a valós idejű vezérlés, amelyek alapvetőek a modern félvezetőgyártásban. Rövid fennállása ellenére a SWIFT projekt előrelépései és Harding jövőbe mutató vezetése jelentős hatással voltak a félvezetőgyártási technikák fejlődésére.”"
    ],
    "commentSummary": [
      "„Az IBM egykor élen járt az automatizált gyártás terén, célul tűzve ki a teljes vertikális integrációt a nyersanyagoktól a szoftverekig, így a testreszabott chipek életképesebbé váltak, mint a szabványos opciók. A technológia fejlesztésének magas költségei miatt azonban sok vállalat, köztük az IBM is, kiszervezte a gyártást, vagy leválasztotta gyártóüzemeit. A jelenlegi erőfeszítések, mint például Jim Keller Atomic Semi projektje, arra összpontosítanak, hogy a kis gyártási sorozatok gazdaságosak legyenek, és olyan innovációkat vizsgálnak, mint a strukturált ASIC-ek (alkalmazás-specifikus integrált áramkörök) és a maszk nélküli litográfia, hogy csökkentsék a költségeket és javítsák a testreszabott szilícium hozzáférhetőségét.”"
    ],
    "points": 147,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1732745938
  },
  {
    "id": 42259133,
    "title": "„Az Egyesült Államok szerzői jogi hivatala elutasította a játékmegőrzésre irányuló jelentős erőfeszítést”",
    "originLink": "https://www.gamesradar.com/games/publishers-are-absolutely-terrified-preserved-video-games-would-be-used-for-recreational-purposes-so-the-us-copyright-office-has-struck-down-a-major-effort-for-game-preservation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259133",
    "commentBody": "",
    "originSummary": [
      "„Az Egyesült Államok Szerzői Jogi Hivatala elutasította azt a DMCA mentességi kérelmet, amely lehetővé tette volna a könyvtárak számára, hogy távolról megosszák a megőrzött videojátékok digitális hozzáférését, ezzel lezárva a Video Game History Foundation (VGHF) és a Software Preservation Network hároméves kampányát.”",
      "„A javasolt mentesség lehetővé tette volna egy digitális könyvtár létrehozását történészek és kutatók számára, hogy hozzáférjenek a már nem kapható játékokhoz, de elutasították, mivel az iparági csoportok szerint fennállt a veszélye a szabadidős használatnak és a piaci károknak.”",
      "„A VGHF csalódottságát fejezte ki, bírálva a döntést, amelyet erősen befolyásolt az iparági lobbizás, és amely az iparági érdekeket a történelmi játékokhoz való nyilvános hozzáférés elé helyezte.”"
    ],
    "commentSummary": [
      "„Az Egyesült Államok Szerzői Jogi Hivatala elutasította egy javaslatot, amely a videojátékok megőrzésére irányult, mivel aggályok merültek fel, hogy ezeket a játékokat inkább szórakozási célokra használhatják, mintsem megőrzésre.”",
      "„Ez a döntés vitákat váltott ki a retro játékok rajongói körében, akik azzal érvelnek, hogy a régebbi játékok több élvezetet és nosztalgiát nyújtanak a modern játékokhoz képest.”",
      "„A döntés kritikusai úgy vélik, hogy a jelenlegi szerzői jogi törvények túlságosan korlátozóak, akadályozzák a kulturális és történelmi média megőrzését, és javasolják a szerzői jogi időszakok lerövidítését az innováció előmozdítása és a régebbi művek gyorsabb közkinccsé válása érdekében.”"
    ],
    "points": 140,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1732737261
  },
  {
    "id": 42259185,
    "title": "„Az idegi aktivitás következtetése a plaszticitás előtt a tanulás érdekében a visszaterjesztésen túl”",
    "originLink": "https://www.nature.com/articles/s41593-023-01514-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259185",
    "commentBody": "",
    "originSummary": [
      "„A cikk bemutatja a „prospektív konfigurációt”, egy új hitel-hozzárendelési elvet a tanulásban, amely alternatívát kínál a hagyományos visszaterjesztési módszerrel szemben.”",
      "„A jövőbeli konfiguráció során a neurális hálózatok előre megjósolják a kívánt neurális aktivitási mintákat, mielőtt a szinaptikus súlyokat módosítanák, ezáltal növelve a tanulás hatékonyságát és eredményességét.”",
      "„Ez a módszer szorosabban igazodik az emberi és állati tanulmányokban megfigyelt idegi aktivitáshoz, és előnyöket kínálhat mind a biológiai, mind a mesterséges tanulási rendszerekben a visszaterjesztéssel szemben.”"
    ],
    "commentSummary": [
      "„Egy új elmélet, a „prospektív konfiguráció” javasolt annak magyarázatára, hogy az agy hogyan oldja meg a kredit-hozzárendelési problémát, eltérően az mesterséges neurális hálózatokban (ANN-ek) alkalmazott visszaterjesztési módszertől.”",
      "„A elmélet azt sugallja, hogy a neurális aktivitás változásai megelőzik a szinaptikus súlyok módosulását, ellentétben a visszaterjesztéssel, ahol a súlyváltozások vezetnek a neurális aktivitás megváltozásához.”",
      "„Ez a megközelítés jobban igazodhat a biológiai folyamatokhoz, és betekintést nyújthat a hatékonyabb tanulási algoritmusok kifejlesztésébe, hozzájárulva az AI és az emberi agy tanulási hasonlóságairól és különbségeiről szóló vitákhoz.”"
    ],
    "points": 138,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1732737627
  }
]
