[
  {
    "id": 42259278,
    "title": "يمكن للبرامج الضارة إيقاف تشغيل ضوء LED للكاميرا وتسجيل الفيديو، كما تم توضيحه على جهاز ThinkPad X230",
    "originLink": "https://github.com/xairy/lights-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259278",
    "commentBody": "",
    "originSummary": [
      "يقدم المستودع أدوات للتلاعب بمصباح LED الخاص بالكاميرا في جهاز ThinkPad X230، موضحًا كيف يمكن للبرامج الضارة تسجيل الفيديو دون إشعار LED. - تتضمن العملية إعادة برمجة البرامج الثابتة للكاميرا عبر USB، وهي تقنية يمكن تطبيقها على أجهزة لابتوب مختلفة، باستخدام سكريبتات للتلاعب بالبرامج الثابتة والتحكم في LED. - تستخدم الكاميرا وحدة تحكم Ricoh R5U8710، وينصح بالحذر حيث أن إعادة البرمجة قد تتسبب في تلف الكاميرا؛ تتوفر المزيد من الرؤى في حديث \"Lights Out\" في POC 2024."
    ],
    "commentSummary": [
      "يتمتع البرمجيات الخبيثة بالقدرة على تعطيل أضواء LED الخاصة بالكاميرا وتسجيل الفيديو دون علم المستخدم، كما تم إثبات ذلك على جهاز ThinkPad X230. - على عكس أجهزة MacBook التي تحتوي على أضواء LED موصولة بشكل مباشر للإشارة إلى استخدام الكاميرا، تفتقر العديد من أجهزة الكمبيوتر المحمولة الأخرى إلى هذه الميزة، مما يثير مخاوف تتعلق بالخصوصية. - لتعزيز الأمان، يوصي الخبراء باستخدام أغطية أو مفاتيح مادية للكاميرات والميكروفونات لمنع الوصول غير المصرح به وحماية المعلومات الحساسة."
    ],
    "points": 915,
    "commentCount": 482,
    "retryCount": 0,
    "time": 1732738255
  },
  {
    "id": 42264427,
    "title": "هتزنر تخفض حركة المرور على الخوادم الافتراضية الخاصة في الولايات المتحدة",
    "originLink": "https://news.ycombinator.com/item?id=42264427",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264427",
    "commentBody": "",
    "originSummary": [
      "يتم تحديث هيكل التعريفة للخوادم السحابية (خطوط CCX وCPX) وموازنات التحميل في أشبورن وهيلزبورو، الولايات المتحدة. ستطبق الأسعار الجديدة وكميات المرور على الخوادم التي تم إنشاؤها وإعادة تحجيمها بدءًا من 1 ديسمبر 2024، مع رؤية الخوادم الحالية للتغييرات اعتبارًا من 1 فبراير 2025. يهدف التحديث إلى توفير تسعير أكثر عدلاً بناءً على الظروف المحلية، بينما تظل أسعار تجاوز المرور دون تغيير."
    ],
    "commentSummary": [
      "تقوم شركة هيتزنر بمراجعة نموذج التسعير الخاص بها لخوادم السحابة وموازنات التحميل في الولايات المتحدة، حيث تقلل حركة المرور المضمنة من 20 تيرابايت إلى 1 تيرابايت فقط وترفع الأسعار.",
      "ستدخل التغييرات حيز التنفيذ في ديسمبر 2024 للخوادم الجديدة وفبراير 2025 للخوادم الحالية، بهدف تحقيق توازن في التكاليف بين المستخدمين ذوي الموارد المنخفضة والعالية.",
      "أدى القرار إلى نقاشات حول العدالة واستراتيجيات الأعمال، حيث أعرب بعض المستخدمين عن عدم رضاهم بشأن التخفيض الجذري في حركة المرور المضمنة."
    ],
    "points": 236,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1732792964
  },
  {
    "id": 42264733,
    "title": "أستراليا: حظر الأطفال دون سن 16 عامًا من وسائل التواصل الاجتماعي بعد تمرير مجلس الشيوخ قوانين",
    "originLink": "https://www.abc.net.au/news/2024-11-28/social-media-age-ban-passes-parliament/104647138",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42264733",
    "commentBody": "",
    "originSummary": [
      "أستراليا قد أصدرت تشريعًا جديدًا يحظر على الأطفال دون سن 16 عامًا استخدام وسائل التواصل الاجتماعي، بهدف حماية الصحة العقلية.",
      "لدى شركات وسائل التواصل الاجتماعي عام للامتثال، حيث تواجه غرامات تصل إلى 50 مليون دولار في حالة عدم الامتثال، بينما لا يواجه المستخدمون والآباء أي عقوبات.",
      "لا ينطبق القانون على تطبيقات المراسلة أو الألعاب عبر الإنترنت أو الخدمات التعليمية، وقد تلقى ردود فعل متباينة من خبراء الصحة النفسية والسياسيين وشركات التكنولوجيا."
    ],
    "commentSummary": [
      "تستعد أستراليا لحظر استخدام الأطفال دون سن 16 عامًا لوسائل التواصل الاجتماعي، مما يستلزم التحقق من الهوية لتأكيد العمر، وهو ما أثار مخاوف بشأن الخصوصية.",
      "ينتقد البعض هذا الأمر خشية أن يمنح الحكومة إمكانية الوصول إلى بيانات وسائل التواصل الاجتماعي ويقلل من خصوصية المستخدمين، حيث يقترح البعض أن وسائل الإعلام التقليدية تدعم القانون للحد من المنافسة مع وسائل التواصل الاجتماعي.",
      "فعالية القانون وتنفيذه غير مؤكدة، مع وجود ثغرات محتملة وتحديات في تطبيقه."
    ],
    "points": 234,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1732796901
  },
  {
    "id": 42259184,
    "title": "QwQ: نموذج التفكير O1 من علي بابا",
    "originLink": "https://qwenlm.github.io/blog/qwq-32b-preview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259184",
    "commentBody": "",
    "originSummary": [
      "QwQ (Qwen with Questions) هو نموذج ذكاء اصطناعي مصمم لاستكشاف المشكلات بفضول واستفسار فلسفي، حيث يقوم باستمرار بالتشكيك في افتراضاته.",
      "على الرغم من القيود مثل خلط اللغات والحلقات المنطقية المتكررة، يبرز QwQ في المجالات التقنية، محققًا درجات عالية في معايير مثل GPQA وAIME وMATH-500 وLiveCodeBench.",
      "يظهر النموذج قدرات قوية في حل المشكلات في الرياضيات والبرمجة، مما يساهم في الرحلة المستمرة لفهم التفكير الاصطناعي وذكاء الآلة."
    ],
    "commentSummary": [
      "نموذج اللغة الكبير QwQ من علي بابا يلفت الانتباه لأدائه المميز على أجهزة متنوعة، بما في ذلك أجهزة ماك بوك، وقدرته على حل المهام المعقدة مع تقديم تفسيرات مفصلة.",
      "تشمل المناقشات حول QwQ متطلبات الأجهزة، وقضايا الرقابة المحتملة على المواضيع الحساسة، وقدراته على الانفتاح والتفكير، على الرغم من بعض القيود الملحوظة.",
      "تسلط المحادثة الضوء على الآثار الأوسع لنماذج اللغة الكبيرة مفتوحة المصدر وديناميكيات المنافسة في مجال تطوير الذكاء الاصطناعي."
    ],
    "points": 233,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1732737625
  },
  {
    "id": 42263834,
    "title": "في مدح الطباعة: القراءة ضرورية في عصر الانهيار المعرفي",
    "originLink": "https://lithub.com/in-praise-of-print-why-reading-remains-essential-in-an-era-of-epistemological-collapse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42263834",
    "commentBody": "",
    "originSummary": [
      "يؤكد إد سيمون على الأهمية الدائمة لقراءة المطبوعات، مشيرًا إلى كتاب سفين بيركيرتس \"مراثي غوتنبرغ\" لتسليط الضوء على المخاوف بشأن تأثير الوسائط الرقمية على القراءة العميقة والمعلومات المضللة.",
      "يجادل سيمون بأن الكتب المطبوعة توفر تجربة فريدة وغامرة لا يمكن لوسائل الإعلام الرقمية تكرارها، مما يعزز التأمل والخصوصية بعيدًا عن الضجيج المستمر للإنترنت.",
      "يستنتج أن الحفاظ على القدرة على القراءة والكتابة العميقة ضروري للحفاظ على التفكير الفردي ومقاومة التأثير الواسع للتكنولوجيا الرقمية."
    ],
    "commentSummary": [
      "تدور المناقشة بين القراءة المطبوعة والرقمية حول المخاوف بشأن تأثير الوسائط الرقمية على التفاعل العميق مع المحتوى. يشير مؤيدو القراءة الرقمية إلى الراحة وسهولة الوصول، بينما يقلق النقاد بشأن تأثيرها على التفكير النقدي ومدى الانتباه. تعكس هذه المناقشة قضايا أوسع تتعلق بتأثير التكنولوجيا على استهلاك المعلومات والتوازن بين التقدم التكنولوجي واكتساب المعرفة التقليدية."
    ],
    "points": 225,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732785781
  },
  {
    "id": 42261909,
    "title": "Voice-Pro – سحر استنساخ الصوت بالذكاء الاصطناعي: حوّل أي صوت في 15 ثانية",
    "originLink": "https://github.com/abus-aikorea/voice-pro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261909",
    "commentBody": "",
    "originSummary": [
      "Voice-Pro هو واجهة ويب Gradio مفتوحة المصدر مصممة للتلاعب الصوتي المتقدم، بما في ذلك استنساخ الصوت بدون عينات مسبقة ومغير صوت يحتوي على أكثر من 50 صوتًا لمشاهير.",
      "يقدم ميزات مثل تنزيل الصوت من يوتيوب، وعزل الصوت، وتحويل النص إلى كلام بعدة لغات، والترجمة، باستخدام محركات Whisper.",
      "يعتبر Voice-Pro مفيدًا بشكل خاص لمنشئي المحتوى والمطورين وعشاق الصوت، مع توفر الموارد على GitHub ودروس الفيديو على YouTube."
    ],
    "commentSummary": [
      "Voice-Pro هو أداة ذكاء اصطناعي مفتوحة المصدر تتيح استنساخ الصوت في 15 ثانية، وتتميز باستنساخ الصوت بدون تدريب مسبق وتغيير الصوت بأكثر من 50 صوتًا لمشاهير. تتضمن وظائف مثل تنزيل الصوت من يوتيوب، وعزل الصوت، وتحويل النص إلى كلام وترجمة متعددة اللغات، مدعومة بمحركات Whisper، ومتاحة على GitHub. على الرغم من إمكاناتها الإبداعية، هناك مخاوف بشأن إساءة استخدامها لسرقة الهوية والاحتيال، وهي حاليًا تفتقر إلى الدعم لنظامي Linux أو MacOS، مع وجود تساؤلات حول التثبيت والتكاليف المخفية."
    ],
    "points": 197,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1732761421
  },
  {
    "id": 42260027,
    "title": "إغلاق أسواق الطعام التي يبلغ عمرها 850 عامًا في لندن",
    "originLink": "https://www.bbc.co.uk/news/articles/cje050wz22qo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260027",
    "commentBody": "",
    "originSummary": [
      "ستغلق أسواق سميثفيلد وبيليجسجيت التاريخية في لندن، التي تعتبر ذات أهمية لتاريخها الذي يمتد لـ 850 عامًا، بحلول عام 2028 حيث تسحب مؤسسة مدينة لندن دعمها. تُعرف الأسواق بأنها أكبر أسواق الجملة للحوم والأسماك الداخلية في المملكة المتحدة، وسيتم استبدالها بتطورات جديدة، مع حصول التجار على تعويض ومساعدة في الانتقال. تم التخلي عن خطط نقل الأسواق إلى داجنهام بسبب التكاليف العالية، مما أثار مخاوف بشأن مستقبل إمدادات الأسماك في لندن ويمثل خسارة للتقاليد."
    ],
    "commentSummary": [
      "تخطط لإغلاق أسواق الطعام التاريخية في لندن، مثل سميثفيلد وبيليغزغيت، حيث تروج مؤسسة مدينة لندن لذلك باعتباره \"فصلًا جديدًا إيجابيًا\" للتجار. - يقترح النقاد أن الإغلاقات تهدف إلى تسهيل تطوير العقارات، وتحويل المنطقة إلى مركز تجاري، مما يثير القلق بشأن فقدان التراث الثقافي. - القرار ينتظر موافقة البرلمان، مع مخاوف بشأن التأثير السلبي المحتمل على الأعمال المحلية."
    ],
    "points": 192,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1732743398
  },
  {
    "id": 42262734,
    "title": "picoCAD - نموذج صغير للنماذج الصغيرة",
    "originLink": "https://store.steampowered.com/app/2800590/picoCAD/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42262734",
    "commentBody": "",
    "originSummary": [
      "تم إصدار picoCAD، أداة النمذجة ثلاثية الأبعاد لإنشاء نماذج بأسلوب رجعي، في 27 نوفمبر 2024 من قبل Apskeppet، لتلبية احتياجات كل من المبتدئين والخبراء. الأداة متاحة لنظامي التشغيل Windows وmacOS، بسعر تمهيدي قدره 5.09 دولار حتى 4 ديسمبر 2024. يُشجع المستخدمون على الانضمام إلى المجتمع واستكشاف الدروس لتعزيز إبداعهم باستخدام picoCAD."
    ],
    "commentSummary": [
      "picoCAD هو أداة نمذجة ثلاثية الأبعاد بسيطة مفضلة لبساطتها وسهولة استخدامها، خاصة لإنشاء نماذج منخفضة المضلع، مقارنة بالبرامج الأكثر تعقيدًا مثل Blender. تم تطويره بواسطة Johan Peitz، ويسمح picoCAD بالتصدير إلى صيغ obj/mtl، رغم أنه يفتقر إلى التصدير الثنائي الأصلي على Picotron. يقدر المستخدمون جماليته الفريدة وبساطته، وغالبًا ما يقارنونه بأدوات أخرى مثل Crocotile وKenney Shape."
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1732772100
  },
  {
    "id": 42260030,
    "title": "التصنيف الذاتي العائم",
    "originLink": "https://arxiv.org/abs/2411.16544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260030",
    "commentBody": "",
    "originSummary": [
      "تقدم الورقة مفهوم \"التصنيف الذاتي\"، وهي طريقة لترميز معلومات النوع داخل كائنات بحجم 64 بت، مما يحسن تخطيط الذاكرة للغات الديناميكية دون التضحية بمساحة البيانات.",
      "تحسين العلامات الذاتية يزيد من سرعة التنفيذ في المعايير الثقيلة على الأعداد العائمة بمقدار 2.3 مرة في Scheme و2.7 مرة في JavaScript، مما يوفر بديلاً أكثر كفاءة للطرق الحالية مثل المؤشرات الموسومة وNaN-tagging.",
      "تسمح هذه الطريقة بتشفير فعال لكل من البيانات والنوع، مما يعزز الأداء دون التأثير على العمليات الأخرى، مما يجعلها حلاً واعدًا للتعامل مع الأعداد العشرية ذات الدقة المزدوجة 64 بت IEEE754 في اللغات الديناميكية."
    ],
    "commentSummary": [
      "تقدم الورقة تقنية \"التوسيم الذاتي للعدد العشري\"، وهي تقنية تهدف إلى تحسين تخزين الأعداد العشرية في لغات البرمجة الديناميكية من خلال استخدام البتات العالية للتوسيم، مما يسمح لمعظم الأعداد العشرية بالبقاء غير مغلفة وتحسين الأداء.",
      "ينتقد منتقدو الورقة البحثية أن مقارناتها معيبة ويوصون بإجراء اختبارات ضد الأساليب المعروفة مثل NaN-tagging، وهي تقنية لتشفير معلومات إضافية في قيم NaN (ليس رقمًا) للأرقام العائمة.",
      "تُلاحظ التقنية لبساطتها وإمكاناتها، حيث تم تنفيذ طرق مشابهة بالفعل في لغات مثل Koka وCRuby، وتم رؤية تحسينات ذات صلة في أنظمة مثل Objective-C من Apple وآلة جافا الافتراضية (JVM)."
    ],
    "points": 164,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1732743412
  },
  {
    "id": 42260017,
    "title": "تطوير دواء للسرطان دون شركات الأدوية الكبرى: هذا المستشفى يثبت أنه يمكن القيام بذلك",
    "originLink": "https://www.ftm.nl/artikelen/ruzie-tussen-ziekenhuis-en-farma-industrie-over-goedkeuring-kankermedicijn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260017",
    "commentBody": "",
    "originSummary": [
      "تُعزى زيادة تكاليف الرعاية الصحية في هولندا إلى البيروقراطية والهدر والرعاية غير الضرورية، مما يبرز عدم الكفاءة النظامية.",
      "طور مستشفى هولندي دواءً لعلاج السرطان بشكل مستقل عن شركات الأدوية الكبرى، مما يوفر علاجًا أرخص بخمس مرات من العلاج الأمريكي المماثل، مما يبرز الإمكانية للمستشفيات غير الربحية في تقليل تكاليف الرعاية الصحية.",
      "على الرغم من الابتكار، فإن عملية التسجيل المكلفة والمعقدة لوكالة الأدوية الأوروبية (EMA) تثني المستشفيات؛ ومع ذلك، قام مستشفى AVL بتمويل دراسة في المرحلة الثالثة من خلال التبرعات، بهدف الحصول على موافقة وكالة الأدوية الأوروبية للحفاظ على علاجهم الميسور التكلفة ضد المنافسة الصيدلانية الباهظة."
    ],
    "commentSummary": [
      "نجح مستشفى في تطوير دواء للسرطان بشكل مستقل، مما يثبت أن تطوير الأدوية يمكن أن يحدث دون مشاركة شركات الأدوية الكبرى. - يتعرض عملية تطوير الأدوية التقليدية للانتقاد بسبب تكلفتها العالية وتأثرها بعوامل غير علمية، مثل الأنا والسياسة. - تركز المناقشة على التعقيدات في تطوير الأدوية، بما في ذلك التحديات التنظيمية وارتفاع معدل فشل الأدوية خلال التجارب السريرية."
    ],
    "points": 154,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1732743349
  },
  {
    "id": 42261053,
    "title": "مشروع دراجة الألمنيوم لمعهد ماساتشوستس للتكنولوجيا 1974 (2016)",
    "originLink": "https://www.sheldonbrown.com/AluminumBikeProject.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261053",
    "commentBody": "",
    "originSummary": [
      "في عام 1974، استضاف معهد ماساتشوستس للتكنولوجيا دورة حيث قام المشاركون، بما في ذلك مارك روزنباوم وهارييت فيل، ببناء إطارات دراجات من الألومنيوم، وكان تصميم روزنباوم هو الأخف وزنًا لدراجة سباق في ذلك الوقت. كانت دراجة روزنباوم مصنوعة من الألومنيوم 6061-T6 والتيتانيوم، وتتميز بأنابيب ذات قطر أكبر ومحامل دقيقة، ووزنها 12 رطلاً و5 أونصات، وهي معروضة الآن في متحف معهد ماساتشوستس للتكنولوجيا. كان إطار هارييت فيل متورطًا في نزاع براءة اختراع بين شركة كانونديل وكلاين، حيث استخدمت كانونديل الإطار للاحتجاج ضد براءة اختراع كلاين من خلال الادعاء بوجود فن سابق."
    ],
    "commentSummary": [
      "في عام 1974، اعتبرت معهد ماساتشوستس للتكنولوجيا الألومنيوم لاستخدامه في إطارات الدراجات، ورفضت المغنيسيوم بسبب هشاشته ومشاكل التآكل، على الرغم من أن سبائك المغنيسيوم الحديثة مثل LPSO تظهر إمكانيات. - المحاولات التاريخية مع إطارات المغنيسيوم، مثل تلك الخاصة بكيرك، غالبًا ما فشلت بسبب ضعف المواد، بينما يُفضل الألياف الكربونية والتيتانيوم لقوتهما ومرونتهما. - على الرغم من التقدم في المواد، يظل الوزن محور التركيز في تصميم الدراجات، مع زيادة التركيز على الديناميكا الهوائية وراحة الراكب."
    ],
    "points": 152,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1732751978
  },
  {
    "id": 42261707,
    "title": "تقوم شركة ديل بنشر تحديثات غير موقعة على موقعها الإلكتروني والتي تفشل في التثبيت",
    "originLink": "https://infosec.exchange/@0xabad1dea/113543212666056329",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42261707",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تقوم شركة ديل بإصدار تحديثات غير موقعة على موقعها الإلكتروني، مما يؤدي إلى فشل في التثبيت ويثير مخاوف أمنية بشأن إمكانية استغلالها من قبل القراصنة.",
      "أفاد المستخدمون بوجود عدم تطابق بين كتالوجات التحديث والتوقيعات، مع حل بعض المشكلات بعد تقديم الشكاوى، لكن الانتقادات لا تزال قائمة بشأن إدارة التحديثات من قبل شركة ديل.",
      "تؤكد الحالة على الحاجة الملحة للتحقق من تحديثات البرامج لضمان الأمان والموثوقية عبر منصات مختلفة، بما في ذلك أبل ولينكس."
    ],
    "points": 150,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732759401
  },
  {
    "id": 42260364,
    "title": "القصة المنسية عن كيفية اختراع شركة IBM للمصنع الآلي",
    "originLink": "https://spectrum.ieee.org/semiconductor-fabrication",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42260364",
    "commentBody": "",
    "originSummary": [
      "في عام 1970، أطلق بيل هاردينغ من شركة IBM مشروع SWIFT، بهدف أتمتة تصنيع الرقائق لإنتاج الدوائر المتكاملة (ICs) في أقل من يوم، وهو تقليص كبير من العملية التي كانت تستغرق عادةً شهرًا. حقق SWIFT إنجازًا بتقليص الوقت إلى 5 ساعات لكل طبقة، وهو إنجاز لم يتم تجاوزه حتى الآن، وقدم ابتكارات مثل المعالجة الآلية والتحكم في الوقت الحقيقي، والتي تعتبر أساسية في تصنيع أشباه الموصلات الحديثة. وعلى الرغم من وجوده القصير، فإن تقدم مشروع SWIFT وقيادة هاردينغ الرؤيوية أثرت بشكل كبير على تطور تقنيات إنتاج أشباه الموصلات."
    ],
    "commentSummary": [
      "كانت شركة IBM في السابق رائدة في مجال التصنيع الآلي، حيث كانت تهدف إلى التكامل الرأسي الكامل من المواد الخام إلى البرمجيات، مما جعل الرقائق المخصصة أكثر جدوى من الخيارات القياسية. - نظرًا للتكاليف العالية لتطوير التكنولوجيا، قامت العديد من الشركات، بما في ذلك IBM، بالاستعانة بمصادر خارجية للإنتاج أو فصل مرافق التصنيع الخاصة بها. - تركز الجهود الحالية، مثل مشروع Atomic Semi لجيم كيلر، على جعل عمليات التصنيع الصغيرة اقتصادية، واستكشاف الابتكارات مثل الدوائر المتكاملة الخاصة بالتطبيقات (ASICs) المهيكلة والطباعة الحجرية بدون قناع لتقليل التكاليف وتحسين الوصول إلى السيليكون المخصص."
    ],
    "points": 147,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1732745938
  },
  {
    "id": 42259133,
    "title": "رفض مكتب حقوق الطبع والنشر الأمريكي جهدًا كبيرًا لحفظ الألعاب",
    "originLink": "https://www.gamesradar.com/games/publishers-are-absolutely-terrified-preserved-video-games-would-be-used-for-recreational-purposes-so-the-us-copyright-office-has-struck-down-a-major-effort-for-game-preservation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259133",
    "commentBody": "",
    "originSummary": [
      "رفض مكتب حقوق الطبع والنشر الأمريكي طلب إعفاء من قانون الألفية للملكية الرقمية (DMCA) الذي كان يهدف إلى السماح للمكتبات بمشاركة الوصول الرقمي عن بُعد لألعاب الفيديو المحفوظة، مما أنهى حملة استمرت ثلاث سنوات من قبل مؤسسة تاريخ ألعاب الفيديو (VGHF) وشبكة حفظ البرمجيات.",
      "كان من شأن الإعفاء المقترح أن يسهل إنشاء مكتبة رقمية للمؤرخين والباحثين للوصول إلى الألعاب التي لم تعد تُطبع، لكنه رُفض بسبب المخاوف المتعلقة بالاستخدام الترفيهي المحتمل والأضرار السوقية، كما جادلت مجموعات الصناعة.",
      "أعربت VGHF عن خيبة أملها، منتقدة القرار باعتباره متأثرًا بشكل كبير بضغوط الصناعة، التي أولت الأولوية لمصالح الصناعة على حساب الوصول العام إلى الألعاب التاريخية."
    ],
    "commentSummary": [
      "رفض مكتب حقوق الطبع والنشر الأمريكي اقتراحًا يهدف إلى الحفاظ على ألعاب الفيديو، بسبب مخاوف من أن هذه الألعاب قد تُستخدم لأغراض ترفيهية بدلاً من الحفاظ عليها.",
      "أشعل هذا القرار نقاشات بين عشاق الألعاب القديمة، الذين يجادلون بأن الألعاب القديمة توفر متعة وحنينًا أكثر مقارنة بالألعاب الحديثة.",
      "يعتقد منتقدو القرار أن قوانين حقوق الطبع والنشر الحالية مفرطة في التقييد، مما يعيق الحفاظ على الوسائط الثقافية والتاريخية، ويقترحون تقصير مدة حقوق الطبع والنشر لتعزيز الابتكار والسماح للأعمال القديمة بدخول الملكية العامة في وقت أقرب."
    ],
    "points": 140,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1732737261
  },
  {
    "id": 42259185,
    "title": "استنتاج النشاط العصبي قبل اللدونة للتعلم بما يتجاوز الانتشار العكسي",
    "originLink": "https://www.nature.com/articles/s41593-023-01514-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42259185",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة \"التكوين المستقبلي\"، وهو مبدأ جديد لتخصيص الائتمان في التعلم، كبديل للطريقة التقليدية للانتشار العكسي.",
      "يتضمن التكوين المستقبلي استخدام الشبكات العصبية للتنبؤ بأنماط النشاط العصبي المرغوبة قبل تعديل أوزان المشابك، مما يعزز الكفاءة والفعالية في التعلم.",
      "تتوافق هذه الطريقة بشكل أكبر مع النشاط العصبي المرصود في الدراسات البشرية والحيوانية وقد تقدم مزايا في كل من الأنظمة البيولوجية والاصطناعية للتعلم مقارنة بالانتشار العكسي."
    ],
    "commentSummary": [
      "تم اقتراح نظرية جديدة، \"التكوين المستقبلي\"، لشرح كيفية معالجة الدماغ لمشكلة تخصيص الائتمان، والتي تختلف عن طريقة الانتشار العكسي المستخدمة في الشبكات العصبية الاصطناعية (ANNs).",
      "تشير النظرية إلى أن التغيرات في النشاط العصبي تسبق تعديلات الأوزان المشبكية، مما يتناقض مع الانتشار العكسي حيث تؤدي تغييرات الأوزان إلى تغيير النشاط العصبي.",
      "قد يتماشى هذا النهج بشكل أفضل مع العمليات البيولوجية ويمكن أن يوفر رؤى لتطوير خوارزميات تعلم أكثر كفاءة، مما يساهم في النقاشات حول أوجه التشابه والاختلاف بين تعلم الذكاء الاصطناعي وتعلم الدماغ البشري."
    ],
    "points": 138,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1732737627
  }
]
