[
  {
    "id": 42497093,
    "title": "Ne oldu dünyanın en büyük tüplü televizyonuna? [video]",
    "originLink": "https://www.youtube.com/watch?v=JfZxOuc9Qwk",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42497093",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bir YouTube fenomeni, dünyanın en büyük tüplü televizyonunu, nadir bir Sony modelini, yok olmaktan kurtararak Japonya'dan ABD'ye kişisel kullanım için taşıdı.- Bu karar, bu tür benzersiz eserlerin özel koleksiyonlar yerine müzelerde korunması gerekip gerekmediği konusunda tartışma başlattı.- Durum, nadir eşyaların korunmasındaki zorlukları ve mülkiyet ile kültürel miras etrafındaki karmaşık sorunları vurguluyor."
    ],
    "points": 564,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1734983374
  },
  {
    "id": 42499567,
    "title": "Pi sayısının kötü bir ikizi var",
    "originLink": "https://mathstodon.xyz/@johncarlosbaez/113703444230936435",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42499567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yatay sekiz şeklindeki lemniskat eğrisi ile ilişkilendirilen lemniskat sabiti, ϖ ile gösterilir ve pi sayısının bir karşılığıdır.",
      "Bu tartışmalar, bilim kurgudaki potansiyel uygulamalarını, yazım varyasyonlarını ve matematiksel önemini vurgulamaktadır.",
      "Konuşma ayrıca dil ve matematik üzerindeki kültürel ve tarihi etkileri, özellikle Yunan ve Arap katkılarını inceliyor."
    ],
    "points": 360,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1735011682
  },
  {
    "id": 42500475,
    "title": "38. Kaos İletişim Kongresi",
    "originLink": "https://events.ccc.de/congress/2024/infos/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42500475",
    "commentBody": "",
    "originSummary": [
      "38. Chaos Communication Congress (38C3), Chaos Computer Club tarafından organize edilen ve 27-30 Aralık 2024 tarihleri arasında Hamburg'da gerçekleşmesi planlanan bir etkinliktir. Bu yıllık etkinlik, teknoloji, toplum ve ütopya kesişimine vurgu yaparak, teknolojinin etkisi üzerine dersler, atölye çalışmaları ve tartışmalar sunmaktadır. Katılımcılar, gönüllü olarak, etkinliklere ev sahipliği yaparak veya projeler sunarak etkinliğe katılmaya davet edilmektedir ve etkinliğin bilgi sayfaları ve blogunda anahtar bilgilere ulaşılabilir."
    ],
    "commentSummary": [
      "38. Chaos Communication Congress (CCC), yapay zeka, biyoloji ve gömülü sistemler üzerine çeşitli konuşmalarıyla dikkat çekiyor ve Joscha Bach'ın \"Hesaplamadan Bilince\" serisini öne çıkarıyor. Etkinlik, ana akım dışı tartışmalarıyla tanınıyor ve biletleme gibi zorluklar ile teknik ve toplumsal konular arasındaki dengeyi ele alarak canlı yayınlanacak. CCC, hacker topluluğu için açıklık ve kapsayıcılığa odaklanan önemli bir etkinlik olup, dil kullanımı da dahil olmak üzere politik ve kültürel yönleri keşfediyor."
    ],
    "points": 308,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1735028149
  },
  {
    "id": 42498648,
    "title": "ESP32 Kullanarak Düşük Maliyetli Bir Drone Yapın",
    "originLink": "https://www.digikey.com/en/maker/projects/a-step-by-step-guide-to-build-a-low-cost-drone-using-esp32/8afccd0690574bcebfa0d2ad6fd0a391",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DIY drone ekosistemi, özelleştirme için uygun fiyatlı bileşenler olan uçuş kontrol mikrodenetleyici birimleri (MCU'lar), motor sürücüleri ve kameralar ile genişliyor.",
      "Açık kaynaklı yazılımlar olan Betaflight ve ArduPilot, DJI gibi tescilli sistemlere alternatifler sunarak bu DIY yapıları destekler, ancak şu anda bazı alanlarda geride kalmaktadırlar.",
      "ESP32 mikrodenetleyici, WiFi üzerinden gerçek zamanlı kontrol gibi zorluklara rağmen, giriş seviyesi kurulumların yaklaşık 500 dolara mal olmasıyla drone projeleri için uygun maliyetli bir seçenektir."
    ],
    "points": 298,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1734999639
  },
  {
    "id": 42498634,
    "title": "AMD GPU'ları LLM çıkarımı için rekabetçi hale getirmek (2023)",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498634",
    "commentBody": "",
    "originSummary": [
      "MLC-LLM, ROCm kullanarak AMD GPU'lar üzerinde Büyük Dil Modellerinin (LLM'ler) derlenmesini ve dağıtımını kolaylaştırır, NVIDIA'nın üst düzey GPU'larına yakın bir performans elde eder.- AMD Radeon RX 7900 XTX, belirli modeller için NVIDIA RTX 4090'ın hızının %80'ine ve RTX 3090 Ti'nın %94'üne ulaşarak rekabetçi bir performans sunar ve önemli ölçüde daha uygun fiyatlıdır.- Proje, LLM çıkarımı için AMD GPU'larının potansiyelini vurgular, yazılım desteğinde devam eden iyileştirmeler ve toplu işleme ile çoklu GPU desteği gibi gelecekteki geliştirmeler için planlar bulunmaktadır."
    ],
    "commentSummary": [
      "AMD'nin RX7900XTX gibi tüketici GPU'ları, MI300X gibi veri merkezi GPU'larından mimari olarak farklılık gösterir ve bu durum performans seviyelerini etkiler. AMD'nin CDNA mimarisi ve HIP (Taşınabilirlik için Heterojen Hesaplama Arayüzü) desteğini derin öğrenme platformlarına entegre etme çabaları artmaktadır ve bu, Nvidia'nın AI iş yüklerindeki hakimiyetine meydan okumayı amaçlamaktadır. Artan ilgiye rağmen, yazılım desteği ve performans tutarlılığı gibi zorluklar devam etmekte ve bazı geliştiricilerin, CUDA (Birleşik Hesaplama Cihazı Mimarisi) platformu ile önemli bir avantaja sahip olan Nvidia'ya geri dönmesine yol açmaktadır."
    ],
    "points": 241,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1734999438
  },
  {
    "id": 42498462,
    "title": "Kanser kılavuzları neden PDF'lerde sıkışıp kalıyor?",
    "originLink": "https://seangeiger.substack.com/p/why-are-cancer-guidelines-stuck-in",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498462",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kanser kılavuzları, kullanılabilirlik ve tıbbi sistemlerle entegrasyon konusundaki sınırlamalara rağmen, dayanıklılıkları ve taşınabilirlikleri nedeniyle sıklıkla PDF formatında saklanır. Yapılandırılmış verilere geçiş, kullanılabilirliği artırabilir, ancak tıbbi bilginin karmaşıklığı, standartlaşma eksikliği ve düzenleyici engeller gibi zorluklar bulunmaktadır. Tartışma, otomatik sistemlerde tutarlı güncellemeler ve hata yönetimi ihtiyacını göz önünde bulundurarak, PDF'lerin güvenilirliğini dinamik, makine tarafından yorumlanabilir veri çözümlerinin potansiyel avantajlarıyla dengeleme üzerine odaklanmaktadır."
    ],
    "points": 229,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1734996997
  },
  {
    "id": 42497173,
    "title": "Tam Lego Island'ın dekompilyasyonu",
    "originLink": "https://github.com/isledecomp/isle",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42497173",
    "commentBody": "",
    "originSummary": [
      "Proje, LEGO Island'ın (Sürüm 1.1, İngilizce) tam bir dekompilesini içeriyor ve orijinal makine kodunu mümkün olduğunca yakından kopyalamayı hedefliyor.",
      "CMake'i derleme için kullanır, en iyi sonuçlar için Microsoft Visual C++ 4.20 önerilir ve ortamın ayarlanmasını, CMake ile yapılandırmayı ve nmake ile derlemeyi içerir.",
      "Katkılar teşvik edilmektedir, özellikle 1.1 sürümünün İngilizce versiyonuna odaklanarak, decompile edilmiş ISLE.EXE ve LEGO1.DLL dosyalarına sürekli iyileştirmeler yapılmaktadır."
    ],
    "commentSummary": [
      "Bir GitHub projesi, klasik oyun Lego Island'ı başarıyla decompile ederek, orijinal oyundaki hataları düzeltme çabalarını geliştirdi. Teknik içerikleriyle tanınan bir YouTuber olan MattKC, bu dekompilasyon projesinde önemli bir rol oynadı. Proje, doğruluğu vurgulamakta ve bir lint aracı ile bir kaynak düzenleyici gibi araçlar içermektedir. Proje, vintage LEGO oyunlarını yeniden yapma konusunda ilgi uyandırdı ve hayranlar, Rock Raiders ve Lego Loco gibi başlıklar için nostalji ifade ederek, bu klasik oyunları koruma ve geliştirme konusundaki topluluk takdirini vurguladı."
    ],
    "points": 216,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1734984217
  },
  {
    "id": 42500482,
    "title": "Intel hissedarları, eski CEO ve CFO'dan 3 yıllık maaşlarını geri ödemelerini talep eden bir dava açtı.",
    "originLink": "https://www.cfodive.com/news/intel-shareholders-yank-exceo-cfo-compensation-foundry/736193/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42500482",
    "commentBody": "",
    "originSummary": [
      "Intel hissedarları, eski CEO Pat Gelsinger ve CFO David Zinsner'dan tazminatlarının iadesini talep ediyor, onları Intel'in dökümhane biriminin finansal performansı hakkında hissedarları yanıltmakla suçluyorlar.",
      "Dava, Intel'in başarısız dönüşüm planı ve rekor 16,6 milyar dolarlık üç aylık kaybının ardından Intel hisselerinin %9,2 düşmesine yol açan bir güven yükümlülüğü ihlali iddiasında bulunuyor.",
      "Başlangıçta büyümeyi yönlendirmesi beklenen dökümhane birimi, daha sonra önemli bir maliyet merkezi olarak tanımlandı ve Gelsinger istifa ederken, şimdi geçici CEO olan Zinsner tarafından yeniden yapılandırma çabalarını başlattı."
    ],
    "commentSummary": [
      "Intel hissedarları, eski CEO ve CFO'ya karşı bir dava açarak başarısız bir iş planı nedeniyle üç yıllık maaşın iadesini talep etti.",
      "Eleştirmenler, yöneticilerin Intel'in Dökümhane biriminin karşılaştığı zorlukları kabul ettiklerini belirterek davanın temelsiz olduğunu savunuyorlar.",
      "Dava, hissedarlar ile şirket liderliği arasındaki gerilimleri vurguluyor ve bazıları bunu mali kazanç amacıyla motive edilmiş gereksiz bir eylem olarak görüyor."
    ],
    "points": 199,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1735028274
  },
  {
    "id": 42501102,
    "title": "Tokyo, tüm şehrin nokta bulutu verilerini ücretsiz olarak yayınladı.",
    "originLink": "https://twitter.com/spatiallyjess/status/1871342549958537326",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42501102",
    "commentBody": "",
    "originSummary": [
      "Tokyo, tüm şehrin ücretsiz nokta bulutu verilerini kamuya açık hale getirerek indirilebilir duruma getirdi.",
      "Point cloud verileri, genellikle 3D modelleme ve coğrafi bilgi sistemlerinde (CBS) kullanılan, uzaydaki veri noktalarının bir koleksiyonudur.",
      "Bu sürüm, Tokyo'nun 3D modellemesi ve mekansal analiziyle ilgilenen geliştiriciler, araştırmacılar ve şehir plancıları için değerli kaynaklar sağladığı için önemlidir."
    ],
    "commentSummary": [
      "Tokyo, şehrin tamamının ücretsiz nokta bulutu verilerini kullanıma sundu ve etkileşimli 3D navigasyon ve keşif imkanı sağladı. - Bu girişim, İsviçre ve Fransa'daki detaylı 3D modeller ve lidar verilerinin yayınlandığı benzer girişimlere benzemektedir. - Bu veri setleri, özellikle bilgisayar tarafından üretilen görüntüler (CGI), video oyunları ve diğer 3D teknolojilerdeki uygulamalar için oldukça değerlidir."
    ],
    "points": 157,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1735037499
  },
  {
    "id": 42498982,
    "title": "Debugging Araçlarını Anlamak, Bölüm 2: Çalışan Bir Programın Anatomisi",
    "originLink": "https://www.rfleury.com/p/demystifying-debuggers-part-2-the",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498982",
    "commentBody": "",
    "originSummary": [
      "Makale \"Hata Ayıklayıcıları Anlamak, Bölüm 2: Çalışan Bir Programın Anatomisi\", sanal adres alanları, iş parçacıkları ve süreçler gibi program yürütümünde yer alan bileşenleri açıklar.- İşletim sistemlerinin sanal bellek ve zamanlama kullanarak aynı anda çalışan birden fazla programı nasıl yönettiğini detaylandırır.- Gönderi, hata ayıklayıcıların bu süreçlerle etkileşime girerek program yürütümünü nasıl analiz ettiğini açıklamaya odaklanan bir serinin parçasıdır."
    ],
    "commentSummary": [
      "Debug araçları, çalışan programları analiz etmek için çok önemlidir ve bunların Büyük Dil Modelleri (LLM'ler) ile entegre edilmesi, potansiyel olarak işlevselliklerini artırabilir.",
      "Yazılımcılar arasında LLM'lerin hata ayıklama potansiyeli hakkında bir tartışma var; bazıları hata izleme yetenekleri konusunda iyimserken, diğerleri mevcut etkinlikleri konusunda şüpheci.",
      "Tartışma, hata ayıklama uygulamaları ve yazılım geliştirmede LLM'lerin gelişen rolü üzerine farklı bakış açılarını vurguluyor."
    ],
    "points": 141,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1735004011
  },
  {
    "id": 42499332,
    "title": "Yapay yaşam arayışını temel modellerle otomatikleştirmek",
    "originLink": "https://sakana.ai/asal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42499332",
    "commentBody": "",
    "originSummary": [
      "Otomatik Yapay Yaşam Arayışı (ASAL) algoritması, simülasyonlarda yapay yaşam formlarını keşfetmek için AI görsel-dil temel modellerini kullanarak Yapay Yaşam (ALife) araştırma alanını geliştirir.- ASAL, Lenia, Boids, Parçacık Yaşamı ve Hayat Oyunu gibi simülasyonlarda yeni yaşam formlarını başarıyla tanımlayarak dinamik desenler ve yeni hücresel otomat kuralları sergilemiştir.- Bu yaklaşım, manuel olarak tasarlanmış simülasyonların sınırlamalarını aşarak keşif sürecini otomatikleştirir ve daha uyumlu ve yaratıcı sistemler için ALife kavramlarını AI ile entegre etmeye yönelik daha fazla keşif ve işbirliğini teşvik eder."
    ],
    "commentSummary": [
      "Yapay yaşam (ALife) arayışının otomasyonunda temel modellerin entegrasyonu, yapay zeka (AI) ve ALife arasındaki farkı vurgulayarak ilgi çekici bir konu haline geliyor. \"The Self-Assembling Brain\" adlı kitap, zekayı çeşitli bakış açılarından inceleyerek devam eden tartışmalara katkıda bulunuyor. \"Attention Is All You Need\" makalesinin yazarları tarafından kurulan Sakana AI, girişim sermayesi yatırımlarıyla desteklenen AI'nin ticarileştirilmesine odaklanıyor ve Yapay Zekanın Dünya Dışı Zeka Arayışı (SETI) verilerini analiz etmedeki rolü üzerine yapılan tartışmaların bir parçası."
    ],
    "points": 134,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1735008467
  },
  {
    "id": 42498514,
    "title": "2023'te Saniyede Milyonlarca URL'yi Ayrıştırma",
    "originLink": "https://onlinelibrary.wiley.com/doi/10.1002/spe.3296",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498514",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bu tartışma, özellikle URL normalizasyonu ve ayrıştırma hataları ile ilgili olarak saniyede milyonlarca URL'nin ayrıştırılması zorluklarına odaklanmaktadır.",
      "HTTP://\" ifadesinin \"HTTPS://\" olarak değiştirilmesinin gerekliliği ve HTTPS'nin güvenilirliği konusunda tartışmalar var, bazıları ise ayrıştırıcının performans iddialarına şüpheyle yaklaşıyor.",
      "Katılımcılar ayrıca verimli ayrıştırıcılar yazmanın zorluklarını, URL ayrıştırma için düzenli ifadeler (regex) kullanmanın sınırlamalarını ve çeşitli URL spesifikasyonlarına uymanın karmaşıklıklarını tartışıyorlar."
    ],
    "points": 131,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1734997688
  },
  {
    "id": 42500704,
    "title": "Paris'ten Berlin'e trenle seyahat artık beş saat daha hızlı",
    "originLink": "https://www.theguardian.com/travel/2024/dec/24/paris-to-berlin-by-train-faster-service-via-strasbourg",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42500704",
    "commentBody": "",
    "originSummary": [
      "Deutsche Bahn ve SNCF, Paris'ten Berlin'e yeni bir doğrudan gündüz tren servisi başlattı ve seyahat süresini beş saat azaltarak 7 saat 59 dakikaya indirdi.",
      "Rota, Strasbourg, Karlsruhe ve Frankfurt'ta manzaralı görünümler ve duraklar içeriyor, ikinci sınıf biletler €59.99'dan başlıyor.",
      "Hizmet daha rahat bir seyahat deneyimi sunarken, bazıları hava yolculuğuyla etkili bir şekilde rekabet edebilmesi için daha hızlı olması gerektiğini savunuyor."
    ],
    "commentSummary": [
      "Paris ve Berlin arasındaki yeni direkt tren bağlantısı, seyahat süresini beş saat azaltarak hava yolculuğuna kıyasla daha rahat bir yolculuk sunuyor.",
      "Trenler, daha düşük CO2 emisyonları üreterek çevre dostudur, ancak önemli altyapı yatırımları gerektirir.",
      "Tren yolculuğu uçmaktan daha maliyetli ve daha az esnek olabilirken, birçok gezgin konforu ve rahatlığı nedeniyle onu tercih ediyor."
    ],
    "points": 108,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1735031834
  }
]
