[
  {
    "id": 42497093,
    "title": "ماذا حدث لأكبر تلفزيون أنبوبي في العالم؟ [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=JfZxOuc9Qwk",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42497093",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أنقذ مؤثر على يوتيوب أكبر تلفزيون أنبوبي في العالم، وهو نموذج نادر من سوني، من التدمير، حيث نقله من اليابان إلى الولايات المتحدة للاستخدام الشخصي. - أثار القرار جدلاً حول ما إذا كان ينبغي الحفاظ على مثل هذه القطع الفريدة في المتاحف بدلاً من المجموعات الخاصة. - يبرز الوضع الصعوبات في الحفاظ على العناصر النادرة والقضايا المعقدة المحيطة بالملكية والتراث الثقافي."
    ],
    "points": 564,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1734983374
  },
  {
    "id": 42499567,
    "title": "العدد باي له توأم شرير",
    "originLink": "https://mathstodon.xyz/@johncarlosbaez/113703444230936435",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42499567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "الثابت الليميسكاتي، الذي يُرمز له بالرمز ϖ، يرتبط بمنحنى الليميسكاتي الذي يشبه شكل ∞ ويعتبر نظيرًا لعدد باي.",
      "تسلط المناقشات الضوء على تطبيقاته المحتملة في الخيال العلمي، وتنوع طرق كتابته، وأهميته الرياضية.",
      "تستكشف المحادثة أيضًا التأثيرات الثقافية والتاريخية على اللغة والرياضيات، لا سيما المساهمات اليونانية والعربية."
    ],
    "points": 360,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1735011682
  },
  {
    "id": 42500475,
    "title": "المؤتمر الثامن والثلاثون للاتصال الفوضوي",
    "originLink": "https://events.ccc.de/congress/2024/infos/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42500475",
    "commentBody": "",
    "originSummary": [
      "من المقرر أن يُعقد المؤتمر الثامن والثلاثون للاتصالات الفوضوية (38C3) في هامبورغ من 27 إلى 30 ديسمبر 2024، بتنظيم من نادي الكمبيوتر الفوضوي. يركز هذا الحدث السنوي على تقاطع التكنولوجيا والمجتمع واليوتوبيا، ويقدم محاضرات وورش عمل ومناقشات حول تأثير التكنولوجيا. يُدعى المشاركون للمشاركة من خلال التطوع أو استضافة الفعاليات أو تقديم المشاريع، مع توفر المعلومات الأساسية على صفحات المعلومات والمدونة الخاصة بالحدث."
    ],
    "commentSummary": [
      "يجذب المؤتمر الثامن والثلاثون للاتصال الفوضوي (CCC) الانتباه من خلال محادثاته المتنوعة حول الذكاء الاصطناعي، وعلم الأحياء، والأنظمة المدمجة، مع تسليط الضوء على سلسلة \"من الحساب إلى الوعي\" لجوشا باخ. يُعرف الحدث بمناقشاته غير التقليدية وسيتم بثه مباشرة، حيث يتناول تحديات مثل التذاكر والتوازن بين الموضوعات التقنية والاجتماعية. يُعتبر CCC حدثًا رئيسيًا لمجتمع القراصنة، يركز على الانفتاح والشمولية، ويستكشف الجوانب السياسية والثقافية، بما في ذلك استخدام اللغة."
    ],
    "points": 308,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1735028149
  },
  {
    "id": 42498648,
    "title": "بناء طائرة بدون طيار منخفضة التكلفة باستخدام ESP32",
    "originLink": "https://www.digikey.com/en/maker/projects/a-step-by-step-guide-to-build-a-low-cost-drone-using-esp32/8afccd0690574bcebfa0d2ad6fd0a391",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يتوسع نظام الطائرات بدون طيار المصنوعة يدويًا، مع توفر مكونات بأسعار معقولة مثل وحدات التحكم الدقيقة لوحدات التحكم في الطيران، ومحركات القيادة، والكاميرات للتخصيص.",
      "يدعم البرمجيات مفتوحة المصدر مثل Betaflight و ArduPilot هذه البنيات الذاتية، مما يوفر بدائل للأنظمة المملوكة مثل DJI، على الرغم من أنها تتأخر حاليًا في بعض المجالات.",
      "يُعتبر المتحكم الدقيق ESP32 خيارًا اقتصاديًا لمشاريع الطائرات بدون طيار، حيث تكلف الإعدادات الأساسية حوالي 500 دولار، على الرغم من التحديات مثل التحكم في الوقت الحقيقي عبر WiFi."
    ],
    "points": 298,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1734999639
  },
  {
    "id": 42498634,
    "title": "جعل وحدات معالجة الرسومات من AMD تنافسية لاستدلال نماذج اللغة الكبيرة (2023)",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498634",
    "commentBody": "",
    "originSummary": [
      "يسهل MLC-LLM عملية تجميع ونشر نماذج اللغة الكبيرة (LLMs) على وحدات معالجة الرسومات من AMD باستخدام ROCm، محققًا أداءً قريبًا من وحدات معالجة الرسومات المتقدمة من NVIDIA. تقدم بطاقة AMD Radeon RX 7900 XTX أداءً تنافسيًا، حيث تصل إلى 80% من سرعة NVIDIA RTX 4090 و94% من RTX 3090 Ti لبعض النماذج، بينما تكون أكثر توفيرًا من حيث التكلفة بشكل كبير. يبرز المشروع الإمكانيات التي توفرها وحدات معالجة الرسومات من AMD لاستدلال نماذج اللغة الكبيرة، مع تحسينات مستمرة في دعم البرمجيات وخطط لتحسينات مستقبلية مثل التجميع ودعم تعدد وحدات معالجة الرسومات."
    ],
    "commentSummary": [
      "تختلف وحدات معالجة الرسوميات للمستهلكين من AMD، مثل RX7900XTX، في البنية عن وحدات معالجة الرسوميات لمراكز البيانات مثل MI300X، مما يؤثر على مستويات الأداء. هناك جهد متزايد لدمج بنية CDNA من AMD ودعم HIP (واجهة الحوسبة المتغايرة للتنقل) في منصات التعلم العميق، بهدف تحدي هيمنة Nvidia في أعباء العمل المتعلقة بالذكاء الاصطناعي. على الرغم من الاهتمام المتزايد، لا تزال التحديات مثل دعم البرمجيات واتساق الأداء قائمة، مما يدفع بعض المطورين للعودة إلى Nvidia، التي تحتفظ بميزة كبيرة مع منصتها CUDA (بنية الأجهزة الموحدة للحوسبة)."
    ],
    "points": 241,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1734999438
  },
  {
    "id": 42498462,
    "title": "لماذا تظل إرشادات السرطان محصورة في ملفات PDF؟",
    "originLink": "https://seangeiger.substack.com/p/why-are-cancer-guidelines-stuck-in",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498462",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "غالبًا ما يتم تخزين إرشادات السرطان بتنسيق PDF بسبب متانتها وقابليتها للنقل، على الرغم من القيود في سهولة الاستخدام والتكامل مع الأنظمة الطبية. - يمكن أن يؤدي الانتقال إلى البيانات المهيكلة إلى تحسين سهولة الاستخدام، لكن التحديات تشمل تعقيد المعلومات الطبية، ونقص التوحيد القياسي، والعقبات التنظيمية. - يتركز النقاش حول موازنة موثوقية ملفات PDF مع المزايا المحتملة للحلول الديناميكية القابلة للتفسير بواسطة الآلات، مع الأخذ في الاعتبار الحاجة إلى تحديثات متسقة وإدارة الأخطاء في الأنظمة الآلية."
    ],
    "points": 229,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1734996997
  },
  {
    "id": 42497173,
    "title": "إعادة تجميع كاملة لجزيرة ليغو",
    "originLink": "https://github.com/isledecomp/isle",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42497173",
    "commentBody": "",
    "originSummary": [
      "يتضمن المشروع عملية فك كاملة لشفرة لعبة LEGO Island (الإصدار 1.1، الإنجليزية)، بهدف تكرار الشفرة الآلية الأصلية بأكبر قدر ممكن من الدقة.",
      "يستخدم CMake للبناء، مع توصية باستخدام Microsoft Visual C++ 4.20 للحصول على أفضل النتائج، ويتضمن إعداد البيئة، التكوين باستخدام CMake، والبناء باستخدام nmake.",
      "يتم تشجيع المساهمات، مع التركيز بشكل خاص على الإصدار الإنجليزي من النسخة 1.1، مع تحسينات مستمرة على ملفات ISLE.EXE وLEGO1.DLL المفككة."
    ],
    "commentSummary": [
      "نجح مشروع على GitHub في فك شفرة لعبة Lego Island الكلاسيكية، مما عزز الجهود السابقة لإصلاح الأخطاء في اللعبة الأصلية. لعب MattKC، وهو يوتيوبر معروف بالمحتوى التقني، دورًا كبيرًا في هذا المشروع الذي يركز على الدقة ويشمل أدوات مثل أداة lint ومحرر الموارد. أثار المشروع اهتمامًا بإعادة صنع ألعاب LEGO القديمة، حيث أعرب المعجبون عن حنينهم لألعاب مثل Rock Raiders وLego Loco، مما يبرز تقدير المجتمع للحفاظ على هذه الألعاب الكلاسيكية وتحسينها."
    ],
    "points": 216,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1734984217
  },
  {
    "id": 42500482,
    "title": "رفع مساهمو شركة إنتل قضية يطالبون فيها الرئيس التنفيذي السابق والمدير المالي بإعادة رواتب ثلاث سنوات.",
    "originLink": "https://www.cfodive.com/news/intel-shareholders-yank-exceo-cfo-compensation-foundry/736193/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42500482",
    "commentBody": "",
    "originSummary": [
      "يسعى مساهمو إنتل إلى استعادة التعويضات من الرئيس التنفيذي السابق بات غيلسنجر والمدير المالي ديفيد زينسنر، متهمين إياهم بتضليل المساهمين بشأن الأداء المالي لوحدة المصانع في إنتل.",
      "تزعم الدعوى القضائية انتهاك الواجبات الائتمانية، عقب فشل خطة التحول لشركة إنتل وتسجيل خسارة ربع سنوية قياسية بلغت 16.6 مليار دولار، مما أدى إلى انخفاض بنسبة 9.2% في أسهم إنتل.",
      "تم تحديد وحدة المسبك، التي كان من المتوقع في البداية أن تقود النمو، لاحقًا كمركز تكلفة كبير، مما دفع زينسنر، الذي يشغل الآن منصب الرئيس التنفيذي المؤقت المشارك، إلى بذل جهود لإعادة الهيكلة، بينما استقال جيلسنجر."
    ],
    "commentSummary": [
      "رفع مساهمو شركة إنتل دعوى قضائية ضد المدير التنفيذي والمدير المالي السابقين، مطالبين بإعادة رواتب ثلاث سنوات بسبب خطة عمل فاشلة.",
      "يجادل النقاد بأن الدعوى القضائية لا أساس لها، حيث كان التنفيذيون قد أقروا بالتحديات التي تواجهها وحدة المسبك في إنتل.",
      "تؤكد الدعوى القضائية على التوترات بين المساهمين وقيادة الشركة، حيث يرى البعض أنها إجراء تافه مدفوع بدافع الربح المالي."
    ],
    "points": 199,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1735028274
  },
  {
    "id": 42501102,
    "title": "أصدرت طوكيو بيانات السحابة النقطية للمدينة بأكملها مجانًا",
    "originLink": "https://twitter.com/spatiallyjess/status/1871342549958537326",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42501102",
    "commentBody": "",
    "originSummary": [
      "أتاحت طوكيو بيانات السحابة النقطية المجانية للمدينة بأكملها، مما يسمح بتنزيلها للجمهور.",
      "بيانات السحابة النقطية هي مجموعة من النقاط البيانية في الفضاء، تُستخدم غالبًا في النمذجة ثلاثية الأبعاد وأنظمة المعلومات الجغرافية (GIS).",
      "يُعتبر هذا الإصدار مهمًا لأنه يوفر موارد قيمة للمطورين والباحثين ومخططي المدن المهتمين بالنمذجة ثلاثية الأبعاد والتحليل المكاني لطوكيو."
    ],
    "commentSummary": [
      "أتاحت طوكيو بيانات السحابة النقطية المجانية للمدينة بأكملها، مما يتيح التنقل والاستكشاف ثلاثي الأبعاد التفاعلي. - هذه المبادرة مشابهة لتلك الموجودة في سويسرا وفرنسا، حيث تم إصدار نماذج ثلاثية الأبعاد مفصلة وبيانات ليدار. - هذه المجموعات من البيانات ذات قيمة خاصة للتطبيقات في الصور المولدة بالحاسوب (CGI)، وألعاب الفيديو، والتقنيات ثلاثية الأبعاد الأخرى."
    ],
    "points": 157,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1735037499
  },
  {
    "id": 42498982,
    "title": "فك غموض أدوات التصحيح، الجزء الثاني: تشريح البرنامج الجاري",
    "originLink": "https://www.rfleury.com/p/demystifying-debuggers-part-2-the",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498982",
    "commentBody": "",
    "originSummary": [
      "تشرح المقالة \"إزالة الغموض عن المصححات، الجزء الثاني: تشريح البرنامج الجاري\" المكونات المشاركة في تنفيذ البرنامج، مثل مساحات العناوين الافتراضية، والخيوط، والعمليات. وتفصل كيفية استخدام أنظمة التشغيل للذاكرة الافتراضية والجدولة لإدارة تشغيل برامج متعددة في وقت واحد. المنشور هو جزء من سلسلة تركز على شرح كيفية تفاعل المصححات مع هذه العمليات لتحليل تنفيذ البرنامج."
    ],
    "commentSummary": [
      "المصححات ضرورية لتحليل البرامج قيد التشغيل، ودمجها مع النماذج اللغوية الكبيرة (LLMs) يمكن أن يعزز من وظائفها بشكل محتمل.",
      "هناك نقاش بين المطورين حول إمكانيات النماذج اللغوية الكبيرة في تصحيح الأخطاء، حيث يتفائل البعض بقدرتها على تتبع الأخطاء بينما يشكك آخرون في فعاليتها الحالية.",
      "تؤكد المناقشة على وجهات النظر المتنوعة حول ممارسات تصحيح الأخطاء والدور المتطور لنماذج اللغة الكبيرة في تطوير البرمجيات."
    ],
    "points": 141,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1735004011
  },
  {
    "id": 42499332,
    "title": "أتمتة البحث عن الحياة الاصطناعية باستخدام نماذج الأساس",
    "originLink": "https://sakana.ai/asal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42499332",
    "commentBody": "",
    "originSummary": [
      "يستخدم خوارزمية البحث الآلي عن الحياة الاصطناعية (ASAL) نماذج أساسية للرؤية واللغة في الذكاء الاصطناعي لاكتشاف أشكال الحياة الاصطناعية في المحاكاة، مما يعزز مجال أبحاث الحياة الاصطناعية (ALife). وقد نجحت ASAL في تحديد أشكال حياة جديدة في محاكاة مثل Lenia وBoids وParticle Life وGame of Life، مما يبرز الأنماط الديناميكية وقواعد الأوتوماتا الخلوية الجديدة. تعمل هذه الطريقة على أتمتة عملية الاكتشاف، متغلبة على قيود المحاكاة المصممة يدويًا، وتشجع على المزيد من الاستكشاف والتعاون لدمج مفاهيم الحياة الاصطناعية في الذكاء الاصطناعي للحصول على أنظمة أكثر تكيفًا وإبداعًا."
    ],
    "commentSummary": [
      "يصبح دمج النماذج الأساسية في أتمتة البحث عن الحياة الاصطناعية (ALife) موضوعًا ذا اهتمام، مما يبرز التمييز بين الذكاء الاصطناعي (AI) وALife. - \"الدماغ الذي يجمع نفسه\" هو كتاب يفحص الذكاء من وجهات نظر متعددة، مما يساهم في النقاش المستمر. - شركة ساكانا AI، التي أسسها مؤلفو الورقة المؤثرة \"الانتباه هو كل ما تحتاجه\"، تركز على تسويق الذكاء الاصطناعي، مدعومة باستثمارات رأس المال المغامر، وهي جزء من المناقشات حول دور الذكاء الاصطناعي في تحليل بيانات البحث عن الذكاء خارج الأرض (SETI)."
    ],
    "points": 134,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1735008467
  },
  {
    "id": 42498514,
    "title": "تحليل ملايين الروابط في الثانية (2023)",
    "originLink": "https://onlinelibrary.wiley.com/doi/10.1002/spe.3296",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42498514",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تركز المناقشة على التحديات المتعلقة بتحليل ملايين الروابط الإلكترونية في الثانية، خاصةً المشكلات المتعلقة بتطبيع الروابط وأخطاء التحليل.",
      "هناك جدل حول ضرورة تغيير \"http://\" إلى \"https://\" وموثوقية HTTPS، مع بعض الشكوك حول ادعاءات أداء المحلل.",
      "يناقش المشاركون أيضًا صعوبات كتابة المحللات الفعالة، وقيود استخدام التعبيرات العادية (regex) لتحليل عناوين URL، وتعقيدات الالتزام بمواصفات URL المختلفة."
    ],
    "points": 131,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1734997688
  },
  {
    "id": 42500704,
    "title": "الرحلة بالقطار من باريس إلى برلين أصبحت الآن أسرع بخمس ساعات",
    "originLink": "https://www.theguardian.com/travel/2024/dec/24/paris-to-berlin-by-train-faster-service-via-strasbourg",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42500704",
    "commentBody": "",
    "originSummary": [
      "أطلقت دويتشه بان وSNCF خدمة قطار نهارية مباشرة جديدة من باريس إلى برلين، مما يقلل وقت السفر بمقدار خمس ساعات ليصبح 7 ساعات و59 دقيقة.",
      "تشمل الرحلة مناظر خلابة وتوقفات في ستراسبورغ وكارلسروه وفرانكفورت، وتبدأ أسعار التذاكر من 59.99 يورو للدرجة الثانية.",
      "بينما تقدم الخدمة تجربة سفر أكثر استرخاءً، يجادل البعض بأنها تحتاج إلى أن تكون أسرع لتنافس بشكل فعال مع السفر الجوي."
    ],
    "commentSummary": [
      "يقلل الاتصال الجديد للقطار المباشر بين باريس وبرلين من وقت السفر بمقدار خمس ساعات، مما يوفر رحلة أكثر راحة مقارنة بالسفر الجوي.",
      "القطارات صديقة للبيئة، حيث تنتج انبعاثات أقل من ثاني أكسيد الكربون، لكنها تتطلب استثمارات كبيرة في البنية التحتية.",
      "بينما يمكن أن يكون السفر بالقطار أكثر تكلفة وأقل مرونة من الطيران، يفضله العديد من المسافرين لراحته وملاءمته."
    ],
    "points": 108,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1735031834
  }
]
