[
  {
    "id": 42314547,
    "title": "IMG_0001",
    "originLink": "https://walzr.com/IMG_0001/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314547",
    "commentBody": "",
    "originSummary": [
      "بين عامي 2009 و2012، تضمنت أجهزة الآيفون زر \"إرسال إلى يوتيوب\" في تطبيق الصور، مما أدى إلى تحميل العديد من الفيديوهات بأسماء ملفات افتراضية IMG_XXXX.- تم تطوير روبوت، مستوحى من بن والاس، للعثور على 5 ملايين من هذه الفيديوهات، التي تعرض لحظات خام وغير محررة.- تتوفر مجموعة الفيديوهات للمشاهدة، معروضة بترتيب عشوائي، مما يوفر لمحة عن المحتوى غير المصفى من تلك الحقبة."
    ],
    "commentSummary": [
      "تدور المناقشة حول ميزة في واجهة المستخدم البسيطة التي تعرض عدد المشاهدات على الفيديوهات، مما يثير الحنين إلى محتوى الإنترنت المبكر الذي كان أكثر شخصية وأصالة. يعبر المستخدمون عن مشاعر مختلطة، حيث يرى البعض أن الفيديوهات الشخصية تعد انتهاكًا للخصوصية، رغم توفرها للجمهور، مما يبرز المخاوف المستمرة بشأن الخصوصية في ثقافة الإنترنت. تعكس المحادثة تطور ثقافة الإنترنت، حيث تقارن بين الأصالة الخام للتجارب عبر الإنترنت في الماضي والطبيعة الأكثر تعقيمًا والتي قد تكون منتهكة للخصوصية في الويب اليوم."
    ],
    "points": 1329,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1733287572
  },
  {
    "id": 42312121,
    "title": "ابني (9 سنوات) استخدم جافا سكريبت العادية لصنع لعبة، ويريد ملاحظاتك.",
    "originLink": "https://www.armaansahni.com/game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42312121",
    "commentBody": "",
    "originSummary": [
      "طفل يبلغ من العمر 9 سنوات كان يتعلم البرمجة، حيث أتقن HTML وCSS، ومؤخرًا استخدم Google Gemini لتعزيز مهاراته. قام بإنشاء لعبة عن طريق برمجة HTML وCSS وJavaScript في VSCode واستخدم Piskel للرسوم المتحركة، بمساعدة من والديه وGoogle Gemini. وثق الطفل تجربته في منشور مدونة، حيث ناقش العملية وتلقى ملاحظات من والديه المبرمجين لتحسين كتابته."
    ],
    "commentSummary": [
      "أنشأ طفل يبلغ من العمر 9 سنوات لعبة باستخدام JavaScript، مما أظهر مهارات في HTML وCSS وتصميم الألعاب باستخدام أدوات مثل VSCode وPiskel. تلقى المطور الصغير توجيهات من والديه المبرمجين واستخدم Google Gemini لتعزيز مهاراته في البرمجة. كانت ردود الفعل من المجتمع إيجابية، مع اقتراحات للتحسينات، مما يشير إلى بيئة داعمة لرحلته في البرمجة."
    ],
    "points": 803,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1733263696
  },
  {
    "id": 42311069,
    "title": "الهندسة الخالية من الأنا",
    "originLink": "https://egoless.engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311069",
    "commentBody": "",
    "originSummary": [
      "تؤكد المحاضرة على أهمية تعزيز بيئات العمل الأفضل من خلال إزالة التقسيمات غير الضرورية للأدوار وتشجيع التعاون عبر الأدوار. وتسلط الضوء على عدم الكفاءة الناتجة عن تقسيم الأدوار المفرط وسوء الفهم لممارسات \"الديفوبس\" التي تخلق حواجز بدلاً من تعزيز التعاون. يدعو المتحدث إلى تقدير التعاون والفضول والمسؤولية المشتركة، مشيرًا إلى أن البؤس لا ينبغي أن يُعتبر مرادفًا للإنتاجية."
    ],
    "commentSummary": [
      "يركز الهندسة الخالية من الأنا على التعاون، والملكية، وتقليل العمليات غير الضرورية لتعزيز كفاءة الفريق.",
      "يسلط الضوء على أهمية إنشاء بيئات ذات ثقة عالية لتعزيز الإنتاجية ويحذر من عدم الكفاءة التي تسببها السياسة في هياكل الفرق الحديثة.",
      "يُعتبر تحقيق التوازن بين الاستقلالية والإشراف الضروري أمرًا حيويًا، خاصة في المشاريع الكبيرة، لتعزيز ثقافة الثقة والتعاون مع إدارة السمات البشرية مثل الأنا."
    ],
    "points": 703,
    "commentCount": 247,
    "retryCount": 0,
    "time": 1733258303
  },
  {
    "id": 42312301,
    "title": "تم إصدار Phoenix LiveView 1.0.0",
    "originLink": "https://www.phoenixframework.org/blog/phoenix-liveview-1.0-released?release=1.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42312301",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Phoenix LiveView 1.0.0، مقدماً تحديثاً رئيسياً يبسط التطبيقات الديناميكية المرسومة من الخادم عن طريق تقليل الحاجة إلى JavaScript وتعزيز القدرات في الوقت الحقيقي. تشمل الميزات الرئيسية لهذا الإصدار محرك تفريق لتحديثات فعالة، ومكونات HEEx لتحسين تكوين HTML، وتحميلات تفاعلية، وكلها تستفيد من Elixir وErlang VM لتحقيق تفوق في زمن الاستجابة وقابلية التوسع. كما يقدم التحديث ميزات جديدة مثل التدفقات والعمليات غير المتزامنة، مع خطط مستقبلية لدمج روابط JavaScript ومكونات الويب، مما يشجع المطورين على استكشاف سهولة إعداده."
    ],
    "commentSummary": [
      "تم إصدار Phoenix LiveView 1.0.0، ويتميز بمثبت جديد لتسهيل الإعداد ووظائف محسنة.",
      "يُعتبر الإصدار إنجازًا كبيرًا لمشروعي Elixir وPhoenix، حيث أشاد المستخدمون بإنتاجيته وسهولة استخدامه مقارنةً بالأطر الأخرى.",
      "على الرغم من بعض التحديات مثل إدارة الاتصالات غير الموثوقة، فإن المجتمع يسعى بنشاط لإيجاد حلول، والمبدع كريس مكورد منفتح على تلقي الملاحظات."
    ],
    "points": 693,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1733264927
  },
  {
    "id": 42317903,
    "title": "جين 2: نموذج عالمي أساسي واسع النطاق",
    "originLink": "https://deepmind.google/discover/blog/genie-2-a-large-scale-foundation-world-model/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42317903",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Research Genie 2 في 4 ديسمبر 2024، وهو نموذج عالمي أساسي واسع النطاق مصمم لتوليد بيئات ثلاثية الأبعاد متنوعة لتدريب وكلاء الذكاء الاصطناعي. تم تطويره بواسطة فريق جاك باركر-هولدر، يمكن لـ Genie 2 إنشاء عوالم قابلة للتحكم في الحركة وقابلة للعب من خلال مطالبة صورة واحدة، مما يدعم النماذج الأولية السريعة والتجارب التفاعلية. يعزز Genie 2 البحث في الذكاء الاصطناعي من خلال نمذجة تفاعلات الكائنات، وتحريك الشخصيات، وفيزياء البيئة، مما يعالج تحدي إنشاء بيئات تدريب غنية للوكلاء المجسدين."
    ],
    "commentSummary": [
      "Genie 2، الذي تم تطويره بواسطة DeepMind، هو نموذج عالمي جديد يظهر إمكانيات في التنقل في البيئات باستخدام الصور والنصوص، لكنه يفتقر إلى التفاصيل التقنية، والشفرة، والوصول المفتوح.",
      "يُعتبر أكثر كنموذج أولي للبحث والتطوير بدلاً من كونه منتجًا نهائيًا، مما يؤدي إلى انتقادات حول عدم إمكانية الوصول إليه وتطبيقه العملي المحدود.",
      "تسلط المناقشة حول Genie 2 الضوء على تحديات المحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي، والإمكانيات المستقبلية للتطبيقات، والطبيعة التنافسية لتطوير الذكاء الاصطناعي، مع بقاء فائدته وتأثيره في العالم الحقيقي غير مؤكدين."
    ],
    "points": 417,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1733323502
  },
  {
    "id": 42314700,
    "title": "OpenTTD هو لعبة محاكاة مفتوحة المصدر تستند إلى لعبة Transport Tycoon Deluxe",
    "originLink": "https://www.openttd.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314700",
    "commentBody": "",
    "originSummary": [
      "تم إصدار OpenTTD 14.1 في 3 مايو 2024، مع التركيز على إصلاح الأخطاء منذ الإصدار الأولي. تشمل التحديثات الرئيسية حل مشكلة عدم التزامن في اللعب الجماعي وتحسينات في ميزة توجيه السفن وفك التكتل. أظهر اللاعبون تفاعلًا كبيرًا، حيث سجلوا 34,700 ساعة في 17,219 لعبة خلال الأسبوع الماضي."
    ],
    "commentSummary": [
      "OpenTTD هو لعبة محاكاة مفتوحة المصدر مستوحاة من لعبة Transport Tycoon Deluxe، وتتميز بإمكانية اللعب دون الحاجة إلى أصول إضافية، على عكس العديد من النسخ المفتوحة المصدر الأخرى. تم إصدار OpenTTD في عام 2004، واستبدلت الرسومات الأصلية للعبة بحلول عام 2009، مما أتاح توزيعها على منصات مثل Steam مع الحفاظ على الأسلوب الأصلي دون نسخ الأصول. تدعم اللعبة اللعب الجماعي ولها تطبيقات تعليمية، مثل تطوير الذكاء الاصطناعي، وتستمر في كونها شائعة لجاذبيتها النوستالجية ولعبها الممتع."
    ],
    "points": 292,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1733290165
  },
  {
    "id": 42311031,
    "title": "قام مترجم C الخاص بي بترجمة نفسه",
    "originLink": "https://github.com/keyvank/30cc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311031",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "قام مستخدم بتفصيل رحلته في تطوير مترجم C ذاتي التجميع، مسلطًا الضوء على التحديات والمكافآت التي واجهها خلال العملية.",
      "التغذية الراجعة تركزت على الالتزام بمبادئ DRY (لا تكرر نفسك) وتجنب التحويل غير الضروري للأنواع مع malloc()، وهي وظيفة تخصيص الذاكرة في لغة البرمجة C.",
      "توسعت المناقشة لتشمل مواضيع مثل توافق المترجم، أسلوب البرمجة، التمهيد، ومزايا وعيوب استخدام ملفات Make مقابل سكربتات بايثون لبناء المشاريع."
    ],
    "points": 238,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1733258124
  },
  {
    "id": 42315946,
    "title": "كيفية تنمية العلاقات المهنية",
    "originLink": "https://tej.as/blog/how-to-grow-professional-relationships-tjs-model",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42315946",
    "commentBody": "",
    "originSummary": [
      "نموذج التعاون TJS (الرحلة إلى التآزر) يوضح سبع حالات من العلاقات المهنية، تتراوح من التنافسية إلى الهوية المشتركة، لتعزيز التعاون.",
      "يؤكد النموذج على الانتقال من عقلية المحصلة الصفرية إلى التآزر عالي الجودة، مشجعًا على عقلية الوفرة والتوافق مع الأهداف والقيم الشخصية.",
      "تشمل المراحل الرئيسية المنافسة، التعايش، التواصل، التعاون، التنسيق، التعاون المشترك، و\"نحن نفس الشيء\"، مع الهدف النهائي لتحقيق المزيد بشكل جماعي بدلاً من فردي."
    ],
    "commentSummary": [],
    "points": 237,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1733305322
  },
  {
    "id": 42314340,
    "title": "دورة فيزياء الجسيمات لطلاب المدارس الثانوية",
    "originLink": "https://ppc.web.cern.ch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314340",
    "commentBody": "",
    "originSummary": [
      "قام فريق أبحاث تعليم الفيزياء في سيرن بتطوير دورة تجريبية في فيزياء الجسيمات لطلاب المدارس الثانوية، تتكون من 16 فصلًا تحتوي على مقاطع فيديو واختبارات. تستغرق الدورة حوالي 4 ساعات وتغطي مواضيع أساسية مثل \"ما هو الجسيم؟\" و\"ما هو مسرع الجسيمات؟\" وتشمل تجارب عملية يمكن القيام بها بنفسك. يمكن للمشاركين إكمال الفصول بأي ترتيب والحصول على شهادة رقمية عند إتمام جميع الاختبارات، مع تشجيع تقديم الملاحظات لتحسين الدورات المستقبلية."
    ],
    "commentSummary": [
      "دورة فيزياء الجسيمات لطلاب المدارس الثانوية في المملكة المتحدة شملت 54 مراهقًا من 36 مدرسة، وأُجريت عبر الإنترنت على مدى ثمانية أسابيع. - على الرغم من التحديات مثل التفاعل المحدود ومشاكل الثقة بالنفس، نجح أكثر من 80% من الطلاب في اجتياز اختبار يحتوي على أسئلة من امتحان فيزياء الكم لطلاب الدراسات العليا في أكسفورد، حيث حصل نصفهم على درجات امتياز. - أدى نجاح الدورة بدون استخدام الرياضيات المعقدة إلى مناقشات حول فرض استخدام الكاميرا في الفصول الدراسية عبر الإنترنت، وإشراك الطلاب، وإتاحة اللغة للناطقين بغير الإنجليزية."
    ],
    "points": 215,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1733284177
  },
  {
    "id": 42313507,
    "title": "لا NAT نوفمبر: شهري بدون IPv4",
    "originLink": "https://blog.infected.systems/posts/2024-12-01-no-nat-november/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42313507",
    "commentBody": "",
    "originSummary": [
      "تحدي \"لا NAT نوفمبر\" تضمن تعطيل IPv4 واستخدام IPv6 فقط، مما يبرز الإمكانيات والتحديات في الانتقال إلى شبكات تعتمد فقط على IPv6. يقترح المؤلف نهج \"IPv6 في الغالب\"، الذي يعطي الأولوية لـ IPv6 مع الحفاظ على شبكات مزدوجة المكدس، مما يقلل من الصيانة ويستعد لمستقبل خالٍ من IPv4. ساعدت تقنيات الانتقال مثل NAT64 وDNS64 في معالجة مشكلات التوافق، حيث تكيفت أجهزة Apple بشكل جيد، بينما أظهرت أنظمة Windows وLinux نتائج متباينة."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على التحديات في الانتقال من IPv4 إلى IPv6، بما في ذلك مشكلات دعم مزودي خدمة الإنترنت، والقيود المتعلقة بالأجهزة، والعقبات التجارية والتقنية.",
      "يلاحظ المستخدمون فوائد IPv6، مثل تحسين زمن الاستجابة وتبسيط إدارة الشبكة من خلال تجنب تعقيدات NAT (ترجمة عناوين الشبكة).",
      "تشمل المحادثة شكوكًا حول تبني IPv6 وتستكشف الحلول التقنية والتكوينات وتأثيرها على الأمان وإدارة الشبكات."
    ],
    "points": 201,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1733274224
  },
  {
    "id": 42313910,
    "title": "الفورمالديهايد يسبب السرطان أكثر من أي ملوث هواء سام آخر",
    "originLink": "https://www.propublica.org/article/formaldehyde-epa-trump-public-health-danger",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42313910",
    "commentBody": "",
    "originSummary": [
      "الفورمالديهايد، وهو ملوث هواء شائع من مصادر مثل عوادم السيارات والمصانع، يشكل مخاطر كبيرة للإصابة بالسرطان، خاصة المرتبطة بسرطان الدم النقوي. - تم عرقلة الجهود لتنظيم الفورمالديهايد بسبب تأثير الصناعة والتغيرات السياسية، مع انتكاسات ملحوظة خلال إدارة ترامب. - تحقيقات ProPublica تسلط الضوء على المخاطر التي تم التقليل من شأنها للتعرض للفورمالديهايد والتحديات المستمرة في تنفيذ لوائح فعالة، على الرغم من بعض التقدم تحت إدارة بايدن."
    ],
    "commentSummary": [
      "يُعترف بالفورمالديهايد كملوث هواء مسرطن رئيسي، مع استمرار النقاشات حول تنظيمه والمخاطر الصحية المرتبطة به، خاصةً سرطان الدم النقوي.",
      "تواجه وكالة حماية البيئة (EPA) انتقادات من بعض العلماء بشأن تقييمها لمخاطر الفورمالديهايد، مما يبرز التوتر بين السلامة العامة والمصالح الاقتصادية.",
      "يوجد الفورمالديهايد بشكل شائع في منتجات مثل مواد البناء وعلاجات الشعر، مما يثير مخاوف بشأن التعرض له، بينما تشمل المناقشات الأوسع التلوث الناتج عن إطارات المركبات وتقليل الاعتماد على السيارات."
    ],
    "points": 179,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1733278587
  },
  {
    "id": 42314024,
    "title": "مؤتمر Emacs 2024",
    "originLink": "https://emacsconf.org/2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314024",
    "commentBody": "",
    "originSummary": [
      "من المقرر أن يُعقد مؤتمر EmacsConf 2024 عبر الإنترنت في 7-8 ديسمبر، ويشمل محاضرات وفرص تطوعية ومناقشات تركز على GNU Emacs وEmacs Lisp.",
      "سيستخدم الحدث برنامجًا مجانيًا للبث المباشر ويتضمن حدثًا تابعًا في لوسيرن، سويسرا، مما يوفر تجربة هجينة.",
      "يمكن للمشاركين الانخراط في المناقشات عبر قائمة البريد الإلكتروني emacsconf-discuss، والتنظيم من خلال emacsconf-org، والتواصل على IRC في #emacsconf على irc.libera.chat، مع محتوى مرخص تحت CC BY-SA 4.0 وGPLv3+."
    ],
    "commentSummary": [
      "يؤكد مؤتمر EmacsConf 2024 على التفاني المستمر لمجتمع Emacs، مع إبراز ميزاته الفريدة رغم عدم شعبيته مثل المحررات الأخرى مثل VS Code. تركز المناقشات الرئيسية على جاذبية Emacs الخاصة، والعلاقة بين الشعبية واستدامة البرمجيات، والعروض التقديمية المبتكرة في المؤتمر. تشمل الموضوعات البارزة تكامل Emacs مع الذكاء الاصطناعي وأنماطه الفريدة مثل gptel، مما يبرز قابليته للتكيف واستمرارية أهميته."
    ],
    "points": 140,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1733280127
  },
  {
    "id": 42317968,
    "title": "الرئيس التنفيذي لشركة UnitedHealthcare قُتل بالرصاص في وسط مانهاتن",
    "originLink": "https://www.cnn.com/2024/12/04/us/brian-thompson-united-healthcare-death/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42317968",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم إطلاق النار بشكل مأساوي على الرئيس التنفيذي لشركة UnitedHealthcare في مانهاتن، مما أدى إلى انتشار التكهنات حول الدافع وراء الحادث.",
      "يقترح البعض أن الدافع قد يكون مرتبطًا بممارسات يونايتد هيلث كير المثيرة للجدل، بما في ذلك رفض المطالبات للأمراض المميتة.",
      "أشعل الحدث محادثات حول سلامة الأفراد البارزين وتأثير تصرفات الشركات على الرأي العام."
    ],
    "points": 135,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1733323975
  },
  {
    "id": 42310683,
    "title": "ستيفن كينغ يغلق محطاته الإذاعية الثلاث في ولاية مين",
    "originLink": "https://www.nytimes.com/2024/12/03/arts/stephen-king-maine-radio-stations.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42310683",
    "commentBody": "",
    "originSummary": [
      "ستيفن كينغ يغلق محطاته الإذاعية الثلاث في بانغور، مين، بعد أكثر من 40 عامًا من الملكية، بسبب الخسائر المالية وعمره.",
      "ستتوقف المحطات، التي تعكس شغف كينغ بموسيقى الروك والإعلام المحلي، عن العمل في ليلة رأس السنة.",
      "يمثل هذا القرار تغييرًا كبيرًا في شؤون أعمال كينغ، حيث يعيد تنظيم مشاريعه."
    ],
    "commentSummary": [
      "ستيفن كينغ يغلق محطاته الإذاعية الثلاث في ولاية مين بسبب التحديات التي تفرضها زيادة البث الإذاعي للشركات، مما يجعل من الصعب على المحطات الصغيرة المنافسة.",
      "تواجه صناعة الراديو صعوبات مع تزايد شعبية المنصات الرقمية مثل البودكاست ويوتيوب، مما يجذب الجماهير بعيدًا عن الراديو التقليدي.",
      "إغلاق محطات كينغ يبرز الصعوبات الأوسع التي تواجهها شركات الراديو المستقلة في التكيف مع بيئة الإعلام المتطورة بسرعة."
    ],
    "points": 132,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1733256400
  },
  {
    "id": 42311912,
    "title": "يتم استدعاء سيارة بورش ماكان الكهربائية لأن مصابيحها الأمامية شديدة السطوع",
    "originLink": "https://insideevs.com/news/742893/porsche-macan-electric-ev-recall-headlights/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311912",
    "commentBody": "",
    "originSummary": [
      "تستدعي بورشه 2,941 سيارة من طراز ماكان الكهربائي في الولايات المتحدة بسبب المصابيح الأمامية التي تكون شديدة السطوع، مما يتطلب زيارة لمركز الخدمة لتحديث البرنامج.",
      "لا يمكن حل المشكلة من خلال تحديث عبر الهواء، مما يستلزم زيارة فعلية إلى مركز الخدمة لإجراء الإصلاح المجاني.",
      "يؤثر الاستدعاء على المركبات المصنعة بين 15 مارس و4 نوفمبر 2024، حيث سيتم إخطار الوكلاء والمالكين في ديسمبر 2024 ويناير 2025، على التوالي."
    ],
    "commentSummary": [
      "يتم استدعاء سيارة بورش ماكان الكهربائية بسبب المصابيح الأمامية التي تكون شديدة السطوع، مما يسبب عدم الراحة ومخاوف تتعلق بالسلامة للسائقين.",
      "يسلط الاستدعاء الضوء على الفروق في لوائح المصابيح الأمامية بين الولايات المتحدة وأوروبا، حيث تفرض الولايات المتحدة حدودًا أكثر صرامة على السطوع ولكنها تفرض تطبيقًا أقل على التعديل الصحيح.",
      "تسلط القضية الضوء على إحباط أوسع بين السائقين بشأن زيادة سطوع مصابيح السيارات الحديثة، خاصة في المركبات الأكبر مثل سيارات الدفع الرباعي والشاحنات."
    ],
    "points": 126,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1733262428
  }
]
