[
  {
    "id": 42314547,
    "title": "IMG_0001",
    "originLink": "https://walzr.com/IMG_0001/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314547",
    "commentBody": "",
    "originSummary": [
      "Giữa năm 2009 và 2012, iPhone có nút \"Gửi đến YouTube\" trong ứng dụng Ảnh, dẫn đến nhiều video được tải lên với tên tệp mặc định IMG_XXXX. Một bot đã được phát triển, lấy cảm hứng từ Ben Wallace, để tìm kiếm 5 triệu video này, thể hiện những khoảnh khắc thô và chưa chỉnh sửa. Bộ sưu tập video này có sẵn để xem, được trình bày theo thứ tự ngẫu nhiên, mang đến cái nhìn thoáng qua về nội dung chưa qua lọc từ thời kỳ đó."
    ],
    "commentSummary": [
      "Theo cuộc thảo luận, tính năng giao diện người dùng (UI) tối giản hiển thị số lượt xem trên video gợi nhớ về nội dung cá nhân và chân thực hơn của internet thời kỳ đầu. Người dùng bày tỏ cảm xúc lẫn lộn, với một số người coi video cá nhân là sự xâm phạm quyền riêng tư, mặc dù chúng có sẵn công khai, nhấn mạnh những lo ngại về quyền riêng tư đang diễn ra trong văn hóa internet. Cuộc trò chuyện phản ánh sự phát triển của văn hóa internet, đối lập giữa tính chân thực thô sơ của trải nghiệm trực tuyến trong quá khứ với tính chất được làm sạch và có khả năng xâm phạm quyền riêng tư của web ngày nay."
    ],
    "points": 1329,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1733287572
  },
  {
    "id": 42312121,
    "title": "Con trai tôi (9 tuổi) đã sử dụng JavaScript thuần để tạo ra một trò chơi và muốn nhận phản hồi từ bạn.",
    "originLink": "https://www.armaansahni.com/game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42312121",
    "commentBody": "",
    "originSummary": [
      "Ai đó 9 tuổi đã học lập trình, thành thạo HTML và CSS, và gần đây đã sử dụng Google Gemini để nâng cao kỹ năng của mình. Cậu bé đã tạo ra một trò chơi bằng cách lập trình HTML, CSS và JavaScript trong VSCode và sử dụng Piskel cho đồ họa động, với sự hướng dẫn từ cha mẹ và Google Gemini. Đứa trẻ đã ghi lại trải nghiệm của mình trong một bài đăng trên blog, thảo luận về quá trình và nhận phản hồi từ cha mẹ là lập trình viên để cải thiện bài viết của mình."
    ],
    "commentSummary": [
      "Một đứa trẻ 9 tuổi đã tạo ra một trò chơi sử dụng JavaScript, thể hiện kỹ năng trong HTML, CSS và thiết kế trò chơi với các công cụ như VSCode và Piskel. - Nhà phát triển trẻ tuổi này đã nhận được sự hướng dẫn từ cha mẹ là lập trình viên và sử dụng Google Gemini để nâng cao kỹ năng lập trình của mình. - Phản hồi từ cộng đồng rất tích cực, với những gợi ý cải tiến, cho thấy một môi trường hỗ trợ cho hành trình lập trình của cậu bé."
    ],
    "points": 803,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1733263696
  },
  {
    "id": 42311069,
    "title": "Egoless Engineering",
    "originLink": "https://egoless.engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311069",
    "commentBody": "",
    "originSummary": [
      "Theo bài nói, việc tạo ra môi trường làm việc tốt hơn bằng cách phá vỡ sự phân chia vai trò không cần thiết và khuyến khích sự hợp tác giữa các vai trò là rất quan trọng. Bài nói nhấn mạnh những sự không hiệu quả do việc chia nhỏ vai trò quá mức và sự hiểu lầm về các thực hành \"devops\" tạo ra rào cản thay vì thúc đẩy sự hợp tác. Diễn giả ủng hộ việc coi trọng sự hợp tác, tò mò và trách nhiệm chung, gợi ý rằng không nên đánh đồng sự khổ sở với năng suất."
    ],
    "commentSummary": [
      "Egoless Engineering tập trung vào sự hợp tác, quyền sở hữu và giảm thiểu các quy trình không cần thiết để nâng cao hiệu quả của nhóm.",
      "Điều này nhấn mạnh tầm quan trọng của việc tạo ra môi trường tin cậy cao để tăng năng suất và cảnh báo về những sự kém hiệu quả do chính trị gây ra trong cấu trúc nhóm hiện đại.",
      "Việc cân bằng giữa tự chủ và giám sát cần thiết là rất quan trọng, đặc biệt trong các dự án lớn, để thúc đẩy văn hóa tin tưởng và hợp tác trong khi quản lý các đặc điểm con người như cái tôi."
    ],
    "points": 703,
    "commentCount": 247,
    "retryCount": 0,
    "time": 1733258303
  },
  {
    "id": 42312301,
    "title": "Phoenix LiveView 1.0.0 đã ra mắt",
    "originLink": "https://www.phoenixframework.org/blog/phoenix-liveview-1.0-released?release=1.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42312301",
    "commentBody": "",
    "originSummary": [
      "Phoenix LiveView 1.0.0 đã được phát hành, cung cấp một bản cập nhật lớn giúp đơn giản hóa các ứng dụng được render trên máy chủ động bằng cách giảm nhu cầu sử dụng JavaScript và tăng cường khả năng thời gian thực. - Các tính năng chính của bản phát hành này bao gồm một công cụ diffing để cập nhật hiệu quả, các thành phần HEEx để cải thiện khả năng kết hợp HTML, và tải lên tương tác, tất cả đều tận dụng Elixir và Erlang VM để có độ trễ và khả năng mở rộng vượt trội. - Bản cập nhật cũng giới thiệu các tính năng mới như streams và các hoạt động không đồng bộ, với kế hoạch tương lai tích hợp các hooks JavaScript và Web Components, khuyến khích các nhà phát triển khám phá thiết lập dễ dàng của nó."
    ],
    "commentSummary": [
      "Phoenix LiveView 1.0.0 đã được phát hành, với một trình cài đặt mới để thiết lập dễ dàng hơn và các chức năng được nâng cao.",
      "Việc phát hành được coi là một cột mốc quan trọng cho các dự án Elixir và Phoenix, với người dùng khen ngợi năng suất và sự dễ sử dụng của nó so với các khung công tác khác.",
      "Mặc dù có một số thách thức như quản lý các kết nối không đáng tin cậy, cộng đồng đang tích cực tìm kiếm giải pháp, và người sáng tạo, Chris McCord, sẵn sàng lắng nghe ý kiến phản hồi."
    ],
    "points": 693,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1733264927
  },
  {
    "id": 42317903,
    "title": "Genie 2: Một mô hình thế giới nền tảng quy mô lớn",
    "originLink": "https://deepmind.google/discover/blog/genie-2-a-large-scale-foundation-world-model/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42317903",
    "commentBody": "",
    "originSummary": [
      "Research Genie 2, phát hành vào ngày 4 tháng 12 năm 2024, là một mô hình thế giới nền tảng quy mô lớn được thiết kế để tạo ra các môi trường 3D đa dạng cho việc huấn luyện tác nhân AI. - Được phát triển bởi nhóm của Jack Parker-Holder, Genie 2 có thể tạo ra các thế giới có thể điều khiển hành động và có thể chơi được từ một hình ảnh gợi ý duy nhất, hỗ trợ tạo mẫu nhanh và trải nghiệm tương tác. - Genie 2 thúc đẩy nghiên cứu AI bằng cách mô hình hóa các tương tác đối tượng, hoạt hình nhân vật và vật lý môi trường, giải quyết thách thức tạo ra các môi trường huấn luyện phong phú cho các tác nhân hiện thân."
    ],
    "commentSummary": [
      "Genie 2, được phát triển bởi DeepMind, là một mô hình thế giới mới cho thấy tiềm năng trong việc điều hướng môi trường bằng cách sử dụng hình ảnh và văn bản nhưng thiếu chi tiết kỹ thuật, mã nguồn và quyền truy cập mở.",
      "Được coi là một nguyên mẫu cho nghiên cứu và phát triển hơn là một sản phẩm hoàn chỉnh, dẫn đến sự chỉ trích về tính không khả dụng và ứng dụng thực tế hạn chế của nó.",
      "Cuộc thảo luận xung quanh Genie 2 nhấn mạnh những thách thức của nội dung do AI tạo ra, tiềm năng cho các ứng dụng trong tương lai, và tính cạnh tranh của sự phát triển AI, với tính hữu dụng và tác động thực tế của nó vẫn còn chưa chắc chắn."
    ],
    "points": 417,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1733323502
  },
  {
    "id": 42314700,
    "title": "OpenTTD là một trò chơi mô phỏng mã nguồn mở dựa trên Transport Tycoon Deluxe",
    "originLink": "https://www.openttd.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314700",
    "commentBody": "",
    "originSummary": [
      "OpenTTD 14.1 đã được phát hành vào ngày 3 tháng 5 năm 2024, tập trung vào việc sửa lỗi kể từ khi phát hành ban đầu. - Các cập nhật chính bao gồm giải quyết lỗi không đồng bộ trong chế độ nhiều người chơi và cải tiến tính năng tìm đường cho tàu và tính năng giải tán tàu. - Người chơi đã thể hiện sự tham gia đáng kể, ghi nhận 34.700 giờ chơi trong 17.219 trò chơi trong tuần qua."
    ],
    "commentSummary": [
      "OpenTTD là một trò chơi mô phỏng mã nguồn mở lấy cảm hứng từ Transport Tycoon Deluxe, nổi bật vì có thể chơi mà không cần thêm tài sản bổ sung, không giống như nhiều bản làm lại mã nguồn mở khác. - Phát hành vào năm 2004, OpenTTD đã thay thế đồ họa trò chơi gốc vào năm 2009, cho phép phân phối trên các nền tảng như Steam trong khi vẫn giữ nguyên phong cách gốc mà không sao chép tài sản. - Trò chơi hỗ trợ chế độ nhiều người chơi và có ứng dụng giáo dục, chẳng hạn như trong phát triển AI, và tiếp tục phổ biến nhờ sức hấp dẫn hoài cổ và lối chơi hấp dẫn."
    ],
    "points": 292,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1733290165
  },
  {
    "id": 42311031,
    "title": "Trình biên dịch C của tôi đã tự biên dịch chính nó",
    "originLink": "https://github.com/keyvank/30cc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311031",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Một người dùng đã chia sẻ chi tiết hành trình phát triển một trình biên dịch C tự biên dịch, nêu bật những thách thức và phần thưởng của quá trình này.",
      "Phản hồi tập trung vào việc tuân thủ nguyên tắc DRY (Don't Repeat Yourself - Đừng Lặp Lại Chính Mình) và tránh việc ép kiểu không cần thiết với malloc(), một hàm cấp phát bộ nhớ trong C.",
      "Cuộc thảo luận mở rộng để bao gồm các chủ đề như khả năng tương thích của trình biên dịch, phong cách mã hóa, khởi động, và ưu nhược điểm của việc sử dụng Makefiles so với các tập lệnh Python cho việc xây dựng dự án."
    ],
    "points": 238,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1733258124
  },
  {
    "id": 42315946,
    "title": "Phát triển mối quan hệ chuyên nghiệp như thế nào",
    "originLink": "https://tej.as/blog/how-to-grow-professional-relationships-tjs-model",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42315946",
    "commentBody": "",
    "originSummary": [
      "The TJS (Mô hình Hợp tác Hành trình đến Đồng bộ) phác thảo bảy trạng thái của mối quan hệ chuyên nghiệp, từ cạnh tranh đến nhận dạng chung, nhằm nâng cao sự hợp tác.",
      "Theo mô hình này, cần chuyển từ tư duy tổng bằng không sang sự hợp tác chất lượng cao, khuyến khích tư duy phong phú và sự phù hợp với các mục tiêu và giá trị cá nhân.",
      "Những giai đoạn chính bao gồm Cạnh tranh, Cùng tồn tại, Giao tiếp, Hợp tác, Phối hợp, Cộng tác, và \"Chúng ta là một,\" với mục tiêu cuối cùng là đạt được nhiều hơn khi làm việc cùng nhau so với làm việc riêng lẻ."
    ],
    "commentSummary": [],
    "points": 237,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1733305322
  },
  {
    "id": 42314340,
    "title": "Một khóa học vật lý hạt cho học sinh trung học",
    "originLink": "https://ppc.web.cern.ch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314340",
    "commentBody": "",
    "originSummary": [
      "CERN đã phát triển một khóa học thí điểm về vật lý hạt dành cho học sinh trung học, bao gồm 16 chương với video và câu đố. Khóa học kéo dài khoảng 4 giờ, bao gồm các chủ đề cơ bản như \"Hạt là gì?\" và \"Máy gia tốc hạt là gì?\" và bao gồm các thí nghiệm tự làm. Người tham gia có thể hoàn thành các chương theo bất kỳ thứ tự nào và nhận chứng chỉ kỹ thuật số sau khi hoàn thành tất cả các câu đố, với khuyến khích phản hồi để cải thiện các phiên bản tương lai."
    ],
    "commentSummary": [
      "Một khóa học vật lý hạt dành cho học sinh trung học ở Vương quốc Anh đã thu hút 54 thiếu niên từ 36 trường, được thực hiện trực tuyến trong tám tuần. Mặc dù có những thách thức như tương tác hạn chế và vấn đề tự tin, hơn 80% học sinh đã vượt qua một bài kiểm tra với các câu hỏi từ kỳ thi vật lý lượng tử sau đại học của Oxford, với một nửa đạt được điểm xuất sắc. Thành công của khóa học mà không cần toán học phức tạp đã dẫn đến các cuộc thảo luận về việc bắt buộc sử dụng camera trong các lớp học trực tuyến, thu hút học sinh và khả năng tiếp cận ngôn ngữ cho những người không nói tiếng Anh."
    ],
    "points": 215,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1733284177
  },
  {
    "id": 42313507,
    "title": "Không NAT Tháng Mười Một: Tháng không có IPv4 của tôi",
    "originLink": "https://blog.infected.systems/posts/2024-12-01-no-nat-november/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42313507",
    "commentBody": "",
    "originSummary": [
      "Theo thử thách \"No NAT November\", người tham gia phải vô hiệu hóa IPv4 và chỉ sử dụng IPv6, nhấn mạnh tiềm năng và thách thức của việc chuyển đổi sang mạng chỉ có IPv6. Tác giả đề xuất một cách tiếp cận \"chủ yếu là IPv6\", ưu tiên IPv6 trong khi duy trì mạng dual-stack, giảm bảo trì và chuẩn bị cho một tương lai không có IPv4. Các công nghệ chuyển tiếp như NAT64 và DNS64 đã giúp giải quyết các vấn đề tương thích, với các thiết bị của Apple thích ứng tốt, trong khi Windows và Linux cho thấy kết quả hỗn hợp."
    ],
    "commentSummary": [
      "Cuộc thảo luận nêu bật những thách thức trong việc chuyển đổi từ IPv4 sang IPv6, bao gồm các vấn đề hỗ trợ từ nhà cung cấp dịch vụ Internet, hạn chế về phần cứng, và các rào cản kinh doanh và kỹ thuật.",
      "Người dùng ghi nhận lợi ích của IPv6, chẳng hạn như cải thiện độ trễ và đơn giản hóa quản lý mạng bằng cách tránh các phức tạp của NAT (Dịch địa chỉ mạng).",
      "Cuộc trò chuyện bao gồm sự hoài nghi về việc áp dụng IPv6 và khám phá các giải pháp kỹ thuật, cấu hình, cũng như tác động của nó đối với an ninh và quản lý mạng."
    ],
    "points": 201,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1733274224
  },
  {
    "id": 42313910,
    "title": "Formaldehyde gây ra nhiều bệnh ung thư hơn bất kỳ chất ô nhiễm không khí độc hại nào khác",
    "originLink": "https://www.propublica.org/article/formaldehyde-epa-trump-public-health-danger",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42313910",
    "commentBody": "",
    "originSummary": [
      "Formaldehyde, một chất ô nhiễm không khí phổ biến từ các nguồn như khí thải ô tô và nhà máy, gây ra rủi ro ung thư đáng kể, đặc biệt liên quan đến bệnh bạch cầu tủy. Nỗ lực điều chỉnh formaldehyde đã bị cản trở bởi ảnh hưởng của ngành công nghiệp và thay đổi chính trị, với những trở ngại đáng chú ý trong thời kỳ chính quyền Trump. Cuộc điều tra của ProPublica nhấn mạnh những rủi ro bị đánh giá thấp của việc tiếp xúc với formaldehyde và những thách thức đang diễn ra trong việc thực hiện các quy định hiệu quả, mặc dù đã có một số tiến bộ dưới thời chính quyền Biden."
    ],
    "commentSummary": [
      "Formaldehyde được công nhận là một chất ô nhiễm không khí gây ung thư chính, với các cuộc tranh luận đang diễn ra về việc điều chỉnh và các rủi ro sức khỏe liên quan, đặc biệt là bệnh bạch cầu tủy.",
      "EPA (Cơ quan Bảo vệ Môi trường) đang đối mặt với sự chỉ trích từ một số nhà khoa học về việc đánh giá rủi ro của formaldehyde, làm nổi bật sự căng thẳng giữa an toàn công cộng và lợi ích kinh tế.",
      "Formaldehyde thường được tìm thấy trong các sản phẩm như vật liệu xây dựng và các liệu pháp chăm sóc tóc, gây ra mối lo ngại về phơi nhiễm, trong khi các cuộc thảo luận rộng hơn bao gồm ô nhiễm từ lốp xe và giảm sự phụ thuộc vào ô tô."
    ],
    "points": 179,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1733278587
  },
  {
    "id": 42314024,
    "title": "EmacsConf 2024",
    "originLink": "https://emacsconf.org/2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314024",
    "commentBody": "",
    "originSummary": [
      "EmacsConf 2024 dự kiến sẽ được tổ chức trực tuyến vào ngày 7-8 tháng 12, với các bài thuyết trình, cơ hội tình nguyện và thảo luận xoay quanh GNU Emacs và Emacs Lisp.",
      "Sự kiện sẽ sử dụng phần mềm miễn phí để phát trực tuyến và bao gồm một sự kiện vệ tinh tại Lucerne, Thụy Sĩ, mang lại trải nghiệm kết hợp.",
      "Người tham gia có thể tham gia thảo luận qua danh sách thư emacsconf-discuss, tổ chức qua emacsconf-org, và kết nối trên IRC tại #emacsconf trên irc.libera.chat, với nội dung được cấp phép theo CC BY-SA 4.0 và GPLv3+."
    ],
    "commentSummary": [
      "EmacsConf 2024 nhấn mạnh sự cống hiến bền bỉ của cộng đồng Emacs, thể hiện các tính năng độc đáo của nó mặc dù không phổ biến như các trình soạn thảo như VS Code. - Các cuộc thảo luận chính tập trung vào sức hấp dẫn đặc thù của Emacs, mối quan hệ giữa sự phổ biến và tính bền vững của phần mềm, và các bài thuyết trình sáng tạo tại hội nghị. - Các chủ đề đáng chú ý bao gồm tích hợp Emacs với AI và các chế độ độc đáo như gptel, nhấn mạnh khả năng thích ứng và sự liên quan liên tục của nó."
    ],
    "points": 140,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1733280127
  },
  {
    "id": 42317968,
    "title": "Giám đốc điều hành UnitedHealthcare bị bắn chết ở trung tâm Manhattan",
    "originLink": "https://www.cnn.com/2024/12/04/us/brian-thompson-united-healthcare-death/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42317968",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Giám đốc điều hành của UnitedHealthcare đã bị bắn một cách bi thảm ở Manhattan, dẫn đến nhiều suy đoán rộng rãi về động cơ đằng sau vụ việc.",
      "Một số người cho rằng động cơ có thể liên quan đến các thực hành gây tranh cãi của UnitedHealthcare, bao gồm việc từ chối các yêu cầu bồi thường cho các bệnh nan y.",
      "Vụ việc đã khơi dậy các cuộc thảo luận về sự an toàn của những cá nhân nổi tiếng và tác động của các hành động của công ty đối với cảm xúc của công chúng."
    ],
    "points": 135,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1733323975
  },
  {
    "id": 42310683,
    "title": "Stephen King đóng cửa 3 đài phát thanh của mình ở Maine",
    "originLink": "https://www.nytimes.com/2024/12/03/arts/stephen-king-maine-radio-stations.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42310683",
    "commentBody": "",
    "originSummary": [
      "Stephen King đang đóng cửa ba đài phát thanh của mình ở Bangor, Maine, sau hơn 40 năm sở hữu, do thua lỗ tài chính và tuổi tác của ông.",
      "Những đài phát thanh, phản ánh niềm đam mê của King đối với nhạc rock và truyền thông địa phương, sẽ ngừng hoạt động vào đêm Giao thừa.",
      "Quyết định này đánh dấu một sự thay đổi đáng kể trong các hoạt động kinh doanh của King, khi ông tái tổ chức các dự án của mình."
    ],
    "commentSummary": [
      "Stephen King đang đóng cửa ba đài phát thanh của mình ở Maine do những thách thức do sự gia tăng của phát thanh doanh nghiệp, khiến các đài nhỏ khó cạnh tranh.",
      "Ngành công nghiệp radio đang đối mặt với khó khăn khi các nền tảng kỹ thuật số như podcast và YouTube trở nên phổ biến hơn, thu hút khán giả rời xa radio truyền thống.",
      "Việc đóng cửa các đài của King nhấn mạnh những khó khăn rộng lớn hơn của các doanh nghiệp radio độc lập trong việc thích nghi với môi trường truyền thông đang phát triển nhanh chóng."
    ],
    "points": 132,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1733256400
  },
  {
    "id": 42311912,
    "title": "Chiếc Porsche Macan EV đang bị thu hồi vì đèn pha của nó quá sáng",
    "originLink": "https://insideevs.com/news/742893/porsche-macan-electric-ev-recall-headlights/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311912",
    "commentBody": "",
    "originSummary": [
      "Porsche đang triệu hồi 2.941 mẫu Macan Electric tại Mỹ do đèn pha quá sáng, yêu cầu khách hàng đến trung tâm dịch vụ để cập nhật phần mềm.",
      "Vấn đề không thể được giải quyết thông qua một bản cập nhật qua mạng, đòi hỏi phải đến trực tiếp trung tâm dịch vụ để sửa chữa miễn phí.",
      "Việc thu hồi ảnh hưởng đến các phương tiện được sản xuất từ ngày 15 tháng 3 đến ngày 4 tháng 11 năm 2024, với các đại lý và chủ sở hữu sẽ được thông báo vào tháng 12 năm 2024 và tháng 1 năm 2025, tương ứng."
    ],
    "commentSummary": [
      "The Porsche Macan EV đang bị thu hồi do đèn pha quá sáng, gây khó chịu và lo ngại về an toàn cho người lái.",
      "Việc thu hồi nhấn mạnh sự khác biệt trong quy định về đèn pha giữa Mỹ và Châu Âu, với Mỹ có giới hạn độ sáng nghiêm ngặt hơn nhưng ít thực thi hơn về việc điều chỉnh đúng cách.",
      "Vấn đề này làm nổi bật sự thất vọng rộng rãi hơn trong số các tài xế về độ sáng ngày càng tăng của đèn pha ô tô hiện đại, đặc biệt là trên các phương tiện lớn hơn như SUV và xe tải."
    ],
    "points": 126,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1733262428
  }
]
