[
  {
    "id": 42314547,
    "title": "IMG_0001",
    "originLink": "https://walzr.com/IMG_0001/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314547",
    "commentBody": "",
    "originSummary": [
      "Vuosien 2009 ja 2012 välillä iPhoneissa oli \"Lähetä YouTubeen\" -painike Kuvat-sovelluksessa, mikä johti lukuisiin latauksiin, joissa oli oletusnimet IMG_XXXX. Ben Wallacen innoittamana kehitettiin botti, joka paikansi 5 miljoonaa näistä videoista, esitellen raakoja ja muokkaamattomia hetkiä. Videokokoelma on katsottavissa satunnaisessa järjestyksessä, tarjoten vilauksen tuon aikakauden suodattamattomasta sisällöstä."
    ],
    "commentSummary": [
      "Keskustelu pyörii minimalistisen käyttöliittymäominaisuuden ympärillä, joka näyttää katselukerrat videoissa ja herättää nostalgiaa varhaisen internetin henkilökohtaisemmasta ja aidommasta sisällöstä. Käyttäjät ilmaisevat ristiriitaisia tunteita, sillä jotkut pitävät henkilökohtaisia videoita yksityisyyden loukkauksena, vaikka ne ovat julkisesti saatavilla, mikä korostaa jatkuvia yksityisyyshuolia internetkulttuurissa. Keskustelu heijastaa internetkulttuurin kehitystä, vertaillen menneiden verkkokokemusten raakaa aitoutta nykypäivän verkon puhdistetumpaan ja mahdollisesti yksityisyyttä loukkaavampaan luonteeseen."
    ],
    "points": 1329,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1733287572
  },
  {
    "id": 42312121,
    "title": "Poikani (9-vuotias) käytti pelkää JavaScriptiä tehdäkseen pelin ja haluaa palautettasi.",
    "originLink": "https://www.armaansahni.com/game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42312121",
    "commentBody": "",
    "originSummary": [
      "9-vuotias on oppinut koodausta, hallinnut HTML:n ja CSS:n, ja on äskettäin käyttänyt Google Geminiä taitojensa parantamiseen. Hän loi pelin koodaamalla HTML:llä, CSS:llä ja JavaScriptillä VSCode-ohjelmassa ja käytti Piskeliä animoitujen grafiikoiden luomiseen, vanhempiensa ja Google Geminin ohjauksessa. Lapsi dokumentoi kokemuksensa blogikirjoituksessa, jossa hän käsitteli prosessia ja sai palautetta ohjelmoijavanhemmiltaan kirjoituksensa hiomiseksi."
    ],
    "commentSummary": [
      "9-vuotias loi pelin käyttämällä JavaScriptiä, esitellen taitojaan HTML:ssä, CSS:ssä ja pelisuunnittelussa työkaluilla kuten VSCode ja Piskel. Nuori kehittäjä sai ohjausta ohjelmoijavanhemmiltaan ja käytti Google Geminiä parantaakseen koodaustaitojaan. Yhteisön palaute on ollut positiivista, ja siinä on annettu parannusehdotuksia, mikä osoittaa tukevan ympäristön hänen koodausmatkalleen."
    ],
    "points": 803,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1733263696
  },
  {
    "id": 42311069,
    "title": "Egoless Engineering",
    "originLink": "https://egoless.engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311069",
    "commentBody": "",
    "originSummary": [
      "Puhe korostaa parempien työympäristöjen luomisen tärkeyttä purkamalla tarpeettomia roolijakoja ja kannustamalla yhteistyöhön eri roolien välillä. Se tuo esiin tehottomuuksia, joita liiallinen roolijako aiheuttaa, sekä väärinkäsityksiä \"devops\"-käytännöistä, jotka luovat esteitä sen sijaan, että edistäisivät yhteistyötä. Puhuja puoltaa yhteistyön, uteliaisuuden ja jaetun vastuun arvostamista, ehdottaen, että kurjuutta ei tulisi rinnastaa tuottavuuteen."
    ],
    "commentSummary": [
      "Egoless Engineering keskittyy yhteistyöhön, omistajuuteen ja tarpeettomien prosessien minimoimiseen tiimin tehokkuuden parantamiseksi.",
      "Se korostaa korkean luottamuksen ympäristöjen luomisen tärkeyttä tuottavuuden lisäämiseksi ja varoittaa politiikan aiheuttamista tehottomuuksista nykyaikaisissa tiimirakenteissa.",
      "Autonomian tasapainottaminen tarvittavan valvonnan kanssa on ratkaisevan tärkeää, erityisesti suurissa projekteissa, jotta voidaan edistää luottamuksen ja yhteistyön kulttuuria samalla kun hallitaan inhimillisiä piirteitä, kuten egoa."
    ],
    "points": 703,
    "commentCount": 247,
    "retryCount": 0,
    "time": 1733258303
  },
  {
    "id": 42312301,
    "title": "Phoenix LiveView 1.0.0 on täällä",
    "originLink": "https://www.phoenixframework.org/blog/phoenix-liveview-1.0-released?release=1.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42312301",
    "commentBody": "",
    "originSummary": [
      "Phoenix LiveView 1.0.0 on julkaistu, tarjoten merkittävän päivityksen, joka yksinkertaistaa dynaamisia palvelinrenderöityjä sovelluksia vähentämällä JavaScriptin tarvetta ja parantamalla reaaliaikaisia ominaisuuksia. - Tämän julkaisun keskeisiä ominaisuuksia ovat tehokkaat päivitykset mahdollistava diffing-moottori, HEEx-komponentit parantamaan HTML:n yhdisteltävyyttä ja interaktiiviset lataukset, jotka kaikki hyödyntävät Elixiriä ja Erlang VM:ää erinomaisen viiveen ja skaalautuvuuden saavuttamiseksi. - Päivitys tuo mukanaan myös uusia ominaisuuksia, kuten streamit ja asynkroniset toiminnot, ja tulevaisuuden suunnitelmiin kuuluu JavaScript-koukkujen ja Web-komponenttien integrointi, mikä kannustaa kehittäjiä tutkimaan sen helppoa käyttöönottoa."
    ],
    "commentSummary": [
      "Phoenix LiveView 1.0.0 on julkaistu, ja se sisältää uuden asennusohjelman helpompaa käyttöönottoa varten sekä parannettuja toimintoja.",
      "Julkaisua pidetään merkittävänä virstanpylväänä Elixir- ja Phoenix-projekteille, ja käyttäjät ylistävät sen tuottavuutta ja helppokäyttöisyyttä verrattuna muihin kehyksiin.",
      "Huolimatta joistakin haasteista, kuten epäluotettavien yhteyksien hallinnasta, yhteisö etsii aktiivisesti ratkaisuja, ja luoja Chris McCord on avoin palautteelle."
    ],
    "points": 693,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1733264927
  },
  {
    "id": 42317903,
    "title": "Genie 2: Suuri perusmaailmamalli",
    "originLink": "https://deepmind.google/discover/blog/genie-2-a-large-scale-foundation-world-model/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42317903",
    "commentBody": "",
    "originSummary": [
      "Research Genie 2, julkaistu 4. joulukuuta 2024, on laajamittainen perustavanlaatuinen maailmamalli, joka on suunniteltu tuottamaan monipuolisia 3D-ympäristöjä tekoälyagenttien koulutukseen. Jack Parker-Holderin tiimin kehittämä Genie 2 voi luoda toiminnallisesti hallittavia, pelattavia maailmoja yhdestä kuvakehotteesta, tukien nopeaa prototyyppien luomista ja interaktiivisia kokemuksia. Genie 2 edistää tekoälytutkimusta mallintamalla esineiden vuorovaikutuksia, hahmoanimaatioita ja ympäristön fysiikkaa, vastaten haasteeseen luoda rikkaita koulutusympäristöjä ruumiillistuneille agenteille."
    ],
    "commentSummary": [
      "Genie 2, jonka on kehittänyt DeepMind, on uusi maailmamalli, joka osoittaa potentiaalia ympäristöjen navigoinnissa käyttämällä valokuvia ja tekstiä, mutta siitä puuttuvat tekniset yksityiskohdat, koodi ja avoin pääsy.",
      "Sen katsotaan olevan enemmän tutkimus- ja kehitystyön prototyyppi kuin valmis tuote, mikä on johtanut kritiikkiin sen vaikeasta saavutettavuudesta ja rajallisesta käytännön sovellettavuudesta.",
      "Keskustelu Genie 2:sta korostaa AI:n tuottaman sisällön haasteita, tulevien sovellusten potentiaalia ja AI-kehityksen kilpailullista luonnetta, kun sen todellinen hyöty ja vaikutus ovat yhä epävarmoja."
    ],
    "points": 417,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1733323502
  },
  {
    "id": 42314700,
    "title": "OpenTTD on avoimen lähdekoodin simulaatiopeli, joka perustuu Transport Tycoon Deluxe -peliin.",
    "originLink": "https://www.openttd.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314700",
    "commentBody": "",
    "originSummary": [
      "OpenTTD 14.1 julkaistiin 3. toukokuuta 2024, keskittyen virheiden korjauksiin alkuperäisen julkaisun jälkeen. Tärkeimpiä päivityksiä ovat moninpelin synkronointivirheen korjaaminen sekä parannukset laivojen reitinhakuun ja ryhmittymisen purkuun. Pelaajat ovat osoittaneet merkittävää sitoutumista, kirjaten 34 700 tuntia 17 219 pelissä viime viikolla."
    ],
    "commentSummary": [
      "OpenTTD on avoimen lähdekoodin simulaatiopeli, joka on saanut inspiraationsa Transport Tycoon Deluxesta ja on huomionarvoinen siitä, että sitä voi pelata ilman lisäresursseja, toisin kuin monet muut avoimen lähdekoodin uusintaversiot. Vuonna 2004 julkaistu OpenTTD korvasi alkuperäisen pelin grafiikat vuoteen 2009 mennessä, mikä mahdollisti sen jakelun alustoilla kuten Steam säilyttäen alkuperäisen tyylin ilman resurssien kopiointia. Peli tukee moninpeliä ja sillä on opetuksellisia sovelluksia, kuten tekoälyn kehittämisessä, ja se on edelleen suosittu nostalgisen vetovoimansa ja mukaansatempaavan pelattavuutensa ansiosta."
    ],
    "points": 292,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1733290165
  },
  {
    "id": 42311031,
    "title": "Kääntäjäni käänsi itsensä",
    "originLink": "https://github.com/keyvank/30cc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311031",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Käyttäjä kuvaili matkaansa itseään kääntävän C-kääntäjän kehittämisessä, korostaen prosessin haasteita ja palkitsevuutta.",
      "Palautteessa keskityttiin noudattamaan DRY (Don't Repeat Yourself) -periaatteita ja välttämään tarpeetonta tyyppimuunnosta malloc()-funktion, C-kielessä käytettävän muistinvarausfunktion, yhteydessä.",
      "Keskustelu laajeni käsittämään aiheita kuten kääntäjän yhteensopivuus, koodityyli, bootstrapping sekä Makefilejen ja Python-skriptien käytön hyvät ja huonot puolet projektien rakentamisessa."
    ],
    "points": 238,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1733258124
  },
  {
    "id": 42315946,
    "title": "Kuinka kehittää ammatillisia suhteita",
    "originLink": "https://tej.as/blog/how-to-grow-professional-relationships-tjs-model",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42315946",
    "commentBody": "",
    "originSummary": [
      "Matka Synergiaan (TJS) -yhteistyömalli kuvaa seitsemän ammatillisten suhteiden tilaa, jotka vaihtelevat kilpailullisista jaetun identiteetin tilaan, yhteistyön parantamiseksi.",
      "Malli korostaa siirtymistä nollasummamielentilasta korkealaatuiseen synergiaan, kannustaen runsauden ajattelutapaan ja henkilökohtaisten tavoitteiden ja arvojen mukaiseen linjaukseen.",
      "Keskeisiä vaiheita ovat Kilpailu, Rinnakkaiselo, Viestintä, Yhteistyö, Koordinointi, Yhteistyö ja \"Olemme samaa\", joiden lopullisena tavoitteena on saavuttaa enemmän yhdessä kuin yksin."
    ],
    "commentSummary": [],
    "points": 237,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1733305322
  },
  {
    "id": 42314340,
    "title": "Hiukkasfysiikan kurssi lukiolaisille",
    "originLink": "https://ppc.web.cern.ch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314340",
    "commentBody": "",
    "originSummary": [
      "CERNin fysiikan opetustutkimusryhmä on kehittänyt pilottikurssin hiukkasfysiikasta lukiolaisille, joka koostuu 16 luvusta videoineen ja visailuineen. Noin 4 tuntia kestävä kurssi kattaa perustavanlaatuisia aiheita, kuten \"Mikä on hiukkanen?\" ja \"Mikä on hiukkaskiihdytin?\" ja sisältää tee-se-itse-kokeita. Osallistujat voivat suorittaa luvut missä tahansa järjestyksessä ja ansaita digitaalisen todistuksen suoritettuaan kaikki visailut, ja palautetta kannustetaan antamaan tulevien versioiden parantamiseksi."
    ],
    "commentSummary": [
      "Yhdistyneessä kuningaskunnassa järjestettiin lukiolaisille suunnattu hiukkasfysiikan kurssi, johon osallistui 54 teini-ikäistä 36 koulusta, ja se toteutettiin verkossa kahdeksan viikon ajan. - Haasteista, kuten rajallisesta vuorovaikutuksesta ja itsetunto-ongelmista huolimatta, yli 80 % opiskelijoista läpäisi testin, joka sisälsi kysymyksiä Oxfordin jatko-opintojen kvanttifysiikan kokeesta, ja puolet saavutti erinomaisia tuloksia. - Kurssin menestys ilman monimutkaista matematiikkaa johti keskusteluihin kameran käytön pakottamisesta verkkotunneilla, opiskelijoiden sitouttamisesta ja kielten saavutettavuudesta ei-englanninkielisille opiskelijoille."
    ],
    "points": 215,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1733284177
  },
  {
    "id": 42313507,
    "title": "Ei NAT-marraskuu: Kuukauteni ilman IPv4:ää",
    "originLink": "https://blog.infected.systems/posts/2024-12-01-no-nat-november/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42313507",
    "commentBody": "",
    "originSummary": [
      "Haaste \"No NAT November\" sisälsi IPv4:n poistamisen käytöstä ja pelkän IPv6:n käytön, korostaen siirtymisen mahdollisuuksia ja haasteita IPv6-yksinomaisiin verkkoihin. Kirjoittaja ehdottaa \"enimmäkseen IPv6\" -lähestymistapaa, joka asettaa etusijalle IPv6:n samalla kun ylläpidetään kaksipinoisia verkkoja, vähentäen ylläpitoa ja valmistautuen IPv4-vapaaseen tulevaisuuteen. Siirtymäteknologiat kuten NAT64 ja DNS64 auttoivat ratkaisemaan yhteensopivuusongelmia, Applen laitteiden sopeutuessa hyvin, kun taas Windows ja Linux osoittivat vaihtelevia tuloksia."
    ],
    "commentSummary": [
      "Keskustelu tuo esiin haasteita siirryttäessä IPv4:stä IPv6:een, mukaan lukien internet-palveluntarjoajien tukiongelmat, laitteistorajoitukset sekä liiketoiminnalliset ja tekniset esteet.",
      "IPv6:n käyttäjät huomaavat etuja, kuten parantuneen viiveen ja yksinkertaistetun verkonhallinnan välttämällä NAT:n (Network Address Translation) monimutkaisuudet.",
      "Keskustelu sisältää epäilyksiä IPv6:n käyttöönotosta ja tutkii teknisiä ratkaisuja, kokoonpanoja sekä sen vaikutusta turvallisuuteen ja verkon hallintaan."
    ],
    "points": 201,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1733274224
  },
  {
    "id": 42313910,
    "title": "Formaldehydi aiheuttaa enemmän syöpää kuin mikään muu myrkyllinen ilman epäpuhtaus.",
    "originLink": "https://www.propublica.org/article/formaldehyde-epa-trump-public-health-danger",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42313910",
    "commentBody": "",
    "originSummary": [
      "Formaldehydi, yleinen ilmansaaste, jota tulee esimerkiksi autojen pakokaasuista ja tehtaista, aiheuttaa merkittäviä syöpäriskejä, erityisesti liittyen myeloidiseen leukemiaan. Pyrkimyksiä formaldehydin sääntelyyn on estänyt teollisuuden vaikutusvalta ja poliittiset muutokset, ja erityisesti Trumpin hallinnon aikana koettiin merkittäviä takaiskuja. ProPublican tutkimus korostaa formaldehydialtistuksen aliarvioituja riskejä ja jatkuvia haasteita tehokkaiden säädösten toteuttamisessa, vaikka Bidenin hallinnon aikana onkin edistytty jonkin verran."
    ],
    "commentSummary": [
      "Formaldehydi tunnustetaan merkittäväksi karsinogeeniseksi ilman epäpuhtaudeksi, ja sen sääntelystä ja siihen liittyvistä terveysriskeistä, erityisesti myeloidisesta leukemiasta, käydään jatkuvasti keskustelua.",
      "Ympäristönsuojeluvirasto (EPA) kohtaa kritiikkiä joiltakin tutkijoilta sen arvioidessa formaldehydin riskejä, mikä korostaa jännitettä julkisen turvallisuuden ja taloudellisten etujen välillä.",
      "Formaldehydiä esiintyy yleisesti tuotteissa, kuten rakennusmateriaaleissa ja hiustenhoitotuotteissa, mikä herättää huolta altistumisesta, samalla kun laajemmissa keskusteluissa käsitellään ajoneuvojen renkaiden aiheuttamaa saastumista ja autoriippuvuuden vähentämistä."
    ],
    "points": 179,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1733278587
  },
  {
    "id": 42314024,
    "title": "EmacsConf 2024",
    "originLink": "https://emacsconf.org/2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42314024",
    "commentBody": "",
    "originSummary": [
      "EmacsConf 2024 on suunniteltu pidettäväksi verkossa 7.-8. joulukuuta, ja se sisältää puheita, vapaaehtoistyömahdollisuuksia ja keskusteluja, jotka keskittyvät GNU Emacsiin ja Emacs Lispiin.",
      "Tapahtumassa käytetään ilmaista ohjelmistoa suoratoistoon, ja siihen sisältyy satelliittitapahtuma Luzernissa, Sveitsissä, tarjoten hybridikokemuksen.",
      "Osallistujat voivat osallistua keskusteluihin emacsconf-discuss-sähköpostilistan kautta, järjestäytyä emacsconf-orgin kautta ja liittyä IRC:ssä kanavalle #emacsconf osoitteessa irc.libera.chat, sisällön ollessa lisensoitu CC BY-SA 4.0 ja GPLv3+ -lisenssien alaisuudessa."
    ],
    "commentSummary": [
      "EmacsConf 2024 korostaa Emacs-yhteisön kestävää omistautumista, esitellen sen ainutlaatuisia ominaisuuksia, vaikka se ei olekaan yhtä suosittu kuin editorit kuten VS Code. Keskeiset keskustelut keskittyvät Emacsin kapeaan vetovoimaan, suosion ja ohjelmistojen kestävyyden väliseen suhteeseen sekä innovatiivisiin esityksiin konferenssissa. Huomionarvoisia aiheita ovat Emacsin integrointi tekoälyn kanssa ja ainutlaatuiset tilat, kuten gptel, jotka korostavat sen sopeutumiskykyä ja jatkuvaa merkityksellisyyttä."
    ],
    "points": 140,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1733280127
  },
  {
    "id": 42317968,
    "title": "UnitedHealthcare:n toimitusjohtaja ammuttiin kuoliaaksi Manhattanin keskustassa",
    "originLink": "https://www.cnn.com/2024/12/04/us/brian-thompson-united-healthcare-death/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42317968",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "UnitedHealthcare:n toimitusjohtaja ammuttiin traagisesti Manhattanilla, mikä on johtanut laajaan spekulointiin tapahtuman motiivista.",
      "Jotkut ehdottavat, että motiivi saattaa liittyä UnitedHealthcare:n kiistanalaisiin käytäntöihin, mukaan lukien terminaalisten sairauksien korvausvaatimusten hylkääminen.",
      "Tapahtuma on herättänyt keskusteluja korkean profiilin henkilöiden turvallisuudesta ja yritystoimien vaikutuksesta yleiseen mielipiteeseen."
    ],
    "points": 135,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1733323975
  },
  {
    "id": 42310683,
    "title": "Stephen King sulkee kolme radiokanavaansa Mainessa",
    "originLink": "https://www.nytimes.com/2024/12/03/arts/stephen-king-maine-radio-stations.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42310683",
    "commentBody": "",
    "originSummary": [
      "Stephen King sulkee kolme radioasemaansa Bangorissa, Mainessa, yli 40 vuoden omistuksen jälkeen taloudellisten tappioiden ja ikänsä vuoksi.",
      "Kingin intohimoa rockmusiikkiin ja paikalliseen mediaan heijastavat asemat lopettavat toimintansa uudenvuodenaattona.",
      "Tämä päätös merkitsee merkittävää muutosta Kingin liiketoimissa, kun hän järjestelee uudelleen hankkeitaan."
    ],
    "commentSummary": [
      "Stephen King sulkee kolme radiokanavaansa Mainessa, koska yrityslähetysten yleistyminen aiheuttaa haasteita, jotka tekevät pienille asemille vaikeaksi kilpailla.",
      "Radioteollisuus kohtaa vaikeuksia, kun digitaaliset alustat kuten podcastit ja YouTube kasvattavat suosiotaan ja vetävät yleisöjä pois perinteisen radion parista.",
      "King's-asemien sulkeminen korostaa itsenäisten radioyritysten laajempia kamppailuja sopeutua nopeasti kehittyvään mediaympäristöön."
    ],
    "points": 132,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1733256400
  },
  {
    "id": 42311912,
    "title": "Porsche Macan EV kutsutaan takaisin, koska sen ajovalot ovat liian kirkkaat",
    "originLink": "https://insideevs.com/news/742893/porsche-macan-electric-ev-recall-headlights/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42311912",
    "commentBody": "",
    "originSummary": [
      "Porsche kutsuu takaisin 2 941 Macan Electric -mallia Yhdysvalloissa liian kirkkaiden ajovalojen vuoksi, mikä vaatii huoltokeskuskäynnin ohjelmistopäivitystä varten.",
      "Asiaa ei voida ratkaista etäpäivityksellä, joten tarvitaan fyysinen käynti huoltokeskuksessa ilmaista korjausta varten.",
      "Takaisinkutsu koskee ajoneuvoja, jotka on valmistettu 15. maaliskuuta ja 4. marraskuuta 2024 välisenä aikana, ja jälleenmyyjille ja omistajille ilmoitetaan asiasta joulukuussa 2024 ja tammikuussa 2025."
    ],
    "commentSummary": [
      "Porsche Macan EV kutsutaan takaisin, koska sen ajovalot ovat liian kirkkaat, mikä aiheuttaa epämukavuutta ja turvallisuusongelmia kuljettajille.",
      "Takaisinkutsu korostaa eroja ajovalosäädöksissä Yhdysvaltojen ja Euroopan välillä, sillä Yhdysvalloissa on tiukemmat kirkkausrajat, mutta vähemmän valvontaa oikean säädön suhteen.",
      "Kysymys korostaa laajempaa turhautumista kuljettajien keskuudessa nykyaikaisten auton ajovalojen lisääntyvän kirkkauden suhteen, erityisesti suuremmissa ajoneuvoissa, kuten katumaastureissa ja kuorma-autoissa."
    ],
    "points": 126,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1733262428
  }
]
