[
  {
    "id": 42506577,
    "title": "عيد ميلاد مجيد للجميع",
    "originLink": "https://news.ycombinator.com/item?id=42506577",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42506577",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1164,
    "commentCount": 296,
    "retryCount": 0,
    "time": 1735096207
  },
  {
    "id": 42505454,
    "title": "تطبيق شريط القوائم لنظام macOS يعرض مدى امتلاء خزان البول في محطة الفضاء الدولية في الوقت الفعلي",
    "originLink": "https://github.com/Jaennaet/pISSStream",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42505454",
    "commentBody": "",
    "originSummary": [
      "pISSStream هو تطبيق لشريط القوائم في نظام macOS يعرض حالة سعة خزان البول لمحطة الفضاء الدولية (ISS) في الوقت الفعلي. تم تطوير التطبيق باستخدام لغة Swift ونظام macOS، مما يمثل المحاولة الأولى للمطور، والتي قد تؤدي إلى وجود أخطاء محتملة ومعالجة محدودة للأخطاء. يتم الحصول على بيانات التطبيق من مشروع ISS Mimic، على الرغم من أن المطور لا يخطط لإضافة إحصائيات إضافية من المصدر."
    ],
    "commentSummary": [
      "تطبيق شريط القوائم لنظام macOS يعرض حالة خزان البول لمحطة الفضاء الدولية (ISS) في الوقت الحقيقي، مستوحى من بيانات ISS-Mimic، وهو متاح على GitHub.",
      "تم إنشاء التطبيق بواسطة jaennaet كمشروع لتعلم Swift، ويستكشف بشكل فكاهي التواصل مفتوح المصدر والأهداف غير المقصودة، مما يثير النقاشات حول إدارة النفايات الفضائية والتطورات المحتملة.",
      "يتلقى المشروع ردود فعل متباينة، تتراوح بين التسلية والشك، مع محادثات حول جدته، وإمكانية تحويله إلى أفلام، وإمكانيات تحقيق الربح منه."
    ],
    "points": 925,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1735079920
  },
  {
    "id": 42506145,
    "title": "شجرة عيد الميلاد المزخرفة (2013) ≈ T * sin (t)'",
    "originLink": "https://community.wolfram.com/c/portal/getImageAttachment?filename=tree.gif&userId=93201",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42506145",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "شجرة عيد الميلاد T * sin(t) هي منشور احتفالي متكرر على موقع Hacker News، حيث تم تسليط الضوء هذا العام على تعديل سيلفيا هاو.- يتضمن المنشور مناقشات حول المفاهيم الرياضية وراء الشجرة ويعرض مشاريع احتفالية إبداعية أخرى، مثل زينة dweet ونهج لعبة الفوضى.- يشارك المجتمع في تبادل والاحتفال بالإبداعات الرياضية والفنية الخاصة بالعطلات."
    ],
    "points": 348,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1735088842
  },
  {
    "id": 42507185,
    "title": "هذه المشكلة المفتوحة علمتني ما هو الطوبولوجيا [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=IQqtsm-bBRU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42507185",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "شرح الفيديو بشكل فعال مفاهيم الطوبولوجيا الجبرية، مما جعلها متاحة لجمهور أوسع يتجاوز الأكاديميين. أثار النقاشات حول تصور المفاهيم الرياضية المعقدة، مثل الفضاءات رباعية الأبعاد، وأكد على القيمة التعليمية للرسوم المتحركة. بينما وجد بعض المشاهدين الشروحات صعبة، أظهر الفيديو إمكانيات طرق التدريس المبتكرة في الرياضيات."
    ],
    "points": 285,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1735106925
  },
  {
    "id": 42507312,
    "title": "روبي 3.4.0",
    "originLink": "https://www.ruby-lang.org/en/news/2024/12/25/ruby-3-4-0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42507312",
    "commentBody": "",
    "originSummary": [
      "تقدم روبي 3.4.0 ميزات جديدة مثل مرجع معلمة الكتلة باستخدام `it`، وPrism كمحلل افتراضي، وHappy Eyeballs Version 2 لتحسين الاتصال بالشبكة.",
      "يتضمن التحديث تحسينات في الأداء، وخيارات جديدة لسطر الأوامر، وإصلاحات متنوعة للأخطاء، بالإضافة إلى تحذيرات إهمال للمتغيرات النصية القابلة للتغيير ودعم لتوزيع الكلمات المفتاحية nil.",
      "تم معالجة مشكلات التوافق وتحديثات واجهة برمجة التطبيقات C، مع تحديثات للفئات الأساسية والمكتبة القياسية، مما يجعلها إصدارًا مهمًا للمطورين."
    ],
    "commentSummary": [
      "يقدم روبي 3.4.0 محللاً جديدًا مكتوبًا يدويًا، ليحل محل المحلل السابق الذي تم إنشاؤه، مما يمثل تحولًا كبيرًا نحو تحسين الصيانة على المدى الطويل.",
      "لقد بدأت التحديثات مناقشات حول مزايا وعيوب مولدات المحللات مقابل المحللات المكتوبة يدويًا، حيث يفضل بعض المطورين الأخيرة لبساطتها وكفاءتها.",
      "تم استقبال تحسينات أداء روبي، لا سيما مع YJIT (جيت روبي آخر)، بشكل إيجابي، مما يعزز جاذبيتها لتطوير الويب على الرغم من تحديات التثبيت."
    ],
    "points": 268,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1735108807
  },
  {
    "id": 42505038,
    "title": "تجربة QvQ - نموذج كوين الجديد للاستدلال البصري",
    "originLink": "https://simonwillison.net/2024/Dec/24/qvq/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42505038",
    "commentBody": "",
    "originSummary": [
      "أصدرت شركة علي بابا نموذجًا جديدًا للتفكير البصري، QvQ-72B-Preview، في ديسمبر 2024، والذي يدمج الرؤية مع التعليمات النصية لتعزيز قدرات التفكير البصري.",
      "النموذج متاح للاختبار على Hugging Face Spaces ويمكن تشغيله محليًا باستخدام حزمة mlx-vlm الخاصة بـ Prince Canuma، مما يبرز طبيعته المفتوحة المصدر وسهولة الوصول إليه.",
      "يسلط مدونة سيمون ويليسون الضوء على إمكانيات النموذج للتطبيقات الإبداعية، على الرغم من النتائج المتباينة، ويؤكد على نهجه الترفيهي في حل المشكلات."
    ],
    "commentSummary": [
      "يتطلب نموذج QvQ، وهو نموذج الاستدلال البصري الجديد من Qwen، مساحة قرص تبلغ 38 جيجابايت ويتفوق في تقديم أوصاف مفصلة للصور ولكنه يواجه صعوبة في مهام الاستدلال البصري المعقدة.",
      "تأثر تعامل النموذج مع المواضيع الحساسة، مثل ميدان تيانانمن، بالرقابة، مما يثير قلق المستخدمين بشأن وضعه كمصدر مفتوح وآليات الرقابة.",
      "لاحظ المستخدمون أن QvQ يتميز بأسلوب مطول وغير رسمي، وعلى الرغم من قدرته على إدارة بعض المهام مثل المعادلات الرياضية، إلا أنه غالبًا ما يفشل في التحديات الأكثر تعقيدًا."
    ],
    "points": 228,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1735075532
  },
  {
    "id": 42504343,
    "title": "أقنعة، دخان، ومرايا: قصة رحلة مصر للطيران 804",
    "originLink": "https://admiralcloudberg.medium.com/masks-smoke-and-mirrors-the-untold-story-of-egyptair-flight-804-42c788fcac2d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42504343",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تكشف التحقيقات في حادث تحطم طائرة مصر للطيران الرحلة 804 عن وجود تناقضات بين تقارير المكتب الفرنسي للتحقيق والتحليل لسلامة الطيران المدني (BEA) وتقارير إدارة التحقيق في حوادث الطائرات المصرية (EAAID).",
      "تشمل القضايا الرئيسية التي نوقشت لوائح التدخين في قمرة القيادة، واستخدام الأكسجين النقي في الطيران، وصعوبة إجراء تحقيقات غير متحيزة في الأنظمة الاستبدادية.",
      "يدور النقاش حول تركيز السلطات المصرية على نظرية القنبلة، رغم الأدلة المخالفة، مما يبرز تأثير النفوذ السياسي على ثقافة السلامة والتحقيقات في الحوادث."
    ],
    "points": 212,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1735069180
  },
  {
    "id": 42506569,
    "title": "FixBrowser – متصفح ويب خفيف الوزن تم إنشاؤه من الصفر",
    "originLink": "https://www.fixbrowser.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42506569",
    "commentBody": "",
    "originSummary": [
      "يتم تطوير متصفح ويب جديد خفيف الوزن يركز على الخصوصية، والذي يعمل بشكل فريد بدون جافا سكريبت، باستخدام نصوص محدثة لتحسين المواقع بدلاً من ذلك. - يستخدم المتصفح استراتيجية القائمة البيضاء لحظر الموارد من مختلف النطاقات، مما يتجنب بشكل فعال المتعقبات ويعزز خصوصية المستخدم. - يقوم المطور بإجراء حملة لجمع التبرعات لدعم تقدم هذا المشروع، داعياً الأطراف المهتمة للمساهمة."
    ],
    "commentSummary": [
      "FixBrowser هو متصفح ويب خفيف الوزن يركز على الخصوصية، ويعزز الخصوصية عن طريق حجب الموارد من نطاقات مختلفة باستخدام نهج القائمة البيضاء.",
      "تم تطويره بلغة FixScript، وهي لغة آمنة وقابلة للنقل، ولا تدعم JavaScript، على الرغم من وجود إمكانية لدمج محركات البرمجة النصية الأخرى.",
      "المشروع مفتوح المصدر ويسعى للحصول على تمويل لمزيد من التطوير، بهدف دعم منصات متعددة، بما في ذلك لينكس وماك أو إس."
    ],
    "points": 186,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1735096093
  },
  {
    "id": 42507116,
    "title": "لقد أنشأت موقعًا للبحث الدلالي في أوراق ArXiv",
    "originLink": "https://papermatch.mitanshu.tech/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42507116",
    "commentBody": "",
    "originSummary": [
      "قام طالب دراسات عليا يعاني من اضطراب فرط الحركة ونقص الانتباه بتطوير موقع ويب للمساعدة في مراجعات الأدبيات المنهجية من خلال العثور على أوراق بحثية مشابهة بناءً على المعنى. يستخدم الموقع نموذج التضمين الخاص بـ MixedBread لتمثيل المتجهات، وMilvus للتخزين والبحث، وGradio لتقديم التطبيق. يتم تحديث قاعدة بيانات المتجهات أسبوعيًا باستخدام بيانات Kaggle، ويتم تحسين كفاءة البحث من خلال تحويل التضمينات إلى ثنائية واستخدام مسافة هامنج."
    ],
    "commentSummary": [
      "تم تطوير موقع ويب جديد للبحث الدلالي في أوراق ArXiv باستخدام نموذج التضمين MixedBread، وMilvus لتخزين المتجهات، وGradio للواجهة الأمامية.",
      "يتم تحديث قاعدة البيانات أسبوعيًا من كاجل، ويتم استخدام مسافة هامنج للبحث بشكل أسرع، مع اقتراحات من المستخدمين لإضافة ميزات إضافية وتطبيقات أوسع.",
      "تشمل المناقشات الاستخدامات المحتملة للبحث الدلالي في التسويق والتجارة الإلكترونية، بالإضافة إلى الجوانب التقنية مثل نماذج التضمين واستراتيجيات إعادة الترتيب."
    ],
    "points": 159,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1735105452
  },
  {
    "id": 42506211,
    "title": "محاكاة CRT في تظليل GPU، تبدو أفضل من إدراج الإطار الأسود",
    "originLink": "https://blurbusters.com/crt-simulation-in-a-gpu-shader-looks-better-than-bfi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42506211",
    "commentBody": "",
    "originSummary": [
      "مارك ريجهون، بالتعاون مع تيموثي لوتيس، قدما خوارزمية مفتوحة المصدر جديدة لمحاكاة شاشات CRT (أنبوب الأشعة الكاثودية)، متاحة على Shadertoy وGitHub. تقلل هذه الخوارزمية من ضبابية الحركة على الشاشات التي تعمل بتردد 240 هرتز أو أكثر وتوفر وميضًا أكثر نعومة مقارنة بإدراج الإطار الأسود (BFI)، وقد تم دمجها في محاكي Retroarch. تتوافق المحاكاة مع شاشات LCD وOLED، وتوفر أوضاعًا في الوقت الحقيقي والحركة البطيئة، وهي فعالة بشكل خاص في تقليل ضبابية الحركة في المحتوى القديم الذي يعمل بسرعة 60 إطارًا في الثانية."
    ],
    "commentSummary": [
      "تتركز المناقشة حول محاكاة أنبوب الأشعة الكاثودية (CRT) في تظليل وحدة معالجة الرسوميات (GPU)، والتي يجدها بعض المستخدمين أفضل من إدراج الإطارات السوداء لمحاكاة الرسوميات القديمة لألعاب الفيديو. - يبلغ المستخدمون عن مشكلات مثل التموج المستمر، والوميض، وتغير الألوان، مما يشير إلى تحديات في تحقيق تأثير CRT مقنع على الشاشات الحديثة. - قد يتطلب تحقيق محاكاة واقعية معدلات تحديث عالية، تصل إلى 1000 هرتز، لتقليل ضبابية الحركة، على الرغم من أن ذلك قد يؤدي إلى وميض وظهور عيوب."
    ],
    "points": 155,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1735089989
  },
  {
    "id": 42505542,
    "title": "توفي غوردون ماه أونغ",
    "originLink": "https://www.pcworld.com/article/2564783/gordon-mah-ung-remembered.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42505542",
    "commentBody": "",
    "originSummary": [
      "غوردون ماه أونغ، محرر محترم في PCWorld وصحفي متخصص في الأجهزة، توفي عن عمر يناهز 58 عامًا بعد معركة مع سرطان البنكرياس، تاركًا تأثيرًا كبيرًا في صحافة التكنولوجيا.",
      "مع أكثر من 25 عامًا في الصناعة، كان معروفًا بمعرفته العميقة وكتاباته الجذابة والتزامه بالنزاهة الصحفية، حيث ساهم في Maximum PC وPCWorld.",
      "ألهم عمل جوردون، بما في ذلك بودكاست \"The Full Nerd\"، العديد في مجتمع التكنولوجيا، وكان يُعجب به لالتزامه بالدفاع عن المستهلك وتبسيط التكنولوجيا المعقدة."
    ],
    "commentSummary": [
      "غوردون ماه أونغ، شخصية محترمة في مجتمع التكنولوجيا ومعروف بعمله مع Maximum PC، قد توفي، تاركًا تأثيرًا كبيرًا على عشاق أجهزة الكمبيوتر من خلال دفاعه عن المستهلك ومراجعاته للأجهزة. - أشادت شخصيات بارزة مثل ستيف من GamersNexus وإيان بتأثيره وتفانيه في مجال التكنولوجيا، بالإضافة إلى حسه الفكاهي. - كما أن وفاته سلطت الضوء على قضية سرطان البنكرياس، وهو مرض معروف بصعوبة اكتشافه المبكر."
    ],
    "points": 142,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1735080914
  },
  {
    "id": 42506506,
    "title": "لقد قمت للتو بتحديث متصفح كروم الخاص بزوجتي، ولم يعد uBlock مدعومًا.",
    "originLink": "https://news.ycombinator.com/item?id=42506506",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42506506",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يعبر المستخدمون عن إحباطهم لأن التحديث الأخير لمتصفح كروم لم يعد يدعم uBlock، وهو امتداد شائع لحجب الإعلانات، مما يثير مخاوف من أن جوجل تفضل الإعلانات على حساب تجربة المستخدم.",
      "رداً على ذلك، يقوم بعض المستخدمين بالتحول إلى متصفحات بديلة مثل فايرفوكس، المعروف بميزاته القوية في الخصوصية وحجب الإعلانات، أو بريف، الذي يوفر حجب الإعلانات مدمجاً.",
      "تسلط الوضعية الضوء على التحديات المستمرة في الحفاظ على حجب الإعلانات بشكل فعال في المتصفحات المبنية على كروميوم، مما يدفع إلى مناقشات حول اختيار المتصفح لتعزيز الخصوصية."
    ],
    "points": 139,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1735094969
  },
  {
    "id": 42506041,
    "title": "ركض طيار عبر المطار ليفاجئ المرأة التي أنقذت حياته",
    "originLink": "https://www.cnn.com/2024/12/21/travel/united-pilot-reunites-bone-marrow-donor/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42506041",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "فاجأ طيار المرأة التي أنقذت حياته، مما أثار نقاشًا حول أخلاقيات التبرع بالأعضاء. - ناقش المستخدمون ما إذا كان يجب على المتبرعين بالأعضاء مراعاة معتقدات المستفيدين، حيث انقسمت الآراء بين إعطاء الأولوية لإنقاذ الحياة وخيار المتبرع. - أبرزت المحادثة تعقيدات أخلاقيات توزيع الأعضاء وشجعت على النظر في التبرع بالخلايا الجذعية أو نخاع العظام."
    ],
    "points": 122,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1735087296
  }
]
