[
  {
    "id": 42876840,
    "title": "JavaScript Temporal מגיע",
    "originLink": "https://developer.mozilla.org/en-US/blog/javascript-temporal-is-coming/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42876840",
    "commentBody": "",
    "originSummary": [
      "JavaScript Temporal הוא תכונה חדשה בגרסאות ניסיוניות של דפדפנים שמטרתה לשפר את הטיפול בתאריכים וזמנים עבור מפתחי אתרים, תוך התמודדות עם המגבלות של אובייקט Date הישן.",
      "Temporal מספק ניהול מדויק של תאריכים, זמנים, משכים ולוחות שנה, עם למעלה מ-200 שיטות עזר, ותומך בלוחות שנה ואזורי זמן שונים.",
      "בעוד שתמיכה מלאה בכל הדפדפנים עדיין בתהליך, פיירפוקס מוביל עם היישום המתקדם ביותר, ומפתחים יכולים להתנסות ב-Temporal באמצעות @js-temporal/polyfill."
    ],
    "commentSummary": [
      "JavaScript Temporal הוא API חדש שנועד להתגבר על המגבלות של ה-API הישן Date(), תוך שאיבת השראה מספריות זמן מתקדמות כמו chrono ב-Rust ו-Joda Time ב-Java.",
      "זה מציג מבנה מורכב יותר אך הכרחי על ידי הפרדת הזמן לזמן נאיבי, רגע וזמן אזורי, ובכך מתמודד ביעילות עם בעיות כמו באגים של שעון קיץ (DST) והבדלים בסריאליזציה.",
      "צפוי כי Temporal יחליף ספריות פופולריות כמו Moment.js, Luxon ו-date-fns על ידי מתן פתרון מובנה וסטנדרטי לניהול תאריכים וזמנים ב-JavaScript, תוך שימוש במסד הנתונים של אזורי הזמן של IANA."
    ],
    "points": 724,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1738236511
  },
  {
    "id": 42871371,
    "title": "מאגר המידע DeepSeek שנחשף דולף מידע רגיש, כולל היסטוריית צ'אט",
    "originLink": "https://www.wiz.io/blog/wiz-research-uncovers-exposed-deepseek-database-leak",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42871371",
    "commentBody": "",
    "originSummary": [
      "וויז ריסרץ' זיהתה פגיעות אבטחה במסד נתונים של ClickHouse הנגיש לציבור של DeepSeek, סטארטאפ סיני בתחום הבינה המלאכותית, אשר חשף למעלה ממיליון שורות של נתונים רגישים, כולל היסטוריית צ'אט ומפתחות סודיים. מסד הנתונים היה פתוח וללא אימות, מה שהציג סיכוני אבטחה משמעותיים, אך הוא אובטח במהירות לאחר גילוי אחראי של וויז ריסרץ'. תקרית זו מדגישה את האתגרים הביטחוניים באימוץ המהיר של טכנולוגיות בינה מלאכותית, ומבליטה את הצורך הקריטי באמצעי אבטחה חזקים כדי להגן על נתונים רגישים ככל שהבינה המלאכותית הופכת לחלק בלתי נפרד מפעילות עסקית."
    ],
    "commentSummary": [
      "דליפת מסד נתונים של DeepSeek חשפה מידע רגיש, כגון היסטוריית צ'אט, אך היא נחשפה באחריות ותוקנה במהירות.",
      "הדיון מדגיש את השימוש הנרחב באנגלית בקידוד ברחבי העולם, המיוחס לשליטתה בשפות תכנות וכלים.",
      "הדליפה גם עוררה שיחות על השפעת DeepSeek על מניית NVIDIA ועל חששות גיאופוליטיים רחבים יותר, במיוחד בנוגע להשפעתה הטכנולוגית של סין."
    ],
    "points": 642,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1738185936
  },
  {
    "id": 42874301,
    "title": "מטוס סילון מסחרי מתנגש עם מסוק בלאק הוק ליד שדה התעופה רייגן",
    "originLink": "https://www.mediaite.com/news/breaking-commercial-jet-collides-with-police-chopper-near-reagan-airport/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42874301",
    "commentBody": "",
    "originSummary": [
      "התנגשות באוויר התרחשה בין מטוס נוסעים למסוק בלק הוק של צבא ארה\"ב ליד שדה התעופה רייגן, וירג'יניה, וגרמה לשיבושים בטיסות.",
      "המטוס הנוסעים, מטוס בומברדייה CRJ700 של חברת PSA Airlines, נשא 60 נוסעים וארבעה אנשי צוות, בעוד שהמסוק נשא שלושה חיילים.",
      "נמצאו לפחות 18 גופות, ומבצע חיפוש והצלה משמעותי מתנהל בנהר הפוטומק."
    ],
    "commentSummary": [
      "מטוס סילון מסחרי ומסוק בלק הוק התנגשו ליד נמל התעופה רייגן, מה שמעורר דאגות משמעותיות לגבי בטיחות התעבורה האווירית.",
      "על אף ההוראות למסוק לשמור על הפרדה חזותית, התרחשה ההתנגשות, מה שהוביל לדיונים על נהלי בקרת התעבורה האווירית.",
      "התקרית הגבירה את הקריאות לשינויים במדיניות לשיפור הבטיחות ולמניעת תאונות עתידיות במרחב האווירי של ארה\"ב."
    ],
    "points": 563,
    "commentCount": 510,
    "retryCount": 0,
    "time": 1738205805
  },
  {
    "id": 42877860,
    "title": "מיסטרל קטן 3",
    "originLink": "https://mistral.ai/news/mistral-small-3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42877860",
    "commentBody": "",
    "originSummary": [
      "מיסטרל AI שחררה את Mistral Small 3, מודל עם 24 מיליארד פרמטרים המותאם לשיהוי נמוך, תחת רישיון Apache 2.0, ומציעה חלופה בקוד פתוח למודלים קנייניים גדולים יותר.",
      "המודל מצטיין במשימות בינה מלאכותית גנרטיבית, ומשיג דיוק של מעל 81% ב-MMLU עם השהיה של 150 טוקנים לשנייה, ומתאים לפריסה מקומית על מכשירים כמו RTX 4090 או מקבוק עם 32GB זיכרון RAM.",
      "מיסטרל סמול 3 זמין בפלטפורמות כמו Hugging Face, Ollama, ו-Kaggle, והוא מיועד לסיוע בשיחות עם תגובה מהירה ולכיוונון עדין למומחיות בתחום ספציפי."
    ],
    "commentSummary": [
      "מיסטרל סמול 3 הוא מודל בינה מלאכותית חדש המותאם לביצועים יעילים על מחשבים ניידים, ומתחרה במודלים כמו Llama 3.3 70B, וניתן להפעילו מקומית על מכשירים כמו ה-M2 MacBook Pro.",
      "המודל הוא קוד פתוח תחת רישיון Apache 2.0, עם תמחור API תחרותי, מה שהופך אותו לנגיש ליישומים שונים, כולל פיננסים ובריאות.",
      "דיונים מדגישים את הביצועים החזקים שלו בתפוקה מובנית וביישומים מקומיים, כמו גם את החשיבות של משקלים בקוד פתוח ולמידה מפרויקטים בקוד פתוח."
    ],
    "points": 411,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1738246617
  },
  {
    "id": 42877709,
    "title": "Antiqua et Nova: הערה על הקשר בין בינה מלאכותית לאינטליגנציה אנושית",
    "originLink": "https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_ddf_doc_20250128_antiqua-et-nova_en.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42877709",
    "commentBody": "",
    "originSummary": [
      "המסמך בוחן את הבינה המלאכותית והאינטליגנציה האנושית מנקודת מבט נוצרית, תוך התמקדות באתגרים אתיים ואנתרופולוגיים שהבינה המלאכותית מציבה. הוא מדגיש את אמונת הכנסייה באינטליגנציה כמתנה אלוהית, חיונית לכבוד האדם, ואת הצורך בשימוש אחראי בבינה מלאכותית לטובת החברה. הטקסט קורא להנחיות אתיות שיבטיחו שהבינה המלאכותית תכבד את כבוד האדם, תוך התייחסות לחששות כמו פרטיות, מידע שגוי והשפעותיה על עבודה ויחסים."
    ],
    "commentSummary": [
      "מסמך הוותיקן \"Antiqua et Nova\" בוחן את האינטראקציה בין בינה מלאכותית (AI) לבינה אנושית, תוך הדגשת השימוש האחראי בבינה אנושית כמתנה אלוהית.",
      "בעוד שהמסמך מכיר ביתרונות הבינה המלאכותית, הוא מזהיר מפני אתגרים אתיים, כמו היכולת של הבינה המלאכותית לחקות יצירתיות אנושית ולקבל החלטות אוטונומיות, ומדגיש את הצורך בפיתוח בינה מלאכותית שיכבד את כבוד האדם וישרת את טובת הכלל.",
      "הכנסייה מזהירה מפני הפיכת הבינה המלאכותית לתחליף לאלוהים, ומדגישה את הצורך בשיקול דעת זהיר ובשימוש אתי כדי למנוע הפיכת הטכנולוגיה לאלוהית ולשמור על התמקדות בערכים אנושיים."
    ],
    "points": 290,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1738245687
  },
  {
    "id": 42872276,
    "title": "עצה לחבר שרוצה להתחיל בלוג",
    "originLink": "https://www.henrikkarlsson.xyz/p/start-a-blog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42872276",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "בלוגרים שאפתנים מומלצים להחזיק בתוכן שלהם במקום להסתמך על פלטפורמות כמו Medium או Substack, כדי להבטיח שליטה ועצמאות.",
      "כתיבה עקבית ובחירת נישה ספציפית מומלצות להשגת תוצאות טובות יותר ולמשיכת קהל נאמן.",
      "האסטרטגיה POSSE (פרסם באתר שלך, סנדר במקום אחר) מומלצת לקידום עבודה, תוך הדגשת החשיבות של כתיבה לשביעות רצון אישית על פני מעורבות מיידית."
    ],
    "points": 290,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1738190714
  },
  {
    "id": 42873697,
    "title": "משתמשי קנאביס צעירים מראים ירידה בתפקוד המוח, כך עולה מהמחקר הגדול ביותר עד כה",
    "originLink": "https://newatlas.com/brain/young-adult-cannabis-brain-function/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42873697",
    "commentBody": "",
    "originSummary": [
      "מחקר של קמפוס הרפואה של אוניברסיטת קולורדו אנסצ'וץ' מצביע על כך ששימוש בקנאביס יכול לפגוע בתפקוד המוח אצל מבוגרים צעירים, במיוחד בזיכרון העבודה. המחקר, שכלל 1,003 משתתפים וסריקות MRI, מצא כי משתמשים כבדים וחדשים בקנאביס הציגו פעילות מוחית מופחתת במהלך משימות זיכרון, מה שמשפיע על אזורים הקשורים לרגש, קוגניציה והתנהגות חברתית. המחקר, שפורסם ב-JAMA Network Open, מציע כי הימנעות מקנאביס לפני משימות קוגניטיביות עשויה לשפר את הביצועים, אך משתמשים כבדים עשויים להתמודד עם תסמיני גמילה, מה שמדגיש את הצורך במחקר נוסף על השפעות הקנאביס לטווח הארוך על המוח."
    ],
    "commentSummary": [
      "מחקר משמעותי מציע כי משתמשים צעירים בקנאביס עשויים לחוות ירידה בתפקוד המוח, במיוחד בזיכרון העבודה.",
      "המחקר אינו יכול לקבוע סיבתיות באופן מוחלט, שכן הוא מכיר בקיומם של קשרים אפשריים עם גורמים כמו טיפול עצמי בחרדה או ADHD.",
      "הדיון המתמשך שואל האם קנאביס גורם ישירות להפחתת תפקוד קוגניטיבי או אם הוא קשור לבחירות אורח חיים אחרות."
    ],
    "points": 271,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1738200234
  },
  {
    "id": 42871743,
    "title": "משפת C++ לשפת Clojure: שפת Jank מבטיחה את הטוב משתי השפות",
    "originLink": "https://thenewstack.io/from-c-to-clojure-new-language-promises-best-of-both/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42871743",
    "commentBody": "",
    "originSummary": [
      "ג'יי ווילקרסון, מהנדס לשעבר ב-Electronic Arts (EA), יוצר את \"jank\", שפת תכנות חדשה המשלבת את התכונות האינטראקטיביות של Clojure עם הידור מקומי, תוך ניצול LLVM (מכונה וירטואלית ברמת נמוכה).",
      "Jank משלב היבטים של C++, Clojure, ו-Rust, במטרה לשפר את הביצועים והשימושיות, ומיועד ליישומים במשחקים, פיתוח ממשקי משתמש גרפיים (GUI), ומדעי הנתונים.",
      "השפה משכה עניין בקהילה, עם מפת דרכים לפיתוח הכוללת שיפור בדיווח על שגיאות, תאימות עם C++, והפצה על לינוקס, עם יישומים פוטנציאליים במנועי משחקים ושירותי רשת."
    ],
    "commentSummary": [
      "Jank היא שפת תכנות חדשה שנועדה למזג את החוזקות של C++ ו-Clojure, תוך הדגשת אינטראופרביליות חלקה עם C++ ופיתוח אינטראקטיבי. היא משתמשת בקומפילציה בזמן אמת (JIT) עם LLVM (מכונה וירטואלית ברמת נמוכה) כדי לייצר בינאריים מקוריים, מה שמשפר את הביצועים ואת האינטגרציה עם C++. השפה עדיין בפיתוח, עם תוכניות עתידיות לתמוך בפלטפורמות מרובות ולשפר את ניהול הזיכרון, מה שמעורר עניין בפוטנציאל שלה בפיתוח משחקים וביישומי GUI מקוריים."
    ],
    "points": 229,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1738187771
  },
  {
    "id": 42870990,
    "title": "יצירת הווידאו שהפך את גורילאז",
    "originLink": "https://animationobsessive.substack.com/p/making-the-video-that-made-gorillaz",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42870990",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "גורילאז, להקה וירטואלית, זכתה לפופולריות בזכות השילוב החדשני של מוזיקה ואנימציה, במיוחד עם הווידאו \"Clint Eastwood\". מעריצים זוכרים בחיבה את הפרויקטים היצירתיים של הלהקה, כמו אתר האינטראקטיבי Flash Kong Studios והאמנות הייחודית של ג'יימי היולט. הלהקה, בהובלת דיימון אלברן, ממשיכה להיות משפיעה בתעשיית המוזיקה, ושומרת על קסם נצחי למרות השינויים שעברה לאורך השנים."
    ],
    "points": 206,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1738183853
  },
  {
    "id": 42874885,
    "title": "מעגלים מודפסים (PCBs), שכבות נחושת, מישורי קרקע, ואתה",
    "originLink": "https://lcamtuf.substack.com/p/pcbs-ground-planes-and-you",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42874885",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המאמר חוקר את ההתפתחות של עיצוב לוחות מעגלים מודפסים (PCB), תוך התמקדות מיוחדת ביציקות נחושת ומישורי קרקע, שהפכו ליעילים יותר עם טכניקות ייצור מודרניות.",
      "כעת משתמשים ביציקות נחושת כדי לשפר את מהירות הייצור, העקביות ולהפחית חריטה צדדית, בעוד שמישורי קרקע חיוניים לתאימות אלקטרומגנטית (EMC), ביצועים חשמליים ותכנון לייצור (DFM).",
      "המאמר מדגיש את החשיבות של כתיבה טכנית מדויקת ומבקר את ערבוב המושגים בדיונים על תכנון מעגלים מודפסים (PCB)."
    ],
    "points": 193,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1738211605
  },
  {
    "id": 42870171,
    "title": "Airflow – הזרם קבצי מדיה ישירות מ-macOS למכשירי AirPlay",
    "originLink": "https://airflow.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42870171",
    "commentBody": "",
    "originSummary": [
      "Airflow היא אפליקציית הזרמת וידאו התואמת ל-Chromecast, Apple TV, ולטלוויזיות עם AirPlay 2, ומציעה הזרמת HEVC, אודיו אדפטיבי, וזיהוי תווים אופטי (OCR) בזמן אמת עבור כתוביות.",
      "זה תומך ב-4K HDR (טווח דינמי גבוה) ובפורמטי אודיו שונים, ומספק השמעה באיכות גבוהה עם שימוש מינימלי במעבד.",
      "Airflow זמין לרכישה חד-פעמית במחיר של $19.99 וכולל אפליקציית שלט רחוק חינמית לאנדרואיד ולאייפון, תואם ל-macOS 10.12+, Windows 10+ 64-ביט, ו-Windows 10+ 32-ביט."
    ],
    "commentSummary": [
      "Airflow היא אפליקציית הזרמת מדיה המאפשרת למשתמשים להזרים תוכן מ-macOS למכשירי AirPlay ו-Chromecast, ידועה במהירותה ובאמינותה.",
      "משתמשים מעריכים את Airflow בזכות יכולות השפשוף של הווידאו, הטיפול בקבצים גדולים, התמיכה בכתוביות וההתאמה גם ל-macOS וגם ל-Windows.",
      "על אף כמה חששות לגבי מצב הפיתוח וביקורות על ממשק המשתמש, עדכונים אחרונים מצביעים על פיתוח פעיל, ורבים מהמשתמשים מוצאים אותו כרכישה בעלת ערך בהשוואה לחלופות כמו Beamer ו-AirParrot."
    ],
    "points": 188,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1738180071
  },
  {
    "id": 42873312,
    "title": "Mathesar – ממשק אינטואיטיבי דמוי גיליון אלקטרוני לנתוני Postgres",
    "originLink": "https://github.com/mathesar-foundation/mathesar",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42873312",
    "commentBody": "",
    "originSummary": [
      "Mathesar היא יישום אינטרנט המספק ממשק דמוי גיליון אלקטרוני עבור מסדי נתונים של PostgreSQL, ומאפשר למשתמשים לנהל נתונים ללא צורך בקידוד.",
      "זהו קוד פתוח, מתארח בעצמו, ומשתלב ישירות עם PostgreSQL, ומבטיח אבטחת נתונים באמצעות בקרת גישה מקורית.",
      "מתסר נמצא כרגע בבטא ציבורית, מעודד תרומות מהקהילה ומתוחזק על ידי עמותת מתסר."
    ],
    "commentSummary": [
      "Mathesar מספקת ממשק דמוי גיליון אלקטרוני עבור Postgres, המיועד להיות ידידותי למשתמשים שאינם טכניים, ומאפשר עריכת נתונים, שאילתות וניהול קשרים ישירות בתוך Postgres.",
      "זהו כלי מבוסס רשת, קוד פתוח ומארח עצמי, השונה מאחרים כמו DBeaver או Metabase, עם דגש על קלות שימוש ואינטגרציה עמוקה עם Postgres.",
      "נכון לעכשיו, ל-Mathesar חסרה התאמה אישית של ממשק המשתמש ועורך SQL, אך יש תוכניות לשלב תכונות אלו; היא מורשית תחת GPLv3 וממומנת באמצעות תרומות, תוך חקירת אפשרויות הכנסה ברות קיימא."
    ],
    "points": 182,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1738197113
  },
  {
    "id": 42876998,
    "title": "400 מיליון הורדות ל-LibreOffice, והמספר ממשיך לעלות",
    "originLink": "https://blog.documentfoundation.org/blog/2025/01/30/400-million-downloads-and-counting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42876998",
    "commentBody": "",
    "originSummary": [
      "LibreOffice הגיעה להישג משמעותי, עם יותר מ-400 מיליון הורדות נכון ל-30 בינואר 2025, מה שמדגיש את הפופולריות והיעילות המתמשכת שלה.",
      "לאחר צמיחה מהירה ראשונית בין השנים 2011 ל-2014, העניין ב-LibreOffice התחדש לאחר תקופת קיפאון, כאשר משתמשים העריכו את הערך של חבילות משרד שולחניות לצד פתרונות מבוססי ענן.",
      "על אף שעמדה בפני התקפות על מונה ההורדות שלה בשנת 2019, המשיכה LibreOffice לצמוח, והגיעה ליותר מ-35 מיליון הורדות בשנה עד 2024, מה שמדגים את עמידותה ורלוונטיותה המתמשכת."
    ],
    "commentSummary": [
      "LibreOffice השיגה אבן דרך משמעותית עם 400 מיליון הורדות, מה שמדגיש את השימוש הנרחב בה למרות התחרות מצד חבילות משרדיות אחרות כמו OnlyOffice.",
      "משתמשים מביעים העדפות מגוונות, כאשר חלקם מעדיפים את OnlyOffice בשל התאימות שלו עם Microsoft Office והממשק המודרני, בעוד אחרים מעריכים את LibreOffice בזכות היותו קוד פתוח והיכולת שלו להתמודד עם קבצים גדולים.",
      "דיון זה מדגיש את שילוב LibreOffice בהפצות לינוקס, את השימושיות שלו בהקשרים אישיים ומקצועיים, ואת הפיתוח המתמשך שלו, לצד האתגרים במעבר מפתרונות מבוססי ענן לתוכנה מקומית."
    ],
    "points": 178,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1738238354
  },
  {
    "id": 42871143,
    "title": "ניתוח קבצי PDF (ועוד) באליקסיר באמצעות ראסט",
    "originLink": "https://www.chriis.dev/opinion/parsing-pdfs-in-elixir-using-rust",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42871143",
    "commentBody": "",
    "originSummary": [
      "ניתוח קבצי PDF באליקסיר הוא מאתגר בשל היעדר פתרונות פשוטים, אך שילוב של ראסט באמצעות NIFs (פונקציות מיושמות באופן מקומי) מציע חלופה חזקה.",
      "השילוב של המהירות והיעילות של Rust עם היכולות של Elixir מאפשר יצירת אפליקציית LiveView ב-Elixir להעלאת קבצי PDF, תוך שימוש בספריית Extractous ב-Rust ו-Rustler לשילוב.",
      "גישה זו מדגישה את החוזקות של שתי השפות, ומספקת פתרון חסכוני ויעיל לניתוח PDF, עם יישום מלא הזמין ב-GitHub."
    ],
    "commentSummary": [
      "ניתוח קבצי PDF באליקסיר באמצעות ראסט מספק פתרון יציב על ידי ניצול האמינות של ראסט כדי למנוע קריסות במכונה הווירטואלית BEAM (המכונה הווירטואלית של ארלנג של בוגדן/ביורן).",
      "האתגר העיקרי הוא חילוץ נתונים מורכבים, כמו טבלאות, מקבצי PDF, מה שדורש יותר מאשר חילוץ טקסט פשוט.",
      "כלים כמו Unstructured ו-Marker ב-Rust נבדקים כדי לשפר את מהירות ההסקה של המודל ולשלב יכולות ראייה, עם עניין ב-API מבוסס Docker לפיתוח מקומי."
    ],
    "points": 168,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1738184728
  }
]
