[
  {
    "id": 42876840,
    "title": "JavaScript Temporal geliyor",
    "originLink": "https://developer.mozilla.org/en-US/blog/javascript-temporal-is-coming/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42876840",
    "commentBody": "",
    "originSummary": [
      "JavaScript Temporal, web geliştiricileri için tarih ve saat işlemlerini iyileştirmeyi amaçlayan ve eski Date nesnesinin sınırlamalarını ele alan deneysel tarayıcı sürümlerinde yeni bir özelliktir.",
      "Temporal, çeşitli takvimler ve saat dilimlerini destekleyen 200'den fazla yardımcı yöntemle, tarihlerin, zamanların, sürelerin ve takvimlerin hassas yönetimini sağlar.",
      "Tam çapraz tarayıcı desteği hala devam ederken, Firefox en gelişmiş uygulama ile önde gidiyor ve geliştiriciler @js-temporal/polyfill kullanarak Temporal ile deney yapabilirler."
    ],
    "commentSummary": [
      "JavaScript Temporal, Rust'taki chrono ve Java'daki Joda Time gibi gelişmiş zaman kütüphanelerinden ilham alarak, eski Date() API'sinin sınırlamalarını aşmak için tasarlanmış yeni bir API'dir.",
      "Zamanı saf zaman, an ve zaman dilimli zaman olarak ayırarak daha karmaşık ama gerekli bir yapı sunar, bu da Yaz Saati Uygulaması (DST) hataları ve serileştirme tutarsızlıkları gibi sorunları etkili bir şekilde ele alır.",
      "Temporal'in, IANA Zaman Dilimi Veritabanını kullanarak JavaScript'te tarih ve saat yönetimi için standartlaştırılmış, yerleşik bir çözüm sunarak Moment.js, Luxon ve date-fns gibi popüler kütüphanelerin yerini alması bekleniyor."
    ],
    "points": 724,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1738236511
  },
  {
    "id": 42871371,
    "title": "DeepSeek veritabanı, sohbet geçmişi de dahil olmak üzere hassas bilgileri sızdırıyor",
    "originLink": "https://www.wiz.io/blog/wiz-research-uncovers-exposed-deepseek-database-leak",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42871371",
    "commentBody": "",
    "originSummary": [
      "Wiz Research, Çinli bir yapay zeka girişimi olan DeepSeek'in herkese açık bir ClickHouse veritabanında, sohbet geçmişi ve gizli anahtarlar da dahil olmak üzere milyonlarca satır hassas veriyi açığa çıkaran bir güvenlik açığı tespit etti. Veritabanı açık ve kimlik doğrulaması yapılmamıştı, bu da önemli güvenlik riskleri oluşturuyordu, ancak Wiz Research'ün sorumlu açıklamasının ardından hızla güvence altına alındı. Bu olay, yapay zeka teknolojilerinin hızla benimsenmesinde güvenlik zorluklarını vurgulamakta ve yapay zekanın iş operasyonlarına giderek daha fazla entegre olmasıyla birlikte hassas verileri korumak için sağlam güvenlik önlemlerine duyulan kritik ihtiyacı öne çıkarmaktadır."
    ],
    "commentSummary": [
      "Bir DeepSeek veritabanı sızıntısı, sohbet geçmişi gibi hassas bilgileri ortaya çıkardı, ancak sorumlu bir şekilde ifşa edildi ve derhal yamalandı.",
      "Bu tartışma, İngilizcenin küresel ölçekte kodlamada yaygın kullanımını, programlama dilleri ve araçlarındaki hakimiyetine bağlayarak vurgulamaktadır.",
      "Bu sızıntı, DeepSeek'in NVIDIA'nın hisseleri üzerindeki etkisi ve daha geniş jeopolitik endişeler, özellikle de Çin'in teknolojik etkisi hakkında tartışmalara da yol açtı."
    ],
    "points": 642,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1738185936
  },
  {
    "id": 42874301,
    "title": "Reagan havaalanı yakınlarında ticari jet, Black Hawk helikopteriyle çarpıştı",
    "originLink": "https://www.mediaite.com/news/breaking-commercial-jet-collides-with-police-chopper-near-reagan-airport/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42874301",
    "commentBody": "",
    "originSummary": [
      "Reagan Havalimanı, Virginia yakınlarında bir yolcu uçağı ile bir ABD Ordusu Black Hawk helikopteri arasında havada çarpışma meydana geldi ve bu durum uçuş aksaklıklarına neden oldu.",
      "Yolcu uçağı, bir PSA Airlines Bombardier CRJ700, 60 yolcu ve dört mürettebat üyesi taşırken, helikopter üç asker taşıyordu.",
      "En az 18 ceset bulundu ve Potomac Nehri'nde önemli bir arama kurtarma operasyonu devam ediyor."
    ],
    "commentSummary": [
      "Reagan Havalimanı yakınlarında bir ticari jet ve bir Black Hawk helikopteri çarpıştı, hava trafiği güvenliği konusunda önemli endişeler yarattı.",
      "Helikoptere görsel ayrımı koruma talimatı verilmesine rağmen çarpışma meydana geldi ve bu durum hava trafik kontrol prosedürleri hakkında tartışmalara yol açtı.",
      "Bu olay, ABD hava sahasında güvenliği artırmak ve gelecekteki kazaları önlemek için politika değişiklikleri yapılması yönündeki çağrıları yoğunlaştırdı."
    ],
    "points": 563,
    "commentCount": 510,
    "retryCount": 0,
    "time": 1738205805
  },
  {
    "id": 42877860,
    "title": "Mistral Küçük 3",
    "originLink": "https://mistral.ai/news/mistral-small-3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42877860",
    "commentBody": "",
    "originSummary": [
      "Mistral AI, 24 milyar parametreli, düşük gecikme süresi için optimize edilmiş Mistral Small 3 modelini Apache 2.0 lisansı altında piyasaya sürdü ve bu, daha büyük tescilli modellere açık kaynaklı bir alternatif sunuyor.",
      "Model, 150 token/s gecikme süresiyle MMLU'de %81'in üzerinde doğruluk elde ederek üretken yapay zeka görevlerinde üstün başarı gösteriyor ve RTX 4090 veya 32GB RAM'e sahip bir Macbook gibi cihazlarda yerel dağıtım için uygun.",
      "Mistral Small 3, Hugging Face, Ollama ve Kaggle gibi platformlarda mevcuttur ve hızlı yanıt veren konuşma yardımı ve alanına özgü uzmanlık için ince ayar yapmak üzere tasarlanmıştır."
    ],
    "commentSummary": [
      "Mistral Small 3, Llama 3.3 70B gibi modellerle rekabet eden ve M2 MacBook Pro gibi cihazlarda yerel olarak çalıştırılabilen, dizüstü bilgisayarlarda verimli performans için optimize edilmiş yeni bir yapay zeka modelidir.",
      "Model, Apache 2.0 lisansı altında açık kaynaklıdır ve rekabetçi API fiyatlandırması ile finans ve sağlık gibi çeşitli uygulamalar için erişilebilir hale gelmektedir.",
      "Yapılan tartışmalar, yapılandırılmış çıktı ve yerel uygulamalardaki güçlü performansının yanı sıra, açık kaynak ağırlıklarının önemini ve açık kaynak projelerinden öğrenmenin önemini vurgulamaktadır."
    ],
    "points": 411,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1738246617
  },
  {
    "id": 42877709,
    "title": "Antiqua et Nova: Yapay Zeka ve İnsan Zekası Arasındaki İlişki Üzerine Not",
    "originLink": "https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_ddf_doc_20250128_antiqua-et-nova_en.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42877709",
    "commentBody": "",
    "originSummary": [
      "Belge, Hristiyan bakış açısıyla yapay zeka ve insan zekasını inceleyerek, yapay zekanın ortaya çıkardığı etik ve antropolojik zorluklara odaklanıyor. Kilisenin zekayı, insan onuru için hayati olan ilahi bir armağan olarak gördüğünü vurguluyor ve toplumun yararına olacak şekilde sorumlu yapay zeka kullanımına ihtiyaç duyulduğunu belirtiyor. Metin, yapay zekanın insan onuruna saygı göstermesini sağlamak için etik yönergeler çağrısında bulunarak, gizlilik, yanlış bilgi ve iş gücü ile ilişkiler üzerindeki etkileri gibi endişeleri ele alıyor."
    ],
    "commentSummary": [
      "Vatikan'ın \"Antiqua et Nova\" belgesi, yapay zeka (YZ) ile insan zekası arasındaki etkileşimi inceleyerek, insan zekasının ilahi bir armağan olarak sorumlu kullanımını vurgulamaktadır.",
      "Belge, yapay zekanın faydalarını kabul ederken, yapay zekanın insan yaratıcılığını taklit etme ve otonom kararlar alma potansiyeli gibi etik zorluklara dikkat çekiyor ve yapay zeka gelişiminin insan onuruna saygı göstermesi ve ortak iyiliğe hizmet etmesi gerektiğini vurguluyor.",
      "Kilise, yapay zekanın Tanrı'nın yerine geçmemesi konusunda uyarıda bulunarak, teknolojiyi tanrılaştırmaktan kaçınmak ve insan değerlerine odaklanmayı sürdürmek için dikkatli bir değerlendirme ve etik kullanım çağrısında bulunuyor."
    ],
    "points": 290,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1738245687
  },
  {
    "id": 42872276,
    "title": "Bir blog başlatmak isteyen bir arkadaş için tavsiyeler",
    "originLink": "https://www.henrikkarlsson.xyz/p/start-a-blog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42872276",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Aday blog yazarlarına, kontrol ve bağımsızlık sağlamak için Medium veya Substack gibi platformlara güvenmek yerine içeriklerini kendilerinin sahiplenmeleri tavsiye edilir.",
      "İyi sonuçlar elde etmek ve sadık bir kitle çekmek için tutarlı yazı yazmak ve belirli bir niş seçmek önerilir.",
      "POSSE stratejisi (Kendi Sitenizde Yayınlayın, Başka Yerde Yayınlayın) çalışmaları tanıtmak için önerilirken, anında etkileşimden ziyade kişisel tatmin için yazmanın önemini vurgular."
    ],
    "points": 290,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1738190714
  },
  {
    "id": 42873697,
    "title": "Genç esrar kullanıcılarının beyin fonksiyonlarının azaldığını, şimdiye kadarki en büyük çalışma buldu",
    "originLink": "https://newatlas.com/brain/young-adult-cannabis-brain-function/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42873697",
    "commentBody": "",
    "originSummary": [
      "Colorado Üniversitesi Anschutz Tıp Kampüsü tarafından yapılan bir çalışma, esrar kullanımının genç yetişkinlerde beyin fonksiyonlarını bozabileceğini, özellikle de çalışma belleğini etkilediğini göstermektedir. 1.003 katılımcı ve MRI taramaları içeren araştırma, yoğun ve yakın zamanda esrar kullananların, bellek görevleri sırasında azalmış beyin aktivitesi sergilediğini ve bunun duygu, biliş ve sosyal davranışla ilgili alanları etkilediğini bulmuştur. JAMA Network Open'da yayınlanan çalışma, bilişsel görevler öncesinde esrardan uzak durmanın performansı artırabileceğini öne sürmekte, ancak yoğun kullanıcıların yoksunluk belirtileriyle karşılaşabileceğini belirterek, esrarın uzun vadeli beyin etkileri üzerine daha fazla araştırma yapılması gerektiğini vurgulamaktadır."
    ],
    "commentSummary": [
      "Önemli bir çalışma, genç esrar kullanıcılarının özellikle çalışma belleğinde azalmış beyin fonksiyonu yaşayabileceğini öne sürüyor.",
      "Çalışma, anksiyete veya DEHB için kendi kendine ilaç kullanımı gibi faktörlerle potansiyel korelasyonları kabul ettiğinden, nedenselliği kesin olarak belirleyemez.",
      "Devam eden tartışma, esrarın doğrudan bilişsel işlevin azalmasına neden olup olmadığını veya diğer yaşam tarzı seçimleriyle ilişkili olup olmadığını sorguluyor."
    ],
    "points": 271,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1738200234
  },
  {
    "id": 42871743,
    "title": "Metin: C++'tan Clojure'a: Jank dili her ikisinin de en iyisini vaat ediyor",
    "originLink": "https://thenewstack.io/from-c-to-clojure-new-language-promises-best-of-both/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42871743",
    "commentBody": "",
    "originSummary": [
      "Jeaye Wilkerson, Electronic Arts (EA) şirketinde eski bir mühendis, Clojure'un etkileşimli özelliklerini yerel derleme ile birleştiren ve LLVM'yi (Düşük Seviyeli Sanal Makine) kullanan yeni bir programlama dili olan \"jank\"i oluşturuyor.",
      "Jank, C++, Clojure ve Rust'ın unsurlarını birleştirerek performans ve kullanılabilirliği artırmayı hedefler ve oyun, grafiksel kullanıcı arayüzü (GUI) geliştirme ve veri bilimi uygulamaları için tasarlanmıştır.",
      "Dil, geliştirilmiş hata raporlama, C++ ile birlikte çalışabilirlik ve Linux üzerinde dağıtım gibi bir geliştirme yol haritası ile topluluk ilgisini çekmiştir; oyun motorları ve web hizmetlerinde potansiyel uygulamalara sahiptir."
    ],
    "commentSummary": [
      "Jank, C++ ve Clojure'un güçlü yönlerini birleştirmek için tasarlanmış yeni bir programlama dilidir ve C++ ile sorunsuz birlikte çalışabilirlik ve etkileşimli geliştirmeyi vurgular. Performansı ve C++ entegrasyonunu artırarak yerel ikili dosyalar üretmek için LLVM (Düşük Düzeyli Sanal Makine) ile Anında Derleme (JIT) kullanır. Dil hala geliştirilme aşamasındadır ve gelecekte birden fazla platformu destekleme ve bellek yönetimini iyileştirme planları bulunmaktadır, bu da oyun geliştirme ve yerel GUI uygulamaları için potansiyeli konusunda ilgi uyandırmaktadır."
    ],
    "points": 229,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1738187771
  },
  {
    "id": 42870990,
    "title": "Video'yu yapan Gorillaz'ı yapmak",
    "originLink": "https://animationobsessive.substack.com/p/making-the-video-that-made-gorillaz",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42870990",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Gorillaz, sanal bir grup olarak, müzik ve animasyonu yenilikçi bir şekilde birleştirerek, özellikle \"Clint Eastwood\" videosuyla popülerlik kazandı. Hayranlar, etkileşimli Flash Kong Studios sitesi ve Jamie Hewlett'in kendine özgü sanat eserleri gibi grubun yaratıcı projelerini sevgiyle hatırlıyor. Damon Albarn liderliğindeki grup, yıllar içinde evrim geçirmesine rağmen, müzik endüstrisinde etkili olmaya devam ediyor ve zamansız bir çekiciliği koruyor."
    ],
    "points": 206,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1738183853
  },
  {
    "id": 42874885,
    "title": "METİN: PCB'ler, bakır dökümler, topraklama düzlemleri ve siz",
    "originLink": "https://lcamtuf.substack.com/p/pcbs-ground-planes-and-you",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42874885",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Makale, özellikle modern üretim teknikleriyle daha verimli hale gelen bakır dökümler ve topraklama düzlemlerine odaklanarak, Baskılı Devre Kartı (PCB) tasarımının evrimini inceliyor.",
      "Bakır dökümler artık üretim hızını ve tutarlılığını artırmak, yan aşındırmayı azaltmak için kullanılırken, topraklama düzlemleri Elektromanyetik Uyumluluk (EMC), elektriksel performans ve Üretilebilirlik için Tasarım (DFM) açısından önemlidir.",
      "Makale, kesin teknik yazımın önemini vurgulamakta ve PCB tasarım tartışmalarında kavramların karıştırılmasını eleştirmektedir."
    ],
    "points": 193,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1738211605
  },
  {
    "id": 42870171,
    "title": "Airflow – Medya dosyalarını doğrudan macOS'tan AirPlay cihazlarına aktarın",
    "originLink": "https://airflow.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42870171",
    "commentBody": "",
    "originSummary": [
      "Airflow, Chromecast, Apple TV ve AirPlay 2 TV'lerle uyumlu bir video akış uygulamasıdır ve HEVC akışı, uyarlanabilir ses ve gerçek zamanlı altyazı OCR (Optik Karakter Tanıma) özelliklerine sahiptir.",
      "4K HDR (Yüksek Dinamik Aralık) ve çeşitli ses formatlarını destekler, minimum CPU kullanımı ile yüksek kaliteli oynatma sağlar.",
      "Airflow, 19,99 $'lık tek seferlik bir satın alma ile sunulmaktadır ve macOS 10.12+, 64-bit Windows 10+ ve 32-bit Windows 10+ ile uyumlu Android ve iPhone için ücretsiz bir uzaktan kumanda uygulaması içerir."
    ],
    "commentSummary": [
      "Airflow, kullanıcıların macOS'tan AirPlay ve Chromecast cihazlarına içerik akışı yapmasına olanak tanıyan, hızı ve güvenilirliği ile bilinen bir medya akış uygulamasıdır.",
      "Kullanıcılar, Airflow'un video tarama yeteneklerini, büyük dosyaları işleme kapasitesini, altyazı desteğini ve hem macOS hem de Windows ile uyumluluğunu takdir ediyor.",
      "Yazılımın geliştirme durumu ve kullanıcı arayüzü eleştirileri hakkında bazı endişeler olmasına rağmen, son güncellemeler aktif bir geliştirme sürecine işaret ediyor ve birçok kullanıcı, Beamer ve AirParrot gibi alternatiflerle karşılaştırıldığında bunun değerli bir satın alma olduğunu düşünüyor."
    ],
    "points": 188,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1738180071
  },
  {
    "id": 42873312,
    "title": "Mathesar – Postgres verilerine yönelik sezgisel bir elektronik tablo benzeri arayüz",
    "originLink": "https://github.com/mathesar-foundation/mathesar",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42873312",
    "commentBody": "",
    "originSummary": [
      "Mathesar, kullanıcıların kod yazmaya gerek kalmadan verileri yönetmelerini sağlayan, PostgreSQL veritabanları için bir elektronik tablo benzeri arayüz sunan bir web uygulamasıdır.",
      "Açık kaynaklı, kendi kendine barındırılan ve PostgreSQL ile doğrudan entegre olan bu sistem, yerel erişim kontrolü aracılığıyla veri güvenliğini sağlar.",
      "Mathesar şu anda kamuya açık beta sürümündedir, topluluk katkılarını teşvik etmektedir ve kâr amacı gütmeyen Mathesar Vakfı tarafından sürdürülmektedir."
    ],
    "commentSummary": [
      "Mathesar, Postgres için elektronik tablo benzeri bir arayüz sunar ve teknik bilgisi olmayan kullanıcılar için kullanıcı dostu olacak şekilde tasarlanmıştır. Bu sayede, Postgres içinde doğrudan veri düzenleme, sorgulama ve ilişki yönetimi yapılmasına olanak tanır.",
      "Bu, DBeaver veya Metabase gibi diğerlerinden farklı olarak, kullanım kolaylığı ve Postgres ile derin entegrasyona odaklanan, web tabanlı, açık kaynaklı ve kendi kendine barındırılan bir araçtır.",
      "Şu anda Mathesar, UI özelleştirmesi ve bir SQL düzenleyicisi içermemektedir ancak bu özellikleri eklemeyi planlamaktadır; GPLv3 lisanslıdır ve bağışlar yoluyla finanse edilmektedir, sürdürülebilir gelir seçeneklerini araştırmaktadır."
    ],
    "points": 182,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1738197113
  },
  {
    "id": 42876998,
    "title": "LibreOffice 400M İndirme ve Saymaya Devam Ediyor",
    "originLink": "https://blog.documentfoundation.org/blog/2025/01/30/400-million-downloads-and-counting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42876998",
    "commentBody": "",
    "originSummary": [
      "LibreOffice, 30 Ocak 2025 itibarıyla 400 milyon indirme sayısını aşarak önemli bir dönüm noktasına ulaştı ve bu, onun sürekli popülerliğini ve faydasını vurguluyor.",
      "2011'den 2014'e kadar olan ilk hızlı büyümenin ardından, kullanıcılar bulut tabanlı çözümlerle birlikte masaüstü ofis paketlerinin değerini takdir ettikçe LibreOffice'e olan ilgi duraklama sonrası yeniden canlandı.",
      "2019 yılında indirme sayacına yönelik saldırılarla karşılaşmasına rağmen, LibreOffice büyümeye devam etti ve 2024 yılına kadar yıllık 35 milyondan fazla indirme sayısına ulaşarak dayanıklılığını ve devam eden önemini gösterdi."
    ],
    "commentSummary": [
      "LibreOffice, 400 milyon indirme ile önemli bir dönüm noktasına ulaşarak, OnlyOffice gibi diğer ofis paketlerinden gelen rekabete rağmen yaygın kullanımını vurguluyor.",
      "Kullanıcılar, Microsoft Office ile uyumluluğu ve modern arayüzü nedeniyle OnlyOffice'i tercih edenler ile açık kaynaklı yapısı ve büyük dosyaları işleme yeteneği nedeniyle LibreOffice'i değerli bulanlar arasında farklı tercihler ifade etmektedir.",
      "Metin, LibreOffice'in Linux dağıtımlarına entegrasyonunu, hem kişisel hem de profesyonel bağlamlarda kullanımını ve bulut tabanlı çözümlerden yerel yazılıma geçişteki zorluklarla birlikte devam eden gelişimini vurgulamaktadır."
    ],
    "points": 178,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1738238354
  },
  {
    "id": 42871143,
    "title": "Elixir kullanarak Rust ile PDF'leri (ve daha fazlasını) ayrıştırma",
    "originLink": "https://www.chriis.dev/opinion/parsing-pdfs-in-elixir-using-rust",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42871143",
    "commentBody": "",
    "originSummary": [
      "Elixir'de PDF'leri ayrıştırmak, basit çözümlerin eksikliği nedeniyle zordur, ancak NIF'ler (Yerel Uygulamalı Fonksiyonlar) aracılığıyla Rust'ı entegre etmek sağlam bir alternatif sunar.",
      "Rust'un hızı ve verimliliği ile Elixir'in yeteneklerinin birleşimi, Rust'ta Extractous kütüphanesini ve entegrasyon için Rustler'ı kullanarak PDF yüklemeleri için bir LiveView Elixir uygulaması oluşturulmasına olanak tanır.",
      "Bu yaklaşım, her iki dilin de güçlü yönlerini vurgulayarak, PDF ayrıştırma için uygun maliyetli ve verimli bir çözüm sunar ve tam uygulama GitHub'da mevcuttur."
    ],
    "commentSummary": [
      "Elixir'de PDF'leri ayrıştırmak için Rust kullanmak, Rust'ın güvenilirliğinden yararlanarak BEAM (Bogdan/Björn'ün Erlang Soyut Makinesi) sanal makinesinde çöküşleri önleyerek istikrarlı bir çözüm sunar.",
      "Temel zorluk, basit metin çıkarmanın ötesine geçen, tablolar gibi karmaşık verilerin PDF'lerden çıkarılmasıdır.",
      "Rust'taki Unstructured ve Marker gibi araçlar, model çıkarım hızını artırmak ve görsel yetenekleri entegre etmek için araştırılmakta olup, yerel geliştirme için dockerize edilmiş bir API'ye ilgi duyulmaktadır."
    ],
    "points": 168,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1738184728
  }
]
