[
  {
    "id": 42638626,
    "title": "Minun piti poistaa kurssinvaihtosivustoni tai minut erotettaisiin.",
    "originLink": "https://www.linkedin.com/posts/jdkaim_github-jdkaimhuskyswap-huskyswap-project-activity-7282609173316415488-1jdb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42638626",
    "commentBody": "",
    "originSummary": [
      "JD Kaim, tietojenkäsittelytieteen opiskelija, kehitti HuskySwap-sovelluksen, joka on suunniteltu helpottamaan opiskelijoiden välistä kurssipaikkojen vaihtoa Washingtonin yliopistossa. - Vaikka sovellus oli alun perin tarkoitettu kurssiprojektiksi, Kaim sai yliopistolta \"rikkomusilmoituksen\" yrittäessään integroida sovelluksen viralliseen rekisteröintijärjestelmään. - Tilanne on herättänyt ristiriitaisia reaktioita, ja osa on arvostellut yliopiston toimia, kun taas toiset ovat antaneet tukea ja neuvoja Kaimille, joka pysyy optimistisena tulevien hankkeiden ja työmahdollisuuksien suhteen."
    ],
    "commentSummary": [
      "Kurssinvaihtosivuston luoja joutui sulkemaan sen saatuaan ultimaatumin yliopistoltaan, Washingtonin yliopistolta (UW), joka uhkasi erottamisella. - Vaikka opiskelija noudatti vaatimuksia, yliopisto asetti hänen tililleen eston, joka esti rekisteröitymisen viimeiselle lukukaudelle, ellei hän kehitä vastaavaa ratkaisua yliopistolle ilman korvausta. - Opiskelija kokee tilanteen lannistavaksi ja hakee oikeudenmukaista ratkaisua UW:n johdolta, samalla kun harkitsee oikeudellista neuvontaa."
    ],
    "points": 1112,
    "commentCount": 515,
    "retryCount": 0,
    "time": 1736371632
  },
  {
    "id": 42642089,
    "title": "Luigi Mangionen tili on nimetty uudelleen Stack Overflow'ssa",
    "originLink": "https://substack.evancarroll.com/p/the-erasure-of-luigi-mangione",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42642089",
    "commentBody": "",
    "originSummary": [
      "Evan Carroll tuo esiin Luigi Mangionen identiteetin poistamisen Stack Overflow -sivustolla, jossa hänen tilinsä nimettiin uudelleen \"user4616250\" ilman selkeää perustelua, mikä herättää huolta attribuutiosta Creative Commons -lisenssin alaisuudessa.",
      "Carrollin tutkimus tästä asiasta johti vuoden mittaiseen porttikieltoon Stack Exchange -alustalla, minkä hän kokee kostotoimenpiteenä, toisin kuin muut alustat kuten GitHub ja LinkedIn, jotka eivät ole poistaneet Mangionea.",
      "Tilanne korostaa Stack Exchangen ainutlaatuista kantaa ja vaatii oikeudenmukaista kohtelua Mangionelle, jota ei ole tuomittu mistään rikoksesta."
    ],
    "commentSummary": [
      "Luigi Mangionen Stack Overflow -tili nimettiin uudelleen, mikä johti keskusteluihin moderoinnista ja tekijänoikeuksista alustalla.",
      "Kriitikot väittävät, että hänen nimensä poistaminen saattaa rikkoa Creative Commons Attribution-ShareAlike (CC-BY-SA) -lisenssiä, joka edellyttää asianmukaista attribuointia.",
      "Keskustelu laajenee koskemaan laajempia huolenaiheita yritysten hallinnasta käyttäjien sisällön suhteen sekä moderointikäytäntöjen vaikutuksia yksilön oikeuksiin ja yhteiskunnalliseen oikeudenmukaisuuteen."
    ],
    "points": 853,
    "commentCount": 658,
    "retryCount": 0,
    "time": 1736402558
  },
  {
    "id": 42640180,
    "title": "Sinun ei tarvitse maksaa Microsoft 365 -hintojen korotusta",
    "originLink": "https://www.consumer.org.nz/articles/you-don-t-have-to-pay-the-microsoft-365-price-increase",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42640180",
    "commentBody": "",
    "originSummary": [
      "Microsoft 365 on nostanut tilausmaksujaan noin 40 %, perustellen tätä AI-työkalunsa Copilotin integroinnilla, vaikka täysi pääsy Copilotiin vaatii lisätilauksen. - Asiakkaat voivat välttää hinnankorotuksen valitsemalla piilotetun \"Microsoft 365 Classic\" -suunnitelman, joka säilyttää vanhan hinnoittelun, mutta jota ei mainosteta avoimesti. - Tämä tilanne korostaa \"pimeiden mallien\" käyttöä, joissa käyttöliittymät on suunniteltu manipuloimaan kuluttajien valintoja, mikä herättää eettisiä huolenaiheita läpinäkyvyydestä ja kuluttajien oikeuksista."
    ],
    "commentSummary": [
      "Microsoft 365:n hinnankorotus on saanut käyttäjät etsimään vaihtoehtoja, kuten vanhempia versioita, kuten Office 2010, tai ilmaisia palveluita, kuten Google Docs, koska he ovat huolissaan ohjelmiston kuukausimaksuista, joilla on vähäiset toistuvat kustannukset. - Yritykset tuntevat usein pakkoa pysyä Software as a Service (SaaS) -palveluissa, kuten Microsoft 365:ssä, integraation ja jatkuvuuden vuoksi, huolimatta korkeista kustannuksista, kun taas jotkut harkitsevat itseisännöintiä, mikä voi olla kallista ja riskialtista. - Microsoft tarjoaa kertamaksuvaihtoehdon Office 2024:lle, joka on rajoitettu yhteen PC:hen, mikä houkuttelee niitä, jotka eivät halua sitoutua tilausmalliin."
    ],
    "points": 353,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1736382339
  },
  {
    "id": 42638735,
    "title": "LA:n maastopalot pakottavat tuhansia evakuoitumaan, NASA JPL suljettu",
    "originLink": "https://www.theregister.com/2025/01/08/los_angeles_fires_jpl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42638735",
    "commentBody": "",
    "originSummary": [
      "Maastopalot Los Angelesin piirikunnassa ovat johtaneet 70 000 ihmisen evakuointiin ja sähkökatkoihin, jotka vaikuttavat 400 000 asukkaaseen, yli 1 000 rakennuksen tuhouduttua ja kahden kuolemantapauksen raportoituessa. - Kalifornian kuvernööri Gavin Newsom julisti hätätilan, lähettäen kansalliskaartin ja palomiehiä, mukaan lukien vankeja, ratkaisemaan kriisiä. - NASAn Jet Propulsion Laboratory (JPL) on uhattuna, ja hätätoimenpiteet ovat käynnissä, sekä varasuunnitelmat Marsin lennonjohdon siirtämiseksi tarvittaessa."
    ],
    "commentSummary": [
      "Maastopalot Los Angelesissa ovat johtaneet massiivisiin evakuointeihin ja NASA:n Jet Propulsion Laboratoryn (JPL) sulkemiseen, mikä korostaa tilanteen vakavuutta.",
      "Voimakkaat tuulet vaikeuttavat sammutustöitä, ja on huolta palolaitoksen budjettileikkauksista, jotka saattavat vaikuttaa reagointikykyyn.",
      "Yhteisö tukee aktiivisesti tulipalojen uhreja lahjoitusten ja avun kautta, osoittaen solidaarisuutta katastrofin edessä."
    ],
    "points": 352,
    "commentCount": 539,
    "retryCount": 0,
    "time": 1736372409
  },
  {
    "id": 42645218,
    "title": "Pelattava Tetris-peli PDF-tiedoston sisällä",
    "originLink": "https://th0mas.nl/downloads/pdftris.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42645218",
    "commentBody": "",
    "originSummary": [
      "Modernit työpöytäselainten PDF-moottorit, kuten PDFium ja PDF.js, voivat tukea JavaScriptiä riittävillä syöttö-/tulostusominaisuuksilla luodakseen yksinkertaisia pelejä, kuten Tetris.",
      "Projekti osoittaa PDF-skriptauksen monipuolisuuden käyttämällä annotointikenttiä mustavalkopikseleille ja tekstinsyöttökenttää näppäimistön syötteelle, huolimatta joistakin rajoituksista.",
      "PDF on saatavilla ASCII-muodossa, mikä mahdollistaa sen avaamisen tekstieditorissa tai lähdekoodin tarkastelun GitHubissa."
    ],
    "commentSummary": [
      "Tetris-peli on kehitetty PDF-tiedoston sisälle käyttäen JavaScriptiä, mikä esittelee modernien PDF-moottoreiden, kuten PDFiumin ja PDF.js:n, kykyjä. - Peli hyödyntää annotaatiokenttiä pikselinäyttöön ja tekstinsyöttöä ohjaimiin, mutta se ei toimi tulostettuna tai tietyissä PDF-katseluohjelmissa, kuten Evince. - Tämä projekti osoittaa PDF-skriptauksen joustavuutta, mutta herättää myös turvallisuushuolia koodin suorittamisesta PDF-tiedostoissa; lähdekoodi on saatavilla GitHubissa."
    ],
    "points": 340,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1736429493
  },
  {
    "id": 42639417,
    "title": "Salesforce ei palkkaa enää ohjelmistoinsinöörejä vuonna 2025, sanoo Marc Benioff",
    "originLink": "https://www.salesforceben.com/salesforce-will-hire-no-more-software-engineers-in-2025-says-marc-benioff/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42639417",
    "commentBody": "",
    "originSummary": [
      "Salesforce aikoo lopettaa uusien ohjelmistoinsinöörien palkkaamisen vuonna 2025, ja syynä on 30 %:n tuottavuuden kasvu, joka johtuu tekoälyn edistysaskeleista, kuten toimitusjohtaja Marc Benioff on todennut. - Yhtiö keskittyy AI-tuotteeseensa, Agentforceen, ja lisää myyjien palkkaamista viestimään tekoälyn arvoa asiakkaille. - Vaikka yhtiö on äskettäin irtisanonut työntekijöitä pandemian aikaisen ylirekrytoinnin vuoksi, Benioff odottaa yhtiön kasvavan seuraavien viiden vuoden aikana, ja edessä on tapahtumia kuten Japan Dreamin’ ja Architect Dreamin’."
    ],
    "commentSummary": [
      "Salesforcen toimitusjohtaja Marc Benioff ilmoitti ohjelmistoinsinöörien palkkauskiellosta vuodelle 2025, keskittyen tekoälypohjaiseen tuottavuuteen ja kustannusten hallintaan.",
      "Tämä päätös seuraa aiempaa rekrytointikieltoa ja irtisanomisia vuoden 2023 alussa, jotka johtuivat osakkeenomistajien paineesta, ja sitä pidetään markkinointistrategiana Salesforce:n tekoälytuotteille.",
      "Huolimatta väitteistä, että tekoäly parantaa tuottavuutta 30 %, skeptisyys jatkuu, ja Salesforce aikoo laajentaa myyntitiimiään edistääkseen tekoälytarjontaansa, mikä herättää kysymyksiä tekoälyn roolista ihmisten työpaikkojen korvaajana."
    ],
    "points": 328,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1736376987
  },
  {
    "id": 42639563,
    "title": "Steve Langasek, yksi Ubuntu Linuxin johtavista henkilöistä, on kuollut.",
    "originLink": "https://thenewstack.io/steve-langasek-one-of-ubuntu-linuxs-leading-lights-has-died/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42639563",
    "commentBody": "",
    "originSummary": [
      "Steve Langasek, merkittävä Linux-yhteisön vaikuttaja, erityisesti Debianin ja Ubuntun parissa, menehtyi 1. tammikuuta 2025, 45-vuotiaana. - Langasek tunnettiin merkittävistä panoksistaan järjestelmänhallintaan, ohjelmistokehitykseen ja pakettien ylläpitoon, vaikuttaen projekteihin kuten Linux-PAM, Samba ja OpenLDAP. - Hänen johtajuutensa, mentorointinsa ja omistautumisensa avoimen lähdekoodin periaatteille olivat erittäin arvostettuja, ja merkittävät henkilöt kuten Mark Shuttleworth ja Dustin Kirkland ylistivät hänen teknistä näkemystään ja henkeään."
    ],
    "commentSummary": [
      "Steve Langasek, merkittävä Ubuntu Linuxin ja Debianin kehittäjä, on menehtynyt 45-vuotiaana vaiheessa 4 olevaan paksusuolen syöpään. - Hänen kuolemansa on käynnistänyt keskusteluja varhaisten lääketieteellisten seulontojen kriittisestä tärkeydestä ja niiden saatavuuden vaikeuksista. - Teknologiayhteisö muistaa hänet laajasta tietämyksestään ja tukevasta luonteestaan."
    ],
    "points": 269,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1736377988
  },
  {
    "id": 42644168,
    "title": "Factorio Blueprint Visualizer",
    "originLink": "https://github.com/piebro/factorio-blueprint-visualizer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42644168",
    "commentBody": "",
    "originSummary": [
      "Uusi verkkosivusto on kehitetty visualisoimaan Factorio-suunnitelmia vektorigrafiikan (SVG) avulla, mikä mahdollistaa käyttäjien tuoda ja muokata suunnitelmia taidokkaasti. - Työkalu tukee Factorio 2.0:aa ja Factorio: Space Agea, ja sen suorituskyky on parantunut Pythonista JavaScriptiin siirron jälkeen. - Käyttäjät voivat säätää piirustusasetuksia ja hyödyntää työkalua tekstistä kuvaksi -generointiin tai kynäpiirtämiseen, ja osallistumista sekä palautetta kannustetaan."
    ],
    "commentSummary": [
      "Factorio Blueprint Visualizer, fanien luoma verkkosivusto, on päivitetty tukemaan Factorio 2.0:aa ja Space Age DLC:tä, mikä mahdollistaa käyttäjille piirrostyylien muokkaamisen.",
      "Projekti kirjoitettiin uudelleen Pythonista JavaScriptiksi suorituskyvyn parantamiseksi, ja luoja on avoin palautteelle virheistä ja ominaisuusideoista.",
      "Vaikka visualisoija ei tue natiivisti modeja, sitä voidaan mukauttaa lisäämällä mod-rakennuksia, ja yhteisö pysyy aktiivisesti mukana pelissä."
    ],
    "points": 254,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1736421783
  }
]
