[
  {
    "id": 42638626,
    "title": "আমাকে আমার কোর্স-অদলবদল সাইটটি বন্ধ করতে হয়েছিল নতুবা বহিষ্কৃত হতে হতো",
    "originLink": "https://www.linkedin.com/posts/jdkaim_github-jdkaimhuskyswap-huskyswap-project-activity-7282609173316415488-1jdb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42638626",
    "commentBody": "",
    "originSummary": [
      "জেডি কাইম, একজন কম্পিউটার বিজ্ঞান ছাত্র, হাস্কিসোয়াপ নামে একটি অ্যাপ তৈরি করেছেন, যা ওয়াশিংটন বিশ্ববিদ্যালয়ের ছাত্রদের মধ্যে ক্লাস স্পট ট্রেডিং সহজতর করার জন্য ডিজাইন করা হয়েছে। - এটি মূলত একটি ক্লাস প্রকল্প হিসেবে তৈরি হলেও, কাইম যখন অ্যাপটি অফিসিয়াল রেজিস্ট্রেশন সিস্টেমের সাথে সংযুক্ত করার চেষ্টা করেন, তখন বিশ্ববিদ্যালয় থেকে একটি \"লঙ্ঘন নোটিশ\" পান। - এই পরিস্থিতি মিশ্র প্রতিক্রিয়া সৃষ্টি করেছে, কিছু লোক বিশ্ববিদ্যালয়ের পদক্ষেপের সমালোচনা করেছেন এবং অন্যরা কাইমকে সমর্থন ও পরামর্শ প্রদান করেছেন, যিনি ভবিষ্যতের উদ্যোগ এবং চাকরির সম্ভাবনা সম্পর্কে আশাবাদী রয়েছেন।"
    ],
    "commentSummary": [
      "একটি কোর্স-অদলবদল সাইটের স্রষ্টাকে তাদের বিশ্ববিদ্যালয়, ইউনিভার্সিটি অফ ওয়াশিংটন (UW) থেকে বহিষ্কারের হুমকি পাওয়ার পর সাইটটি বন্ধ করতে বাধ্য করা হয়েছিল। - সম্মতি সত্ত্বেও, বিশ্ববিদ্যালয় শিক্ষার্থীর অ্যাকাউন্টে একটি স্থগিতাদেশ আরোপ করে, তাদের চূড়ান্ত কোয়ার্টারের জন্য নিবন্ধন বন্ধ করে দেয় যদি না তারা বিশ্ববিদ্যালয়ের জন্য বিনা পারিশ্রমিকে একটি অনুরূপ সমাধান তৈরি করে। - শিক্ষার্থী এই পরিস্থিতিকে হতাশাজনক মনে করছেন এবং UW নেতৃত্বের কাছ থেকে ন্যায্য সমাধান খুঁজছেন, পাশাপাশি আইনি পরামর্শ বিবেচনা করছেন।"
    ],
    "points": 1112,
    "commentCount": 515,
    "retryCount": 0,
    "time": 1736371632
  },
  {
    "id": 42642089,
    "title": "লুইজি ম্যানজিওনের অ্যাকাউন্ট স্ট্যাক ওভারফ্লোতে পুনরায় নামকরণ করা হয়েছে",
    "originLink": "https://substack.evancarroll.com/p/the-erasure-of-luigi-mangione",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42642089",
    "commentBody": "",
    "originSummary": [
      "ইভান ক্যারল স্ট্যাক ওভারফ্লোতে লুইজি ম্যানজিওনের পরিচয় মুছে ফেলার বিষয়টি তুলে ধরেছেন, যেখানে তার অ্যাকাউন্টের নাম পরিবর্তন করে \"user4616250\" রাখা হয়েছে স্পষ্ট কারণ ছাড়াই, যা ক্রিয়েটিভ কমন্স লাইসেন্সের অধীনে স্বীকৃতির বিষয়ে উদ্বেগ সৃষ্টি করেছে।",
      "ক্যারলের এই বিষয়ে অনুসন্ধান স্ট্যাক এক্সচেঞ্জ থেকে এক বছরের নিষেধাজ্ঞার ফলস্বরূপ হয়, যা তিনি প্রতিশোধমূলক হিসাবে মনে করেন, অন্য প্ল্যাটফর্ম যেমন গিটহাব এবং লিঙ্কডইন এর সাথে বিপরীত যেখানে ম্যানজিওনকে মুছে ফেলা হয়নি।",
      "পরিস্থিতিটি স্ট্যাক এক্সচেঞ্জের একটি অনন্য অবস্থানকে তুলে ধরে এবং মাঞ্জিওনের ন্যায্য আচরণের আহ্বান জানায়, যিনি কোনো অপরাধে দোষী সাব্যস্ত হননি।"
    ],
    "commentSummary": [
      "লুইজি ম্যানজিওনের স্ট্যাক ওভারফ্লো অ্যাকাউন্টের নাম পরিবর্তন করা হয়েছিল, যা প্ল্যাটফর্মে মডারেশন এবং স্বীকৃতি অধিকার নিয়ে আলোচনা শুরু করে।",
      "সমালোচকরা যুক্তি দেন যে তার নাম অপসারণ করা ক্রিয়েটিভ কমন্স অ্যাট্রিবিউশন-শেয়ারঅ্যালাইক (CC-BY-SA) লাইসেন্সের লঙ্ঘন হতে পারে, যা সঠিক স্বীকৃতি প্রয়োজন।",
      "আলোচনা বিস্তৃত হয়েছে ব্যবহারকারীর বিষয়বস্তুর উপর কর্পোরেট নিয়ন্ত্রণ এবং ব্যক্তিগত অধিকার ও সামাজিক ন্যায়বিচারের উপর মডারেশন প্রক্রিয়ার প্রভাব সম্পর্কে বৃহত্তর উদ্বেগের দিকে।"
    ],
    "points": 853,
    "commentCount": 658,
    "retryCount": 0,
    "time": 1736402558
  },
  {
    "id": 42640180,
    "title": "আপনাকে Microsoft 365 এর মূল্য বৃদ্ধি পরিশোধ করতে হবে না",
    "originLink": "https://www.consumer.org.nz/articles/you-don-t-have-to-pay-the-microsoft-365-price-increase",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42640180",
    "commentBody": "",
    "originSummary": [
      "মাইক্রোসফট ৩৬৫ তার সাবস্ক্রিপশন মূল্যে প্রায় ৪০% বৃদ্ধি করেছে, এর এআই টুল, কপাইলটের সংযোজনের কথা উল্লেখ করে, যদিও কপাইলটের পূর্ণ প্রবেশাধিকার পেতে একটি অতিরিক্ত সাবস্ক্রিপশন প্রয়োজন। - গ্রাহকরা একটি লুকানো \"মাইক্রোসফট ৩৬৫ ক্লাসিক\" পরিকল্পনা নির্বাচন করে মূল্য বৃদ্ধির এড়াতে পারেন, যা পুরানো মূল্য ধরে রাখে কিন্তু খোলাখুলিভাবে প্রচারিত হয় না। - এই পরিস্থিতি \"ডার্ক প্যাটার্ন\" এর ব্যবহারের দিকে ইঙ্গিত করে, যেখানে ব্যবহারকারী ইন্টারফেসগুলি ভোক্তাদের পছন্দগুলি প্রভাবিত করার জন্য ডিজাইন করা হয়, যা স্বচ্ছতা এবং ভোক্তা অধিকারের বিষয়ে নৈতিক উদ্বেগ উত্থাপন করে।"
    ],
    "commentSummary": [
      "মাইক্রোসফট ৩৬৫-এর মূল্য বৃদ্ধি ব্যবহারকারীদের বিকল্প অনুসন্ধানে প্ররোচিত করেছে, যেমন পুরনো সংস্করণগুলি যেমন অফিস ২০১০ বা বিনামূল্যের সেবা যেমন গুগল ডক্স, কারণ সফটওয়্যারের জন্য মাসিক অর্থ প্রদান নিয়ে উদ্বেগ রয়েছে যেখানে পুনরাবৃত্ত খরচ খুবই কম। - ব্যবসাগুলি প্রায়ই মাইক্রোসফট ৩৬৫-এর মতো সফটওয়্যার অ্যাজ এ সার্ভিস (SaaS) এর সাথে সংহতি এবং ধারাবাহিকতার জন্য লেগে থাকতে বাধ্য হয়, উচ্চ খরচ সত্ত্বেও, যখন কিছু স্ব-হোস্টিং বিবেচনা করে, যা ব্যয়বহুল এবং ঝুঁকিপূর্ণ হতে পারে। - মাইক্রোসফট অফিস ২০২৪-এর জন্য এককালীন ক্রয় বিকল্প অফার করে, যা একটি পিসি-তে সীমাবদ্ধ, তাদের জন্য আকর্ষণীয় যারা সাবস্ক্রিপশন মডেলে প্রতিশ্রুতিবদ্ধ হতে পছন্দ করেন না।"
    ],
    "points": 353,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1736382339
  },
  {
    "id": 42638735,
    "title": "এলএ-এর দাবানল হাজার হাজার মানুষকে সরিয়ে নিতে বাধ্য করেছে, নাসা জেপিএল বন্ধ",
    "originLink": "https://www.theregister.com/2025/01/08/los_angeles_fires_jpl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42638735",
    "commentBody": "",
    "originSummary": [
      "লস অ্যাঞ্জেলেস কাউন্টিতে দাবানলের কারণে ৭০,০০০ মানুষকে সরিয়ে নেওয়া হয়েছে এবং ৪,০০,০০০ বাসিন্দা বিদ্যুৎ বিচ্ছিন্ন অবস্থায় রয়েছে, যেখানে ১,০০০ এরও বেশি কাঠামো ধ্বংস হয়েছে এবং দুইজনের মৃত্যুর খবর পাওয়া গেছে। - ক্যালিফোর্নিয়ার গভর্নর গ্যাভিন নিউসম জরুরি অবস্থা ঘোষণা করেছেন, জাতীয় গার্ড এবং দমকলকর্মীদের, যার মধ্যে বন্দিরাও রয়েছে, সংকট মোকাবিলায় মোতায়েন করেছেন। - নাসার জেট প্রপালশন ল্যাবরেটরি (জেপিএল) হুমকির মুখে রয়েছে, জরুরি ব্যবস্থা গ্রহণ করা হয়েছে এবং প্রয়োজন হলে মঙ্গল মিশন নিয়ন্ত্রণ স্থানান্তরের জন্য বিকল্প পরিকল্পনা করা হয়েছে।"
    ],
    "commentSummary": [
      "লস অ্যাঞ্জেলেসে বন্যা আগুনের কারণে ব্যাপক সরিয়ে নেওয়া এবং নাসার জেট প্রপালশন ল্যাবরেটরি (জেপিএল) বন্ধ হয়ে গেছে, যা পরিস্থিতির তীব্রতাকে তুলে ধরেছে।",
      "দমকা বাতাস অগ্নিনির্বাপণ প্রচেষ্টাকে জটিল করে তুলছে, এবং অগ্নি নির্বাপণ বিভাগের বাজেট কাটছাঁট নিয়ে উদ্বেগ রয়েছে, যা প্রতিক্রিয়া সক্ষমতাকে প্রভাবিত করতে পারে।",
      "সম্প্রদায়টি অনুদান এবং সহায়তার মাধ্যমে অগ্নিকাণ্ডে ক্ষতিগ্রস্তদের সক্রিয়ভাবে সমর্থন করছে, যা দুর্যোগের মুখে সংহতি প্রদর্শন করছে।"
    ],
    "points": 352,
    "commentCount": 539,
    "retryCount": 0,
    "time": 1736372409
  },
  {
    "id": 42645218,
    "title": "একটি পিডিএফের ভিতরে খেলা যায় এমন টেট্রিস গেম",
    "originLink": "https://th0mas.nl/downloads/pdftris.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42645218",
    "commentBody": "",
    "originSummary": [
      "আধুনিক ডেস্কটপ ব্রাউজারের পিডিএফ ইঞ্জিন, যেমন PDFium এবং PDF.js, যথেষ্ট ইনপুট/আউটপুট ক্ষমতা সহ জাভাস্ক্রিপ্ট সমর্থন করতে পারে যাতে টেট্রিসের মতো সহজ গেম তৈরি করা যায়।",
      "প্রকল্পটি কিছু সীমাবদ্ধতা সত্ত্বেও, মনোক্রোম পিক্সেলের জন্য অ্যানোটেশন ক্ষেত্র এবং কীবোর্ড ইনপুটের জন্য একটি টেক্সট ইনপুট বক্স ব্যবহার করে পিডিএফ স্ক্রিপ্টিংয়ের বহুমুখিতা প্রদর্শন করে।",
      "পিডিএফটি ASCII ফরম্যাটে উপলব্ধ, যা ব্যবহারকারীদের এটি একটি টেক্সট এডিটরে খুলতে বা GitHub-এ সোর্স কোড দেখতে সক্ষম করে।"
    ],
    "commentSummary": [
      "একটি টেট্রিস গেম জাভাস্ক্রিপ্ট ব্যবহার করে একটি পিডিএফের মধ্যে তৈরি করা হয়েছে, যা আধুনিক পিডিএফ ইঞ্জিন যেমন PDFium এবং PDF.js এর সক্ষমতাগুলি প্রদর্শন করে। - গেমটি পিক্সেল প্রদর্শনের জন্য এনোটেশন ক্ষেত্র এবং নিয়ন্ত্রণের জন্য টেক্সট ইনপুট ব্যবহার করে, তবে এটি মুদ্রণ করার সময় বা কিছু পিডিএফ ভিউয়ার যেমন Evince এ কার্যকরী নয়। - এই প্রকল্পটি পিডিএফ স্ক্রিপ্টিংয়ের নমনীয়তা প্রদর্শন করে, তবে পিডিএফের মধ্যে কোড কার্যকর করার বিষয়ে নিরাপত্তা উদ্বেগও উত্থাপন করে; সোর্স কোডটি GitHub এ উপলব্ধ।"
    ],
    "points": 340,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1736429493
  },
  {
    "id": 42639417,
    "title": "মার্ক বেনিওফ বলেছেন, সেলসফোর্স ২০২৫ সালে আর কোনো সফটওয়্যার ইঞ্জিনিয়ার নিয়োগ করবে না।",
    "originLink": "https://www.salesforceben.com/salesforce-will-hire-no-more-software-engineers-in-2025-says-marc-benioff/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42639417",
    "commentBody": "",
    "originSummary": [
      "সেলসফোর্স ২০২৫ সালে আরও সফটওয়্যার ইঞ্জিনিয়ার নিয়োগ বন্ধ করার পরিকল্পনা করছে, এআই অগ্রগতির কারণে ৩০% উৎপাদনশীলতা বৃদ্ধির কথা উল্লেখ করে, যা সিইও মার্ক বেনিওফ বলেছেন। - কোম্পানিটি তার এআই পণ্য, এজেন্টফোর্সের উপর মনোযোগ দেবে এবং এআই-এর মূল্য গ্রাহকদের কাছে পৌঁছে দেওয়ার জন্য বিক্রয়কর্মী নিয়োগ বাড়াবে। - অতিরিক্ত নিয়োগের কারণে মহামারী চলাকালীন সাম্প্রতিক ছাঁটাই সত্ত্বেও, বেনিওফ আগামী পাঁচ বছরে কোম্পানির বৃদ্ধির আশা করছেন, জাপান ড্রিমিন' এবং আর্কিটেক্ট ড্রিমিন' এর মতো আসন্ন ইভেন্টগুলি দিগন্তে রয়েছে।"
    ],
    "commentSummary": [
      "সেলসফোর্সের সিইও মার্ক বেনিওফ ২০২৫ সালে সফটওয়্যার ইঞ্জিনিয়ারদের জন্য নিয়োগ স্থগিতের ঘোষণা দিয়েছেন, যা এআই-চালিত উৎপাদনশীলতা এবং খরচ নিয়ন্ত্রণের উপর গুরুত্বারোপ করছে।",
      "এই সিদ্ধান্তটি ২০২৩ সালের শুরুর দিকে কর্মী নিয়োগ স্থগিত এবং ছাঁটাইয়ের পর আসে, যা শেয়ারহোল্ডারদের চাপ দ্বারা প্রভাবিত হয়েছিল এবং এটি সেলসফোর্সের এআই পণ্যের জন্য একটি বিপণন কৌশল হিসেবে বিবেচিত হয়।",
      "এআই থেকে ৩০% উৎপাদনশীলতা বৃদ্ধির দাবির পরেও সন্দেহ বিদ্যমান, এবং সেলসফোর্স এআই প্রস্তাবনা প্রচারের জন্য তাদের বিক্রয় দল সম্প্রসারণের পরিকল্পনা করছে, যা মানব কাজের স্থানে এআই-এর ভূমিকা নিয়ে প্রশ্ন উত্থাপন করছে।"
    ],
    "points": 328,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1736376987
  },
  {
    "id": 42639563,
    "title": "উবুন্টু লিনাক্সের অন্যতম প্রধান ব্যক্তিত্ব স্টিভ ল্যাঙ্গাসেক মারা গেছেন",
    "originLink": "https://thenewstack.io/steve-langasek-one-of-ubuntu-linuxs-leading-lights-has-died/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42639563",
    "commentBody": "",
    "originSummary": [
      "স্টিভ ল্যাঙ্গাসেক, লিনাক্স সম্প্রদায়ের একজন বিশিষ্ট অবদানকারী, বিশেষ করে ডেবিয়ান এবং উবুন্টুতে, ১ জানুয়ারি, ২০২৫ তারিখে ৪৫ বছর বয়সে মৃত্যুবরণ করেন। - ল্যাঙ্গাসেক সিস্টেম প্রশাসন, সফটওয়্যার উন্নয়ন এবং প্যাকেজ রক্ষণাবেক্ষণে তার গুরুত্বপূর্ণ অবদানের জন্য পরিচিত ছিলেন, যা লিনাক্স-পিএএম, সাম্বা এবং ওপেনএলডিএপি-এর মতো প্রকল্পগুলিতে প্রভাব ফেলেছিল। - তার নেতৃত্ব, পরামর্শ এবং ওপেন-সোর্স নীতির প্রতি উত্সর্গ অত্যন্ত প্রশংসিত ছিল, যেখানে মার্ক শাটলওয়ার্থ এবং ডাস্টিন কার্কল্যান্ডের মতো বিশিষ্ট ব্যক্তিরা তার প্রযুক্তিগত অন্তর্দৃষ্টি এবং মনোভাবের প্রশংসা করেছেন।"
    ],
    "commentSummary": [
      "স্টিভ ল্যাঙ্গাসেক, উবুন্টু লিনাক্স এবং ডেবিয়ানের একজন বিশিষ্ট অবদানকারী, ৪৫ বছর বয়সে স্টেজ ৪ কোলন ক্যান্সারে মারা গেছেন। - তার মৃত্যু প্রাথমিক চিকিৎসা স্ক্রিনিংয়ের গুরুত্ব এবং সেগুলিতে প্রবেশের অসুবিধা সম্পর্কে আলোচনা শুরু করেছে। - প্রযুক্তি সম্প্রদায় তাকে তার বিস্তৃত জ্ঞান এবং সহায়ক প্রকৃতির জন্য স্মরণ করে।"
    ],
    "points": 269,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1736377988
  },
  {
    "id": 42644168,
    "title": "ফ্যাক্টোরিও ব্লুপ্রিন্ট ভিজ্যুয়ালাইজার",
    "originLink": "https://github.com/piebro/factorio-blueprint-visualizer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42644168",
    "commentBody": "",
    "originSummary": [
      "একটি নতুন ওয়েবসাইট তৈরি করা হয়েছে যা ভেক্টর গ্রাফিক্স (SVG) ব্যবহার করে ফ্যাক্টরিও ব্লুপ্রিন্টগুলি ভিজুয়ালাইজ করতে দেয়, যা ব্যবহারকারীদের ব্লুপ্রিন্টগুলি শিল্পকৌশলে আমদানি এবং পরিবর্তন করতে সক্ষম করে। - এই টুলটি ফ্যাক্টরিও ২.০ এবং ফ্যাক্টরিও: স্পেস এজ সমর্থন করে, যা পাইথন থেকে জাভাস্ক্রিপ্টে পোর্ট করার পর উন্নত কর্মক্ষমতা প্রদান করে। - ব্যবহারকারীরা অঙ্কন সেটিংস সামঞ্জস্য করতে পারে এবং টেক্সট-টু-ইমেজ জেনারেশন বা পেন প্লটিংয়ের জন্য টুলটি ব্যবহার করতে পারে, যেখানে অবদান এবং প্রতিক্রিয়া উৎসাহিত করা হয়।"
    ],
    "commentSummary": [
      "ফ্যাক্টরিও ব্লুপ্রিন্ট ভিজ্যুয়ালাইজার, একটি ফ্যান-নির্মিত ওয়েবসাইট, ফ্যাক্টরিও ২.০ এবং স্পেস এজ ডিএলসি সমর্থন করার জন্য আপডেট করা হয়েছে, যা ব্যবহারকারীদের অঙ্কনের শৈলী পরিবর্তন করার অনুমতি দেয়।",
      "প্রকল্পটি কর্মদক্ষতা উন্নত করার জন্য পাইথন থেকে জাভাস্ক্রিপ্টে পুনরায় লেখা হয়েছে, এবং সৃষ্টিকর্তা বাগ এবং বৈশিষ্ট্য ধারণা সম্পর্কে প্রতিক্রিয়া গ্রহণ করতে ইচ্ছুক।",
      "যদিও ভিজ্যুয়ালাইজারটি স্বাভাবিকভাবে মড সমর্থন করে না, এটি মড বিল্ডিং যোগ করে কাস্টমাইজ করা যেতে পারে, এবং সম্প্রদায়টি গেমটির সাথে সক্রিয়ভাবে জড়িত থাকে।"
    ],
    "points": 254,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1736421783
  }
]
