[
  {
    "id": 42638626,
    "title": "Ya kurs değiştirme sitemi kapatmak zorundaydım ya da okuldan atılacaktım.",
    "originLink": "https://www.linkedin.com/posts/jdkaim_github-jdkaimhuskyswap-huskyswap-project-activity-7282609173316415488-1jdb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42638626",
    "commentBody": "",
    "originSummary": [
      "JD Kaim, bir bilgisayar bilimi öğrencisi, Washington Üniversitesi'ndeki öğrenciler arasında ders yeri ticaretini kolaylaştırmak için tasarlanmış HuskySwap adlı bir uygulama geliştirdi. - Başlangıçta bir sınıf projesi olarak tasarlanmasına rağmen, Kaim, uygulamayı resmi kayıt sistemiyle entegre etmeye çalışırken üniversiteden bir \"İhlal Bildirimi\" aldı. - Durum, bazıları üniversitenin eylemlerini eleştirirken, diğerleri Kaim'e destek ve tavsiye vererek karışık tepkiler yarattı. Kaim, gelecekteki girişimler ve iş olanakları konusunda iyimserliğini koruyor."
    ],
    "commentSummary": [
      "Bir ders değiştirme sitesinin yaratıcısı, üniversiteleri Washington Üniversitesi'nden (UW) gelen ve uzaklaştırma tehdidi içeren bir ültimatom aldıktan sonra siteyi kapatmak zorunda kaldı. - Uyumluluğa rağmen, üniversite öğrencinin hesabına bir engel koyarak, son çeyrek için kayıt yapmasını engelledi, aksi takdirde üniversite için benzer bir çözüm geliştirmesini talep etti, üstelik tazminat olmaksızın. - Öğrenci durumu moral bozucu buluyor ve UW liderliğinden adil bir çözüm ararken, aynı zamanda hukuki danışmanlık almayı da düşünüyor."
    ],
    "points": 1112,
    "commentCount": 515,
    "retryCount": 0,
    "time": 1736371632
  },
  {
    "id": 42642089,
    "title": "Luigi Mangione'nin hesabı Stack Overflow'da yeniden adlandırıldı",
    "originLink": "https://substack.evancarroll.com/p/the-erasure-of-luigi-mangione",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42642089",
    "commentBody": "",
    "originSummary": [
      "Evan Carroll, Stack Overflow'da Luigi Mangione'nin kimliğinin silinmesini vurguluyor; burada hesabı, açık bir gerekçe olmaksızın 'user4616250' olarak yeniden adlandırıldı ve bu durum, Creative Commons lisansı kapsamında atıf konusundaki endişeleri artırıyor.",
      "Carroll'un bu konudaki araştırması, Stack Exchange'den bir yıl süreyle yasaklanmasına yol açtı, bu durumu misilleme olarak görüyor ve GitHub ve LinkedIn gibi diğer platformlarla karşılaştırıyor, çünkü bu platformlar Mangione'yi silmedi.",
      "Durum, Stack Exchange'in benzersiz bir duruşunu vurguluyor ve herhangi bir suçtan hüküm giymemiş olan Mangione'nin adil muamele görmesi çağrısında bulunuyor."
    ],
    "commentSummary": [
      "Luigi Mangione'nin Stack Overflow hesabı yeniden adlandırıldı, bu durum platformda moderasyon ve atıf hakları hakkında tartışmalara yol açtı.",
      "Eleştirmenler, isminin kaldırılmasının, uygun atıf gerektiren Creative Commons Attribution-ShareAlike (CC-BY-SA) lisansını ihlal edebileceğini savunuyorlar.",
      "Bu tartışma, kullanıcı içeriği üzerindeki kurumsal kontrol ve moderasyon uygulamalarının bireysel haklar ve toplumsal adalet üzerindeki etkileri hakkındaki daha geniş endişelere kadar uzanıyor."
    ],
    "points": 853,
    "commentCount": 658,
    "retryCount": 0,
    "time": 1736402558
  },
  {
    "id": 42640180,
    "title": "Microsoft 365 fiyat artışını ödemeniz gerekmiyor",
    "originLink": "https://www.consumer.org.nz/articles/you-don-t-have-to-pay-the-microsoft-365-price-increase",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42640180",
    "commentBody": "",
    "originSummary": [
      "Microsoft 365, AI aracı Copilot'un entegrasyonunu gerekçe göstererek abonelik fiyatlarını yaklaşık %40 artırdı, ancak Copilot'a tam erişim için ek bir abonelik gerekiyor. - Müşteriler, eski fiyatlandırmayı koruyan ancak açıkça reklamı yapılmayan gizli bir \"Microsoft 365 Classic\" planını seçerek fiyat artışından kaçınabilirler. - Bu durum, kullanıcı arayüzlerinin tüketici seçimlerini manipüle etmek için tasarlandığı \"karanlık desenler\" kullanımını vurgulamakta ve şeffaflık ile tüketici hakları konusunda etik kaygılar ortaya çıkarmaktadır."
    ],
    "commentSummary": [
      "Microsoft 365'in fiyat artışı, kullanıcıları, yazılım için aylık ödeme yapma konusundaki endişeler nedeniyle, Office 2010 gibi eski sürümler veya Google Docs gibi ücretsiz hizmetler gibi alternatifleri keşfetmeye yönlendirdi. - İşletmeler, yüksek maliyetlere rağmen entegrasyon ve süreklilik için Microsoft 365 gibi Hizmet Olarak Yazılım (SaaS) kullanmaya zorunlu hissederken, bazıları pahalı ve riskli olabilen kendi barındırma seçeneklerini değerlendiriyor. - Microsoft, abonelik modeline bağlı kalmak istemeyenlere hitap eden, tek bir PC ile sınırlı olan Office 2024 için tek seferlik bir satın alma seçeneği sunuyor."
    ],
    "points": 353,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1736382339
  },
  {
    "id": 42638735,
    "title": "LA orman yangınları binlerce kişiyi tahliye etmeye zorladı, NASA JPL kapatıldı",
    "originLink": "https://www.theregister.com/2025/01/08/los_angeles_fires_jpl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42638735",
    "commentBody": "",
    "originSummary": [
      "Los Angeles County'deki orman yangınları, 70.000 kişinin tahliye edilmesine ve 400.000 sakini etkileyen elektrik kesintilerine yol açtı, 1.000'den fazla yapı yıkıldı ve iki ölüm bildirildi. - Kaliforniya Valisi Gavin Newsom, Ulusal Muhafızları ve itfaiyecileri, mahkumlar da dahil olmak üzere, krizi ele almak için görevlendirerek olağanüstü hal ilan etti. - NASA'nın Jet Propulsion Laboratory (JPL) tehdit altında, acil durum önlemleri devrede ve gerekirse Mars görev kontrolünü transfer etmek için yedek planlar hazır."
    ],
    "commentSummary": [
      "Los Angeles'taki orman yangınları, kitlesel tahliyelere ve NASA'nın Jet Propulsion Laboratory (JPL) laboratuvarının kapatılmasına yol açarak durumun ciddiyetini gözler önüne serdi.",
      "Şiddetli rüzgarlar yangınla mücadele çabalarını zorlaştırıyor ve itfaiye departmanındaki bütçe kesintilerinin müdahale yeteneklerini etkileyebileceği konusunda endişeler var.",
      "Topluluk, bağışlar ve yardımlar yoluyla yangınlardan etkilenenleri aktif olarak destekleyerek felaket karşısında dayanışma sergiliyor."
    ],
    "points": 352,
    "commentCount": 539,
    "retryCount": 0,
    "time": 1736372409
  },
  {
    "id": 42645218,
    "title": "Bir PDF içinde oynanabilir bir Tetris oyunu",
    "originLink": "https://th0mas.nl/downloads/pdftris.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42645218",
    "commentBody": "",
    "originSummary": [
      "Modern masaüstü tarayıcıların PDF motorları, PDFium ve PDF.js gibi, Tetris gibi basit oyunlar oluşturmak için yeterli giriş/çıkış yetenekleriyle JavaScript'i destekleyebilir.",
      "Proje, bazı sınırlamalara rağmen, klavye girişi için bir metin giriş kutusu ve monokrom pikseller için açıklama alanları kullanarak PDF betiklerinin çok yönlülüğünü göstermektedir.",
      "PDF, kullanıcıların bir metin düzenleyicide açmasına veya GitHub'da kaynak kodunu görüntülemesine olanak tanıyan ASCII formatında mevcuttur."
    ],
    "commentSummary": [
      "Bir Tetris oyunu, PDFium ve PDF.js gibi modern PDF motorlarının yeteneklerini sergileyen JavaScript kullanılarak bir PDF içinde geliştirilmiştir. - Oyun, piksel görüntüleme için açıklama alanlarını ve kontroller için metin girişini kullanır, ancak yazdırıldığında veya Evince gibi bazı PDF görüntüleyicilerde işlevsel değildir. - Bu proje, PDF betik yazımının esnekliğini gösterirken, PDF'ler içinde kod çalıştırmanın güvenlik endişelerini de gündeme getirmektedir; kaynak kodu GitHub'da erişilebilir durumdadır."
    ],
    "points": 340,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1736429493
  },
  {
    "id": 42639417,
    "title": "Salesforce, 2025 yılında daha fazla yazılım mühendisi işe almayacak, diyor Marc Benioff",
    "originLink": "https://www.salesforceben.com/salesforce-will-hire-no-more-software-engineers-in-2025-says-marc-benioff/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42639417",
    "commentBody": "",
    "originSummary": [
      "Salesforce, 2025 yılında daha fazla yazılım mühendisi işe almayı durdurmayı planlıyor ve bunu, CEO Marc Benioff'un belirttiği gibi, yapay zeka gelişmelerine bağlı olarak %30'luk bir verimlilik artışına atfediyor. - Şirket, AI ürünü Agentforce'a odaklanacak ve AI'nın müşterilere değerini iletmek için satış elemanlarının işe alımını artıracak. - Pandemi sırasında aşırı işe alım nedeniyle yakın zamanda yapılan işten çıkarmalara rağmen, Benioff önümüzdeki beş yıl içinde şirketin büyümesini öngörüyor ve Japonya Dreamin' ve Architect Dreamin' gibi yaklaşan etkinlikler ufukta görünüyor."
    ],
    "commentSummary": [
      "Salesforce CEO'su Marc Benioff, 2025 yılında yazılım mühendisleri için işe alım dondurması ilan etti, yapay zeka odaklı verimlilik ve maliyet kontrolüne odaklanacaklarını belirtti.",
      "Bu karar, hissedar baskısının etkisiyle 2023'ün başlarında uygulanan işe alım durdurma ve işten çıkarmaların ardından geliyor ve Salesforce'un yapay zeka ürünleri için bir pazarlama stratejisi olarak algılanıyor.",
      "Yapay zekadan %30'luk bir verimlilik artışı iddialarına rağmen, şüphecilik devam ediyor ve Salesforce, yapay zeka ürünlerini tanıtmak için satış ekibini genişletmeyi planlıyor, bu da yapay zekanın insan işlerini değiştirme rolü hakkında sorular ortaya çıkarıyor."
    ],
    "points": 328,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1736376987
  },
  {
    "id": 42639563,
    "title": "Ubuntu Linux'un önde gelen isimlerinden Steve Langasek hayatını kaybetti.",
    "originLink": "https://thenewstack.io/steve-langasek-one-of-ubuntu-linuxs-leading-lights-has-died/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42639563",
    "commentBody": "",
    "originSummary": [
      "Steve Langasek, özellikle Debian ve Ubuntu olmak üzere Linux topluluğuna önemli katkılarda bulunan bir isim, 1 Ocak 2025'te 45 yaşında vefat etti. - Langasek, sistem yönetimi, yazılım geliştirme ve paket bakımı konularındaki önemli katkılarıyla tanınıyordu ve Linux-PAM, Samba ve OpenLDAP gibi projeleri etkiledi. - Liderliği, mentörlüğü ve açık kaynak ilkelerine olan bağlılığı büyük takdir topladı; Mark Shuttleworth ve Dustin Kirkland gibi önemli isimler onun teknik anlayışını ve ruhunu övdü."
    ],
    "commentSummary": [
      "Steve Langasek, Ubuntu Linux ve Debian'a önemli katkılarda bulunan biri, 45 yaşında 4. evre kolon kanseri nedeniyle hayatını kaybetti. - Ölümü, erken tıbbi taramaların kritik önemi ve bu taramalara erişimdeki zorluklar hakkında konuşmaları başlattı. - Teknoloji topluluğu, onu geniş bilgisi ve destekleyici doğasıyla hatırlıyor."
    ],
    "points": 269,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1736377988
  },
  {
    "id": 42644168,
    "title": "Factorio Plan Şeması Görselleştirici",
    "originLink": "https://github.com/piebro/factorio-blueprint-visualizer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42644168",
    "commentBody": "",
    "originSummary": [
      "Factorio planlarını vektör grafikleri (SVG) kullanarak görselleştirmek için yeni bir web sitesi geliştirildi ve kullanıcıların planları sanatsal bir şekilde içe aktarıp değiştirmelerine olanak tanıyor. - Araç, Python'dan JavaScript'e taşındıktan sonra performansı iyileştirilmiş olarak Factorio 2.0 ve Factorio: Space Age'i destekliyor. - Kullanıcılar çizim ayarlarını ayarlayabilir ve aracı metinden görüntü oluşturma veya kalemle çizim için kullanabilir, katkılar ve geri bildirim teşvik edilmektedir."
    ],
    "commentSummary": [
      "Factorio Blueprint Görselleştirici, hayranlar tarafından oluşturulmuş bir web sitesi, kullanıcıların çizim stillerini değiştirmelerine olanak tanıyan Factorio 2.0 ve Space Age DLC'yi destekleyecek şekilde güncellendi.",
      "Proje, performansı artırmak için Python'dan JavaScript'e yeniden yazıldı ve yaratıcısı, hatalar ve özellik fikirleri hakkında geri bildirimlere açıktır.",
      "Her ne kadar görselleştirici modları doğal olarak desteklemese de, mod binaları ekleyerek özelleştirilebilir ve topluluk oyunla aktif bir şekilde ilgilenmeye devam etmektedir."
    ],
    "points": 254,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1736421783
  }
]
