[
  {
    "id": 42717234,
    "title": "لقد اتخذت قرارًا بحل شركة هيندنبورغ للأبحاث",
    "originLink": "https://hindenburgresearch.com/gratitude/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42717234",
    "commentBody": "",
    "originSummary": [
      "أعلن نيت أندرسون، مؤسس شركة هيندنبورغ ريسيرش المعروفة بتحدي الاحتيال والفساد، عن حل الشركة. - يأتي قرار الحل بدافع رغبة أندرسون في الحصول على راحة شخصية ومشاركة أساليبهم التحقيقية مع الجمهور من خلال فتح مصدر عمليتهم. - يعبر أندرسون عن امتنانه لفريقه وعائلته وقرائه، مشددًا على التأثير والدعم الذي تلقوه طوال رحلتهم."
    ],
    "commentSummary": [
      "تقوم شركة هيندنبورغ ريسيرش بحل نفسها، حيث أشار المؤسس نيت أندرسون إلى أسباب شخصية ورغبة في مشاركة أساليبهم التحقيقية علنًا. - على الرغم من نجاحهم في كشف الاحتيالات مثل شركة نيكولا موتورز، يوضح أندرسون أنه لا يوجد تهديد محدد يسبب الإغلاق. - يخطط أندرسون لإصدار مواد تعليمية لتحفيز جهود تحقيقية مماثلة، بينما سيتابع الفريق المتنوع مشاريع مستقلة جديدة."
    ],
    "points": 711,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1736976235
  },
  {
    "id": 42725385,
    "title": "لا مكالمات",
    "originLink": "https://keygen.sh/blog/no-calls/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725385",
    "commentBody": "",
    "originSummary": [
      "زيك جابريلس، مؤسس شركة كيجين، تجنب في البداية المكالمات البيعية بسبب طبيعته الانطوائية، حيث نفذ سياسة 'لا مكالمات'، مما أدى إلى تفاعلات أكثر مباشرة وأول عملية بيع للمؤسسات.",
      "حدد غابريلس أربعة قضايا رئيسية يجب معالجتها لتحقيق نهج 'بدون مكالمات' ناجح: العروض غير الواضحة، الإعداد السيئ، التسعير المخفي، ونقص الثقة، مقترحًا رسائل واضحة، تسعير شفاف، إعداد ذاتي، ووثائق لبناء الثقة.",
      "بينما لا تزال بعض الشركات تتوقع المكالمات، تستخدم Keygen مكالمات 'اكتشاف' قصيرة للانتقال إلى المناقشات عبر البريد الإلكتروني، ويشجع غابرييلس الآخرين على النظر في نهج #nocalls إذا كان يتماشى مع أسلوبهم."
    ],
    "commentSummary": [
      "ينتقد المنشور الشركات التي تفرض إجراء مكالمات هاتفية للحصول على معلومات أساسية عن المنتجات، ويدعو إلى التواصل الشفاف عبر الإنترنت لتوفير الوقت وتقليل الإحباط.",
      "يتفق المعلقون إلى حد كبير، مشيرين إلى أن بعض الشركات تستخدم المكالمات الهاتفية لإخفاء المعلومات أو توظيف أساليب بيع تلاعبية.",
      "بينما يجادل البعض بأن المكالمات ضرورية للمبيعات المعقدة في الشركات، فإن الإجماع العام يؤكد على أهمية الشفافية والاتصال الفعال."
    ],
    "points": 588,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1737037051
  },
  {
    "id": 42724621,
    "title": "نينتندو تعلن عن سويتش 2 [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=itpcsQQvgAQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أعلنت نينتندو عن جهاز سويتش 2، مع التركيز على تحسينات تدريجية بدلاً من تغييرات جذرية، مع الحفاظ على تصميمه الهجين للعب المحمول والمربوط.",
      "تشمل التحسينات المحتملة شاشات OLED ووحدات تحكم محسنة، بهدف تقديم مواصفات وميزات أفضل.",
      "يسعى جهاز Switch 2 إلى تحقيق التوازن بين الابتكار والألفة، مما يجذب كل من المعجبين الجدد والحاليين من خلال التركيز على تجارب اللعب المستقرة."
    ],
    "points": 498,
    "commentCount": 665,
    "retryCount": 0,
    "time": 1737032894
  },
  {
    "id": 42716440,
    "title": "إسرائيل وحماس تتوصلان إلى اتفاق لوقف إطلاق النار لإنهاء 15 شهرًا من الحرب في غزة",
    "originLink": "https://www.reuters.com/world/middle-east/gaza-ceasefire-appears-close-us-egyptian-leaders-put-focus-coming-hours-2025-01-14/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716440",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "اتفقت إسرائيل وحماس على وقف إطلاق النار، منهيةً 15 شهرًا من الصراع في غزة، مما يمثل تطورًا هامًا في المنطقة.",
      "تستمر المخاوف من أن وسائل الإعلام والسياسيين في الغرب قد يعلنون بشكل مبكر عن حل الأزمة، متجاهلين القضايا المستمرة مثل تدمير غزة وضم الضفة الغربية.",
      "لا تزال الوضعية معقدة، حيث تدور النقاشات حول الأمن والمطالب الإقليمية وكيفية تحقيق السلام الدائم، مما يعكس وجهات نظر مختلفة وتشابهات مع صراعات جيوسياسية أخرى."
    ],
    "points": 439,
    "commentCount": 1076,
    "retryCount": 0,
    "time": 1736972809
  },
  {
    "id": 42715841,
    "title": "السويد تعيد المزيد من الكتب وممارسة الكتابة اليدوية إلى مدارسها (2023)",
    "originLink": "https://apnews.com/article/sweden-digital-education-backlash-reading-writing-1dd964c628f76361c43dbf3964f7dbf4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42715841",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تعيد السويد إدخال الكتب الورقية وممارسة الكتابة اليدوية في المدارس، متجهة من نهج تعليمي رقمي بالكامل.",
      "هناك اعتراف متزايد بالفوائد العاطفية واللمسية للكتب الورقية، على الرغم من سهولة الصيغ الرقمية.",
      "يركز النقاش المستمر على إيجاد تكامل متوازن بين الأدوات التعليمية الرقمية والفيزيائية في التعليم."
    ],
    "points": 415,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1736969641
  },
  {
    "id": 42724761,
    "title": "عرض نوكيا الداخلي بعد إطلاق الآيفون (2007) [ملف PDF]",
    "originLink": "https://nokia-apple-iphone-was-launched-presentation.tiiny.site/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724761",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "اعترفت عرض نوكيا الداخلي بعد إطلاق الآيفون في عام 2007 بالتهديد الناتج عن ابتكار أبل، ومع ذلك فشلت الإدارة في التكيف بشكل فعال.",
      "على الرغم من امتلاكها لمواهب قوية في البرمجيات والهندسة، قللت نوكيا من أهمية البرمجيات، متمسكة بنظام سيمبيان وفقدت الفرص مع المنصات القائمة على لينكس مثل ميجو وملتمي.",
      "في النهاية، أظهرت قرار نوكيا بدعم نظام ويندوز فون، الذي لم يتمكن من المنافسة مع iOS وأندرويد، صراعهم في التحول من استراتيجيات تركز على الأجهزة إلى استراتيجيات تركز على البرمجيات، وهو تحدٍ يواجه العديد من المنظمات الكبيرة في مواجهة الابتكار المزعزع."
    ],
    "points": 361,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1737033812
  },
  {
    "id": 42716428,
    "title": "فرضت UnitedHealth رسومًا زائدة على مرضى السرطان مقابل الأدوية بنسبة تزيد عن 1,000%",
    "originLink": "https://fortune.com/2025/01/15/ftc-pbms-unitedhealth-brian-thompson-cvs-caremark-cigna-pharmacy-benefit-managers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716428",
    "commentBody": "",
    "originSummary": [
      "تم اكتشاف أن شركة UnitedHealth قد قامت بفرض رسوم زائدة على بعض مرضى السرطان مقابل الأدوية بنسبة تزيد عن 1,000%.",
      "تركز رئيسة لجنة التجارة الفيدرالية، لينا خان، على مديري مزايا الصيدلة الرئيسيين، بما في ذلك OptumRx التابعة لشركة UnitedHealth، وExpress Scripts التابعة لشركة Cigna، وCVS Caremark Rx، كجزء من تحقيق أوسع."
    ],
    "commentSummary": [
      "تم اتهام شركة UnitedHealth بفرض رسوم زائدة على مرضى السرطان مقابل الأدوية بنسبة تزيد عن 1000%، مستغلة دورها المزدوج كجهة تأمين ومدير لمزايا الصيدلة.",
      "يتيح هذا التكامل الرأسي لشركة UnitedHealth تضخيم أسعار الأدوية، مما يؤثر على نفقات المرضى ويتجاوز قيود الأرباح، مما يثير القلق بشأن تفضيل الأرباح على رعاية المرضى.",
      "تؤكد الحالة على التعقيد وغياب الشفافية في نظام الرعاية الصحية، مما يدفع إلى الدعوة لإصلاحات تنظيمية لمعالجة التكاليف المتزايدة وعدم الكفاءة والتركيز على رفاهية المرضى."
    ],
    "points": 348,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1736972767
  },
  {
    "id": 42722756,
    "title": "بلو أوريجين تصل إلى المدار في أول رحلة لصاروخها العملاق نيو جلين",
    "originLink": "https://arstechnica.com/space/2025/01/blue-origin-reaches-orbit-on-first-flight-of-its-titanic-new-glenn-rocket/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42722756",
    "commentBody": "",
    "originSummary": [
      "نجح صاروخ نيو جلين التابع لشركة بلو أوريجين في الوصول إلى المدار لأول مرة، مما يمثل إنجازًا مهمًا للشركة. - واجه الإطلاق تحديات أولية، بما في ذلك مشاكل في تبريد المحرك وقارب ضال، لكنه في النهاية حقق سرعة مدارية بلغت 28,800 كيلومتر في الساعة. - وعلى الرغم من أن المرحلة الأولى من المعزز لم تعد إلى الأرض، فإن الإطلاق الناجح يظهر تقدم بلو أوريجين وتأثير استثمارات جيف بيزوس."
    ],
    "commentSummary": [
      "نجح صاروخ نيو جلين التابع لشركة بلو أوريجين في الوصول إلى المدار في رحلته الأولى، مما يمثل إنجازًا مهمًا للشركة.",
      "على الرغم من أن المرحلة الأولى لم تهبط بنجاح، إلا أن هذا أمر شائع في المحاولات الأولية ولا يقلل من قيمة الإنجاز.",
      "يوفر صاروخ نيو جلين تسعيرًا تنافسيًا للإطلاق وقدرة حمولة، مما يجعله منافسًا للشركات الراسخة مثل سبيس إكس وULA (تحالف الإطلاق المتحد)."
    ],
    "points": 323,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737015460
  },
  {
    "id": 42717165,
    "title": "تحمل العيوب بنسبة 100 ضعف: كيف حللنا مشكلة الإنتاجية",
    "originLink": "https://cerebras.ai/blog/100x-defect-tolerance-how-cerebras-solved-the-yield-problem",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42717165",
    "commentBody": "",
    "originSummary": [
      "طورت شركة Cerebras شريحة بحجم الرقاقة، أكبر بكثير من الشرائح القياسية، من خلال إعادة تصور العلاقة بين حجم الشريحة وتحمل الأخطاء. - يتضمن محرك Wafer Scale Engine (WSE) 970,000 نواة صغيرة تتحمل الأخطاء وهندسة توجيه متقدمة، مما يحقق معدلات إنتاج عالية واستخدامًا للسيليكون بنسبة 93%. - يوضح هذا الابتكار أن الحوسبة بحجم الرقاقة قابلة للتطبيق تجاريًا، حيث تقدم تحملًا أكبر للعيوب مقارنة بوحدات معالجة الرسومات التقليدية مثل H100 من Nvidia."
    ],
    "commentSummary": [
      "قدمت شركة Cerebras بنية توجيه مقاومة للأخطاء في تصنيع الرقائق، مما يسمح بصنع رقائق أكبر باستخدام مساحة القالب للتوجيه بدلاً من الترانزستورات، مما يساعد في تجاوز النوى المعيبة. - يتناقض هذا النهج المبتكر مع الأساليب التقليدية التي تتخلص من الرقائق المعيبة، حيث تستخدم Cerebras رقاقة واحدة كبيرة على مستوى الويفر مع وجود تكرار مدمج للحفاظ على الوظائف. - يُعتبر هذا التطور مهمًا في سياق الذكاء الاصطناعي، حيث تنقسم الآراء حول إمكانياته، فالبعض يراه فقاعة بينما يرى آخرون أنه يحمل إمكانيات تحويلية للصناعة."
    ],
    "points": 312,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1736975955
  },
  {
    "id": 42725147,
    "title": "نيبنتس هو فخ لاصطياد زواحف الويب الذكية",
    "originLink": "https://zadzmo.org/code/nepenthes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725147",
    "commentBody": "",
    "originSummary": [
      "نيبنتيس هو برنامج مصيدة مصمم لاحتجاز وردع الزواحف الشبكية، خاصة تلك التي تجمع البيانات لنماذج اللغة الكبيرة (LLMs)، من خلال توليد صفحات لا نهائية ومتكررة. - يمكن للبرنامج أن يخلق حملاً كبيرًا على وحدة المعالجة المركزية ويستخدم لحماية المحتوى الحقيقي أو لإغراق نماذج الذكاء الاصطناعي ببيانات غير ذات صلة، مما قد يؤثر على رؤية محركات البحث. - تشمل خيارات التثبيت استخدام Docker أو الإعداد اليدوي، مع إدارة التكوين من خلال ملف YAML، ولكن يجب على المستخدمين توخي الحذر نظرًا لإمكانية اعتباره ضارًا."
    ],
    "commentSummary": [
      "نيبنتيس هو فخ مصمم لاصطياد زواحف الويب الخاصة بالذكاء الاصطناعي، مما قد يستغل ثغرة في واجهة برمجة تطبيقات ChatGPT التي قد تؤدي إلى طلبات HTTP مفرطة وحرمان من الخدمة. - تم تجاهل الثغرة من قبل OpenAI ومايكروسوفت، وأثبت الإبلاغ عنها لـ OpenAI وBugCrowd صعوبة بسبب نقص استجابتهما. - لا يميز الفخ بين زواحف الذكاء الاصطناعي ومحركات البحث الشرعية، مما يشكل خطرًا على كليهما، ويسلط الضوء على التحديات في إدارة الزواحف العدوانية وعدم فعالية الحلول الحالية مثل robots.txt."
    ],
    "points": 278,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1737035863
  },
  {
    "id": 42724284,
    "title": "لقد تخلّيت عن الخوارزمية لصالح RSS - وينبغي عليك فعل ذلك أيضًا",
    "originLink": "https://joeyehand.com/blog/2025/01/15/i-ditched-the-algorithm-for-rssand-you-should-too/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724284",
    "commentBody": "",
    "originSummary": [
      "تدعو المقالة إلى استخدام RSS (التغذية البسيطة حقًا) كبديل لخوارزميات وسائل التواصل الاجتماعي، مشددة على قدرتها على تقديم المحتوى دون إعلانات أو تشتيت غير ضروري.",
      "يتيح RSS للمستخدمين الاشتراك مباشرة في مواقعهم المفضلة، بما في ذلك يوتيوب وريدت، مما يوفر تجربة محتوى مبسطة ومخصصة.",
      "سهولة إعداد خلاصات RSS وتوافر مولدات الخلاصات للمواقع التي لا تدعم RSS بشكل أصلي تجعلها أداة عملية للبقاء على اطلاع وتوفير الوقت."
    ],
    "commentSummary": [
      "يؤكد المقال على مزايا خلاصات RSS، التي تقدم المحتوى مباشرة دون تأثير الخوارزميات، مما يوفر تجربة أكثر تخصيصًا وتحكمًا.",
      "يعبر المستخدمون عن عدم رضاهم عن المواقع الحديثة التي تفتقر إلى دعم RSS، بينما يقترح آخرون أدوات ومشاريع لتحسين استخدام RSS.",
      "تتضمن المناقشة توصيات لمجموعة متنوعة من قراء ومعدات RSS، داعيةً للعودة إلى استخدام RSS من أجل تجربة ويب أكثر أصالة."
    ],
    "points": 214,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1737029912
  },
  {
    "id": 42718850,
    "title": "أوبن إيه آي تفشل في تقديم نظام الانسحاب للمصورين",
    "originLink": "https://petapixel.com/2025/01/06/openai-fails-to-deliver-opt-out-system-for-photographers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42718850",
    "commentBody": "",
    "originSummary": [
      "فشلت شركة OpenAI في تحقيق الموعد النهائي لعام 2025 لإطلاق Media Manager، وهي أداة مصممة لمساعدة المصورين على الانسحاب من استخدام أعمالهم في بيانات تدريب الذكاء الاصطناعي.",
      "كان الهدف من الأداة تحديد المحتوى المحمي بحقوق الطبع والنشر ومعالجة النزاعات المتعلقة بحقوق النشر، ولكن يبدو أنها لم تعد أولوية، حيث لم يتم تحديثها منذ أغسطس.",
      "يواجه المصورون حاليًا عملية مرهقة لتقديم كل عمل يرغبون في استبعاده، مما يؤدي إلى انتقادات بأن النظام غير عادل ومن غير المحتمل أن يتم اعتماده على نطاق واسع."
    ],
    "commentSummary": [
      "حاليًا، تفتقر OpenAI إلى نظام يسمح للمصورين بالانسحاب واستبعاد أعمالهم من مجموعات بيانات تدريب الذكاء الاصطناعي، مما يثير مخاوف بشأن حقوق المبدعين.",
      "يشير النقاد إلى أن شركات مثل OpenAI قد تقوم فقط بتنفيذ أنظمة الانسحاب إذا كان ذلك مطلوبًا قانونيًا، مشيرين إلى أوجه التشابه مع قضايا حقوق الطبع والنشر السابقة في صناعة الموسيقى.",
      "تتطلب العملية الحالية من المصورين تقديم أعمالهم بشكل فردي للاستبعاد، وهو ما يُعتبر عائقًا مرهقًا، مما قد يستلزم اتخاذ إجراءات قانونية لضمان احترام حقوق المبدعين."
    ],
    "points": 197,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1736984512
  },
  {
    "id": 42716072,
    "title": "dnSpyEx: مصحح أخطاء ومحرر تجميع لـ .NET",
    "originLink": "https://github.com/dnSpyEx/dnSpy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716072",
    "commentBody": "",
    "originSummary": [
      "dnSpyEx هو استمرار غير رسمي لمشروع dnSpy، حيث يوفر مصحح أخطاء ومحرر تجميعات .NET لتحرير وتصحيح تجميعات .NET وUnity بدون كود المصدر.",
      "تدعم الأداة تصحيح أخطاء تجميعات .NET Framework و.NET وألعاب Unity، وتشمل ميزات مثل تعيين نقاط التوقف، وتقييم التعبيرات، وتحرير البيانات الوصفية.",
      "أحدث إصدار مستقر وإصدارات بيتا متاحة على GitHub، ويستخدم مكتبات مفتوحة المصدر مثل ILSpy وRoslyn، المرخصة تحت GPLv3."
    ],
    "commentSummary": [
      "dnSpyEx هو مصحح أخطاء ومحرر تجميع لـ .NET، يتم الآن صيانته بواسطة electrokill بعد أن قام المؤلف الأصلي، d4d، بأرشفة مستودعاتهم. - إنه أداة مفتوحة المصدر تُستخدم لعكس .NET، وتحليل الثنائيات، وتصحيح الأخطاء، وتعديل الألعاب، وتحديث التطبيقات، مع ميزات مثل فك التجميع وتعيين نقاط التوقف على كود لغة الوسيط (IL) أثناء التشغيل. - يبرز التطوير المستمر لـ dnSpyEx مرونة واستدامة المشاريع مفتوحة المصدر، حتى بعد أرشفة النسخة الأصلية."
    ],
    "points": 191,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1736970884
  },
  {
    "id": 42725057,
    "title": "لا مليارديرات في FOSDEM",
    "originLink": "https://drewdevault.com/2025/01/16/2025-01-16-No-Billionares-at-FOSDEM-please.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725057",
    "commentBody": "",
    "originSummary": [
      "جاك دورسي، الرئيس التنفيذي السابق لتويتر، من المقرر أن يلقي كلمة رئيسية في FOSDEM، وهو حدث مهم لعشاق البرمجيات الحرة، بسبب رعاية شركته المتخصصة في البلوكشين. - على الرغم من ثروته الكبيرة وتاريخه المثير للجدل، بما في ذلك بيع تويتر لإيلون ماسك، فإن مشاركة دورسي أثارت انتقادات وخططًا لاعتصام احتجاجي خلال حديثه. - من المقرر أن يُنظم الاحتجاج في الساعة 11:45 صباحًا خارج المكان، مع تشجيع المشاركين المهتمين على التواصل مع المنظم عبر البريد الإلكتروني."
    ],
    "commentSummary": [
      "تتمحور الجدل حول ما إذا كان يجب على المليارديرات مثل جاك دورسي التحدث في FOSDEM، وهو حدث للبرمجيات الحرة والمفتوحة المصدر، بسبب ثروتهم ونفوذهم. - يشكك النقاد في أخلاقيات الثروة وتأثير منصات التواصل الاجتماعي المركزية، بينما يدافع آخرون عن مساهمات المليارديرات في التكنولوجيا والابتكار. - كما يستكشف النقاش الآراء المختلفة حول حرية التعبير ومدى ملاءمة أساليب الاحتجاج في مثل هذه الأحداث."
    ],
    "points": 183,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1737035370
  },
  {
    "id": 42721442,
    "title": "برنامج Tofino P4 من إنتل أصبح الآن مفتوح المصدر",
    "originLink": "https://p4.org/intels-tofino-p4-software-is-now-open-source/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42721442",
    "commentBody": "",
    "originSummary": [
      "قامت شركة إنتل بفتح مصدر برنامج Tofino P4 الخاص بها، والذي كان سابقًا ملكية خاصة، لتحويل الشبكات القابلة للبرمجة وتعزيز الابتكار داخل مجتمع P4. - تهدف هذه المبادرة إلى ديمقراطية الوصول إلى أدوات برمجة الشبكات المتقدمة، مما يفيد الشركات الناشئة والمؤسسات الأكاديمية والمطورين على مستوى العالم. - يمكن الوصول إلى الشيفرة المصدرية في هيكل p4lang، مع وجود مكونات في مستودعات p4c وopen-p4studio، مما يشجع على المساهمات والمشاركة المجتمعية."
    ],
    "commentSummary": [
      "قامت شركة إنتل بفتح مصدر برنامج Tofino P4 الخاص بها، بهدف دعم المجتمع على الرغم من توقف أجهزة Tofino.",
      "يُقدَّر هذا التحرك ولكنه يُعتبر متأخرًا، حيث إن المنصة تقترب من التقادم، مما يثير تساؤلات حول مدى أهمية P4 ومستقبل Tofino.",
      "الإصدار خطوة إيجابية، حيث يسمح بالاستمرار في استخدام الأجهزة الحالية وقد يلهم تطورات جديدة وموردي أجهزة."
    ],
    "points": 182,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1737003608
  }
]
