[
  {
    "id": 42717234,
    "title": "עשיתי את ההחלטה לפרק את הינדנבורג ריסרץ'",
    "originLink": "https://hindenburgresearch.com/gratitude/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42717234",
    "commentBody": "",
    "originSummary": [
      "הינדנבורג ריסרץ', הידועה באתגרי הונאה ושחיתות, מתפרקת כפי שהוכרז על ידי המייסד נייט אנדרסון. - ההחלטה להתפרק נובעת מרצונו של אנדרסון להקלה אישית ולשתף את שיטות החקירה שלהם עם הציבור על ידי פתיחת תהליך העבודה שלהם. - אנדרסון מביע תודה לצוות שלו, למשפחתו ולקוראים, ומדגיש את ההשפעה והתמיכה שקיבלו לאורך המסע שלהם."
    ],
    "commentSummary": [
      "מחקר הינדנבורג מתפרק, כאשר המייסד נייט אנדרסון מציין סיבות אישיות ורצון לשתף בפומבי את שיטות החקירה שלהם. - למרות הצלחתם בחשיפת הונאות כמו ניקולה מוטורס, אנדרסון מציין שאין איום ספציפי שגורם לסגירה. - אנדרסון מתכנן לשחרר חומרי לימוד כדי לעודד מאמצי חקירה דומים, בעוד הצוות המגוון יפנה למיזמים עצמאיים חדשים."
    ],
    "points": 711,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1736976235
  },
  {
    "id": 42725385,
    "title": "בלי שיחות",
    "originLink": "https://keygen.sh/blog/no-calls/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725385",
    "commentBody": "",
    "originSummary": [
      "זיק גבריאלס, מייסד Keygen, נמנע בתחילה משיחות מכירה בשל טבעו המופנם, והנהיג מדיניות 'ללא שיחות', שהובילה לאינטראקציות ישירות יותר ולמכירה הארגונית הראשונה שלו.",
      "גבּריאלס זיהה ארבעה נושאים מרכזיים שיש לטפל בהם כדי להצליח בגישה של 'ללא שיחות': הצעות לא ברורות, תהליך הצטרפות לקוי, תמחור מוסתר וחוסר אמון, והציע מסרים ברורים, תמחור שקוף, הצטרפות בשירות עצמי ותיעוד לבניית אמון.",
      "בעוד שחלק מהעסקים עדיין מצפים לשיחות, Keygen משתמשת בשיחות 'גילוי' קצרות כדי לעבור לדיונים במייל, וגבריאלס מעודד אחרים לשקול גישה של #ללאשיחות אם זה מתאים לסגנון שלהם."
    ],
    "commentSummary": [
      "הפוסט מבקר חברות שמחייבות שיחות טלפון לקבלת מידע בסיסי על מוצרים, ותומך בתקשורת מקוונת שקופה כדי לחסוך זמן ולהפחית תסכול.",
      "מרבית המגיבים מסכימים, ומציעים כי ישנן חברות שמשתמשות בשיחות טלפון כדי להסתיר מידע או לנקוט בטקטיקות מכירה מניפולטיביות.",
      "בעוד שיש הטוענים כי שיחות הן הכרחיות למכירות מורכבות בארגונים, הקונצנזוס הכללי מדגיש את החשיבות של שקיפות ותקשורת יעילה."
    ],
    "points": 588,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1737037051
  },
  {
    "id": 42724621,
    "title": "נינטנדו מכריזה על ה-Switch 2 [וידאו]",
    "originLink": "https://www.youtube.com/watch?v=itpcsQQvgAQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "נינטנדו הכריזה על ה-Switch 2, תוך הדגשת שיפורים הדרגתיים על פני שינויים רדיקליים, ושמירה על העיצוב ההיברידי שלה למשחק נייד ומחובר.",
      "שיפורים פוטנציאליים כוללים מסכי OLED ובקרים משופרים, במטרה להציע מפרטים ותכונות טובים יותר.",
      "ה-Switch 2 שואף לאזן בין חדשנות למוכרות, ולפנות הן למעריצים חדשים והן לקיימים על ידי התמקדות בחוויות משחק יציבות."
    ],
    "points": 498,
    "commentCount": 665,
    "retryCount": 0,
    "time": 1737032894
  },
  {
    "id": 42716440,
    "title": "ישראל וחמאס הגיעו להסכם הפסקת אש לסיום 15 חודשי מלחמה בעזה",
    "originLink": "https://www.reuters.com/world/middle-east/gaza-ceasefire-appears-close-us-egyptian-leaders-put-focus-coming-hours-2025-01-14/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716440",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ישראל וחמאס הסכימו על הפסקת אש, ובכך סיימו 15 חודשי סכסוך בעזה, מה שמסמן התפתחות משמעותית באזור.",
      "חששות נמשכים כי ייתכן שהתקשורת והפוליטיקאים במערב יכריזו בטרם עת על פתרון המשבר, תוך התעלמות מבעיות מתמשכות כמו הרס עזה וסיפוח הגדה המערבית.",
      "המצב נותר מורכב, עם דיונים על ביטחון, תביעות טריטוריאליות, וכיצד להשיג שלום בר-קיימא, המשקפים נקודות מבט שונות ודמיון עם סכסוכים גיאופוליטיים אחרים."
    ],
    "points": 439,
    "commentCount": 1076,
    "retryCount": 0,
    "time": 1736972809
  },
  {
    "id": 42715841,
    "title": "שוודיה מחזירה יותר ספרים ותרגול כתיבה ידנית לבתי הספר שלה (2023)",
    "originLink": "https://apnews.com/article/sweden-digital-education-backlash-reading-writing-1dd964c628f76361c43dbf3964f7dbf4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42715841",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "שוודיה מחזירה ספרים פיזיים ותרגול כתיבה ידנית בבתי הספר, ומשנה את הגישה החינוכית שהייתה דיגיטלית לחלוטין.",
      "ישנה הכרה גוברת ביתרונות הרגשיים והמוחשיים של ספרים פיזיים, למרות הנוחות של פורמטים דיגיטליים.",
      "הדיון המתמשך מתמקד במציאת שילוב מאוזן של כלים דיגיטליים ופיזיים בלמידה בחינוך."
    ],
    "points": 415,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1736969641
  },
  {
    "id": 42724761,
    "title": "מצגת פנימית של נוקיה לאחר השקת האייפון (2007) [pdf]",
    "originLink": "https://nokia-apple-iphone-was-launched-presentation.tiiny.site/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724761",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "מצגת פנימית של נוקיה לאחר השקת האייפון ב-2007 הכירה באיום מצד החדשנות של אפל, אך ההנהלה לא הצליחה להסתגל ביעילות.",
      "על אף שהיה לה כישרון חזק בתוכנה והנדסה, נוקיה זלזלה בחשיבות התוכנה, נשארה עם סימביאן והחמיצה הזדמנויות עם פלטפורמות מבוססות לינוקס כמו מיגו ומלטמי.",
      "בסופו של דבר, ההחלטה של נוקיה לתמוך ב-Windows Phone, שלא הצליחה להתחרות עם iOS ואנדרואיד, הדגישה את המאבק שלהם לעבור מאסטרטגיות ממוקדות חומרה לאסטרטגיות ממוקדות תוכנה, אתגר שעומד בפני ארגונים גדולים רבים המתמודדים עם חדשנות משבשת."
    ],
    "points": 361,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1737033812
  },
  {
    "id": 42716428,
    "title": "UnitedHealth גבתה יתר על המידה מחולי סרטן עבור תרופות ביותר מ-1,000%",
    "originLink": "https://fortune.com/2025/01/15/ftc-pbms-unitedhealth-brian-thompson-cvs-caremark-cigna-pharmacy-benefit-managers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716428",
    "commentBody": "",
    "originSummary": [
      "נמצא כי חברת יונייטדהלת' גבתה יתר על המידה מחולי סרטן מסוימים עבור תרופות ביותר מ-1,000%.",
      "יושבת ראש ה-FTC לינה קאן מתמקדת במנהלי הטבות בתי מרקחת גדולים, כולל OptumRx של UnitedHealth, Express Scripts של Cigna, ו-CVS Caremark Rx, כחלק מחקירה רחבה יותר."
    ],
    "commentSummary": [
      "יונייטדהלת' הואשמה בגביית יתר מחולי סרטן עבור תרופות ביותר מ-1,000%, תוך ניצול תפקידה הכפול כמבטחת וכמנהל הטבות תרופות (PBM).",
      "אנכית זו מאפשרת ל-UnitedHealth להעלות את מחירי התרופות, מה שמשפיע על הוצאות המטופלים ועוקף מגבלות רווח, מה שמעלה חששות לגבי העדפת רווחים על פני טיפול במטופלים.",
      "המצב מדגיש את המורכבות והיעדר השקיפות במערכת הבריאות, מה שמעורר קריאות לרפורמה רגולטורית כדי להתמודד עם עלויות עולות ואי-יעילות ולהתמקד ברווחת המטופלים."
    ],
    "points": 348,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1736972767
  },
  {
    "id": 42722756,
    "title": "בלו אוריג'ין מגיעה למסלול בטיסה הראשונה של רקטת ניו גלן הענקית שלה",
    "originLink": "https://arstechnica.com/space/2025/01/blue-origin-reaches-orbit-on-first-flight-of-its-titanic-new-glenn-rocket/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42722756",
    "commentBody": "",
    "originSummary": [
      "הרקטה ניו גלן של בלו אוריג'ין הגיעה בהצלחה למסלול בפעם הראשונה, מה שמסמן אבן דרך משמעותית עבור החברה. - השיגור התמודד עם אתגרים ראשוניים, כולל בעיות קירור מנוע וסירה תועה, אך בסופו של דבר השיג מהירות מסלולית של 28,800 קמ\"ש. - למרות שהמאיץ של השלב הראשון לא חזר לכדור הארץ, השיגור המוצלח מדגים את ההתקדמות של בלו אוריג'ין ואת ההשפעה של ההשקעות של ג'ף בזוס."
    ],
    "commentSummary": [
      "הרקטה ניו גלן של בלו אוריג'ין הגיעה בהצלחה למסלול בטיסתה הראשונה, מה שמסמן אבן דרך משמעותית עבור החברה.",
      "על אף שהשלב הראשון לא נחת בהצלחה, זה אופייני לניסיונות ראשוניים ולא מעיב על ההישג.",
      "הרקטה ניו גלן מציעה תמחור תחרותי לשיגורים ויכולת נשיאת מטען, מה שממצב אותה כמתחרה לחברות מבוססות כמו SpaceX ו-ULA (ברית השיגור המאוחדת)."
    ],
    "points": 323,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737015460
  },
  {
    "id": 42717165,
    "title": "סבילות פגמים פי 100: איך פתרנו את בעיית התפוקה",
    "originLink": "https://cerebras.ai/blog/100x-defect-tolerance-how-cerebras-solved-the-yield-problem",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42717165",
    "commentBody": "",
    "originSummary": [
      "Cerebras פיתחה שבב בקנה מידה של פרוסה, גדול משמעותית משבבים סטנדרטיים, על ידי חשיבה מחדש על הקשר בין גודל השבב לעמידות בפני תקלות. - מנוע בקנה מידה של פרוסה (WSE) כולל 970,000 ליבות קטנות ועמידות בפני תקלות וארכיטקטורת ניתוב מתוחכמת, ומשיג תשואות גבוהות וניצול סיליקון של 93%. - חידוש זה מדגים כי מחשוב בקנה מידה של פרוסה הוא בר-קיימא מסחרית, ומציע עמידות גבוהה יותר בפני פגמים בהשוואה ל-GPUs מסורתיים כמו ה-H100 של Nvidia."
    ],
    "commentSummary": [
      "Cerebras הציגה ארכיטקטורת ניתוב עמידה לתקלות בייצור שבבים, המאפשרת יצירת שבבים גדולים יותר על ידי שימוש בשטח השבב לניתוב במקום טרנזיסטורים, מה שעוזר לעקוף ליבות פגומות. - גישה חדשנית זו מנוגדת לשיטות המסורתיות שזורקות שבבים פגומים, שכן Cerebras משתמשת בשבב יחיד גדול בקנה מידה של וייפר עם יתירות מובנית לשמירה על פונקציונליות. - הפיתוח משמעותי בהקשר של בינה מלאכותית, שבה הדעות חלוקות על הפוטנציאל שלו, כאשר חלק רואים בו בועה ואחרים רואים בו פוטנציאל לשינוי תעשייתי."
    ],
    "points": 312,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1736975955
  },
  {
    "id": 42725147,
    "title": "נפנטס הוא מלכודת דבק ללכידת זוחלי רשת של בינה מלאכותית",
    "originLink": "https://zadzmo.org/code/nepenthes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725147",
    "commentBody": "",
    "originSummary": [
      "נפנתס הוא תוכנת מלכודת שנועדה ללכוד ולהרתיע זחלני רשת, במיוחד כאלה שאוספים נתונים עבור מודלים של שפה גדולה (LLMs), על ידי יצירת דפים אינסופיים ומחזוריים. - התוכנה יכולה ליצור עומס משמעותי על המעבד ומשמשת להגנה על תוכן אמיתי או להעמיס על מודלים של בינה מלאכותית עם נתונים לא רלוונטיים, מה שעשוי להשפיע על הנראות במנועי חיפוש. - אפשרויות ההתקנה כוללות שימוש ב-Docker או התקנה ידנית, עם ניהול תצורה באמצעות קובץ YAML, אך על המשתמשים לנקוט זהירות בשל הפוטנציאל שלה להיחשב כזדונית."
    ],
    "commentSummary": [
      "נפנטס הוא מלכודת זפת שנועדה ללכוד זחלני רשת של בינה מלאכותית, ובכך לנצל פגיעות אפשרית ב-API של ChatGPT שעלולה להוביל לבקשות HTTP מוגזמות ולמניעת שירות. - הפגיעות התעלמו ממנה ב-OpenAI ובמיקרוסופט, ודיווח עליה ל-OpenAI ול-BugCrowd התברר כקשה בשל חוסר התגובתיות שלהם. - המלכודת אינה מבדילה בין בינה מלאכותית לבין זחלני מנועי חיפוש לגיטימיים, מה שמציב סיכון לשניהם, ומדגיש את האתגרים בניהול זחלנים אגרסיביים ואת חוסר היעילות של פתרונות נוכחיים כמו robots.txt."
    ],
    "points": 278,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1737035863
  },
  {
    "id": 42724284,
    "title": "נטשתי את האלגוריתם לטובת RSS - וגם אתם צריכים",
    "originLink": "https://joeyehand.com/blog/2025/01/15/i-ditched-the-algorithm-for-rssand-you-should-too/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724284",
    "commentBody": "",
    "originSummary": [
      "המאמר תומך בשימוש ב-RSS (סינדיקציה פשוטה באמת) כחלופה לאלגוריתמים של מדיה חברתית, תוך הדגשת יכולתו לספק תוכן ללא פרסומות או הסחות דעת מיותרות.",
      "RSS מאפשר למשתמשים להירשם ישירות לאתרים המועדפים עליהם, כולל YouTube ו-Reddit, ומספק חוויית תוכן מותאמת אישית ומסודרת.",
      "קלות ההגדרה של עדכוני RSS וזמינותם של מחוללי עדכונים לאתרים ללא תמיכה מובנית ב-RSS הופכים אותו לכלי מעשי להישאר מעודכן ולחסוך זמן."
    ],
    "commentSummary": [
      "המאמר מדגיש את היתרונות של הזנות RSS, שמספקות תוכן ישירות ללא השפעת אלגוריתמים, ומציעות חוויה יותר מותאמת אישית ומבוקרת.",
      "משתמשים מביעים חוסר שביעות רצון מאתרים מודרניים שחסרים תמיכה ב-RSS, בעוד שאחרים מציעים כלים ופרויקטים לשיפור השימוש ב-RSS.",
      "הדיון כולל המלצות על קוראי RSS וכלים שונים, תוך תמיכה בחזרה ל-RSS לחוויית אינטרנט אותנטית יותר."
    ],
    "points": 214,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1737029912
  },
  {
    "id": 42718850,
    "title": "OpenAI לא מצליחה לספק מערכת ויתור לצלמים",
    "originLink": "https://petapixel.com/2025/01/06/openai-fails-to-deliver-opt-out-system-for-photographers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42718850",
    "commentBody": "",
    "originSummary": [
      "OpenAI החמיצה את המועד האחרון שלה לשנת 2025 לשחרור Media Manager, כלי שנועד לעזור לצלמים לבחור שלא להשתמש בעבודותיהם בנתוני אימון של בינה מלאכותית.",
      "הכלי נועד לזהות תוכן המוגן בזכויות יוצרים ולטפל במחלוקות על זכויות יוצרים, אך נראה כי הוא הוזנח, ללא עדכונים מאז אוגוסט.",
      "צלמים מתמודדים כיום עם תהליך מסורבל של הגשת כל עבודה שהם רוצים להחריג, מה שמוביל לביקורת שהמערכת אינה הוגנת ובלתי סבירה לאימוץ רחב."
    ],
    "commentSummary": [
      "נכון לעכשיו, ל-OpenAI אין מערכת לבחירה לא להשתתף עבור צלמים כדי להוציא את עבודותיהם ממאגרי נתונים לאימון בינה מלאכותית, מה שמעלה חששות לגבי זכויות היוצרים.",
      "מבקרים מציעים כי חברות כמו OpenAI עשויות ליישם מערכות של ויתור רק אם יידרשו לכך מבחינה חוקית, תוך השוואה לבעיות זכויות יוצרים בעבר בתעשיית המוזיקה.",
      "התהליך הקיים דורש מהצלמים להגיש באופן אישי עבודות להחרגה, מה שנחשב כמכשול מכביד, שעשוי לדרוש פעולה משפטית כדי להבטיח שכיבוד זכויות היוצרים."
    ],
    "points": 197,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1736984512
  },
  {
    "id": 42716072,
    "title": "dnSpyEx: מנפה שגיאות ועורך אסמבלר עבור .NET",
    "originLink": "https://github.com/dnSpyEx/dnSpy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716072",
    "commentBody": "",
    "originSummary": [
      "dnSpyEx הוא המשך לא רשמי של פרויקט dnSpy, המספק מנפה שגיאות ועורך אסמבליות .NET לעריכה וניפוי שגיאות של אסמבליות .NET ו-Unity ללא קוד מקור.",
      "הכלי תומך בניפוי שגיאות של .NET Framework, .NET, והרכבות משחקי Unity, וכולל תכונות כמו הגדרת נקודות עצירה, הערכת ביטויים ועריכת מטא-נתונים.",
      "הגרסה היציבה האחרונה והבניות הבטא זמינות ב-GitHub, והיא משתמשת בספריות קוד פתוח כמו ILSpy ו-Roslyn, המורשות תחת GPLv3."
    ],
    "commentSummary": [
      "dnSpyEx הוא מנפה שגיאות ועורך אסמבליות של .NET, המנוהל כעת על ידי electrokill לאחר שהמחבר המקורי, d4d, ארכב את המאגרים שלהם. - זהו כלי קוד פתוח המשמש להיפוך .NET, ניתוח בינארי, ניפוי שגיאות, מודינג של משחקים ותיקון יישומים, עם תכונות כמו דה-קומפילציה והגדרת נקודות עצירה על קוד שפת ביניים (IL) בזמן ריצה. - הפיתוח המתמשך של dnSpyEx מדגיש את החוסן והקיימות של פרויקטים בקוד פתוח, אפילו לאחר שהגרסה המקורית אורכבה."
    ],
    "points": 191,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1736970884
  },
  {
    "id": 42725057,
    "title": "בלי מיליארדרים ב-FOSDEM",
    "originLink": "https://drewdevault.com/2025/01/16/2025-01-16-No-Billionares-at-FOSDEM-please.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725057",
    "commentBody": "",
    "originSummary": [
      "ג'ק דורסי, מנכ\"ל טוויטר לשעבר, מתוכנן לשאת נאום מרכזי ב-FOSDEM, אירוע משמעותי לחובבי תוכנה חופשית, בשל חסות של חברת הבלוקצ'יין שלו. - למרות הונו הרב וההיסטוריה השנויה במחלוקת שלו, כולל מכירת טוויטר לאילון מאסק, השתתפותו של דורסי עוררה ביקורת ותוכניות למחאת ישיבה במהלך נאומו. - המחאה מתוכננת להתקיים בשעה 11:45 מחוץ למקום האירוע, כאשר משתתפים מעוניינים מעודדים ליצור קשר עם המארגן דרך דואר אלקטרוני."
    ],
    "commentSummary": [
      "המחלוקת מתמקדת בשאלה האם מיליארדרים כמו ג'ק דורסי צריכים לנאום ב-FOSDEM, אירוע תוכנה חופשית וקוד פתוח, בשל עושרם והשפעתם. - המבקרים מעלים שאלות על האתיקה של עושר ועל ההשפעה של פלטפורמות מדיה חברתית מרוכזות, בעוד אחרים מגנים על תרומות המיליארדרים לטכנולוגיה ולחדשנות. - הדיון גם חוקר דעות שונות על חופש הביטוי וההתאמה של טקטיקות מחאה באירועים כאלה."
    ],
    "points": 183,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1737035370
  },
  {
    "id": 42721442,
    "title": "Intel's Tofino P4 Software Is Now Open Source",
    "originLink": "https://p4.org/intels-tofino-p4-software-is-now-open-source/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42721442",
    "commentBody": "",
    "originSummary": [
      "אינטל הפכה את תוכנת Tofino P4 שלה לקוד פתוח, לאחר שהייתה קניינית, במטרה לשנות רשתות ניתנות לתכנות ולעודד חדשנות בתוך קהילת P4. - יוזמה זו מנגישה כלים מתקדמים לתכנות רשתות, ומועילה לסטארטאפים, מוסדות אקדמיים ומפתחים ברחבי העולם. - קוד המקור נגיש במבנה p4lang, עם רכיבים במאגרים p4c ו-open-p4studio, מה שמעודד תרומות ומעורבות קהילתית."
    ],
    "commentSummary": [
      "אינטל פתחה את קוד המקור של תוכנת Tofino P4 שלה, במטרה לתמוך בקהילה למרות שהחומרה של Tofino הופסקה.",
      "מהלך זה מוערך אך נחשב למאוחר מדי, שכן הפלטפורמה מתקרבת להתיישנות, מה שמעלה שאלות לגבי הרלוונטיות של P4 ועתידו של Tofino.",
      "השחרור הוא צעד חיובי, המאפשר המשך שימוש בחומרה קיימת וייתכן שייתן השראה לפיתוחים חדשים ולספקי חומרה."
    ],
    "points": 182,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1737003608
  }
]
