[
  {
    "id": 42717234,
    "title": "Karar verdim, Hindenburg Research'i dağıtıyorum.",
    "originLink": "https://hindenburgresearch.com/gratitude/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42717234",
    "commentBody": "",
    "originSummary": [
      "Hindenburg Research, dolandırıcılık ve yolsuzlukla mücadele etmesiyle tanınan, kurucu Nate Anderson tarafından açıklandığı üzere dağılıyor. - Dağılma kararı, Anderson'un kişisel rahatlama isteği ve araştırma yöntemlerini kamuoyuyla paylaşmak için süreçlerini açık kaynak haline getirme isteğiyle yönlendiriliyor. - Anderson, yolculukları boyunca aldıkları etki ve destekleri vurgulayarak ekibine, ailesine ve okuyucularına minnettarlığını ifade ediyor."
    ],
    "commentSummary": [
      "Hindenburg Research, kurucusu Nate Anderson'un kişisel nedenler ve araştırma yöntemlerini kamuoyuyla paylaşma isteği nedeniyle dağılıyor. - Nikola Motors gibi sahtekarlıkları ortaya çıkarmadaki başarılarına rağmen, Anderson kapanışa neden olan belirli bir tehdit olmadığını belirtiyor. - Anderson, benzer araştırma çabalarını teşvik etmek için eğitici materyaller yayınlamayı planlarken, çeşitli ekip yeni bağımsız girişimlere yönelecek."
    ],
    "points": 711,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1736976235
  },
  {
    "id": 42725385,
    "title": "Arama Yok",
    "originLink": "https://keygen.sh/blog/no-calls/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725385",
    "commentBody": "",
    "originSummary": [
      "Keygen'in kurucusu Zeke Gabrielse, içe dönük yapısı nedeniyle başlangıçta satış görüşmelerinden kaçındı ve daha doğrudan etkileşimlere ve ilk kurumsal satışına yol açan bir 'görüşme yok' politikası uyguladı.",
      "Gabrielse, başarılı bir 'çağrısız' yaklaşım için ele alınması gereken dört ana sorunu belirledi: belirsiz teklifler, zayıf işe alım süreci, gizli fiyatlandırma ve güven eksikliği. Açık mesajlaşma, şeffaf fiyatlandırma, kendi kendine hizmet veren işe alım ve güven oluşturucu belgeler önerdi.",
      "Bazı işletmeler hala aramalar beklerken, Keygen e-posta tartışmalarına geçiş yapmak için kısa 'keşif aramaları' kullanıyor ve Gabrielse, tarzlarına uyuyorsa başkalarını da #aramayok yaklaşımını düşünmeye teşvik ediyor."
    ],
    "commentSummary": [
      "Metin, temel ürün bilgileri için telefon görüşmelerini zorunlu kılan şirketleri eleştiriyor ve zaman tasarrufu sağlamak ve hayal kırıklığını azaltmak için şeffaf çevrimiçi iletişimi savunuyor.",
      "Yorumcular büyük ölçüde hemfikir, bazı şirketlerin bilgileri gizlemek veya manipülatif satış taktikleri kullanmak için telefon görüşmelerini kullandığını öne sürüyorlar.",
      "Kimileri karmaşık kurumsal satışlar için aramaların gerekli olduğunu savunsa da, genel kanı şeffaflık ve etkili iletişimin önemini vurgulamaktadır."
    ],
    "points": 588,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1737037051
  },
  {
    "id": 42724621,
    "title": "Nintendo, Switch 2'yi duyurdu [video]",
    "originLink": "https://www.youtube.com/watch?v=itpcsQQvgAQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Nintendo, hem taşınabilir hem de yerleştirilmiş oyun için hibrit tasarımını koruyarak, köklü değişiklikler yerine kademeli iyileştirmelere vurgu yaparak Switch 2'yi duyurdu.",
      "Potansiyel iyileştirmeler, daha iyi özellikler ve özellikler sunmayı hedefleyen OLED ekranlar ve geliştirilmiş kontrol cihazlarını içermektedir.",
      "Switch 2, yenilik ile aşinalığı dengelemeye çalışarak, hem yeni hem de mevcut hayranlara hitap etmek için istikrarlı oyun deneyimlerine odaklanıyor."
    ],
    "points": 498,
    "commentCount": 665,
    "retryCount": 0,
    "time": 1737032894
  },
  {
    "id": 42716440,
    "title": "İsrail, Hamas ile Gazze'de 15 aylık savaşı sona erdirmek için ateşkes anlaşmasına vardı.",
    "originLink": "https://www.reuters.com/world/middle-east/gaza-ceasefire-appears-close-us-egyptian-leaders-put-focus-coming-hours-2025-01-14/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716440",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "İsrail ve Hamas, Gazze'de 15 aylık çatışmayı sona erdiren bir ateşkes üzerinde anlaştı, bu da bölgede önemli bir gelişmeyi işaret ediyor.",
      "Batı medyası ve politikacıların krizin çözüldüğünü erken ilan edebileceği, Gazze'nin yıkımı ve Batı Şeria'nın ilhakı gibi devam eden sorunları göz ardı edebileceği endişeleri sürüyor.",
      "Durum karmaşık olmaya devam ediyor, güvenlik, toprak iddiaları ve kalıcı barışın nasıl sağlanacağı konusundaki tartışmalar, farklı bakış açılarını ve diğer jeopolitik çatışmalarla olan paralellikleri yansıtıyor."
    ],
    "points": 439,
    "commentCount": 1076,
    "retryCount": 0,
    "time": 1736972809
  },
  {
    "id": 42715841,
    "title": "İsveç, okullarına daha fazla kitap ve el yazısı pratiği geri getiriyor (2023)",
    "originLink": "https://apnews.com/article/sweden-digital-education-backlash-reading-writing-1dd964c628f76361c43dbf3964f7dbf4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42715841",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "İsveç, tamamen dijital bir eğitim yaklaşımından fiziksel kitaplar ve el yazısı pratiğini okullara yeniden dahil ediyor.",
      "Fiziksel kitapların duygusal ve dokunsal faydalarının, dijital formatların sağladığı kolaylığa rağmen giderek daha fazla kabul gördüğü bir gerçektir.",
      "Devam eden tartışma, eğitimde dijital ve fiziksel öğrenme araçlarının dengeli bir entegrasyonunu bulmaya odaklanıyor."
    ],
    "points": 415,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1736969641
  },
  {
    "id": 42724761,
    "title": "Nokia'nın iPhone piyasaya sürüldükten sonraki iç sunumu (2007) [pdf]",
    "originLink": "https://nokia-apple-iphone-was-launched-presentation.tiiny.site/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724761",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Nokia'nın 2007'de iPhone lansmanından sonra yaptığı iç sunum, Apple'ın yeniliğinden gelen tehdidi kabul etti, ancak yönetim etkili bir şekilde uyum sağlayamadı.",
      "Nokia, güçlü yazılım ve mühendislik yeteneğine sahip olmasına rağmen, yazılımın önemini hafife aldı, Symbian'a bağlı kaldı ve Meego ve Meltemi gibi Linux tabanlı platformlarla fırsatları kaçırdı.",
      "Nihayetinde, Nokia'nın iOS ve Android ile rekabet edemeyen Windows Phone'u destekleme kararı, donanımdan yazılım odaklı stratejilere geçişte yaşadıkları zorlukları vurguladı; bu, yıkıcı yeniliklerle karşı karşıya kalan birçok büyük organizasyon için bir meydan okumaydı."
    ],
    "points": 361,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1737033812
  },
  {
    "id": 42716428,
    "title": "UnitedHealth, kanser hastalarına ilaçlar için %1,000'den fazla fazla ücret aldı.",
    "originLink": "https://fortune.com/2025/01/15/ftc-pbms-unitedhealth-brian-thompson-cvs-caremark-cigna-pharmacy-benefit-managers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716428",
    "commentBody": "",
    "originSummary": [
      "UnitedHealth'in bazı kanser hastalarına ilaçlar için %1,000'den fazla fazla ücret aldığı ortaya çıktı.",
      "FTC Başkanı Lina Khan, daha geniş kapsamlı bir soruşturmanın parçası olarak UnitedHealth'in OptumRx, Cigna'nın Express Scripts ve CVS Caremark Rx dahil olmak üzere büyük eczane fayda yöneticilerine odaklanıyor."
    ],
    "commentSummary": [
      "UnitedHealth, sigortacı ve eczane fayda yöneticisi (PBM) olarak çift rolünü kullanarak kanser hastalarına ilaçlar için %1,000'den fazla fazla ücretlendirme yapmakla suçlandı.",
      "Bu dikey entegrasyon, UnitedHealth'in ilaç fiyatlarını şişirmesine olanak tanıyarak hasta masraflarını etkiler ve kâr sınırlamalarını aşarak, hasta bakımından ziyade kârın önceliklendirildiği endişelerini artırır.",
      "Durum, sağlık sistemindeki karmaşıklığı ve şeffaflık eksikliğini vurguluyor, artan maliyetler ve verimsizliklerle başa çıkmak ve hasta refahına odaklanmak için düzenleyici reform çağrılarını tetikliyor."
    ],
    "points": 348,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1736972767
  },
  {
    "id": 42722756,
    "title": "Blue Origin, devasa New Glenn roketinin ilk uçuşunda yörüngeye ulaştı.",
    "originLink": "https://arstechnica.com/space/2025/01/blue-origin-reaches-orbit-on-first-flight-of-its-titanic-new-glenn-rocket/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42722756",
    "commentBody": "",
    "originSummary": [
      "Blue Origin'in New Glenn roketi, şirket için önemli bir dönüm noktası olan ilk kez yörüngeye başarıyla ulaştı. - Fırlatma, motor soğutma sorunları ve yoldan çıkan bir tekne gibi başlangıç zorluklarıyla karşılaştı, ancak sonunda 28.800 km/s'lik bir yörünge hızına ulaştı. - İlk aşama güçlendiricisi Dünya'ya geri dönmese de, başarılı fırlatma Blue Origin'in ilerlemesini ve Jeff Bezos'un yatırımlarının etkisini gösteriyor."
    ],
    "commentSummary": [
      "Blue Origin'in New Glenn roketi, ilk uçuşunda başarıyla yörüngeye ulaştı ve şirket için önemli bir dönüm noktasını işaret etti.",
      "İlk aşama başarılı bir şekilde iniş yapmasa da, bu durum ilk denemeler için tipiktir ve başarıyı gölgede bırakmaz.",
      "New Glenn roketi, rekabetçi fırlatma fiyatları ve yük kapasitesi sunarak, SpaceX ve ULA (United Launch Alliance) gibi köklü şirketlere rakip olarak konumlanıyor."
    ],
    "points": 323,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737015460
  },
  {
    "id": 42717165,
    "title": "100x hata toleransı: Verimlilik sorununu nasıl çözdük",
    "originLink": "https://cerebras.ai/blog/100x-defect-tolerance-how-cerebras-solved-the-yield-problem",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42717165",
    "commentBody": "",
    "originSummary": [
      "Cerebras, çip boyutu ile hata toleransı arasındaki ilişkiyi yeniden tasarlayarak standart çiplerden önemli ölçüde daha büyük bir wafer ölçekli çip geliştirdi. - Wafer Scale Engine (WSE), 970.000 küçük, hata toleranslı çekirdek ve sofistike bir yönlendirme mimarisi içerir, yüksek verim ve %93 silikon kullanımı sağlar. - Bu yenilik, wafer ölçekli hesaplamanın ticari olarak uygulanabilir olduğunu gösterir ve Nvidia'nın H100 gibi geleneksel GPU'lara kıyasla daha büyük bir kusur toleransı sunar."
    ],
    "commentSummary": [
      "Cerebras, çip üretiminde hata toleranslı bir yönlendirme mimarisi tanıttı ve bu sayede daha büyük çipler üretmek için transistörler yerine yönlendirme için kalıp alanı kullanarak arızalı çekirdekleri atlamayı sağladı. - Bu yenilikçi yaklaşım, arızalı çipleri atan geleneksel yöntemlerle tezat oluşturuyor, çünkü Cerebras, işlevselliği sürdürmek için yerleşik yedekliliğe sahip tek bir büyük wafer ölçekli çip kullanıyor. - Bu gelişme, potansiyeli konusunda görüşlerin bölündüğü AI bağlamında önemlidir; bazıları bunu bir balon olarak görürken, diğerleri endüstriyi dönüştürücü potansiyel olarak görüyor."
    ],
    "points": 312,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1736975955
  },
  {
    "id": 42725147,
    "title": "Nepenthes, yapay zeka web tarayıcılarını yakalamak için bir tuzak çukurudur.",
    "originLink": "https://zadzmo.org/code/nepenthes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725147",
    "commentBody": "",
    "originSummary": [
      "Nepenthes, özellikle Büyük Dil Modelleri (LLM'ler) için veri toplayan web tarayıcılarını tuzağa düşürmek ve caydırmak amacıyla tasarlanmış bir tuzak yazılımıdır ve sonsuz, döngüsel sayfalar oluşturarak çalışır. - Yazılım, önemli ölçüde CPU yükü oluşturabilir ve gerçek içeriği korumak veya yapay zeka modellerini alakasız verilerle bunaltmak için kullanılır, bu da arama motoru görünürlüğünü potansiyel olarak etkileyebilir. - Kurulum seçenekleri arasında Docker veya manuel kurulum bulunur ve yapılandırma bir YAML dosyası aracılığıyla yönetilir, ancak kullanıcılar, kötü niyetli olarak değerlendirilebileceği için dikkatli olmalıdır."
    ],
    "commentSummary": [
      "TEXT: Nepenthes, AI web tarayıcılarını tuzağa düşürmek için tasarlanmış bir zift çukuru olup, ChatGPT API'sinde aşırı HTTP isteklerine ve hizmet reddine yol açabilecek bir güvenlik açığını potansiyel olarak istismar edebilir. - Bu güvenlik açığı OpenAI ve Microsoft tarafından göz ardı edilmiştir ve OpenAI ve BugCrowd'a bildirilmesi, yanıt vermemeleri nedeniyle zor olmuştur. - Zift çukuru, AI ve meşru arama motoru tarayıcıları arasında ayrım yapmaz, her ikisi için de risk oluşturur ve agresif tarayıcıları yönetmedeki zorlukları ve robots.txt gibi mevcut çözümlerin etkisizliğini vurgular."
    ],
    "points": 278,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1737035863
  },
  {
    "id": 42724284,
    "title": "Algoritmayı Bıraktım ve RSS'e Geçtim - Siz de Geçmelisiniz",
    "originLink": "https://joeyehand.com/blog/2025/01/15/i-ditched-the-algorithm-for-rssand-you-should-too/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42724284",
    "commentBody": "",
    "originSummary": [
      "Makale, içerikleri reklamsız veya gereksiz dikkat dağıtıcı unsurlar olmadan sunma yeteneğini vurgulayarak, sosyal medya algoritmalarına alternatif olarak RSS (Gerçekten Basit Dağıtım) kullanımını savunuyor.",
      "RSS, kullanıcıların YouTube ve Reddit dahil olmak üzere favori web sitelerine doğrudan abone olmalarına olanak tanır ve bu da daha düzenli ve kişiselleştirilmiş bir içerik deneyimi sunar.",
      "RSS beslemelerinin kurulmasının kolaylığı ve yerel RSS desteği olmayan siteler için besleme oluşturucuların bulunabilirliği, onu bilgilenmek ve zaman kazanmak için pratik bir araç haline getiriyor."
    ],
    "commentSummary": [
      "Makale, içeriği doğrudan algoritmaların etkisi olmadan sunan RSS beslemelerinin avantajlarını vurguluyor ve daha kişiselleştirilmiş ve kontrollü bir deneyim sunuyor.",
      "Kullanıcılar, RSS desteği olmayan modern web sitelerinden memnuniyetsizliklerini dile getirirken, diğerleri RSS kullanımını iyileştirmek için araçlar ve projeler öneriyor.",
      "Bu tartışma, daha gerçek bir web deneyimi için RSS'ye dönüşü savunarak çeşitli RSS okuyucuları ve araçları için öneriler içermektedir."
    ],
    "points": 214,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1737029912
  },
  {
    "id": 42718850,
    "title": "OpenAI, fotoğrafçılar için vazgeçme sistemini sunmada başarısız oluyor",
    "originLink": "https://petapixel.com/2025/01/06/openai-fails-to-deliver-opt-out-system-for-photographers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42718850",
    "commentBody": "",
    "originSummary": [
      "OpenAI, fotoğrafçıların çalışmalarının yapay zeka eğitim verilerinde kullanılmaması için tasarlanan bir araç olan Media Manager'ı piyasaya sürme konusunda 2025 son tarihini kaçırdı.",
      "Bu araç, telif hakkıyla korunan içeriği tanımlamayı ve telif hakkı anlaşmazlıklarını çözmeyi amaçlıyordu, ancak Ağustos ayından bu yana güncelleme yapılmadığı için önceliği düşürülmüş gibi görünüyor.",
      "Fotoğrafçılar şu anda hariç tutulmasını istedikleri her çalışmayı sunma konusunda zahmetli bir süreçle karşı karşıya kalıyorlar, bu da sistemin adil olmadığı ve yaygın olarak benimsenmesinin olası olmadığı yönünde eleştirilere yol açıyor."
    ],
    "commentSummary": [
      "OpenAI, fotoğrafçıların çalışmalarını yapay zeka eğitim veri setlerinden hariç tutmaları için bir vazgeçme sistemine şu anda sahip değil, bu da yaratıcıların hakları konusunda endişelere yol açıyor.",
      "Eleştirmenler, OpenAI gibi şirketlerin yalnızca yasal olarak zorunlu kılındığında vazgeçme sistemlerini uygulayabileceğini öne sürerek, müzik endüstrisindeki geçmiş telif hakkı sorunlarıyla paralellikler kuruyor.",
      "Mevcut süreç, fotoğrafçıların eserlerini hariç tutmak için bireysel olarak sunmalarını gerektiriyor, bu da hantal bir caydırıcı olarak görülüyor ve muhtemelen yaratıcıların haklarının korunmasını sağlamak için yasal işlem gerektirebilir."
    ],
    "points": 197,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1736984512
  },
  {
    "id": 42716072,
    "title": "dnSpyEx: .NET hata ayıklayıcı ve montaj düzenleyici",
    "originLink": "https://github.com/dnSpyEx/dnSpy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42716072",
    "commentBody": "",
    "originSummary": [
      "dnSpyEx, dnSpy projesinin resmi olmayan bir devamıdır ve kaynak kod olmadan .NET ve Unity derlemelerini düzenlemek ve hata ayıklamak için bir hata ayıklayıcı ve .NET derleme düzenleyicisi sağlar.",
      "Bu araç, .NET Framework, .NET ve Unity oyun derlemelerinin hata ayıklamasını destekler ve kesme noktaları ayarlama, ifadeleri değerlendirme ve meta veri düzenleme gibi özellikler içerir.",
      "En son kararlı sürüm ve beta yapıları GitHub'da mevcuttur ve GPLv3 lisansı altında ILSpy ve Roslyn gibi açık kaynaklı kütüphaneler kullanır."
    ],
    "commentSummary": [
      "dnSpyEx, d4d adlı orijinal yazarın depolarını arşivlemesinin ardından electrokill tarafından sürdürülen bir .NET hata ayıklayıcı ve montaj düzenleyicisidir. - .NET tersine mühendislik, ikili analiz, hata ayıklama, oyun modlama ve uygulama yaması gibi işlemler için kullanılan açık kaynaklı bir araçtır ve çalışma zamanı Ara Dil (IL) kodunda derleme ve kesme noktaları ayarlama gibi özelliklere sahiptir. - dnSpyEx'in devam eden geliştirilmesi, orijinal sürüm arşivlendikten sonra bile açık kaynak projelerinin dayanıklılığını ve sürdürülebilirliğini vurgulamaktadır."
    ],
    "points": 191,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1736970884
  },
  {
    "id": 42725057,
    "title": "FOSDEM'de Milyarder Yok",
    "originLink": "https://drewdevault.com/2025/01/16/2025-01-16-No-Billionares-at-FOSDEM-please.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42725057",
    "commentBody": "",
    "originSummary": [
      "Jack Dorsey, Twitter'ın eski CEO'su, blockchain şirketinin sponsorluğu nedeniyle özgür yazılım meraklıları için önemli bir etkinlik olan FOSDEM'de bir açılış konuşması yapması planlanıyor. - Dorsey'in önemli net serveti ve Elon Musk'a Twitter'ı satışı da dahil olmak üzere tartışmalı geçmişine rağmen, katılımı eleştirilere yol açtı ve konuşması sırasında bir protesto oturma eylemi planlandı. - Protesto, saat 11:45'te mekanın dışında gerçekleşecek şekilde organize edildi ve ilgilenen katılımcıların organizatörle e-posta yoluyla iletişime geçmeleri teşvik ediliyor."
    ],
    "commentSummary": [
      "Anlaşmazlık, Jack Dorsey gibi milyarderlerin servetleri ve etkileri nedeniyle ücretsiz ve açık kaynaklı bir yazılım etkinliği olan FOSDEM'de konuşup konuşmaması gerektiği etrafında dönüyor. - Eleştirmenler, servetin etiğini ve merkezi sosyal medya platformlarının etkisini sorgularken, diğerleri milyarderlerin teknoloji ve yeniliklere katkılarını savunuyor. - Tartışma ayrıca, bu tür etkinliklerde ifade özgürlüğü ve protesto taktiklerinin uygunluğu konusundaki farklı görüşleri de araştırıyor."
    ],
    "points": 183,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1737035370
  },
  {
    "id": 42721442,
    "title": "Intel'in Tofino P4 Yazılımı Artık Açık Kaynak",
    "originLink": "https://p4.org/intels-tofino-p4-software-is-now-open-source/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42721442",
    "commentBody": "",
    "originSummary": [
      "Intel, daha önce tescilli olan Tofino P4 yazılımını açık kaynak haline getirerek programlanabilir ağları dönüştürmeyi ve P4 topluluğu içinde yeniliği teşvik etmeyi amaçlıyor. - Bu girişim, gelişmiş ağ programlama araçlarına erişimi demokratikleştirerek dünya genelindeki girişimlere, akademik kurumlara ve geliştiricilere fayda sağlıyor. - Kaynak kodu, p4c ve open-p4studio depolarındaki bileşenlerle birlikte p4lang yapısında erişilebilir olup, katkıları ve topluluk katılımını teşvik ediyor."
    ],
    "commentSummary": [
      "Intel, Tofino donanımı durdurulmuş olmasına rağmen topluluğu desteklemeyi amaçlayarak Tofino P4 yazılımını açık kaynaklı hale getirdi.",
      "Bu hamle takdir edilmekle birlikte gecikmiş olarak değerlendiriliyor, çünkü platform eskimeye yaklaşıyor ve bu durum P4 ve Tofino'nun geleceği hakkında sorular ortaya çıkarıyor.",
      "Yayın, mevcut donanımın kullanılmaya devam edilmesine olanak tanıyan ve potansiyel olarak yeni gelişmeleri ve donanım satıcılarını teşvik eden olumlu bir adımdır."
    ],
    "points": 182,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1737003608
  }
]
