[
  {
    "id": 42655870,
    "title": "Ik heb een nieuwe superkracht verworven",
    "originLink": "https://danielwirtz.com/blog/spot-the-difference-superpower",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42655870",
    "commentBody": "",
    "originSummary": [
      "Een Reddit-gebruiker ontdekte een techniek om gemakkelijk verschillen in 'zoek-de-verschillen'-puzzels te zien door hun ogen te kruisen om een derde, glinsterend beeld te creëren.",
      "Deze methode maakt verschillen duidelijker, en de gebruiker voelde het alsof hij een nieuwe vaardigheid of 'superkracht' verwierf na het oefenen.",
      "De gebruiker deelde deze techniek met anderen en moedigde hen aan om het te proberen door zich te concentreren op het middelste beeld dat ontstaat wanneer ze hun ogen kruisen."
    ],
    "commentSummary": [
      "Een techniek om verschillen tussen twee afbeeldingen te ontdekken door de ogen te kruisen, vergelijkbaar met het bekijken van stereogrammen, werd gebruikt om een hoge score op een speelautomaat te behalen en een gratis barrekening te winnen.",
      "Deze methode benadrukt verschillen als glinsterende of onstabiele gebieden, wat discussies op gang brengt over de toepassingen en uitdagingen ervan, waaronder oogvermoeidheid en problemen met het zicht.",
      "Het gesprek breidde zich uit naar verwante onderwerpen zoals stereoscopisch zicht en het gebruik van soortgelijke technieken in verschillende vakgebieden."
    ],
    "points": 365,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1736519674
  },
  {
    "id": 42652577,
    "title": "Alle ISBNs visualiseren",
    "originLink": "https://annas-archive.org/blog/all-isbns.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42652577",
    "commentBody": "",
    "originSummary": [
      "Anna's Archive, det største åpne biblioteket, har visualisert alle ISBN-er for å spore fremdriften av bokkopieringer, og avslører at kun 16 % av bøkene er sikkerhetskopiert så langt.",
      "Er er en dusør på $10 000 for å forbedre visualiseringens zoombarhet, interaktivitet og brukervennlighet, med premier til de tre beste bidragene, og all kode må være åpen kildekode.",
      "Dit initiatief is cruciaal voor het behoud van zeldzame boeken, aangezien Anna's Archief de grootste open collectie van boekmetadata bevat."
    ],
    "commentSummary": [
      "De diskusjon på Hacker News dreier seg om å visualisere ISBN-er (International Standard Book Numbers) fra Annas arkiv, med forslag som å bruke en Hilbert-kurve for bedre datarepresentasjon.",
      "Gebruikers debatteren over de effectiviteit van ISBN's voor hiërarchische datavisualisatie en stellen alternatieven voor, zoals het Library of Congress-systeem.",
      "Het gesprek behandelt ook de legaliteit en ethiek van Anna's Archief, dat auteursrechtelijk beschermd materiaal host, en het gebruik van Monero-cryptovaluta voor beloningen vanwege privacyzorgen."
    ],
    "points": 289,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1736484355
  },
  {
    "id": 42651275,
    "title": "Voorspellingsscorekaart, 2025 januari 01",
    "originLink": "https://rodneybrooks.com/predictions-scorecard-2025-january-01/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42651275",
    "commentBody": "",
    "originSummary": [
      "De auteur geeft een jaarlijkse update over voorspellingen die in 2018 zijn gedaan over zelfrijdende auto's, robotica, AI, machine learning en menselijke ruimtevaart, met plannen om nieuwe voorspellingen te doen voor 2026-2036.",
      "Ondanks betydelige fremskritt innen AI og selvkjørende biler i 2024, forblir full autonomi og erstatning av menneskelige jobber med AI fjernt, med fjernovervåking av mennesker fortsatt nødvendig for selvkjørende biler.",
      "De vooruitgang in bemande ruimtevaart verloopt traag, met vertragingen bij SpaceX's Starship en NASA's Artemis, terwijl Blue Origin's New Glenn bijna klaar is voor lancering, en suborbitale toerisme weinig vooruitgang laat zien."
    ],
    "commentSummary": [
      "Het artikel onderzoekt de voorspellingen van Rodney Brooks over AI en robotica, met name met betrekking tot zelfrijdende auto's en AI-vooruitgang. - Critici beweren dat Brooks' voorspellingen vaag en zelfvoldaan zijn, vooral met betrekking tot Waymo's zelfrijdende technologie, die volgens sommigen niet volledig autonoom is vanwege menselijke interventies. - Brooks streeft ernaar de hype rond AI en robotica te temperen door realistische tijdlijnen en uitdagingen te benadrukken, terwijl de discussie ook de economische haalbaarheid van zelfrijdende technologie en de impact ervan op banen in overweging neemt."
    ],
    "points": 224,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1736468875
  }
]
