[
  {
    "id": 42655870,
    "title": "நான் ஒரு புதிய அதிசய சக்தியை பெற்றுள்ளேன்",
    "originLink": "https://danielwirtz.com/blog/spot-the-difference-superpower",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42655870",
    "commentBody": "",
    "originSummary": [
      "ஒரு ரெடிட் பயனர், \"வேறுபாடுகளை கண்டுபிடி\" புதிர்களில் வேறுபாடுகளை எளிதாக கண்டுபிடிக்க ஒரு நுட்பத்தை கண்டுபிடித்தார், இது அவர்களின் கண்களை குறுக்கி மூன்றாவது, மினுங்கும் படத்தை உருவாக்குவதன் மூலம் செய்யப்படுகிறது.",
      "இந்த முறை வேறுபாடுகளை மேலும் தெளிவாக காண அனுமதிக்கிறது, மேலும் பயனர் அதை ஒரு புதிய திறன் அல்லது \"சூப்பர்பவர்\" பெறுவது போன்றதாக உணர்ந்தார்.",
      "பயனர் இந்த நுட்பத்தை மற்றவர்களுடன் பகிர்ந்து, அவர்கள் அதை முயற்சிக்க கண்களை குறுக்கி பார்க்கும்போது உருவாகும் நடுப்படத்தில் கவனம் செலுத்துமாறு ஊக்குவித்தார்."
    ],
    "commentSummary": [
      "ஒரு விளையாட்டு இயந்திரத்தின் அதிக புள்ளிகளை வெல்லவும், ஒரு இலவச பார் டேப்பையும் பெறவும், இரண்டு படங்களுக்கிடையேயான வேறுபாடுகளை கண்டறிய ஒரு நுட்பம் பயன்படுத்தப்பட்டது, இது ஸ்டீரியோகிராம்களைப் பார்ப்பதற்கு ஒத்ததாக உள்ளது.",
      "இந்த முறை மாறுபாடுகளை மினுங்கும் அல்லது நிலையற்ற பகுதிகளாக வெளிப்படுத்துகிறது, இதன் பயன்பாடுகள் மற்றும் சவால்கள், கண் சோர்வு மற்றும் பார்வை சிரமங்கள் உள்ளிட்டவற்றைப் பற்றிய விவாதங்களைத் தூண்டுகிறது.",
      "உரையாடல் стереோஸ்கோபிக் பார்வை மற்றும் பல்வேறு துறைகளில் இதே போன்ற நுட்பங்களைப் பயன்படுத்துதல் போன்ற தொடர்புடைய தலைப்புகளுக்கு விரிந்தது."
    ],
    "points": 365,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1736519674
  },
  {
    "id": 42652577,
    "title": "அனைத்து ISBNகளையும் காட்சிப்படுத்துதல்",
    "originLink": "https://annas-archive.org/blog/all-isbns.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42652577",
    "commentBody": "",
    "originSummary": [
      "அன்னாவின் காப்பகம், மிகப்பெரிய திறந்த நூலகம், புத்தக காப்பு முன்னேற்றத்தை கண்காணிக்க அனைத்து ISBNகளையும் காட்சிப்படுத்தியுள்ளது, இதுவரை புத்தகங்களில் 16% மட்டுமே காப்பு செய்யப்பட்டுள்ளன என்பதை வெளிப்படுத்துகிறது.",
      "ஒரு $10,000 பரிசு, காட்சிப்படுத்தலின் பெரிதாக்கும் திறன், தொடர்பாடல் மற்றும் பயன்பாட்டை மேம்படுத்துவதற்காக வழங்கப்படுகிறது, முதல் மூன்று சமர்ப்பிப்புகளுக்கு பரிசுகள் வழங்கப்படுகின்றன, மேலும் அனைத்து குறியீட்டு பகுதியும் திறந்த மூலமாக இருக்க வேண்டும்.",
      "இந்த முயற்சி அரிய புத்தகங்களை பாதுகாக்க மிகவும் முக்கியமானது, ஏனெனில் அன்னாவின் காப்பகம் புத்தக மெட்டாடேட்டாவின் மிகப்பெரிய திறந்த தொகுப்பை கொண்டுள்ளது."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். சர்ச்சை ஹாக்கர் நியூஸில் அன்னாவின் காப்பகத்திலிருந்து ISBNகளை (சர்வதேச நிலையான புத்தக எண்கள்) காட்சிப்படுத்துவது குறித்து நடைபெறுகிறது, மேலும் தரவின் பிரதிநிதித்துவத்தை மேம்படுத்த ஹில்பர்ட் வளைவு போன்றவற்றைப் பயன்படுத்துவதற்கான பரிந்துரைகள் உள்ளன.",
      "பயனர்கள், அநுக்ரமண தரவுகளின் காட்சிப்படுத்தலுக்கான ISBNகளின் செயல்திறனைப் பற்றி விவாதிக்கின்றனர், காங்கிரஸ் நூலக அமைப்பை போன்ற மாற்று வழிகளை முன்மொழிகின்றனர்.",
      "உரையாடல் அன்னாவின் ஆவணத்தின் சட்டபூர்வத்தன்மை மற்றும் நெறிமுறைகளை, மேலும் தனியுரிமை கவலைகளுக்காக பரிசுகளுக்கு மொனேரோ கிரிப்டோகரன்சியைப் பயன்படுத்துவதைப் பற்றியும் குறிப்பிடுகிறது."
    ],
    "points": 289,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1736484355
  },
  {
    "id": 42651275,
    "title": "முன்னறிவிப்பு மதிப்பீட்டு அட்டவணை, 2025 ஜனவரி 01",
    "originLink": "https://rodneybrooks.com/predictions-scorecard-2025-january-01/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42651275",
    "commentBody": "",
    "originSummary": [
      "மூலம்: ஆசிரியர் 2018 இல் செய்யப்பட்ட சுய இயக்க வாகனங்கள், ரோபோட்டிக்ஸ், செயற்கை நுண்ணறிவு, இயந்திரக் கற்றல் மற்றும் மனித விண்வெளி பயணம் பற்றிய கணிப்புகளை ஆண்டுதோறும் புதுப்பித்து வழங்குகிறார், 2026-2036 க்கான புதிய கணிப்புகளை செய்ய திட்டமிட்டுள்ளார்.",
      "AI மற்றும் சுய இயக்க வாகனங்களில் 2024 இல் முக்கிய முன்னேற்றங்கள் ஏற்பட்டாலும், முழுமையான தன்னாட்சி மற்றும் மனித வேலைகளை AI மூலம் மாற்றுவது இன்னும் தூரத்தில் உள்ளது, மேலும் சுய இயக்க வாகனங்களுக்கு தொலைநிலை மனித கண்காணிப்பு இன்னும் அவசியமாக உள்ளது.",
      "மனித விண்வெளி பயண முன்னேற்றம் மந்தமாக உள்ளது, SpaceX இன் ஸ்டார்ஷிப் மற்றும் NASA இன் ஆர்டெமிஸ் தாமதங்களை எதிர்கொள்கின்றன, அதேசமயம் ப்ளூ ஒரிஜின் இன் நியூ க்ளென் ஏவுதலுக்கு நெருங்கி வருகிறது, மற்றும் துணைபரிமாண சுற்றுலா குறைந்த முன்னேற்றத்தை காட்டுகிறது."
    ],
    "commentSummary": [
      "கட்டுரை ராட்னி ப்ரூக்ஸின் AI மற்றும் ரோபோடிக்ஸ் குறித்த கணிப்புகளை ஆய்வு செய்கிறது, குறிப்பாக சுய இயக்க வாகனங்கள் மற்றும் AI முன்னேற்றங்களை மையமாகக் கொண்டு. - விமர்சகர்கள் ப்ரூக்ஸின் கணிப்புகள் தெளிவற்றவை மற்றும் தன்னம்பிக்கையுடன் இருப்பதாகக் கூறுகின்றனர், குறிப்பாக வேமோவின் சுய இயக்க தொழில்நுட்பம் தொடர்பாக, சிலர் இது முழுமையாக தன்னாட்சி இல்லாதது என்று வாதிடுகின்றனர், ஏனெனில் மனித இடையீடுகள் உள்ளன. - ப்ரூக்ஸ் AI மற்றும் ரோபோடிக்ஸ் பற்றிய பரபரப்பை குறைக்க முயலுகிறார், நிஜமான காலக்கெடுவுகள் மற்றும் சவால்களை வெளிப்படுத்துவதன் மூலம், அதே சமயம் சுய இயக்க தொழில்நுட்பத்தின் பொருளாதார தகுதி மற்றும் வேலைகளின் மீது அதன் தாக்கத்தைப் பற்றிய விவாதமும் கருத்தில் கொள்ளப்படுகிறது."
    ],
    "points": 224,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1736468875
  }
]
