[
  {
    "id": 42655870,
    "title": "Yeni Bir Süper Güç Kazandım",
    "originLink": "https://danielwirtz.com/blog/spot-the-difference-superpower",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42655870",
    "commentBody": "",
    "originSummary": [
      "Bir Reddit kullanıcısı, gözlerini şaşı yaparak üçüncü, parlayan bir görüntü oluşturarak \"farkı bul\" bulmacalarındaki farklılıkları kolayca tespit etmenin bir tekniğini keşfetti.",
      "Bu yöntem, farklılıkların daha belirgin hale gelmesine olanak tanır ve kullanıcı, pratik yaptıktan sonra yeni bir beceri veya \"süper güç\" kazanmış gibi hissetti.",
      "Kullanıcı, gözlerini şaşı yaparak oluşturulan orta görüntüye odaklanarak denemeleri için başkalarıyla bu tekniği paylaştı ve onları denemeye teşvik etti."
    ],
    "commentSummary": [
      "İki görüntü arasındaki farkları, stereogramları izlemeye benzer şekilde gözleri çaprazlayarak tespit etme tekniği, bir oyun makinesinde yüksek skor kazanmak ve ücretsiz bar hesabı elde etmek için kullanıldı.",
      "Bu yöntem, farklılıkları titrek veya kararsız alanlar olarak vurgulayarak, göz yorgunluğu ve görme zorlukları dahil olmak üzere uygulamaları ve zorlukları hakkında tartışmalar başlatır.",
      "Konuşma, stereoskopik görüş ve benzer tekniklerin farklı alanlarda kullanımı gibi ilgili konulara genişledi."
    ],
    "points": 365,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1736519674
  },
  {
    "id": 42652577,
    "title": "ISBN'lerin Tümünü Görselleştirme",
    "originLink": "https://annas-archive.org/blog/all-isbns.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42652577",
    "commentBody": "",
    "originSummary": [
      "Anna'nın Arşivi, en büyük açık kütüphane, kitap yedeklemelerinin ilerlemesini izlemek için tüm ISBN'leri görselleştirdi ve şu ana kadar kitapların yalnızca %16'sının yedeklendiğini ortaya koydu.",
      "10.000 $ ödül, görselleştirmenin yakınlaştırılabilirliğini, etkileşimliliğini ve kullanılabilirliğini geliştirmek için sunulmaktadır. İlk üç gönderi için ödüller verilecek olup, tüm kodlar açık kaynak olmalıdır.",
      "Bu girişim, Anna'nın Arşivi'nin en büyük açık kitap meta verisi koleksiyonuna sahip olması nedeniyle nadir kitapların korunması için çok önemlidir."
    ],
    "commentSummary": [
      "Anna'nın Arşivi'nden ISBN'lerin (Uluslararası Standart Kitap Numaraları) görselleştirilmesi üzerine Hacker News'te yapılan tartışma, daha iyi veri temsili için Hilbert Eğrisi kullanma gibi öneriler etrafında dönüyor.",
      "Kullanıcılar, hiyerarşik veri görselleştirmesi için ISBN'lerin etkinliğini tartışarak, Kongre Kütüphanesi sistemi gibi alternatifler öneriyor.",
      "Konuşma ayrıca, telif hakkıyla korunan materyalleri barındıran Anna'nın Arşivi'nin yasallığı ve etiği ile gizlilik endişeleri nedeniyle ödüller için Monero kripto para biriminin kullanımını ele alıyor."
    ],
    "points": 289,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1736484355
  },
  {
    "id": 42651275,
    "title": "Öngörüler Puan Tablosu, 2025 Ocak 01",
    "originLink": "https://rodneybrooks.com/predictions-scorecard-2025-january-01/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42651275",
    "commentBody": "",
    "originSummary": [
      "Yazar, 2018 yılında yapılan sürücüsüz arabalar, robotik, yapay zeka, makine öğrenimi ve insanlı uzay yolculuğu hakkındaki tahminlerle ilgili yıllık bir güncelleme sunuyor ve 2026-2036 için yeni tahminler yapmayı planlıyor.",
      "2024 yılında yapay zeka ve otonom araçlar alanında önemli gelişmeler olmasına rağmen, tam otonomi ve insan işlerinin yapay zeka ile değiştirilmesi hala uzak bir ihtimal olarak kalmakta, otonom araçlar için uzaktan insan gözetimi hala gerekli olmaktadır.",
      "İnsanlı uzay uçuşu ilerlemesi yavaş, SpaceX'in Starship'i ve NASA'nın Artemis'i gecikmelerle karşılaşırken, Blue Origin'in New Glenn'i fırlatmaya yaklaşıyor ve suborbital turizm sınırlı ilerleme gösteriyor."
    ],
    "commentSummary": [
      "Makale, Rodney Brooks'un AI ve robotik konusundaki tahminlerini, özellikle de kendi kendine giden arabalar ve AI gelişmeleri üzerine odaklanarak inceliyor. - Eleştirmenler, Brooks'un tahminlerinin belirsiz ve kendini öven nitelikte olduğunu, özellikle de bazılarına göre insan müdahaleleri nedeniyle tam otonom olmayan Waymo'nun kendi kendine giden teknolojisiyle ilgili olduğunu iddia ediyor. - Brooks, AI ve robotik konusundaki abartıyı gerçekçi zaman çizelgeleri ve zorlukları vurgulayarak azaltmayı amaçlıyor, bu arada tartışma, kendi kendine giden teknolojinin ekonomik uygulanabilirliğini ve işlere olan etkisini de dikkate alıyor."
    ],
    "points": 224,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1736468875
  }
]
