[
  {
    "id": 42655870,
    "title": "Jeg har fått en ny superkraft",
    "originLink": "https://danielwirtz.com/blog/spot-the-difference-superpower",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42655870",
    "commentBody": "",
    "originSummary": [
      "En Reddit-bruker oppdaget en teknikk for enkelt å oppdage forskjeller i \"finn forskjellen\"-oppgaver ved å krysse øynene for å skape et tredje, skimrende bilde.",
      "Metoden gjør at forskjellene blir mer tydelige, og brukeren følte det var som å få en ny ferdighet eller \"superkraft\" etter å ha øvd.",
      "Brukeren delte denne teknikken med andre og oppmuntret dem til å prøve den ved å fokusere på det midterste bildet som dannes når de krysser øynene."
    ],
    "commentSummary": [
      "En teknikk for å oppdage forskjeller mellom to bilder ved å krysse øynene, likt som å se på stereogrammer, ble brukt for å vinne en spillmaskin høy poengsum og en gratis barregning.",
      "Metoden fremhever forskjeller som glitrende eller ustabile områder, og utløser diskusjoner om dens anvendelser og utfordringer, inkludert øyebelastning og synsvansker.",
      "Diskusjonen utvidet seg til relaterte emner som stereoskopisk syn og bruk av lignende teknikker i forskjellige felt."
    ],
    "points": 365,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1736519674
  },
  {
    "id": 42652577,
    "title": "Visualisering av alle ISBN-er",
    "originLink": "https://annas-archive.org/blog/all-isbns.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42652577",
    "commentBody": "",
    "originSummary": [
      "Anna's Archive, det største åpne biblioteket, har visualisert alle ISBN-er for å spore fremdriften av bokkopieringer, og avslører at bare 16 % av bøkene er sikkerhetskopiert så langt.",
      "En dusør på $10 000 tilbys for å forbedre visualiseringens zoombarhet, interaktivitet og brukervennlighet, med premier for de tre beste innsendelsene, og all kode må være åpen kildekode.",
      "Dette initiativet er avgjørende for å bevare sjeldne bøker, ettersom Annas Arkiv har den største åpne samlingen av bokmetadata."
    ],
    "commentSummary": [
      "Diskusjonen på Hacker News dreier seg om visualisering av ISBN-er (International Standard Book Numbers) fra Annas Arkiv, med forslag som å bruke en Hilbert-kurve for bedre datarepresentasjon.",
      "Brukere diskuterer effektiviteten av ISBN-er for hierarkisk datavisualisering, og foreslår alternativer som Library of Congress-systemet.",
      "Diskusjonen tar også opp lovligheten og etikken rundt Annas Arkiv, som er vert for opphavsrettsbeskyttet materiale, og bruken av Monero-kryptovaluta for dusører på grunn av personvernhensyn."
    ],
    "points": 289,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1736484355
  },
  {
    "id": 42651275,
    "title": "Prognoser Resultattavle, 2025 Januar 01",
    "originLink": "https://rodneybrooks.com/predictions-scorecard-2025-january-01/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42651275",
    "commentBody": "",
    "originSummary": [
      "Forfatteren gir en årlig oppdatering om spådommer gjort i 2018 om selvkjørende biler, robotikk, AI, maskinlæring og menneskelig romfart, med planer om å lage nye spådommer for 2026-2036.",
      "Til tross for betydelige fremskritt innen AI og selvkjørende biler i 2024, forblir full autonomi og erstatning av menneskelige jobber med AI fjernt, med fjernovervåking av mennesker fortsatt nødvendig for selvkjørende biler.",
      "Fremskritt innen bemannet romfart går sakte, med SpaceX sin Starship og NASAs Artemis som møter forsinkelser, mens Blue Origins New Glenn nærmer seg oppskyting, og suborbital turisme viser begrenset fremgang."
    ],
    "commentSummary": [
      "Artikkelen undersøker Rodney Brooks' spådommer om AI og robotikk, med særlig fokus på selvkjørende biler og AI-fremskritt. - Kritikere hevder at Brooks' spådommer er vage og selvforherligende, spesielt når det gjelder Waymos selvkjørende teknologi, som noen mener ikke er fullt autonome på grunn av menneskelige inngrep. - Brooks har som mål å dempe hypen rundt AI og robotikk ved å fremheve realistiske tidslinjer og utfordringer, mens diskusjonen også vurderer den økonomiske levedyktigheten til selvkjørende teknologi og dens innvirkning på arbeidsplasser."
    ],
    "points": 224,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1736468875
  }
]
