[
  {
    "id": 42617645,
    "title": "LLM'lerle Nasıl Program Yaparım",
    "originLink": "https://crawshaw.io/blog/programming-with-llms",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42617645",
    "commentBody": "",
    "originSummary": [
      "Yazar, programlama iş akışına Büyük Dil Modellerini (LLM'ler) entegre etmiş ve bunları otomatik tamamlama, arama ve sohbet odaklı programlama gibi görevler için faydalı bulmuştur.",
      "Üretkenliği artırmak için tekrarlayan görevleri otomatikleştirerek ve programlama verimliliğini artırarak tasarlanmış bir Go programlama Entegre Geliştirme Ortamı (IDE) olan sketch.dev adlı bir araç geliştiriyorlar.",
      "LLM'ler, kod taslakları oluşturma ve sınav tarzı soruları ele alma konusunda etkilidir, ancak bazen hatalar yapabilirler ve daha özel kodlar ve kapsamlı testler oluşturarak programlamada denge değişikliklerine neden olurlar."
    ],
    "commentSummary": [
      "Büyük Dil Modelleri (LLM'ler), bazı yazılım mühendisleri tarafından yeni fikirler tasarlama ve otomatik tamamlama ile sohbet odaklı programlama gibi görevleri yerine getirme konusunda verimliliği artırdığı için tanınmaktadır. - Bazı geliştiriciler LLM'lerin sağladığı verimliliği takdir ederken, diğerleri özellikle karmaşık veya yeni problemler için etkinlikleri konusunda şüpheci kalmaktadır. - Tartışma, LLM'lerin benimsenmesi konusunda geliştiriciler arasında bir bölünmeyi vurgulamakta, bazıları yinelemeli görevler için onları benimserken, diğerleri geleneksel yöntemleri tercih etmektedir."
    ],
    "points": 624,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1736208469
  },
  {
    "id": 42619139,
    "title": "Nvidia'nın Project Digits'i 'kişisel bir yapay zeka süper bilgisayarıdır'",
    "originLink": "https://techcrunch.com/2025/01/06/nvidias-project-digits-is-a-personal-ai-computer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42619139",
    "commentBody": "",
    "originSummary": [
      "Nvidia, CES 2025'te Grace Blackwell donanım platformu üzerine inşa edilmiş, GB10 Grace Blackwell Süperçipini içeren kompakt bir \"kişisel AI süper bilgisayarı\" olan Project Digits'i tanıttı.",
      "Bu cihaz, AI araştırmacıları, veri bilimcileri ve öğrenciler için uygun olan ve 200 milyar parametreye kadar modelleri işleyebilen bir petaflop'a kadar performans sunar.",
      "3.000 $ fiyatla sunulan Project Digits, Mayıs ayında satışa sunulacak ve Nvidia'nın Linux tabanlı DGX OS'unda çalışarak Windows veya Mac bilgisayarlara bağlanabilecek."
    ],
    "commentSummary": [
      "Nvidia'nın Project Digits'i, 1 PFLOP (PetaFLOP) FP4 hesaplama gücüne sahip Blackwell GPU, 128GB birleşik DDR5X bellek, 20 ARM çekirdeği ve yığınlama için ConnectX içeren, 3.000 dolarlık 'kişisel bir AI süper bilgisayarı'dır. - Başlangıç şirketlerini ve meraklıları hedef alarak, bulut AI çözümlerine yerel bir alternatif sunar ve AI geliştirme ve çıkarım görevleri için bellek kapasitesi ve verimliliğe odaklanır. - Cihaz, Ubuntu tabanlı Nvidia'nın DGX OS'unda çalışır ve yerel AI hesaplaması için potansiyel bir oyun değiştirici olarak kabul edilir."
    ],
    "points": 515,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1736223245
  },
  {
    "id": 42619652,
    "title": "Normal ifadelerde bir minimax satranç motoru",
    "originLink": "https://nicholas.carlini.com/writing/2025/regex-chess.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42619652",
    "commentBody": "",
    "originSummary": [
      "Nicholas Carlini, geçerli satranç hamlelerini gerçekleştirmek için 84.688 düzenli ifade kullanan Regex Chess adlı bir satranç motoru geliştirdi ve bu, regex'in alışılmadık uygulamalardaki potansiyelini sergiledi. - Motor, yığın işlemleri, değişken yönetimi ve koşullu yürütme için benzersiz bir komut seti içeren bir düzenli ifade CPU'su gibi çalışır ve paralel hamle üretimini destekler. - Regex Chess, regex yeteneklerinin yaratıcı bir keşfini vurgulayan, sahte yasal hamleleri değerlendirmek ve puanlamak için basitleştirilmiş bir minimax arama kullanır ve kod, kamuya açık olarak görüntülenmek üzere GitHub'da erişilebilir durumdadır."
    ],
    "commentSummary": [
      "Nicholas Carlini, satranç gibi karmaşık görevleri ele almadaki yeteneğini sergileyen normal ifadeler kullanarak bir minimax satranç motoru geliştirdi. - Piyon terfisi ve a-dosyası hamleleri gibi sorunlar içeren hatalara rağmen, proje alışılmadık programlama zorluklarının eğitici ve eğlenceli yönlerini göstermektedir. - Motorun 2 katmanlı araması bazen 1 hamlede mat tehditlerinden kaçınmayı başaramıyor, bu da sınırlamalarını vurgularken aynı zamanda yenilikçi yaklaşımını da gösteriyor."
    ],
    "points": 428,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1736228771
  },
  {
    "id": 42618130,
    "title": "Zig'in derleme zamanı inanılmaz derecede iyi",
    "originLink": "https://www.scottredig.com/blog/bonkers_comptime/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42618130",
    "commentBody": "",
    "originSummary": [
      "Scott Redig, Zig'in derleme zamanında kod yürütülmesine olanak tanıyan ve metaprogramlamayı mümkün kılarak verimliliği artıran 'comptime' özelliğini inceliyor. - 'Comptime' hakkında altı bakış açısı sunarak, kod okuma ve hata ayıklamayı basitleştirme yeteneğini vurguluyor ve bunu generics, kısmi değerlendirme ve kod üretimi ile karşılaştırıyor. - Redig, Zig'in 'comptime' özelliğinin hem güçlü hem de basit olduğu sonucuna vararak, Zig'in resmi kaynakları ve standart kütüphanesi aracılığıyla daha fazla keşif yapılmasını öneriyor."
    ],
    "commentSummary": [
      "Zig'in derleme zamanı programlaması (comptime), jenerikler, karmaşık veri başlatma ve hedefe özgü kod üretimi gibi özellikleri etkinleştiren verimliliği ile tanınır. - Eleştirmenler, Lisp makrolarına benzer yanlış kullanım, parametrisiteyi bozma ve derleme zamanı hesaplama sırasında özyinelemeli jenerik türler ve tür denetimi ile ilgili zorluklar gibi potansiyel sorunlara dikkat çeker. - Bu endişelere rağmen, Zig'in sadeliği ve derleme zamanı yürütümü büyük avantajlar olarak kabul edilir ve bazıları, metaprogramlama yeteneklerini Rust ekosistemi ile entegre etme konusunda ilgi duymaktadır."
    ],
    "points": 353,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1736212507
  },
  {
    "id": 42618761,
    "title": "Nvidia, yeni nesil RTX 5090 ve RTX 5080 GPU'larını duyurdu.",
    "originLink": "https://www.theverge.com/2025/1/6/24337396/nvidia-rtx-5080-5090-5070-ti-5070-price-release-date",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42618761",
    "commentBody": "",
    "originSummary": [
      "Nvidia, CES'te bir sonraki nesil RTX 50 serisi GPU'larını tanıttı ve bunlar arasında üst düzey RTX 5090 ve RTX 5080, sırasıyla 1.999 dolar ve 999 dolar fiyatla yer alıyor. - RTX 5090, 32GB GDDR7 bellek ve 21.760 CUDA çekirdeği içeriyor ve selefi RTX 4090'ın iki katı hız sunarken, RTX 5080 ise 16GB bellek sağlıyor ve RTX 4080'in iki katı hızda çalışıyor. - Seri, performans ve görüntü kalitesini artıran yeni DLSS 4 teknolojisini tanıtıyor ve Mart ayından itibaren dizüstü bilgisayarlar için kullanılabilir olacak."
    ],
    "commentSummary": [
      "Nvidia, RTX 5090 ve RTX 5080 GPU'larını tanıttı. RTX 5090, 32GB GDDR7 bellek ve 575W Termal Tasarım Gücü (TDP) ile tüketici AI iş yüklerine yönelik olarak sunuluyor.",
      "RTX 5080, RTX 5090'a kıyasla daha az bellekle daha uygun fiyatlı bir seçenek sunarak üst düzey oyunlar için tasarlanmıştır.",
      "Bu GPU'lara, özellikle AI uygulamaları için olan yüksek talep, kripto para madenciliği tarafından tetiklenen önceki kıtlıkları hatırlatan erişilebilirlik sorunlarına yol açabilir."
    ],
    "points": 329,
    "commentCount": 367,
    "retryCount": 0,
    "time": 1736219531
  },
  {
    "id": 42615538,
    "title": "Meta AI kullanıldı, şimdi Instagram yüzümü bana yönelik reklamlarda kullanıyor",
    "originLink": "https://old.reddit.com/r/ABoringDystopia/comments/1ht7fft/used_meta_ai_to_edit_a_selfie_now_instagram_is/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42615538",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bir Reddit kullanıcısı, Meta AI'nin \"beni hayal et\" özelliğini kullandıktan sonra kendi yüzlerini içeren Instagram reklamlarıyla karşılaştı ve bu durum kişiselleştirilmiş reklamcılıkla ilgili endişeleri artırdı. - Olay, bu düzeydeki reklam kişiselleştirmesini \"Azınlık Raporu\" filmine benzeten bir tartışmayı ateşledi ve görüşler bunu yenilikçi veya müdahaleci olarak görmek arasında bölündü. - Tartışma, reklamcılıkta yapay zekanın etik sonuçları ve gizlilik endişelerini vurguluyor ve kişisel verilerin korunması için daha sıkı düzenlemeler çağrısında bulunuyor."
    ],
    "points": 299,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1736196298
  },
  {
    "id": 42616700,
    "title": "NYC Yoğunluk Fiyatlandırma Takipçisi",
    "originLink": "https://www.congestion-pricing-tracker.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42616700",
    "commentBody": "",
    "originSummary": [
      "Yoğunluk Fiyatlandırma Takipçisi, Brown Üniversitesi Profesörü Emily Oster'in gözetiminde Benjamin ve Joshua Moshes tarafından yürütülen, New York'taki yoğunluk fiyatlandırmasına odaklanan bir projedir. - Proje, bilgileri sunmak için kapsamlı bir dijital yaklaşımı gösteren web betikleri ve stil sayfalarını içermektedir. - Web sayfası, arama motorları için optimize edilmiştir (SEO) ve bulunamayan içerikleri yönetmek için bir 404 hata sayfası içermektedir."
    ],
    "commentSummary": [
      "NYC'nin sıkışıklık fiyatlandırma politikası, trafik sıkışıklığını azaltmak ve toplu taşıma iyileştirmeleri için gelir elde etmek amacıyla tasarlanmıştır.",
      "Kimileri hemen faydalarını gözlemlerken, diğerleri hava durumu ve tatil seyahati gibi değişkenler nedeniyle etkinliğini değerlendirmek için henüz erken olduğunu savunuyor.",
      "Eleştirmenler, değişmeyen taksi ve araç paylaşım ücretleri ile geliştirilmiş toplu taşıma ihtiyacının önemli endişeler olarak kaldığını belirtiyor."
    ],
    "points": 296,
    "commentCount": 508,
    "retryCount": 0,
    "time": 1736202179
  },
  {
    "id": 42620656,
    "title": "Blender ile yapılmış bir yapımın Altın Küre kazandığı ilk sefer",
    "originLink": "https://variety.com/2025/film/columns/flow-golden-globe-win-independent-animation-1236266805/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42620656",
    "commentBody": "",
    "originSummary": [
      "Letonyalı yönetmen Gints Zilbalodis'in bağımsız animasyonu \"Flow\", en iyi animasyon filmi dalında Altın Küre kazandı ve bağımsız filmler için önemli bir başarıyı vurguladı. - Ücretsiz bir yazılım olan Blender kullanılarak mütevazı bir 3,7 milyon dolarlık bütçeyle oluşturulan \"Flow\", büyük stüdyo yapımlarıyla rekabet etti ve animasyonun demokratikleşmesini gözler önüne serdi. - Filmin zaferi, Altın Kürelerin uluslararası yapımlara yönelik artan kapsayıcılığını yansıtıyor ve Disney'in geleneksel hakimiyetine meydan okuyarak animasyon filmi Oscar yarışını etkileyebilir."
    ],
    "commentSummary": [
      "Blender ile yapılan bir yapım, bir Altın Küre kazanarak açık kaynaklı yazılım için bir dönüm noktası oluşturdu ve profesyonel kullanım için hazır olup olmadığına dair algıları zorladı. - Hikaye anlatımı ve görselliği ile dikkat çeken film, Letonya'da popülerlik kazandı ve diğer animasyon kazananlarına kıyasla düşük bütçesiyle öne çıkıyor. - Blender'ın EEVEE motorunu kullanan filmin başarısı, Blender'ın animasyon endüstrisi üzerindeki potansiyel etkisi ve çeşitli üretim ortamlarındaki yetenekleri hakkında tartışmaları ateşledi."
    ],
    "points": 273,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1736240455
  },
  {
    "id": 42616699,
    "title": "Hayatımı çeyrek asırda bir yaşıyorum",
    "originLink": "https://tla.systems/blog/2025/01/04/i-live-my-life-a-quarter-century-at-a-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42616699",
    "commentBody": "",
    "originSummary": [
      "5 Ocak 2000'de Steve Jobs, Macworld Expo'da, Apple Cork, İrlanda'da bulunan bir mühendisin önemli katkılarıyla, Mac OS X'in Aqua kullanıcı arayüzünü, Dock'u da içerecek şekilde tanıttı.",
      "Mühendis, daha önce DragThing üzerinde çalışmış olan, Bas Ording'in prototiplerini Dock için işlevsel koda dönüştürmede önemli bir rol oynadı, ancak sonunda taşınma baskıları nedeniyle istifa etti.",
      "Apple'dan ayrıldıktan sonra mühendis, popülerliğini sürdüren DragThing ve PCalc'ı yeniden canlandırdı ve ellerinde imzasız bir Gizlilik Sözleşmesi (NDA) buldu."
    ],
    "commentSummary": [
      "Makale, Apple'ın Dock geliştirmesini ele alıyor ve Steve Jobs'un tuhaflıkları ile gizemli doğasına vurgu yapıyor, bir çalışanın bir aldatmacayı sürdürmek için İrlanda ile ABD arasında uçurulmasını da içeriyor.",
      "Önemli çabalara rağmen, proje nihayetinde ofis konumuyla ilgili sorunlar nedeniyle iptal edildi.",
      "Anlatı ayrıca Jobs'un tartışmalı kararlarına, mevcut teknoloji liderleriyle karşılaştırıldığında mirasına ve teknoloji endüstrisinde kariyer yolları ve yaş ayrımcılığı gibi daha geniş temalara da değiniyor."
    ],
    "points": 270,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1736202178
  },
  {
    "id": 42615646,
    "title": "Üçleme Önerileri",
    "originLink": "https://alexanderpetros.com/triptych/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42615646",
    "commentBody": "",
    "originSummary": [
      "Alexander Petros ve Carson Gross'un Triptych Önerileri, formlarda PUT, PATCH ve DELETE gibi ek HTTP yöntemlerini destekleyerek HTML'nin ağ isteklerini işleme yeteneğini geliştirmeyi amaçlıyor.",
      "Öneriler ayrıca, HTML'yi REST ilkeleriyle daha yakından hizalayarak, formlar olmadan HTTP istekleri yapabilen düğmelerin etkinleştirilmesini ve kısmi sayfa değişimlerine izin verilmesini içermektedir.",
      "Bu öneriler Big Sky Dev Con'da tanıtıldı ve GitHub'daki Triptych Polyfill'de detaylandırıldı, bu geliştirmeleri desteklemek için fetch ve navigasyon spesifikasyonlarına yönelik güncellemeler devam etmektedir."
    ],
    "commentSummary": [
      "Alex Petros'un Üçlü Önerileri, HTML'nin PUT ve DELETE gibi HTTP yöntemlerini işlemesini sağlamak amacıyla HTMX kavramlarını HTML spesifikasyonuna dahil etmeyi amaçlamaktadır.",
      "Teklif, Web Hiper Metin Uygulama Teknolojisi Çalışma Grubu'ndan (WHATWG) olumlu geri bildirimler alıyor, ancak Chrome ve Safari gibi büyük tarayıcılar tarafından benimsenmesi hala belirsiz.",
      "Bu girişim, HTML'nin yeteneklerini geliştirerek JavaScript bağımlılığını azaltmayı ve RESTful API'ler ile hipermedya odaklı bir web üzerindeki daha geniş tartışmalara katkıda bulunmayı amaçlamaktadır."
    ],
    "points": 232,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1736196754
  },
  {
    "id": 42624116,
    "title": "Tramway SDK – Half-Life ve Morrowind Motorları Arasındaki Kutsal Olmayan Birliktelik",
    "originLink": "https://racenis.github.io/tram-sdk/why.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42624116",
    "commentBody": "",
    "originSummary": [
      "Unreal ve Source gibi popüler motorlara benzer, açık dünya akışı desteğine sahip yeni bir ücretsiz, açık kaynaklı oyun motoru geliştiriliyor. - Motor, modern donanım için optimize edilmiştir ve yüksek performans sunar, ancak henüz üretim kullanımı için hazır değildir. - Geliştirici, bu motoru kullanarak birkaç büyük projeyi tamamlamayı planlıyor, ancak mevcut ismin muhtemelen geçici olduğu belirtiliyor."
    ],
    "commentSummary": [
      "Tramway SDK, Half-Life ve Morrowind oyun motorlarını birleştirerek düşük bütçeli, açık dünya akışlı bir oyun motoru oluşturan ve ücretsiz, açık kaynaklı bir projedir. - Modern donanım için optimize edilmiş olmasına rağmen, Tramway SDK henüz üretim kullanımı için hazır değildir, ancak eski donanımları destekleyerek yazılım şişkinliğini ve çevresel etkiyi azaltmayı hedeflemektedir. - MIT lisansı altında olan proje, retro estetiği ve bağımsız oyun geliştirme potansiyeli ile takdir edilmektedir ve yaratıcısı geri bildirim ve ilerleme güncellemelerini memnuniyetle karşılamaktadır."
    ],
    "points": 227,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1736266929
  },
  {
    "id": 42618625,
    "title": "Çalışma, Roma İmparatorluğu'nun kurşun kullanımının Avrupa genelinde IQ seviyelerini düşürdüğünü ortaya koyuyor",
    "originLink": "https://www.theguardian.com/science/2025/jan/06/roman-empires-use-of-lead-lowered-iq-levels-across-europe-study-finds",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42618625",
    "commentBody": "",
    "originSummary": [
      "Bir çalışma, Roma İmparatorluğu'nun metal işçiliğinde kurşun kullanımının Pax Romana sırasında Avrupa genelinde IQ'da 2 ila 3 puanlık bir düşüşe neden olduğunu göstermektedir.",
      "500 M.Ö. ile 600 M.S. arasındaki kurşun kirliliğini izlemek için araştırmacılar Arktik buz çekirdeklerini kullandı ve Roma İmparatorluğu'nun zirvesinde önemli bir artış gösterdi.",
      "Çalışma, yaygın kurşun maruziyetinin Roma İmparatorluğu'nun çöküşüne katkıda bulunmuş olabileceğini, kirlilik seviyelerinin Roma sonrası dönemde azaldığını ancak Sanayi Devrimi sırasında yeniden yükseldiğini öne sürüyor."
    ],
    "commentSummary": [
      "Bir çalışma, Roma İmparatorluğu'nun kurşun kullanımının Avrupa'daki IQ seviyelerini düşürebileceğini göstermektedir, ancak bu, doğrudan antik IQ ölçümleri yerine tarihsel kurşun seviyeleri ve modern modellere dayanmaktadır.",
      "Roma altyapısının avantajlarının kurşun maruziyetinin zararlı etkilerini aşmış olabileceği konusunda bir tartışma var.",
      "Çalışma ayrıca florür ve plastikler gibi çağdaş maddelerin IQ üzerindeki potansiyel etkilerini araştırarak, dolaylı kanıtlardan tarihsel sağlık etkilerini değerlendirmenin karmaşıklığını vurgulamaktadır."
    ],
    "points": 194,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1736218095
  },
  {
    "id": 42623144,
    "title": "New York Federal Rezerv Bankası \"Kıyamet Kitabı\" 2022 FOIA aracılığıyla [pdf]",
    "originLink": "https://www.crisesnotes.com/content/files/2023/12/NYFRB-2006.--Doomsday-Book--Searchable.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42623144",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "New York Federal Reserve Bank'ın \"Kıyamet Kitabı\", finansal krizler sırasında hukuki belirsizlikleri yönetmede avukatlara yardımcı olmak için tasarlanmış bir hukuki rehberdir ve hızlı ve etkili yanıtlar sağlanmasını amaçlar. - Başlangıçta belirli avukatlar için tasarlanan rehber, şimdi tüm FRBNY avukatlarına sunulmakta ve teknoloji olay müdahale planlarına benzer bir kriz el kitabı işlevi görmektedir. - Belge, Hukuk İşlevi dışında paylaşılmamaktadır ve adı, ciddi finansal aksaklıklara hazırlığı simgelerken, Fed'in benzersiz rolü nedeniyle Bilgi Edinme Özgürlüğü Yasası'ndan (FOIA) bağımsızlığını koruduğunu, ancak yine de Kongre'ye karşı sorumlu olduğunu belirtmektedir."
    ],
    "points": 183,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1736262587
  },
  {
    "id": 42621627,
    "title": "Üçüncü taraf gerçek kontrol programımızı sonlandırıp Topluluk Notları modeline geçiyoruz",
    "originLink": "https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42621627",
    "commentBody": "",
    "originSummary": [
      "Meta, içerik denetleme sistemlerini basitleştirerek ifade özgürlüğünü önceliklendiriyor; bu sistemler, aşırı karmaşık ve kısıtlayıcı oldukları için eleştirilmişti. - Şirket, ABD'deki üçüncü taraf doğrulama programını sonlandırıyor ve kullanıcı katkılarıyla potansiyel olarak yanıltıcı gönderilere bağlam sağlamak için X'e benzer bir Topluluk Notları sistemi tanıtıyor. - Meta, siyasi içerik üzerindeki kısıtlamaları azaltıyor, ciddi ihlallere odaklanmak için uygulama süreçlerini basitleştiriyor ve kullanıcı tercihleri doğrultusunda siyasi içerik görünürlüğünü kişiselleştiriyor; bu, Mark Zuckerberg'in ifade özgürlüğü vizyonuyla uyumlu."
    ],
    "commentSummary": [
      "Meta, üçüncü taraf doğrulama programından, Twitter'ın stratejisine benzer şekilde, topluluk notları modeline geçiş yapıyor. Bu değişiklik, muhtemelen siyasi değişikliklerle uyum sağlamak ve moderasyon masraflarını azaltmak amacıyla gerçekleştiriliyor.",
      "Eleştirmenler, bu değişimin daha fazla yanlış bilgi ve zararlı içerik ile sonuçlanabileceği konusunda endişelerini dile getirirken, destekçiler bunun ifade özgürlüğünü güçlendirebileceğini savunuyor.",
      "Bu karar, içerik denetimi, ifade özgürlüğü ve sosyal medya platformlarının kamusal söylemi şekillendirmedeki etkisi hakkındaki devam eden tartışmaları vurgulamaktadır."
    ],
    "points": 180,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736252122
  }
]
