[
  {
    "id": 42299863,
    "title": "Facebook இன் சிறிய சிவப்பு புத்தகம்",
    "originLink": "https://www.map.cv/blog/redbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42299863",
    "commentBody": "",
    "originSummary": [
      "2012 ஆம் ஆண்டில், ஃபேஸ்புக் தனது அடையாளத்தையும் கவனத்தையும் ஒரு பில்லியன் பயனர்களுக்கு விரிவாக்கியபோது, பொருட்களை உடைத்தல், பெரியதாக சிந்தித்தல் மற்றும் வேகமாக நகர்தல் போன்ற கொள்கைகளை வலியுறுத்தி 'சிறிய சிவப்பு புத்தகம்' ஒன்றை உருவாக்கியது.",
      "புத்தகம், பென் பாரி வடிவமைத்தது, வேகமான வளர்ச்சியின் போது ஃபேஸ்புக்கின் மனப்பாங்கை பாதுகாக்கும் ஒரு அறிக்கையாக செயல்பட்டது, நிறுவன கலாச்சாரத்தை விரிவாக்குவதில் கதை சொல்லலின் முக்கியத்துவத்தை வெளிப்படுத்தியது.",
      "உயர்தரமான டிஜிட்டல் பதிப்பு இந்த அரிய புத்தகத்தின் உருவாக்கப்பட்டுள்ளது, வெற்றிகரமான நிறுவனங்கள் தங்கள் அடையாளத்தையும் கலாச்சாரத்தையும் எவ்வாறு பராமரிக்கின்றன என்பதை விளக்குவதற்காக."
    ],
    "commentSummary": [
      "Facebook இன் \"சிறிய சிவப்பு புத்தகம்\" என்பது 2012 ஆம் ஆண்டில் வெளியிடப்பட்ட ஒரு ஊழியர் வழிகாட்டி ஆகும், இது ஒரு பணி உணர்வையும் தொழில்நுட்ப நம்பிக்கையையும் ஊக்குவிக்க வடிவமைக்கப்பட்டது.",
      "இந்த வழிகாட்டி அதன் மடத்தனத்திற்கும் சுய விழிப்புணர்வின்மைக்கும் விமர்சனங்களை எதிர்கொண்டுள்ளது, குறிப்பாக தகவல் தனியுரிமை மற்றும் தவறான தகவல்களை உட்படுத்திய பின்வரும் Facebook சர்ச்சைகளை முன்னிட்டு.",
      "TEXT: இந்தப் புத்தகம் தொழில்நுட்பத்தின் மிகுந்த நம்பிக்கையுடன் கூடிய காலத்தைச் சேர்ந்த ஒரு பழமையான பொருளாகக் கருதப்படுகிறது, சமூக ஊடகங்களின் தற்போதைய சிக்கலான நிஜங்களை எதிர்கொள்கிறது."
    ],
    "points": 471,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1733170055
  },
  {
    "id": 42306020,
    "title": "தென் கொரிய அதிபர் அவசர மாமன்னிப்பு சட்டத்தை அறிவித்தார்",
    "originLink": "https://apnews.com/article/south-korea-yoon-martial-law-997c22ac93f6a9bece68454597e577c1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42306020",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தென் கொரிய அதிபர் யூன் சுக் யோல் அவசர மாமன்ற சட்டத்தை அறிவித்தார், ஆனால் தேசிய சபை அதை நீக்க கோரியதால், அந்த அறிவிப்பு செல்லாததாக மாறியது.",
      "இராணுவம், ஜனாதிபதி அதிகாரப்பூர்வமாக முடிக்கும் வரை மாமனித சட்டம் தொடரும் என்று வலியுறுத்துகிறது, இது அரசியல் கடமைகள் மற்றும் சாத்தியமான பதவி நீக்கம் பற்றிய விவாதங்களுக்கு வழிவகுக்கிறது.",
      "அறிக்கை ஒரு புரட்சி முயற்சியுடன் ஒப்பிடப்படுகிறது, இது இராணுவத்தின் பங்கு மற்றும் அதிபரின் நோக்கங்கள் குறித்து கவலைகளை எழுப்புகிறது, அதில் ஊழல் விசாரணைகளை தவிர்ப்பது உள்ளிட்டவை அடங்கும்."
    ],
    "points": 396,
    "commentCount": 412,
    "retryCount": 0,
    "time": 1733234030
  },
  {
    "id": 42302784,
    "title": "நான் கலைக் காட்சியகத்தில் வேலை செய்தபோது கற்றுக் கொண்ட பாடங்கள்",
    "originLink": "https://www.henrikkarlsson.xyz/p/art-gallery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "உரை கலை மதிப்பீட்டின் தனிப்பட்ட தன்மையை மற்றும் ஒரு கலைஞரின் தொழில் வெற்றியில் நெட்வொர்க்கிங் முக்கியத்துவத்தை வலியுறுத்துகிறது.- வெற்றிகரமான கலைக் கண்காட்சிகளை முன்னறிவிப்பதில் உள்ள சவால்கள் மற்றும் ஆரம்ப தொழில்முறை தொடர்புகளின் பங்கு குறித்து இது விவாதிக்கிறது.- உரையாடல் \"மிகுந்த கலை\" என்பதை வரையறுப்பதில் உள்ள சிக்கல்களை, வணிக வெற்றியின் தாக்கத்தை, மற்றும் தொழில்முறை அமைப்புகளில் தொடர்பாடலின் முக்கியத்துவத்தை விரிவாக்குகிறது."
    ],
    "points": 362,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1733195883
  },
  {
    "id": 42303798,
    "title": "ஒய் காம்பினேட்டர் மற்றும் சிலிகான் பள்ளத்தாக்கில் அதிகாரம்",
    "originLink": "https://commoncog.com/c/cases/y-combinator-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303798",
    "commentBody": "",
    "originSummary": [
      "2010 ஆம் ஆண்டில், AdGrok என்ற சிறிய ஸ்டார்ட்அப், தங்களின் முந்தைய வேலைவாய்ப்பு நிறுவனமான Adchemy மூலம் வழக்கில் சிக்கியது, இது அவர்களின் நிதி நிலைத்தன்மையை அச்சுறுத்தியது.- AdGrok க்கு ஆதரவளித்த Y Combinator என்ற ஸ்டார்ட்அப் ஆக்சிலரேட்டர், Adchemy இன் முதலீட்டாளர்கள் மற்றும் சாத்தியமான வணிக கூட்டாளர்களுடன் தனது செல்வாக்கை பயன்படுத்தி வழக்கை தீர்க்க முக்கிய பங்கு வகித்தது.- வழக்கில் வெற்றி பெற்றபோதிலும், இந்த சிக்கல் AdGrok ஐ 2011 இல் Twitter க்கு விற்க வழிவகுத்தது, அதே சமயம் Adchemy பின்னர் Walmart Labs க்கு ஒரு தீவிர விற்பனையில் விற்கப்பட்டது."
    ],
    "commentSummary": [
      "Y Combinator (YC) என்பது சிலிக்கான் பள்ளத்தாக்கில் ஒரு முக்கிய வீரராகும், எது தொடக்க நிறுவனங்கள் வேகமெடுக்கின்றன என்பதை பாதிக்கிறது.- விமர்சகர்கள் YC ஒரு \"தூவல் மற்றும் பிரார்த்தனை\" உத்தியை ஏற்றுக்கொண்டுள்ளது என்று பரிந்துரைக்கின்றனர், தேர்வு மற்றும் தரத்தை விட தொடக்க நிறுவனங்களின் எண்ணிக்கையை முன்னுரிமைப்படுத்துகிறது.- விவாதம் YC தனது செயல்பாடுகளை அளவிட வேண்டுமா அல்லது குறைவான, உயர்தர தொடக்க நிறுவனங்களில் கவனம் செலுத்த வேண்டுமா என்பதைக் குறிக்கிறது, இது தொடக்க கலாச்சாரம் மற்றும் முதலீட்டு உத்திகள் ஆகியவற்றின் பரந்த சிக்கல்களை பிரதிபலிக்கிறது."
    ],
    "points": 269,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1733211287
  },
  {
    "id": 42302426,
    "title": "2023 ஆம் ஆண்டில் உற்பத்தியில் 8 ஆண்டுகள் ஹாஸ்கெல் பயன்படுத்திய பிறகு 8 மாதங்கள் OCaml",
    "originLink": "https://chshersh.com/blog/2023-12-16-8-months-of-ocaml-after-8-years-of-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302426",
    "commentBody": "",
    "originSummary": [
      "எழுத்தாளர் தங்கள் அனுபவத்தின் அடிப்படையில் ஹாஸ்கெல் மற்றும் OCaml ஐ ஒப்பிடுகிறார், ஹாஸ்கெல் அதிக அம்சங்கள் மற்றும் தொகுப்புகளை கொண்டுள்ளது, ஆனால் OCaml இன் எளிமை உற்பத்தித்திறனை மேம்படுத்துகிறது என்பதை குறிப்பிடுகிறார்.- ஹாஸ்கெல் இன் கருவிகள் சக்திவாய்ந்தவை ஆனால் ஒத்திசைவற்றவை, OCaml இன் கருவிகள் நேரடியானவை மற்றும் நம்பகமானவை, சுருக்கமான தொகுப்பி செய்திகளுடன்.- இரு மொழிகளும் தொழில்துறை பயன்பாட்டிற்கு ஏற்றவை, ஆனால் ஹாஸ்கெல் இன் விரிவான ஆவணங்களைப் பொருட்படுத்தாமல், OCaml இன் மேம்பாட்டில் கவனம் செலுத்துவதற்காக எழுத்தாளர் அதை விரும்புகிறார்."
    ],
    "commentSummary": [
      "ஆசிரியர் தங்கள் அனுபவங்களை ஹாஸ்கல் மற்றும் OCaml உடன் ஒப்பிடுகின்றனர், ஹாஸ்கலின் அழகான ஆனால் சிக்கலான சொற்தொடர் மற்றும் குறிப்பாக குறிப்பிட்ட GHC (கிளாஸ்கோ ஹாஸ்கல் கம்பைலர்) பதிப்புகளுடன் முரண்பாடான கருவிகளை குறிப்பிடுகின்றனர்.- OCaml அதன் நேர்த்தியான தன்மை, எளிமையான தொகுதி அமைப்பு, வேகமான கம்பைலர் மற்றும் உற்பத்தியில் நடைமுறைக்கு ஏற்ற தன்மை, குறைவான மொழி நீட்டிப்புகள் மற்றும் மேலாண்மை செய்யக்கூடிய கற்றல் வளைவு ஆகியவற்றிற்காக பாராட்டப்படுகிறது.- ஒரு நிரலாக்க மொழியின் வெற்றிக்கு வலுவான நிலையான நூலகத்தின் முக்கியத்துவத்தை ஆசிரியர் வலியுறுத்துகிறார்."
    ],
    "points": 242,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1733192090
  },
  {
    "id": 42302963,
    "title": "ஆரையிரு வருடத்திற்கு ஒருமுறை எடுக்கப்படும் எச்.ஐ.வி. ஊசி பெண்களில் 100% செயல்திறனை காட்டுகிறது",
    "originLink": "https://apnews.com/article/hiv-infections-aids-prevention-shot-02606f7d7892f0baf55bd0a0ff2ba3de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302963",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஒரு புதிய ஆண்டுக்கு இருமுறை எடுக்கப்படும் எச்.ஐ.வி. ஊசி பெண்களில் 100% செயல்திறனை நிரூபித்துள்ளது, இது தினசரி மாத்திரைகள் அல்லது மாதாந்திர ஊசிகளுக்கு வாக்களிக்கும் ஒரு வாக்களிக்கத்தக்க மாற்றாக உள்ளது.",
      "இந்த முன்னேற்றம், தினசரி மருந்து திட்டங்களை பின்பற்றுவதில் சிரமம் அடையும் நபர்களுக்கு முக்கியமானதாகும், இது எச்ஐவி தடுப்பு முயற்சிகளை எளிதாக்கக்கூடும்.",
      "அதன் வாக்குறுதியைத் தவிர, ஊசி வடிவத்தின் செலவு ஒரு கவலைக்குரியதாக உள்ளது, ஆனால் கிலியாட் 120 குறைந்த வருமான நாடுகளில் மலிவான, பொது பதிப்புகளை வழங்க திட்டமிட்டுள்ளது, இது உயர் எச்ஐவி பரவல் பகுதிகளில் பொது சுகாதாரத்தை பாதிக்கக்கூடும்."
    ],
    "points": 235,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1733198230
  },
  {
    "id": 42303274,
    "title": "பிளிசார்டின் வார்கிராஃப்ட் I மற்றும் II ஐ இழுத்தல் GOG இன் புதிய பாதுகாப்பு திட்டத்தை சோதிக்கிறது",
    "originLink": "https://arstechnica.com/gaming/2024/12/blizzards-pulling-of-warcraft-i-ii-tests-gogs-new-preservation-program/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303274",
    "commentBody": "",
    "originSummary": [
      "Blizzard, மறுபடியும் வெளியிடப்பட்ட பதிப்புகள் வெளியீடு காரணமாக, அதன் கடையிலிருந்து DRM-இல்லா Warcraft I & II தொகுப்பை நீக்க GOG-க்கு கோரிக்கை விடுத்துள்ளது.",
      "நீக்கப்படுவதற்கு முன் GOG அந்த தொகுப்பை தள்ளுபடியில் வழங்குகிறது, இதனால் வாங்குபவர்கள் இன்னும் அணுகலையும், நவீன அமைப்புகளுடன் இணக்கமாக புதுப்பிப்புகளையும் பெறுவார்கள்.",
      "இந்த நிலைமை, மறுபரிசீலனை செய்யப்பட்ட மற்றும் அசல் விளையாட்டு பதிப்புகளுக்கு இடையிலான தொடர்ச்சியான பதற்றத்தை வலியுறுத்துகிறது, வெளியீட்டாளர் முடிவுகளுக்கு மத்தியில் GOG பாரம்பரிய விளையாட்டுகளை பாதுகாக்க முயற்சிக்கிறது."
    ],
    "commentSummary": [
      "Blizzard இன் Warcraft I மற்றும் II ஐ GOG இல் இருந்து நீக்குவது விமர்சனத்தை ஏற்படுத்தியுள்ளது, குறிப்பாக Warcraft 3 மறுஉருவாக்கம் குறித்த எதிர்மறை கருத்துக்களை முன்னிட்டு.",
      "விசிறிகள் கவலை தெரிவிக்கின்றனர், Activision உடன் இணைந்த பிறகு Blizzard, விளையாட்டு தரத்தை பராமரிப்பதற்குப் பதிலாக குறுகிய கால லாபங்களின் மீது அதிக கவனம் செலுத்துகிறது.",
      "இந்த நிலைமை, GOG இன் பாதுகாப்பு திட்டத்தால் வலியுறுத்தப்பட்டுள்ளபடி, விளையாட்டு வரலாற்றை பாதுகாப்பதில் உள்ள சிரமங்களை வலியுறுத்துகிறது மற்றும் லாப நோக்கமுள்ள மாதிரிகளின் நோக்கத்தில் தொழில்துறையின் போக்கை பிரதிபலிக்கிறது."
    ],
    "points": 228,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1733203607
  },
  {
    "id": 42303111,
    "title": "ராஸ்பெர்ரி பை, Pi 5 செயல்திறனை SDRAM சீரமைப்புடன் மேம்படுத்துகிறது",
    "originLink": "https://www.jeffgeerling.com/blog/2024/raspberry-pi-boosts-pi-5-performance-sdram-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303111",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi பொறியாளர்கள் SDRAM (ஒத்திசைவு மாறும் சீரற்ற அணுகல் நினைவகம்) நேரங்களை மேம்படுத்தியுள்ளனர், இதனால் Pi 5 மற்றும் Pi 4 இல் 2.4 GHz இல் 10-20% செயல்திறன் உயர்வு கிடைத்துள்ளது.",
      "மூலமேற்கோள்: காலத்தைக் கடந்து, உற்பத்தியாளர் குறிப்பிட்டுள்ள அளவுகளை விட வேகத்தை அதிகரிப்பது, 32% வரை வேகத்தை அதிகரிக்க முடியும், மேலும் பெரும்பாலான பை 5கள் 2.6-3.0 GHz வரை அடைகின்றன. முடிவுமேற்கோள்.",
      "இந்த செயல்திறன் மேம்பாடுகள், சிறந்த பலமைய செயல்பாட்டை கையாள NUMA (Non-Uniform Memory Access) பாசாங்கு உட்பட, விரைவில் firmware புதுப்பிப்புகள் மூலம் கிடைக்கக்கூடும், சாத்தியமாக நிலையான அம்சங்களாக மாறக்கூடும்."
    ],
    "commentSummary": [
      "ராஸ்பெர்ரி பை 5 SDRAM சீரமைப்பால் மேம்பட்ட செயல்திறனை பெற்றுள்ளது, இதனால் Intel N100களை மாற்று வழியாகப் பயன்படுத்துவது குறித்து விவாதங்கள் எழுந்துள்ளன.- ராஸ்பெர்ரி பைக்களின் விலை உயர்வால், செயல்திறன் மற்றும் விலை ஆகியவற்றில் முன்னுரிமை கொடுப்பவர்களுக்கு Intel N100கள் மேலும் ஈர்க்கக்கூடியதாக உள்ளன, பை களின் GPIO (பொது நோக்கத்திற்கான உள்ளீடு/வெளியீடு) மற்றும் சுருக்கமான அளவு ஆகியவற்றில் உள்ள நன்மைகள் இருந்தாலும்.- சிறந்த பயன்பாட்டு வழக்குகள் குறித்து விவாதம் மையமாக உள்ளது, சிலர் எளிமைக்காக ராஸ்பெர்ரி பைக்களை விரும்புகின்றனர், மற்றவர்கள் தங்கள் மேம்பட்ட சக்தி மற்றும் பல்துறை திறனுக்காக N100களை தேர்வு செய்கின்றனர்."
    ],
    "points": 219,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733200796
  },
  {
    "id": 42303903,
    "title": "எனக்கு Cisco AnyConnect குறித்து மின்னஞ்சல் அனுப்ப தேவையில்லை",
    "originLink": "https://daniel.haxx.se/blog/2024/12/03/no-need-to-email-me-about-cisco-anyconnect/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303903",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியரின் பெயரும் மின்னஞ்சலும் Cisco இன் AnyConnect VPN கிளையன்டில் curl நூலகத்தின் பயன்பாட்டினால் சேர்க்கப்பட்டுள்ளன, இது ஆதரவு தேடும் பயனர்களிடையே குழப்பத்தை ஏற்படுத்துகிறது. - ஆசிரியர் அவர்கள் curl இன் முன்னணி டெவலப்பர் என்பதை விளக்குகின்றனர், இது பயன்பாட்டில் பயன்படுத்தப்படும் ஒரு கூறு, ஆனால் Cisco அல்லது AnyConnect உடன் தொடர்புடையவர்கள் அல்ல. - AnyConnect க்கு ஆதரவு தேவைப்படும் பயனர்கள் ac-mobile-feedback@cisco.com என்ற முகவரியில் நேரடியாக Cisco உடன் தொடர்பு கொள்ள வேண்டும்."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். டேனியல் ஸ்டென்பெர்க், கர்லின் உருவாக்குனர், சிஸ்கோ அனிகனெக்ட் தொடர்பான தவறான ஆதரவு கோரிக்கைகளை அடிக்கடி பெறுகிறார், இது நிறுவனங்கள் தங்களின் ஆதரவு சேனல்களை மறைப்பதன் பிரச்சினைகளை வெளிப்படுத்துகிறது.- பயனர்கள் தங்களின் ஐடி துறைகளை தவிர்க்கிறார்கள், இது முந்தைய எதிர்மறை தொடர்புகளின் காரணமாக இருக்கலாம், இதனால் அவர்கள் தொடர்பில்லாத தரப்புகளிடம் உதவி தேடுகிறார்கள்.- இந்த உரையாடல் ஆன்லைனில் நேரடியாக நபர்களை தொடர்பு கொள்ளும் சிரமங்களை, குறிப்பாக ஸ்பாம் பற்றிய கவலைகளின் காரணமாக, வெளிப்படுத்துகிறது."
    ],
    "points": 209,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1733212485
  },
  {
    "id": 42307223,
    "title": "டக் டக் கோ $25k ஐ பெர்ல் மற்றும் ராகு அறக்கட்டளைக்கு நன்கொடை அளிக்கிறது",
    "originLink": "https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42307223",
    "commentBody": "",
    "originSummary": [
      "\"டக் டக் கோ\" \"கிவிங் டியூஸ்டே\" அன்று \"பெர்ல் மற்றும் ராகு அறக்கட்டளை\" (TPRF)க்கு $25,000 நன்கொடை அளித்து, பெர்ல் மற்றும் ராகு நிரலாக்க மொழிகளை மேம்படுத்தும் அவர்களின் பணி நோக்கத்திற்கு பங்களித்துள்ளது.",
      "2011 முதல், DuckDuckGo ஆன்லைன் நம்பகத்தன்மையை ஆதரிக்கும் அமைப்புகளுக்கு $6 மில்லியனுக்கும் மேல் நன்கொடை வழங்கியுள்ளது, இது பாதுகாப்பான மற்றும் நம்பகமான ஆன்லைன் சூழல்களை உருவாக்குவதற்கான அதன் அர்ப்பணிப்பை வெளிப்படுத்துகிறது.",
      "இந்த நன்கொடை முக்கியமான Perl மேம்பாடு மற்றும் சமூக திட்டங்களுக்கு நிதியளிக்க உதவும், மேலும் TPRF, DuckDuckGo இன் ஆதரவு மற்றும் தங்கள் பணி மீது நம்பிக்கை வைத்ததற்கு நன்றி தெரிவிக்கிறது."
    ],
    "commentSummary": [
      "டக் டக் கோவின் $25k நன்கொடை பெர்ல் மற்றும் ராகு அறக்கட்டளைக்கு வழங்கப்பட்டதால் திறந்த மூல திட்டங்களின் நிலைத்தன்மை குறித்து விவாதங்கள் எழுந்துள்ளன.",
      "Perl பயன்பாட்டின் குறைவு மற்றும் அதற்கு நம்பிக்கை வைக்கும் நிறுவனங்களின் பங்களிப்பின்மை அதன் எதிர்கால நிதி மற்றும் தொழில்நுட்ப கடன் பிரச்சினைகள் பற்றிய கவலைகளை வெளிப்படுத்துகிறது.",
      "திறந்த மூல மாதிரியின் நன்கொடை மற்றும் தன்னார்வப் பணியின்மீது சார்ந்திருப்பது குறித்து நடைபெறும் விவாதம், மாற்று நிதி முறைமைகளை ஆராய்வதை முன்மொழைக்கிறது."
    ],
    "points": 194,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1733240066
  },
  {
    "id": 42304955,
    "title": "நிறுவனம் 1k% விலை உயர்வு அதை VMware இல் இருந்து திறந்த மூல போட்டியாளருக்கு மாற்றியது என்று கூறுகிறது",
    "originLink": "https://arstechnica.com/information-technology/2024/12/company-claims-1000-percent-price-hike-drove-it-from-vmware-to-open-source-rival/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42304955",
    "commentBody": "",
    "originSummary": [
      "பீக்ஸ் குழுமம், ஒரு ஐக்கிய இராச்சிய மேக இயக்குனர், Broadcom VMware ஐ கைப்பற்றிய பிறகு 1,000% விலை உயர்வைத் தொடர்ந்து VMware இல் இருந்து OpenNebula க்கு 20,000 மெய்நிகர் இயந்திரங்களை (VMs) மாற்றியது.",
      "தமிழில் எழுத வேண்டும். இந்த இடமாற்றம் VM திறன் 200% அதிகரிக்கச் செய்தது மற்றும் Beeks க்கு வாடிக்கையாளர் பணிச்சுமைகளுக்கு மேலும் வளங்களை ஒதுக்க அனுமதித்தது.",
      "Broadcom இன் VMware ஐக் கையகப்படுத்தியதால் அதிக செலவுகள் மற்றும் குறைந்த ஆதரவு ஏற்பட்டுள்ளது, இதனால் AT&T உட்பட பல நிறுவனங்கள் வாடிக்கையாளர் அதிருப்தியால் மாற்று வழிகளைத் தேடுகின்றன."
    ],
    "commentSummary": [
      "ஒரு முக்கியமான விலை உயர்வு ஒரு நிறுவனத்தை VMware இல் இருந்து ஒரு திறந்த மூல மாற்றத்திற்கு மாறச் செய்துள்ளது, இது தொழில்துறையில் ஒரு பரந்த போக்கை பிரதிபலிக்கிறது.",
      "VMware-ஐ Broadcom கையகப்படுத்தியதும் அதனைத் தொடர்ந்து விலை மாற்றங்கள் ஏற்பட்டதும், வணிகங்களை பிற விருப்பங்களை ஆராய தூண்டுகின்றன, இதன் விளைவாக Red Hat புதிய வாடிக்கையாளர்களைப் பெறுகிறது.",
      "தொழில்நுட்ப துறையின் கொண்டெய்னர்மயமாக்கல் மற்றும் குபெர்னிடீஸ் நோக்கி மாறுதல் பாரம்பரிய மெய்நிகர் இயந்திரங்களின் கவர்ச்சியை குறைத்து வருகிறது, விற்பனையாளர் பூட்டலின் தேவையை கவனத்தில் கொள்ளவும், ப்ராக்ஸ்மாக்ஸ் அல்லது ஓபன் நெபுலா போன்ற மாற்றுவழிகளை ஆராயவும் வலியுறுத்துகிறது."
    ],
    "points": 194,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1733224054
  }
]
