[
  {
    "id": 42299863,
    "title": "الكتاب الأحمر الصغير لفيسبوك",
    "originLink": "https://www.map.cv/blog/redbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42299863",
    "commentBody": "",
    "originSummary": [
      "في عام 2012، أنشأت فيسبوك \"الكتاب الأحمر الصغير\" للحفاظ على هويتها وتركيزها مع توسعها لتصل إلى مليار مستخدم، مع التركيز على مبادئ مثل كسر الأشياء، التفكير الكبير، والتحرك بسرعة.",
      "الكتاب، الذي صممه بن باري، كان بمثابة بيان للحفاظ على روح فيسبوك خلال النمو السريع، موضحًا أهمية السرد القصصي في توسيع ثقافة الشركة.",
      "تم إنشاء نسخة رقمية عالية الجودة من هذا الكتاب النادر لتوضيح كيفية حفاظ الشركات الناجحة على هويتها وثقافتها."
    ],
    "commentSummary": [
      "كان كتاب \"الكتاب الأحمر الصغير\" لفيسبوك دليلًا للموظفين من عام 2012، مصممًا لإلهام شعور بالمهمة والتفاؤل التكنولوجي.",
      "واجه الدليل انتقادات بسبب سذاجته وافتقاره للوعي الذاتي، خاصة في ضوء الجدل اللاحق حول فيسبوك فيما يتعلق بخصوصية البيانات والمعلومات المضللة.",
      "يُنظر إلى الكتاب على أنه أثر من حقبة أكثر تفاؤلاً في مجال التكنولوجيا، مما يتناقض مع الواقع المعقد الحالي لوسائل التواصل الاجتماعي."
    ],
    "points": 471,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1733170055
  },
  {
    "id": 42306020,
    "title": "رئيس كوريا الجنوبية يعلن حالة الطوارئ والأحكام العرفية",
    "originLink": "https://apnews.com/article/south-korea-yoon-martial-law-997c22ac93f6a9bece68454597e577c1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42306020",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أعلن الرئيس الكوري الجنوبي يون سوك يول حالة الطوارئ العسكرية، لكن الجمعية الوطنية صوتت للمطالبة برفعها، مما جعل الإعلان لاغياً.",
      "يصر الجيش على أن الأحكام العرفية ستستمر حتى ينهيها الرئيس رسميًا، مما يؤدي إلى نقاشات حول الالتزامات الدستورية وإمكانية العزل.",
      "يتم مقارنة الإعلان بمحاولة انقلاب، مما يثير القلق بشأن دور الجيش ودوافع الرئيس، بما في ذلك تجنب التحقيقات في الفضائح."
    ],
    "points": 396,
    "commentCount": 412,
    "retryCount": 0,
    "time": 1733234030
  },
  {
    "id": 42302784,
    "title": "الدروس التي تعلمتها أثناء العمل في معرض فني",
    "originLink": "https://www.henrikkarlsson.xyz/p/art-gallery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يؤكد النص على الطبيعة الذاتية لتقييم الفن وأهمية الشبكات في نجاح مسيرة الفنان المهنية. يناقش التحديات في التنبؤ بالمعارض الفنية الناجحة ودور العلاقات المهنية المبكرة. تمتد المحادثة إلى تعقيدات تعريف \"الفن العظيم\"، وتأثير النجاح التجاري، وأهمية التواصل في البيئات المهنية."
    ],
    "points": 362,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1733195883
  },
  {
    "id": 42303798,
    "title": "واي كومبيناتور والقوة في وادي السيليكون",
    "originLink": "https://commoncog.com/c/cases/y-combinator-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303798",
    "commentBody": "",
    "originSummary": [
      "في عام 2010، واجهت شركة AdGrok الناشئة الصغيرة دعوى قضائية من صاحب العمل السابق، Adchemy، مما هدد استقرارها المالي. لعبت Y Combinator، وهي مسرعة للشركات الناشئة تدعم AdGrok، دورًا محوريًا في حل الدعوى من خلال استغلال نفوذها مع مستثمري Adchemy وشركائها التجاريين المحتملين. على الرغم من الفوز بالدعوى، أدى هذا الموقف إلى بيع AdGrok إلى تويتر في عام 2011، بينما تم بيع Adchemy لاحقًا إلى Walmart Labs في عملية استحواذ سريعة."
    ],
    "commentSummary": [
      "Y Combinator (YC) هو لاعب رئيسي في وادي السيليكون، يؤثر على أي الشركات الناشئة تكتسب زخمًا بعد المسرّع. - يقترح النقاد أن YC قد تبنت استراتيجية \"الرش والصلاة\"، مفضلة عدد الشركات الناشئة على الانتقائية والجودة. - يتمحور النقاش حول ما إذا كان ينبغي على YC توسيع عملياتها أو التركيز على عدد أقل من الشركات الناشئة ذات الجودة العالية، مما يعكس تعقيدات أوسع في ثقافة الشركات الناشئة واستراتيجيات الاستثمار."
    ],
    "points": 269,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1733211287
  },
  {
    "id": 42302426,
    "title": "ثمانية أشهر من استخدام OCaml بعد ثماني سنوات من استخدام Haskell في الإنتاج (2023)",
    "originLink": "https://chshersh.com/blog/2023-12-16-8-months-of-ocaml-after-8-years-of-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302426",
    "commentBody": "",
    "originSummary": [
      "يقارن المؤلف بين Haskell وOCaml بناءً على تجربتهم، مشيرًا إلى أن Haskell يحتوي على ميزات وحزم أكثر، لكن بساطة OCaml تعزز الإنتاجية. أدوات Haskell قوية لكنها غير متسقة، بينما أدوات OCaml بسيطة وموثوقة، مع رسائل مترجم مختصرة. كلا اللغتين مناسبتان للاستخدام الصناعي، لكن المؤلف يفضل OCaml لتركيزها على التطوير بدلاً من التفكير المفرط، على الرغم من أن Haskell يحتوي على توثيق أكثر شمولاً."
    ],
    "commentSummary": [
      "يقارن المؤلف بين تجاربه مع Haskell و OCaml، مسلطًا الضوء على أن Haskell يتميز بنحو أنيق ولكنه معقد وأدوات غير متسقة، خاصة مع إصدارات معينة من GHC (مترجم Haskell Glasgow). يتم الإشادة بـ OCaml لبساطته ونظام الوحدات الأبسط والمترجم الأسرع وعمليته في الإنتاج، مع عدد أقل من الامتدادات اللغوية ومنحنى تعلم أكثر قابلية للإدارة. يؤكد المؤلف على أهمية مكتبة قياسية قوية لنجاح لغة البرمجة."
    ],
    "points": 242,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1733192090
  },
  {
    "id": 42302963,
    "title": "حقنة فيروس نقص المناعة البشرية نصف السنوية تظهر فعالية بنسبة 100% لدى النساء",
    "originLink": "https://apnews.com/article/hiv-infections-aids-prevention-shot-02606f7d7892f0baf55bd0a0ff2ba3de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302963",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أظهر لقاح جديد لفيروس نقص المناعة البشرية يُعطى مرتين سنويًا فعالية بنسبة 100% لدى النساء، مما يوفر بديلاً واعدًا للحبوب اليومية أو الحقن الشهرية.",
      "هذا التطور مهم للأفراد الذين يجدون صعوبة في الالتزام بالجرعات اليومية من الأدوية، مما قد يبسط جهود الوقاية من فيروس نقص المناعة البشرية.",
      "على الرغم من وعوده، فإن تكلفة الشكل القابل للحقن تثير القلق، إلا أن شركة جلعاد تخطط لتقديم نسخ أكثر تكلفة معقولة وجنيسة في 120 دولة ذات دخل منخفض، مما قد يؤثر على الصحة العامة في المناطق ذات الانتشار العالي لفيروس نقص المناعة البشرية."
    ],
    "points": 235,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1733198230
  },
  {
    "id": 42303274,
    "title": "سحب بليزارد للعبة ووركرافت I و II يختبر برنامج الحفظ الجديد لـ GOG",
    "originLink": "https://arstechnica.com/gaming/2024/12/blizzards-pulling-of-warcraft-i-ii-tests-gogs-new-preservation-program/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303274",
    "commentBody": "",
    "originSummary": [
      "طلبت شركة بليزارد من GOG إزالة حزمة Warcraft I & II الخالية من DRM من متجرها بسبب إصدار النسخ المحسنة.",
      "تقدم GOG الحزمة بخصم قبل إزالتها، مما يضمن أن المشترين سيظل لديهم الوصول وسيحصلون على تحديثات للتوافق مع الأنظمة الحديثة.",
      "تؤكد هذه الحالة على التوتر المستمر بين النسخ المعاد تصميمها والأصلية من الألعاب، حيث تسعى GOG للحفاظ على الألعاب الكلاسيكية رغم قرارات الناشرين."
    ],
    "commentSummary": [
      "إزالة بليزارد للعبة ووركرافت I و II من منصة GOG قد أثارت انتقادات، خاصة في ضوء التعليقات السلبية على النسخة المعاد تصميمها من ووركرافت 3.",
      "يعبر المعجبون عن قلقهم من أن شركة بليزارد، بعد اندماجها مع أكتيفيجن، تركز أكثر على الأرباح قصيرة الأجل بدلاً من الحفاظ على جودة الألعاب.",
      "تؤكد هذه الحالة على الصعوبات في الحفاظ على تاريخ الألعاب، كما أبرزها برنامج الحفظ الخاص بـ GOG، وتعكس الاتجاه السائد في الصناعة نحو النماذج التي تركز على الربح."
    ],
    "points": 228,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1733203607
  },
  {
    "id": 42303111,
    "title": "يعزز Raspberry Pi أداء Pi 5 من خلال ضبط SDRAM",
    "originLink": "https://www.jeffgeerling.com/blog/2024/raspberry-pi-boosts-pi-5-performance-sdram-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303111",
    "commentBody": "",
    "originSummary": [
      "قام مهندسو Raspberry Pi بتحسين توقيتات SDRAM (ذاكرة الوصول العشوائي الديناميكية المتزامنة)، مما أدى إلى زيادة في الأداء بنسبة 10-20% لأجهزة Pi 5 و Pi 4 عند تردد 2.4 جيجاهرتز.",
      "يمكن أن يحقق رفع تردد التشغيل، الذي يتضمن زيادة سرعة الساعة إلى ما يتجاوز مواصفات الشركة المصنعة، تسريعًا يصل إلى 32%، حيث تصل معظم أجهزة Pi 5 إلى سرعة تتراوح بين 2.6-3.0 جيجاهرتز.",
      "قد تصبح هذه التحسينات في الأداء، بما في ذلك محاكاة NUMA (الوصول غير المتجانس للذاكرة) لتحسين التعامل مع أحمال العمل متعددة النواة، متاحة قريبًا من خلال تحديثات البرامج الثابتة، وقد تصبح ميزات قياسية."
    ],
    "commentSummary": [
      "يتمتع Raspberry Pi 5 بأداء محسن بفضل ضبط SDRAM، مما أدى إلى مناقشات حول استخدام Intel N100s كبديل. - ارتفاع أسعار Raspberry Pi يجعل Intel N100s أكثر جاذبية لأولئك الذين يفضلون الأداء مقابل التكلفة، على الرغم من مزايا Pi في GPIO (الإدخال/الإخراج العام) والحجم الصغير. - تتركز المناقشة حول أفضل حالات الاستخدام، حيث يفضل البعض Raspberry Pi لبساطته بينما يختار آخرون N100s لقوتها وتعدد استخداماتها."
    ],
    "points": 219,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733200796
  },
  {
    "id": 42303903,
    "title": "لا حاجة لإرسال بريد إلكتروني لي بشأن Cisco AnyConnect",
    "originLink": "https://daniel.haxx.se/blog/2024/12/03/no-need-to-email-me-about-cisco-anyconnect/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303903",
    "commentBody": "",
    "originSummary": [
      "يتم تضمين اسم المؤلف والبريد الإلكتروني في عميل VPN الخاص بـ Cisco AnyConnect بسبب استخدام مكتبة curl، مما يؤدي إلى ارتباك بين المستخدمين الذين يبحثون عن الدعم. يوضح المؤلف أنه المطور الرئيسي لـ curl، وهو مكون مستخدم في التطبيق، ولكنه غير مرتبط بشركة Cisco أو AnyConnect. يجب على المستخدمين الذين يحتاجون إلى دعم لـ AnyConnect الاتصال بشركة Cisco مباشرة على ac-mobile-feedback@cisco.com."
    ],
    "commentSummary": [
      "دانيال ستينبرغ، مبتكر curl، يتلقى بشكل متكرر طلبات دعم موجهة بشكل خاطئ لـ Cisco AnyConnect، مما يوضح المشاكل المتعلقة بالشركات التي تخفي قنوات الدعم الخاصة بها. - غالبًا ما يتجاوز المستخدمون أقسام تكنولوجيا المعلومات الخاصة بهم، ربما بسبب تفاعلات سلبية سابقة، مما يدفعهم للبحث عن المساعدة من أطراف غير ذات صلة. - كما تسلط المحادثة الضوء على صعوبات الاتصال المباشر بالأفراد عبر الإنترنت، وذلك بشكل رئيسي بسبب المخاوف المتعلقة بالبريد العشوائي."
    ],
    "points": 209,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1733212485
  },
  {
    "id": 42307223,
    "title": "تبرعت DuckDuckGo بمبلغ 25 ألف دولار لمؤسسة Perl و Raku",
    "originLink": "https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42307223",
    "commentBody": "",
    "originSummary": [
      "تبرعت شركة DuckDuckGo بمبلغ 25,000 دولار لمؤسسة Perl وRaku (TPRF) في يوم \"الثلاثاء العطاء\"، مساهمة في مهمتهم لتعزيز لغات البرمجة Perl وRaku.",
      "منذ عام 2011، تبرعت DuckDuckGo بأكثر من 6 ملايين دولار لمنظمات تدعم الثقة عبر الإنترنت، مما يبرز التزامها بتعزيز بيئات آمنة وموثوقة على الإنترنت.",
      "ستساعد التبرعات في تمويل تطوير بيرل الأساسي ومشاريع المجتمع، مع تعبير TPRF عن الامتنان لدعم DuckDuckGo وثقتهم في مهمتهم."
    ],
    "commentSummary": [
      "تبرع DuckDuckGo بمبلغ 25 ألف دولار لمؤسسة Perl وRaku أثار نقاشات حول استدامة المشاريع مفتوحة المصدر.",
      "يشير التراجع في استخدام بيرل ونقص المساهمات من الشركات التي تعتمد عليها إلى مخاوف بشأن تمويلها المستقبلي وقضايا الديون التقنية.",
      "يشير النقاش حول اعتماد نموذج المصدر المفتوح على التبرعات والعمل التطوعي إلى استكشاف طرق تمويل بديلة."
    ],
    "points": 194,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1733240066
  },
  {
    "id": 42304955,
    "title": "تدعي الشركة أن زيادة الأسعار بنسبة 1000% دفعتها للانتقال من VMware إلى منافس مفتوح المصدر",
    "originLink": "https://arstechnica.com/information-technology/2024/12/company-claims-1000-percent-price-hike-drove-it-from-vmware-to-open-source-rival/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42304955",
    "commentBody": "",
    "originSummary": [
      "قامت مجموعة بيكس، وهي مشغل سحابي في المملكة المتحدة، بنقل 20,000 آلة افتراضية من VMware إلى OpenNebula بعد زيادة في الأسعار بنسبة 1,000% عقب استحواذ شركة برودكوم على VMware.",
      "عززت هذه الهجرة كفاءة الأجهزة الافتراضية بنسبة 200% وسمحت لشركة Beeks بتخصيص المزيد من الموارد لأعباء عمل العملاء.",
      "استحواذ شركة برودكوم على شركة في إم وير أدى إلى زيادة التكاليف وتقليل الدعم، مما دفع العديد من الشركات، بما في ذلك AT&T، للبحث عن بدائل بسبب عدم رضا العملاء."
    ],
    "commentSummary": [
      "أدى ارتفاع كبير في الأسعار إلى دفع شركة للانتقال من VMware إلى بديل مفتوح المصدر، مما يعكس اتجاهًا أوسع في الصناعة.",
      "استحواذ شركة برودكوم على شركة في إم وير والتغييرات اللاحقة في التسعير تدفع الشركات لاستكشاف خيارات أخرى، مما أدى إلى اكتساب ريد هات عملاء جدد نتيجة لذلك.",
      "إن تحول الصناعة نحو الحاويات وKubernetes يقلل من جاذبية الآلات الافتراضية التقليدية، مما يبرز الحاجة إلى النظر في الاعتماد على مورد واحد واستكشاف بدائل مثل Proxmox أو OpenNebula."
    ],
    "points": 194,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1733224054
  }
]
