[
  {
    "id": 42299863,
    "title": "फेसबुक की छोटी लाल किताब",
    "originLink": "https://www.map.cv/blog/redbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42299863",
    "commentBody": "",
    "originSummary": [
      "2012 में, फेसबुक ने अपनी पहचान और फोकस को बनाए रखने के लिए \"लिटिल रेड बुक\" बनाई, जब यह एक अरब उपयोगकर्ताओं तक विस्तारित हुआ। इसने चीजों को तोड़ने, बड़े सोचने और तेजी से आगे बढ़ने जैसे सिद्धांतों पर जोर दिया।",
      "यह पुस्तक, जिसे बेन बैरी द्वारा डिज़ाइन किया गया था, फेसबुक की तेजी से वृद्धि के दौरान उसकी भावना को संरक्षित करने के लिए एक घोषणापत्र के रूप में कार्य करती है, जो कंपनी की संस्कृति को बढ़ाने में कहानी कहने के महत्व को प्रदर्शित करती है।",
      "इस दुर्लभ पुस्तक का एक उच्च-गुणवत्ता वाला डिजिटल संस्करण तैयार किया गया है ताकि यह दिखाया जा सके कि सफल कंपनियाँ अपनी पहचान और संस्कृति को कैसे बनाए रखती हैं।"
    ],
    "commentSummary": [
      "फेसबुक की \"लिटिल रेड बुक\" 2012 की एक कर्मचारी मार्गदर्शिका थी, जिसे मिशन की भावना और तकनीकी आशावाद को प्रेरित करने के लिए डिज़ाइन किया गया था।",
      "इस गाइड को उसकी सरलता और आत्म-जागरूकता की कमी के लिए आलोचना का सामना करना पड़ा है, विशेष रूप से फेसबुक के बाद के विवादों के संदर्भ में जो डेटा गोपनीयता और गलत सूचना से संबंधित हैं।",
      "यह पुस्तक तकनीक के एक अधिक आशावादी युग की धरोहर के रूप में देखी जाती है, जो सोशल मीडिया की वर्तमान जटिल वास्तविकताओं के विपरीत है।"
    ],
    "points": 471,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1733170055
  },
  {
    "id": 42306020,
    "title": "दक्षिण कोरियाई राष्ट्रपति ने आपातकालीन मार्शल लॉ की घोषणा की",
    "originLink": "https://apnews.com/article/south-korea-yoon-martial-law-997c22ac93f6a9bece68454597e577c1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42306020",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "दक्षिण कोरियाई राष्ट्रपति यून सुक योल ने आपातकालीन मार्शल लॉ की घोषणा की, लेकिन नेशनल असेंबली ने इसे हटाने की मांग के लिए मतदान किया, जिससे यह घोषणा अमान्य हो गई।",
      "सैन्य बल इस बात पर जोर देता है कि मार्शल लॉ तब तक जारी रहेगा जब तक राष्ट्रपति इसे आधिकारिक रूप से समाप्त नहीं करते, जिससे संवैधानिक दायित्वों और संभावित महाभियोग के बारे में बहसें शुरू हो गई हैं।",
      "घोषणा की तुलना एक तख्तापलट प्रयास से की जा रही है, जिससे सेना की भूमिका और राष्ट्रपति के उद्देश्यों, जिसमें घोटाले की जांच से बचना शामिल है, के बारे में चिंताएं बढ़ रही हैं।"
    ],
    "points": 396,
    "commentCount": 412,
    "retryCount": 0,
    "time": 1733234030
  },
  {
    "id": 42302784,
    "title": "कलाकृति दीर्घा में काम करने के दौरान मैंने सीखे सबक",
    "originLink": "https://www.henrikkarlsson.xyz/p/art-gallery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "पाठ कला मूल्यांकन की व्यक्तिपरक प्रकृति और एक कलाकार के करियर की सफलता में नेटवर्किंग के महत्व पर जोर देता है।- यह सफल कला प्रदर्शनियों की भविष्यवाणी में चुनौतियों और प्रारंभिक पेशेवर संबंधों की भूमिका पर चर्चा करता है।- बातचीत \"महान कला\" को परिभाषित करने की जटिलताओं, व्यावसायिक सफलता के प्रभाव, और पेशेवर सेटिंग्स में संचार के महत्व तक विस्तारित होती है।"
    ],
    "points": 362,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1733195883
  },
  {
    "id": 42303798,
    "title": "वाई कॉम्बिनेटर और सिलिकॉन वैली में शक्ति",
    "originLink": "https://commoncog.com/c/cases/y-combinator-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303798",
    "commentBody": "",
    "originSummary": [
      "2010 में, AdGrok, एक छोटा स्टार्टअप, अपने पूर्व नियोक्ता Adchemy से एक मुकदमे का सामना कर रहा था, जिसने उनकी वित्तीय स्थिरता को खतरे में डाल दिया था।- Y Combinator, जो AdGrok का समर्थन करने वाला एक स्टार्टअप एक्सेलेरेटर है, ने Adchemy के निवेशकों और संभावित व्यापारिक साझेदारों के साथ अपने प्रभाव का उपयोग करके मुकदमे को सुलझाने में महत्वपूर्ण भूमिका निभाई।- मुकदमा जीतने के बावजूद, इस घटना ने 2011 में AdGrok की बिक्री ट्विटर को कर दी, जबकि Adchemy को बाद में एक फायर-सेल अधिग्रहण में Walmart Labs को बेच दिया गया।"
    ],
    "commentSummary": [
      "वाई कॉम्बिनेटर (वाईसी) सिलिकॉन वैली में एक प्रमुख खिलाड़ी है, जो यह प्रभावित करता है कि कौन से स्टार्टअप्स एक्सेलेरेटर के बाद गति प्राप्त करते हैं।- आलोचक सुझाव देते हैं कि वाईसी ने \"स्प्रे एंड प्रे\" रणनीति अपनाई है, जो स्टार्टअप्स की संख्या को चयनात्मकता और गुणवत्ता पर प्राथमिकता देती है।- बहस इस बात पर केंद्रित है कि वाईसी को अपने संचालन का विस्तार करना चाहिए या कम, उच्च-गुणवत्ता वाले स्टार्टअप्स पर ध्यान केंद्रित करना चाहिए, जो स्टार्टअप संस्कृति और निवेश रणनीतियों में व्यापक जटिलताओं को दर्शाता है।"
    ],
    "points": 269,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1733211287
  },
  {
    "id": 42302426,
    "title": "8 वर्षों तक उत्पादन में हैस्केल के बाद 8 महीने का ओकैमल (2023)",
    "originLink": "https://chshersh.com/blog/2023-12-16-8-months-of-ocaml-after-8-years-of-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302426",
    "commentBody": "",
    "originSummary": [
      "लेखक अपने अनुभव के आधार पर Haskell और OCaml की तुलना करते हैं, यह बताते हुए कि Haskell में अधिक विशेषताएँ और पैकेज हैं, लेकिन OCaml की सरलता उत्पादकता को बढ़ाती है।- Haskell के उपकरण शक्तिशाली लेकिन असंगत हैं, जबकि OCaml के उपकरण सीधे और विश्वसनीय हैं, जिसमें संक्षिप्त कंपाइलर संदेश होते हैं।- दोनों भाषाएँ औद्योगिक उपयोग के लिए उपयुक्त हैं, लेकिन लेखक OCaml को पसंद करते हैं क्योंकि यह विकास पर ध्यान केंद्रित करता है बजाय अधिक सोचने के, भले ही Haskell का दस्तावेज़ीकरण अधिक व्यापक हो।"
    ],
    "commentSummary": [
      "लेखक ने हस्केल और ओकैमल के साथ अपने अनुभवों की तुलना की है, जिसमें हस्केल की सुंदर लेकिन जटिल सिंटैक्स और असंगत टूलिंग, विशेष रूप से विशिष्ट GHC (ग्लासगो हस्केल कंपाइलर) संस्करणों के साथ, को उजागर किया गया है।- ओकैमल की सराहना इसकी सरलता, सरल मॉड्यूल प्रणाली, तेज कंपाइलर, और उत्पादन में व्यावहारिकता के लिए की जाती है, जिसमें कम भाषा विस्तार और एक अधिक प्रबंधनीय सीखने की प्रक्रिया होती है।- लेखक एक प्रोग्रामिंग भाषा की सफलता के लिए एक मजबूत मानक पुस्तकालय के महत्व पर जोर देते हैं।"
    ],
    "points": 242,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1733192090
  },
  {
    "id": 42302963,
    "title": "छह महीने में एक बार लिया जाने वाला एचआईवी का इंजेक्शन महिलाओं में 100% प्रभावशीलता दिखाता है।",
    "originLink": "https://apnews.com/article/hiv-infections-aids-prevention-shot-02606f7d7892f0baf55bd0a0ff2ba3de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302963",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक नई द्विवार्षिक एचआईवी शॉट ने महिलाओं में 100% प्रभावशीलता प्रदर्शित की है, जो दैनिक गोलियों या मासिक शॉट्स के लिए एक आशाजनक विकल्प प्रदान करता है।",
      "यह विकास उन व्यक्तियों के लिए महत्वपूर्ण है जो दैनिक दवा नियमों का पालन करने में कठिनाई महसूस करते हैं, जिससे एचआईवी रोकथाम के प्रयासों को सरल बनाया जा सकता है।",
      "इसके वादे के बावजूद, इंजेक्टेबल रूप की लागत एक चिंता का विषय है, हालांकि गिलियड 120 निम्न-आय वाले देशों में अधिक सस्ती, जेनेरिक संस्करण पेश करने की योजना बना रहा है, जो उच्च एचआईवी प्रसार वाले क्षेत्रों में सार्वजनिक स्वास्थ्य को प्रभावित कर सकता है।"
    ],
    "points": 235,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1733198230
  },
  {
    "id": 42303274,
    "title": "ब्लिज़ार्ड का वॉरक्राफ्ट I और II को हटाना GOG के नए संरक्षण कार्यक्रम की परीक्षा लेता है।",
    "originLink": "https://arstechnica.com/gaming/2024/12/blizzards-pulling-of-warcraft-i-ii-tests-gogs-new-preservation-program/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303274",
    "commentBody": "",
    "originSummary": [
      "ब्लिज़ार्ड ने GOG से अनुरोध किया है कि वह अपने स्टोर से Warcraft I & II के DRM-मुक्त बंडल को हटा दे, क्योंकि इसके रीमास्टर्ड संस्करण जारी किए गए हैं।",
      "जीओजी बंडल को हटाने से पहले छूट पर पेश कर रहा है, यह सुनिश्चित करते हुए कि खरीदारों को अभी भी पहुंच प्राप्त होगी और आधुनिक सिस्टम के साथ संगतता के लिए अपडेट प्राप्त होंगे।",
      "यह स्थिति रीमास्टर्ड और मूल गेम संस्करणों के बीच चल रहे तनाव को उजागर करती है, जिसमें GOG प्रकाशक के निर्णयों के बावजूद क्लासिक गेम्स को संरक्षित करने का प्रयास कर रहा है।"
    ],
    "commentSummary": [
      "ब्लिज़ार्ड द्वारा GOG से वॉरक्राफ्ट I और II को हटाने से आलोचना हुई है, विशेष रूप से वॉरक्राफ्ट 3 रीमास्टर पर नकारात्मक प्रतिक्रिया के संदर्भ में।",
      "प्रशंसक चिंता व्यक्त कर रहे हैं कि एक्टिविज़न के साथ विलय के बाद ब्लिज़ार्ड अल्पकालिक लाभ पर अधिक ध्यान केंद्रित कर रहा है बजाय इसके कि वह खेल की गुणवत्ता बनाए रखने पर ध्यान दे।",
      "यह स्थिति गेमिंग इतिहास को संरक्षित करने में आने वाली कठिनाइयों को उजागर करती है, जैसा कि GOG के संरक्षण कार्यक्रम द्वारा रेखांकित किया गया है, और उद्योग के लाभ-उन्मुख मॉडलों की प्रवृत्ति को दर्शाती है।"
    ],
    "points": 228,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1733203607
  },
  {
    "id": 42303111,
    "title": "रास्पबेरी पाई ने SDRAM ट्यूनिंग के साथ पाई 5 के प्रदर्शन को बढ़ाया",
    "originLink": "https://www.jeffgeerling.com/blog/2024/raspberry-pi-boosts-pi-5-performance-sdram-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303111",
    "commentBody": "",
    "originSummary": [
      "रास्पबेरी पाई इंजीनियरों ने एसडीआरएएम (सिंक्रोनस डायनामिक रैंडम-एक्सेस मेमोरी) के समय को अनुकूलित किया है, जिसके परिणामस्वरूप पाई 5 और पाई 4 के लिए 2.4 गीगाहर्ट्ज पर 10-20% प्रदर्शन वृद्धि हुई है।",
      "ओवरक्लॉकिंग, जिसमें निर्माता की विशिष्टताओं से परे क्लॉक स्पीड बढ़ाना शामिल है, 32% तक की गति वृद्धि प्राप्त कर सकता है, जिसमें अधिकांश Pi 5s 2.6-3.0 GHz तक पहुंचते हैं।",
      "इन प्रदर्शन सुधारों में, बेहतर मल्टी-कोर वर्कलोड हैंडलिंग के लिए NUMA (नॉन-यूनिफॉर्म मेमोरी एक्सेस) अनुकरण शामिल है, जो जल्द ही फर्मवेयर अपडेट के माध्यम से उपलब्ध हो सकते हैं और संभावित रूप से मानक विशेषताएं बन सकते हैं।"
    ],
    "commentSummary": [
      "रास्पबेरी पाई 5 में एसडीआरएएम ट्यूनिंग के कारण प्रदर्शन में सुधार हुआ है, जिससे इंटेल एन100 का विकल्प के रूप में उपयोग करने पर चर्चा हो रही है।- रास्पबेरी पाई की बढ़ती कीमतें उन लोगों के लिए इंटेल एन100 को अधिक आकर्षक बनाती हैं जो डॉलर प्रति प्रदर्शन को प्राथमिकता देते हैं, भले ही पाई के जीपीआईओ (जनरल पर्पस इनपुट/आउटपुट) और कॉम्पैक्ट आकार में फायदे हों।- बहस का केंद्र सर्वोत्तम उपयोग के मामलों पर है, जिसमें कुछ लोग सरलता के लिए रास्पबेरी पाई को पसंद करते हैं और अन्य लोग उनकी श्रेष्ठ शक्ति और बहुमुखी प्रतिभा के लिए एन100 को चुनते हैं।"
    ],
    "points": 219,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733200796
  },
  {
    "id": 42303903,
    "title": "मुझे सिस्को एनीकनेक्ट के बारे में ईमेल करने की आवश्यकता नहीं है।",
    "originLink": "https://daniel.haxx.se/blog/2024/12/03/no-need-to-email-me-about-cisco-anyconnect/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303903",
    "commentBody": "",
    "originSummary": [
      "लेखक का नाम और ईमेल Cisco के AnyConnect VPN क्लाइंट में curl लाइब्रेरी के उपयोग के कारण शामिल है, जिससे समर्थन की तलाश कर रहे उपयोगकर्ताओं में भ्रम उत्पन्न होता है।- लेखक स्पष्ट करते हैं कि वे curl के प्रमुख डेवलपर हैं, जो ऐप में उपयोग किया गया एक घटक है, लेकिन Cisco या AnyConnect से संबद्ध नहीं हैं।- AnyConnect के लिए समर्थन की आवश्यकता वाले उपयोगकर्ताओं को सीधे Cisco से ac-mobile-feedback@cisco.com पर संपर्क करना चाहिए।"
    ],
    "commentSummary": [
      "कर्ल के निर्माता डैनियल स्टेनबर्ग को अक्सर सिस्को एनीकनेक्ट के लिए गलत समर्थन अनुरोध प्राप्त होते हैं, जो कंपनियों द्वारा उनके समर्थन चैनलों को अस्पष्ट करने की समस्याओं को दर्शाता है।- उपयोगकर्ता अक्सर अपने आईटी विभागों को बायपास कर देते हैं, संभवतः पिछले नकारात्मक इंटरैक्शन के कारण, जिससे वे असंबंधित पक्षों से मदद मांगते हैं।- बातचीत यह भी उजागर करती है कि ऑनलाइन व्यक्तियों से सीधे संपर्क करने में कठिनाइयाँ होती हैं, मुख्य रूप से स्पैम के बारे में चिंताओं के कारण।"
    ],
    "points": 209,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1733212485
  },
  {
    "id": 42307223,
    "title": "डकडकगो ने पर्ल और राकू फाउंडेशन को $25,000 का दान दिया",
    "originLink": "https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42307223",
    "commentBody": "",
    "originSummary": [
      "डकडकगो ने \"गिविंग ट्यूसडे\" पर पर्ल और राकू फाउंडेशन (TPRF) को $25,000 का दान दिया है, जो पर्ल और राकू प्रोग्रामिंग भाषाओं को आगे बढ़ाने के उनके मिशन में योगदान कर रहा है।",
      "2011 से, DuckDuckGo ने ऑनलाइन विश्वास का समर्थन करने वाले संगठनों को $6 मिलियन से अधिक का दान दिया है, जो सुरक्षित और विश्वसनीय ऑनलाइन वातावरण को बढ़ावा देने की अपनी प्रतिबद्धता को दर्शाता है।",
      "दान कोर पर्ल विकास और सामुदायिक परियोजनाओं के वित्तपोषण में सहायता करेगा, जिसमें टीपीआरएफ ने डकडकगो के समर्थन और उनके मिशन में विश्वास के लिए आभार व्यक्त किया।"
    ],
    "commentSummary": [
      "डकडकगो का पर्ल और राकू फाउंडेशन को $25k का दान ओपन-सोर्स परियोजनाओं की स्थिरता पर चर्चाओं को प्रज्वलित कर रहा है।",
      "पर्ल के उपयोग में गिरावट और उन कंपनियों से योगदान की कमी जो इस पर निर्भर हैं, इसके भविष्य के वित्तपोषण और तकनीकी ऋण मुद्दों के बारे में चिंताओं को उजागर करती है।",
      "खुले-स्रोत मॉडल की दान और स्वयंसेवी कार्य पर निर्भरता पर बहस वैकल्पिक वित्तपोषण विधियों की खोज का सुझाव देती है।"
    ],
    "points": 194,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1733240066
  },
  {
    "id": 42304955,
    "title": "कंपनी का दावा है कि 1000% मूल्य वृद्धि ने उसे VMware से ओपन सोर्स प्रतिद्वंद्वी की ओर धकेल दिया।",
    "originLink": "https://arstechnica.com/information-technology/2024/12/company-claims-1000-percent-price-hike-drove-it-from-vmware-to-open-source-rival/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42304955",
    "commentBody": "",
    "originSummary": [
      "बीक्स ग्रुप, एक यूके क्लाउड ऑपरेटर, ने 20,000 वर्चुअल मशीनों (VMs) को VMware से OpenNebula में स्थानांतरित कर दिया, जब ब्रॉडकॉम द्वारा VMware के अधिग्रहण के बाद 1,000% मूल्य वृद्धि हुई।",
      "इस माइग्रेशन ने वीएम दक्षता को 200% तक बढ़ा दिया और बीक्स को क्लाइंट वर्कलोड्स के लिए अधिक संसाधन आवंटित करने की अनुमति दी।",
      "ब्रॉडकॉम द्वारा वीएमवेयर का अधिग्रहण करने से लागत में वृद्धि और समर्थन में कमी आई है, जिससे एटी एंड टी सहित कई कंपनियां ग्राहक असंतोष के कारण विकल्प तलाशने के लिए प्रेरित हुई हैं।"
    ],
    "commentSummary": [
      "एक महत्वपूर्ण मूल्य वृद्धि ने एक कंपनी को VMware से एक ओपन-सोर्स विकल्प की ओर स्थानांतरित करने के लिए प्रेरित किया है, जो उद्योग में एक व्यापक प्रवृत्ति को दर्शाता है।",
      "ब्रॉडकॉम द्वारा वीएमवेयर का अधिग्रहण और उसके बाद की मूल्य निर्धारण में बदलाव व्यवसायों को अन्य विकल्पों की खोज करने के लिए प्रेरित कर रहे हैं, जिसके परिणामस्वरूप रेड हैट को नए ग्राहक मिल रहे हैं।",
      "उद्योग का कंटेनरीकरण और कुबेरनेट्स की ओर झुकाव पारंपरिक वर्चुअल मशीनों की अपील को कम कर रहा है, जिससे विक्रेता लॉक-इन पर विचार करने और प्रॉक्समॉक्स या ओपननेबुला जैसे विकल्पों का पता लगाने की आवश्यकता पर जोर दिया जा रहा है।"
    ],
    "points": 194,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1733224054
  }
]
