[
  {
    "id": 42299863,
    "title": "Facebook'un Küçük Kırmızı Kitabı",
    "originLink": "https://www.map.cv/blog/redbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42299863",
    "commentBody": "",
    "originSummary": [
      "2012 yılında, Facebook kimliğini ve odağını korumak için \"Küçük Kırmızı Kitap\" oluşturdu ve bir milyar kullanıcıya genişlerken, şeyleri bozmak, büyük düşünmek ve hızlı hareket etmek gibi ilkelere vurgu yaptı.",
      "Ben Barry tarafından tasarlanan kitap, Facebook'un hızlı büyüme sırasında ethosunu korumak için bir manifesto olarak hizmet etti ve şirket kültürünü ölçeklendirirken hikaye anlatımının önemini sergiledi.",
      "Nadir bulunan bu kitabın yüksek kaliteli dijital bir versiyonu, başarılı şirketlerin kimliklerini ve kültürlerini nasıl koruduklarını göstermek için oluşturulmuştur."
    ],
    "commentSummary": [
      "Facebook'un \"Küçük Kırmızı Kitap\"ı, 2012 yılında çalışanlar için hazırlanmış bir rehberdi ve bir misyon duygusu ile teknoloji iyimserliği aşılamayı amaçlıyordu.",
      "Kılavuz, özellikle Facebook'un daha sonraki veri gizliliği ve yanlış bilgilendirme ile ilgili tartışmaları ışığında, saflığı ve öz farkındalık eksikliği nedeniyle eleştirilere maruz kaldı.",
      "Kitap, sosyal medyanın mevcut karmaşık gerçekleriyle tezat oluşturan, teknolojide daha umut dolu bir dönemin kalıntısı olarak görülüyor."
    ],
    "points": 471,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1733170055
  },
  {
    "id": 42306020,
    "title": "Güney Kore Devlet Başkanı acil sıkıyönetim ilan etti",
    "originLink": "https://apnews.com/article/south-korea-yoon-martial-law-997c22ac93f6a9bece68454597e577c1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42306020",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Güney Kore Devlet Başkanı Yoon Suk Yeol, olağanüstü hal sıkıyönetimi ilan etti, ancak Ulusal Meclis, kaldırılmasını talep etmek için oy kullandı ve bu da ilanı geçersiz kıldı.",
      "Ordu, sıkıyönetimin başkan resmen sona erdirene kadar devam edeceğinde ısrar ediyor, bu da anayasal yükümlülükler ve olası azil hakkında tartışmalara yol açıyor.",
      "Bildiri, bir darbe girişimiyle karşılaştırılarak, askerin rolü ve başkanın skandal soruşturmalarından kaçınma gibi motivasyonları hakkında endişeleri artırıyor."
    ],
    "points": 396,
    "commentCount": 412,
    "retryCount": 0,
    "time": 1733234030
  },
  {
    "id": 42302784,
    "title": "Bir sanat galerisinde çalışırken öğrendiğim dersler",
    "originLink": "https://www.henrikkarlsson.xyz/p/art-gallery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Metin, sanat değerlendirmesinin öznel doğasını ve bir sanatçının kariyer başarısında ağ kurmanın önemini vurguluyor.- Başarılı sanat sergilerini tahmin etmenin zorluklarını ve erken profesyonel bağlantıların rolünü tartışıyor.- Konuşma, \"büyük sanat\"ı tanımlamanın karmaşıklıklarına, ticari başarının etkisine ve profesyonel ortamlarda iletişimin önemine kadar uzanıyor."
    ],
    "points": 362,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1733195883
  },
  {
    "id": 42303798,
    "title": "Y Combinator ve Silikon Vadisi'ndeki Güç",
    "originLink": "https://commoncog.com/c/cases/y-combinator-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303798",
    "commentBody": "",
    "originSummary": [
      "2010 yılında, küçük bir girişim olan AdGrok, eski işvereni Adchemy'den gelen ve mali istikrarlarını tehdit eden bir dava ile karşı karşıya kaldı. AdGrok'u destekleyen bir girişim hızlandırıcısı olan Y Combinator, Adchemy'nin yatırımcıları ve potansiyel iş ortakları üzerindeki etkisini kullanarak davanın çözülmesinde önemli bir rol oynadı. Davayı kazanmalarına rağmen, bu zorlu süreç AdGrok'un 2011 yılında Twitter'a satılmasına yol açtı, Adchemy ise daha sonra Walmart Labs'e yangın satışı şeklinde bir satın alma ile satıldı."
    ],
    "commentSummary": [
      "Y Combinator (YC), Silikon Vadisi'nde önemli bir oyuncu olup, hızlandırıcı sonrası hangi girişimlerin ivme kazandığını etkilemektedir. Eleştirmenler, YC'nin seçicilik ve kalite yerine girişim sayısını önceliklendiren bir \"saç ve dua et\" stratejisi benimsediğini öne sürmektedir. Tartışma, YC'nin operasyonlarını ölçeklendirmesi mi yoksa daha az sayıda, yüksek kaliteli girişimlere mi odaklanması gerektiği üzerinde yoğunlaşmakta olup, bu durum girişim kültürü ve yatırım stratejilerindeki daha geniş karmaşıklıkları yansıtmaktadır."
    ],
    "points": 269,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1733211287
  },
  {
    "id": 42302426,
    "title": "Üretimde 8 yıl Haskell'den sonra 8 ay OCaml (2023)",
    "originLink": "https://chshersh.com/blog/2023-12-16-8-months-of-ocaml-after-8-years-of-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302426",
    "commentBody": "",
    "originSummary": [
      "Yazar, deneyimlerine dayanarak Haskell ve OCaml'ı karşılaştırıyor, Haskell'in daha fazla özelliğe ve pakete sahip olduğunu, ancak OCaml'ın sadeliğinin verimliliği artırdığını vurguluyor.- Haskell'in araçları güçlü ancak tutarsızken, OCaml'ın araçları basit ve güvenilir olup, özlü derleyici mesajlarına sahiptir.- Her iki dil de endüstriyel kullanım için uygundur, ancak yazar, Haskell'in daha kapsamlı belgelerine rağmen, OCaml'ı aşırı düşünmek yerine geliştirmeye odaklandığı için tercih ediyor."
    ],
    "commentSummary": [
      "Yazar, Haskell ve OCaml ile olan deneyimlerini karşılaştırarak, Haskell'in zarif ama karmaşık sözdizimi ve özellikle belirli GHC (Glasgow Haskell Compiler) sürümleriyle tutarsız araçlarını vurguluyor.- OCaml, daha basit modül sistemi, daha hızlı derleyici ve üretimdeki pratikliği, daha az dil uzantısı ve daha yönetilebilir bir öğrenme eğrisi ile övülüyor.- Yazar, bir programlama dilinin başarısı için sağlam bir standart kütüphanenin önemini vurguluyor."
    ],
    "points": 242,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1733192090
  },
  {
    "id": 42302963,
    "title": "Yılda İki Kez Yapılan HIV Aşısı Kadınlarda %100 Etkinlik Gösteriyor",
    "originLink": "https://apnews.com/article/hiv-infections-aids-prevention-shot-02606f7d7892f0baf55bd0a0ff2ba3de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302963",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yeni bir yılda iki kez uygulanan HIV iğnesi, kadınlarda %100 etkililik göstererek günlük haplar veya aylık iğnelere umut verici bir alternatif sunuyor.",
      "Bu gelişme, günlük ilaç rejimlerine uymakta zorlanan bireyler için çok önemlidir ve potansiyel olarak HIV önleme çabalarını basitleştirebilir.",
      "Enjeksiyon formunun vaatlerine rağmen maliyeti bir endişe kaynağıdır, ancak Gilead, 120 düşük gelirli ülkede daha uygun fiyatlı, jenerik versiyonlar sunmayı planlıyor ve bu da yüksek HIV yaygınlığı olan bölgelerde halk sağlığını potansiyel olarak etkileyebilir."
    ],
    "points": 235,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1733198230
  },
  {
    "id": 42303274,
    "title": "Blizzard'ın Warcraft I ve II'yi geri çekmesi, GOG'un yeni Koruma Programını test ediyor",
    "originLink": "https://arstechnica.com/gaming/2024/12/blizzards-pulling-of-warcraft-i-ii-tests-gogs-new-preservation-program/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303274",
    "commentBody": "",
    "originSummary": [
      "Blizzard, remastered sürümlerinin piyasaya sürülmesi nedeniyle GOG'dan Warcraft I & II'nin DRM'siz paketini mağazasından kaldırmasını istedi.",
      "GOG, paketi kaldırmadan önce indirimli olarak sunuyor ve alıcıların modern sistemlerle uyumluluk için güncellemeleri alacaklarını ve erişimlerinin devam edeceğini garanti ediyor.",
      "Bu durum, GOG'un yayıncı kararlarına rağmen klasik oyunları korumaya çalışmasıyla birlikte, yeniden düzenlenmiş ve orijinal oyun sürümleri arasındaki devam eden gerilimi vurguluyor."
    ],
    "commentSummary": [
      "Blizzard'ın Warcraft I ve II'yi GOG'dan kaldırması, özellikle Warcraft 3 remaster'ı hakkındaki olumsuz geri bildirimler ışığında eleştiri aldı.",
      "Hayranlar, Blizzard'ın Activision ile birleşmesinden sonra, oyun kalitesini korumaktan ziyade kısa vadeli kârlara daha fazla odaklandığı konusunda endişelerini dile getiriyorlar.",
      "Bu durum, GOG'un Koruma Programı tarafından vurgulanan oyun tarihini koruma zorluklarını ve endüstrinin kâr odaklı modellere yönelme eğilimini yansıtıyor."
    ],
    "points": 228,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1733203607
  },
  {
    "id": 42303111,
    "title": "Raspberry Pi, SDRAM ayarlaması ile Pi 5 performansını artırıyor",
    "originLink": "https://www.jeffgeerling.com/blog/2024/raspberry-pi-boosts-pi-5-performance-sdram-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303111",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi mühendisleri, SDRAM (Eşzamanlı Dinamik Rastgele Erişimli Bellek) zamanlamalarını optimize ederek, Pi 5 ve Pi 4 için 2.4 GHz'de %10-20 performans artışı sağladı.",
      "Üreticinin belirttiği özelliklerin ötesinde saat hızını artırmayı içeren overclocking, %32'ye kadar hız artışı sağlayabilir ve çoğu Pi 5, 2.6-3.0 GHz'e ulaşabilir.",
      "Bu performans iyileştirmeleri, daha iyi çok çekirdekli iş yükü yönetimi için NUMA (Non-Uniform Memory Access) emülasyonu da dahil olmak üzere, yakında ürün yazılımı güncellemeleri aracılığıyla kullanılabilir hale gelebilir ve potansiyel olarak standart özellikler haline gelebilir."
    ],
    "commentSummary": [
      "Raspberry Pi 5, SDRAM ayarlamaları sayesinde performansını artırdı ve bu durum, alternatif olarak Intel N100'lerin kullanılmasını tartışmaya açtı.- Raspberry Pi'lerin artan fiyatları, performans başına maliyeti önceliklendirenler için Intel N100'leri daha çekici hale getiriyor, Pi'nin GPIO (Genel Amaçlı Giriş/Çıkış) ve kompakt boyut avantajlarına rağmen.- Tartışma, en iyi kullanım alanları üzerinde yoğunlaşıyor; bazıları basitlik için Raspberry Pi'leri tercih ederken, diğerleri üstün güç ve çok yönlülükleri nedeniyle N100'leri seçiyor."
    ],
    "points": 219,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733200796
  },
  {
    "id": 42303903,
    "title": "Benimle Cisco AnyConnect hakkında e-posta göndermeye gerek yok",
    "originLink": "https://daniel.haxx.se/blog/2024/12/03/no-need-to-email-me-about-cisco-anyconnect/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303903",
    "commentBody": "",
    "originSummary": [
      "Yazarın adı ve e-posta adresi, curl kütüphanesinin kullanımı nedeniyle Cisco'nun AnyConnect VPN istemcisinde yer almakta ve bu durum, destek arayan kullanıcılar arasında karışıklığa yol açmaktadır.- Yazar, uygulamada kullanılan bir bileşen olan curl'ün baş geliştiricisi olduğunu, ancak Cisco veya AnyConnect ile bağlantılı olmadığını açıklamaktadır.- AnyConnect için desteğe ihtiyaç duyan kullanıcılar, doğrudan Cisco ile ac-mobile-feedback@cisco.com adresinden iletişime geçmelidir."
    ],
    "commentSummary": [
      "Daniel Stenberg, curl'ün yaratıcısı, sık sık Cisco AnyConnect için yanlış yönlendirilmiş destek talepleri alıyor, bu da şirketlerin destek kanallarını gizlemeleriyle ilgili sorunları gösteriyor. Kullanıcılar, muhtemelen önceki olumsuz etkileşimler nedeniyle, genellikle BT departmanlarını atlayarak, ilgisiz taraflardan yardım aramaya yöneliyorlar. Konuşma ayrıca, spam endişeleri nedeniyle, çevrimiçi olarak bireylerle doğrudan iletişim kurmanın zorluklarını da vurguluyor."
    ],
    "points": 209,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1733212485
  },
  {
    "id": 42307223,
    "title": "DuckDuckGo, Perl ve Raku Vakfı'na 25 bin dolar bağışladı.",
    "originLink": "https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42307223",
    "commentBody": "",
    "originSummary": [
      "\"Giving Tuesday\" günü DuckDuckGo, Perl ve Raku programlama dillerini geliştirme misyonlarına katkıda bulunarak Perl ve Raku Vakfı'na (TPRF) 25.000 dolar bağışta bulundu.",
      "2011 yılından bu yana DuckDuckGo, çevrimiçi güveni destekleyen kuruluşlara 6 milyon dolardan fazla bağışta bulunarak, güvenli ve güvenilir çevrimiçi ortamların geliştirilmesine olan bağlılığını vurgulamaktadır.",
      "Bağış, temel Perl geliştirme ve topluluk projelerinin finansmanına yardımcı olacak ve TPRF, DuckDuckGo'nun desteği ve misyonlarına olan güveni için minnettarlığını ifade ediyor."
    ],
    "commentSummary": [
      "DuckDuckGo'nun Perl ve Raku Vakfı'na yaptığı 25 bin dolarlık bağış, açık kaynak projelerinin sürdürülebilirliği üzerine tartışmaları ateşledi.",
      "Perl kullanımındaki düşüş ve ona güvenen şirketlerden gelen katkıların eksikliği, gelecekteki finansmanı ve teknoloji borcu sorunları hakkındaki endişeleri vurgulamaktadır.",
      "Bağışlar ve gönüllü çalışmalara dayanan açık kaynak modeline ilişkin tartışma, alternatif finansman yöntemlerinin araştırılmasını önermektedir."
    ],
    "points": 194,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1733240066
  },
  {
    "id": 42304955,
    "title": "Şirket, %1000 fiyat artışının kendisini VMware'den açık kaynak rakibine yönlendirdiğini iddia ediyor",
    "originLink": "https://arstechnica.com/information-technology/2024/12/company-claims-1000-percent-price-hike-drove-it-from-vmware-to-open-source-rival/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42304955",
    "commentBody": "",
    "originSummary": [
      "Beeks Group, bir İngiltere bulut operatörü, Broadcom'un VMware'i satın almasının ardından %1000'lik bir fiyat artışı sonrasında 20.000 sanal makineyi (VM) VMware'den OpenNebula'ya geçirdi.",
      "Bu geçiş, VM verimliliğini %200 artırdı ve Beeks'in müşteri iş yüklerine daha fazla kaynak ayırmasına olanak tanıdı.",
      "Broadcom'un VMware'i satın alması, artan maliyetlere ve azalan desteğe yol açtı, bu da AT&T dahil birçok şirketin müşteri memnuniyetsizliği nedeniyle alternatifler aramasına neden oldu."
    ],
    "commentSummary": [
      "Önemli bir fiyat artışı, bir şirketi VMware'den açık kaynaklı bir alternatife geçmeye yönlendirdi ve bu durum, sektördeki daha geniş bir eğilimi yansıtıyor.",
      "Broadcom'un VMware'i satın alması ve ardından gelen fiyat değişiklikleri, işletmeleri diğer seçenekleri keşfetmeye yönlendiriyor ve bu durum sonucunda Red Hat yeni müşteriler kazanıyor.",
      "Endüstrinin konteynerleştirme ve Kubernetes'e doğru kayması, geleneksel sanal makinelerin cazibesini azaltıyor ve satıcıya bağımlılığı dikkate alarak Proxmox veya OpenNebula gibi alternatifleri keşfetme ihtiyacını vurguluyor."
    ],
    "points": 194,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1733224054
  }
]
