[
  {
    "id": 42299863,
    "title": "Маленькая красная книга Facebook",
    "originLink": "https://www.map.cv/blog/redbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42299863",
    "commentBody": "",
    "originSummary": [
      "В 2012 году Facebook создал «Маленькую Красную Книгу», чтобы сохранить свою идентичность и сосредоточенность по мере расширения до миллиарда пользователей, подчеркивая такие принципы, как ломать вещи, мыслить масштабно и двигаться быстро.",
      "Книга, разработанная Беном Барри, служила манифестом для сохранения духа Facebook в период быстрого роста, демонстрируя важность повествования в масштабировании корпоративной культуры.",
      "Создана высококачественная цифровая версия этой редкой книги, чтобы показать, как успешные компании сохраняют свою идентичность и культуру."
    ],
    "commentSummary": [
      "«Маленькая красная книга» Facebook была руководством для сотрудников 2012 года, созданным для вдохновения чувства миссии и технологического оптимизма.",
      "Руководство подверглось критике за свою наивность и недостаток самосознания, особенно в свете последующих скандалов Facebook, связанных с конфиденциальностью данных и дезинформацией.",
      "Книга рассматривается как реликт из более надежной эпохи в технологиях, контрастирующий с нынешними сложными реалиями социальных медиа."
    ],
    "points": 471,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1733170055
  },
  {
    "id": 42306020,
    "title": "Президент Южной Кореи объявляет чрезвычайное военное положение",
    "originLink": "https://apnews.com/article/south-korea-yoon-martial-law-997c22ac93f6a9bece68454597e577c1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42306020",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Президент Южной Кореи Юн Сок Ёль объявил чрезвычайное военное положение, но Национальная ассамблея проголосовала за его отмену, что сделало объявление недействительным.",
      "Военные настаивают на том, что военное положение будет продолжаться до тех пор, пока президент официально не прекратит его, что приводит к дебатам о конституционных обязательствах и возможном импичменте.",
      "Декларация сравнивается с попыткой переворота, вызывая обеспокоенность по поводу роли военных и мотивов президента, включая избегание расследований скандалов."
    ],
    "points": 396,
    "commentCount": 412,
    "retryCount": 0,
    "time": 1733234030
  },
  {
    "id": 42302784,
    "title": "Уроки, которые я извлек, работая в художественной галерее",
    "originLink": "https://www.henrikkarlsson.xyz/p/art-gallery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Текст подчеркивает субъективный характер оценки искусства и значимость сетевого взаимодействия для успеха карьеры художника. Обсуждаются трудности в прогнозировании успешных художественных выставок и роль ранних профессиональных связей. Разговор затрагивает сложности в определении «великого искусства», влияние коммерческого успеха и важность коммуникации в профессиональной среде."
    ],
    "points": 362,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1733195883
  },
  {
    "id": 42303798,
    "title": "Y Combinator и власть в Кремниевой долине",
    "originLink": "https://commoncog.com/c/cases/y-combinator-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303798",
    "commentBody": "",
    "originSummary": [
      "В 2010 году AdGrok, небольшой стартап, столкнулся с иском от своего бывшего работодателя, Adchemy, что угрожало их финансовой стабильности. - Y Combinator, акселератор стартапов, поддерживающий AdGrok, сыграл ключевую роль в разрешении иска, используя свое влияние на инвесторов и потенциальных деловых партнеров Adchemy. - Несмотря на выигрыш в суде, это испытание привело к продаже AdGrok компании Twitter в 2011 году, в то время как Adchemy позже была продана Walmart Labs в рамках вынужденной продажи."
    ],
    "commentSummary": [
      "Y Combinator (YC) является важным игроком в Кремниевой долине, влияя на то, какие стартапы получают развитие после акселератора. Критики утверждают, что YC принял стратегию \"разбрызгивания и молитвы\", отдавая приоритет количеству стартапов над избирательностью и качеством. Дискуссия сосредоточена на том, следует ли YC расширять свои операции или сосредоточиться на меньшем количестве высококачественных стартапов, что отражает более широкие сложности в культуре стартапов и инвестиционных стратегиях."
    ],
    "points": 269,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1733211287
  },
  {
    "id": 42302426,
    "title": "8 месяцев OCaml после 8 лет использования Haskell в производстве (2023)",
    "originLink": "https://chshersh.com/blog/2023-12-16-8-months-of-ocaml-after-8-years-of-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302426",
    "commentBody": "",
    "originSummary": [
      "Автор сравнивает Haskell и OCaml на основе своего опыта, подчеркивая, что Haskell имеет больше функций и пакетов, но простота OCaml повышает продуктивность. Инструментарий Haskell мощный, но непоследовательный, в то время как инструментарий OCaml прост и надежен, с лаконичными сообщениями компилятора. Обе языки подходят для промышленного использования, но автор предпочитает OCaml за его ориентацию на разработку, а не на излишние размышления, несмотря на более полную документацию Haskell."
    ],
    "commentSummary": [
      "Автор сравнивает свой опыт работы с Haskell и OCaml, подчеркивая элегантный, но сложный синтаксис Haskell и непоследовательные инструменты, особенно с определенными версиями GHC (Glasgow Haskell Compiler). OCaml хвалят за его простоту, более простую систему модулей, более быстрый компилятор и практичность в производстве, с меньшим количеством расширений языка и более управляемой кривой обучения. Автор подчеркивает значимость надежной стандартной библиотеки для успеха языка программирования."
    ],
    "points": 242,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1733192090
  },
  {
    "id": 42302963,
    "title": "Дважды в год инъекция от ВИЧ показала 100% эффективность у женщин",
    "originLink": "https://apnews.com/article/hiv-infections-aids-prevention-shot-02606f7d7892f0baf55bd0a0ff2ba3de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42302963",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Новый двухразовый в год укол от ВИЧ продемонстрировал 100% эффективность у женщин, предлагая многообещающую альтернативу ежедневным таблеткам или ежемесячным уколам.",
      "Это развитие имеет решающее значение для людей, которым сложно придерживаться ежедневных схем приема лекарств, что потенциально упрощает усилия по профилактике ВИЧ.",
      "Несмотря на его перспективность, стоимость инъекционной формы вызывает беспокойство, хотя Gilead планирует предложить более доступные, дженериковые версии в 120 странах с низким уровнем дохода, что может повлиять на общественное здоровье в регионах с высокой распространенностью ВИЧ."
    ],
    "points": 235,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1733198230
  },
  {
    "id": 42303274,
    "title": "Удаление Blizzard игр Warcraft I и II проверяет новую программу сохранения GOG.",
    "originLink": "https://arstechnica.com/gaming/2024/12/blizzards-pulling-of-warcraft-i-ii-tests-gogs-new-preservation-program/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303274",
    "commentBody": "",
    "originSummary": [
      "Blizzard попросила GOG удалить из своего магазина набор Warcraft I & II без DRM-защиты в связи с выпуском ремастированных версий.",
      "Компания GOG предлагает комплект со скидкой перед его удалением, гарантируя, что покупатели по-прежнему будут иметь доступ и получать обновления для совместимости с современными системами.",
      "Эта ситуация подчеркивает продолжающееся напряжение между ремастированными и оригинальными версиями игр, при этом GOG стремится сохранить классические игры, несмотря на решения издателей."
    ],
    "commentSummary": [
      "Удаление Blizzard игр Warcraft I и II с GOG вызвало критику, особенно на фоне негативных отзывов о ремастере Warcraft 3.",
      "Поклонники выражают обеспокоенность тем, что после слияния с Activision компания Blizzard больше сосредоточена на краткосрочной прибыли, чем на поддержании качества игр.",
      "Эта ситуация подчеркивает трудности в сохранении истории игр, как это отмечено Программой сохранения GOG, и отражает тенденцию индустрии к моделям, ориентированным на получение прибыли."
    ],
    "points": 228,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1733203607
  },
  {
    "id": 42303111,
    "title": "Raspberry Pi увеличивает производительность Pi 5 с помощью настройки SDRAM",
    "originLink": "https://www.jeffgeerling.com/blog/2024/raspberry-pi-boosts-pi-5-performance-sdram-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303111",
    "commentBody": "",
    "originSummary": [
      "Инженеры Raspberry Pi оптимизировали тайминги SDRAM (синхронной динамической оперативной памяти), что привело к увеличению производительности на 10-20% для Pi 5 и Pi 4 на частоте 2,4 ГГц.",
      "Разгон, который включает в себя увеличение тактовой частоты сверх спецификаций производителя, может обеспечить ускорение до 32%, при этом большинство Pi 5 достигают 2.6-3.0 ГГц.",
      "Эти улучшения производительности, включая эмуляцию NUMA (неоднородный доступ к памяти) для более эффективной обработки многопоточных задач, могут вскоре стать доступными через обновления прошивки, возможно, став стандартными функциями."
    ],
    "commentSummary": [
      "Raspberry Pi 5 имеет улучшенную производительность благодаря настройке SDRAM, что приводит к обсуждениям о возможности использования Intel N100s в качестве альтернативы. Растущие цены на Raspberry Pi делают Intel N100s более привлекательными для тех, кто ставит в приоритет производительность за доллар, несмотря на преимущества Pi в GPIO (общего назначения вход/выход) и компактных размерах. Дебаты сосредоточены на лучших вариантах использования, где одни предпочитают Raspberry Pi за простоту, а другие выбирают N100s за их превосходную мощность и универсальность."
    ],
    "points": 219,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733200796
  },
  {
    "id": 42303903,
    "title": "Нет необходимости отправлять мне электронное письмо о Cisco AnyConnect",
    "originLink": "https://daniel.haxx.se/blog/2024/12/03/no-need-to-email-me-about-cisco-anyconnect/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42303903",
    "commentBody": "",
    "originSummary": [
      "Имя и электронная почта автора включены в клиент VPN Cisco AnyConnect из-за использования библиотеки curl, что приводит к путанице среди пользователей, ищущих поддержку. Автор поясняет, что он является ведущим разработчиком curl, компонента, используемого в приложении, но не связан с Cisco или AnyConnect. Пользователи, нуждающиеся в поддержке AnyConnect, должны обращаться непосредственно в Cisco по адресу ac-mobile-feedback@cisco.com."
    ],
    "commentSummary": [
      "Даниэль Стенберг, создатель curl, часто получает ошибочные запросы на поддержку для Cisco AnyConnect, что иллюстрирует проблемы с компаниями, скрывающими свои каналы поддержки. Пользователи часто обходят свои IT-отделы, возможно, из-за предыдущих негативных взаимодействий, что приводит их к поиску помощи у несвязанных сторон. Разговор также подчеркивает трудности прямого контакта с людьми в интернете, главным образом из-за опасений по поводу спама."
    ],
    "points": 209,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1733212485
  },
  {
    "id": 42307223,
    "title": "Компания DuckDuckGo пожертвовала $25,000 Фонду Perl и Raku.",
    "originLink": "https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42307223",
    "commentBody": "",
    "originSummary": [
      "Компания DuckDuckGo пожертвовала 25 000 долларов Фонду Perl и Raku (TPRF) в рамках акции «Щедрый вторник», поддерживая их миссию по развитию языков программирования Perl и Raku.",
      "С 2011 года DuckDuckGo пожертвовал более 6 миллионов долларов организациям, поддерживающим доверие в интернете, подчеркивая свою приверженность созданию безопасных и надежных онлайн-сред.",
      "Пожертвование поможет финансировать основную разработку Perl и проекты сообщества, при этом TPRF выражает благодарность DuckDuckGo за поддержку и уверенность в их миссии."
    ],
    "commentSummary": [
      "Пожертвование в размере $25,000 от DuckDuckGo в пользу Фонда Perl и Raku вызвало обсуждения о устойчивости проектов с открытым исходным кодом.",
      "Снижение использования Perl и отсутствие вкладов от компаний, которые на него полагаются, подчеркивают обеспокоенность по поводу его будущего финансирования и проблем с техническим долгом.",
      "Дискуссия о зависимости модели с открытым исходным кодом от пожертвований и волонтерской работы предполагает изучение альтернативных методов финансирования."
    ],
    "points": 194,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1733240066
  },
  {
    "id": 42304955,
    "title": "Компания утверждает, что повышение цен на 1000% заставило её перейти от VMware к открытому исходному коду конкурента",
    "originLink": "https://arstechnica.com/information-technology/2024/12/company-claims-1000-percent-price-hike-drove-it-from-vmware-to-open-source-rival/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42304955",
    "commentBody": "",
    "originSummary": [
      "Компания Beeks Group, британский оператор облачных технологий, перевела 20,000 виртуальных машин (VM) с VMware на OpenNebula после увеличения цен на 1,000% после приобретения VMware компанией Broadcom.",
      "Эта миграция повысила эффективность виртуальных машин на 200% и позволила Beeks выделить больше ресурсов для рабочих нагрузок клиентов.",
      "Поглощение VMware компанией Broadcom привело к увеличению затрат и снижению уровня поддержки, что побудило многие компании, включая AT&T, искать альтернативы из-за недовольства клиентов."
    ],
    "commentSummary": [
      "Значительное повышение цен побудило компанию перейти с VMware на альтернативное решение с открытым исходным кодом, что отражает более широкую тенденцию в отрасли.",
      "Приобретение VMware компанией Broadcom и последующие изменения в ценообразовании побуждают компании искать другие варианты, в результате чего Red Hat приобретает новых клиентов.",
      "Переход отрасли к контейнеризации и Kubernetes снижает привлекательность традиционных виртуальных машин, подчеркивая необходимость учитывать зависимость от поставщика и исследовать альтернативы, такие как Proxmox или OpenNebula."
    ],
    "points": 194,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1733224054
  }
]
