[
  {
    "id": 42845091,
    "title": "हम पेबल को वापस ला रहे हैं",
    "originLink": "https://repebble.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845091",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "पेबल को गूगल के समर्थन से पुनर्जीवित किया जा रहा है, जो इसकी मूल ताकतों जैसे हैकबिलिटी, लंबी बैटरी लाइफ, और फोन एक्सटेंशन के रूप में सेवा करने पर ध्यान केंद्रित कर रहा है।",
      "पुनरुद्धार का उद्देश्य पेबल की ओपन-सोर्स प्रकृति को बनाए रखना और अनिवार्य क्लाउड सदस्यताओं से बचना है, जो हैकर्स और तकनीकी उत्साही लोगों को आकर्षित करता है।",
      "समुदाय पेबल की वापसी को लेकर उत्साहित है, इसके अनोखे फीचर्स और पहनने योग्य तकनीक पर इसके प्रभाव को याद कर रहा है।"
    ],
    "points": 2443,
    "commentCount": 625,
    "retryCount": 0,
    "time": 1738008679
  },
  {
    "id": 42845070,
    "title": "गूगल ने पब्ल ओएस को ओपन-सोर्स किया",
    "originLink": "https://opensource.googleblog.com/2025/01/see-code-that-powered-pebble-smartwatches.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845070",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "गूगल ने पेबल ओएस को ओपन-सोर्स कर दिया है, जिससे स्मार्टवॉच तकनीक में संभावित नए विकास के लिए प्रशंसकों और डेवलपर्स के बीच उत्साह उत्पन्न हो गया है।",
      "GitHub पर जारी संस्करण में सिस्टम फोंट्स और ब्लूटूथ स्टैक जैसे स्वामित्व वाले घटक शामिल नहीं हैं, इसलिए इसे वर्तमान रूप में संकलित नहीं किया जा सकता।",
      "इस कदम को गूगल की ओर से एक सकारात्मक इशारा माना जा रहा है, जो आंतरिक प्रयासों के कारण है, और इसे पेबल स्मार्टवॉच इकोसिस्टम को पुनर्जीवित करने की दिशा में एक कदम के रूप में देखा जा रहा है।"
    ],
    "points": 1207,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1738008549
  },
  {
    "id": 42850222,
    "title": "डीपसीक आर1 डायनामिक 1.58-बिट चलाएं",
    "originLink": "https://unsloth.ai/blog/deepseekr1-dynamic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42850222",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "डीपसीक आर1 डायनामिक 1.58-बिट 80% आकार में कमी प्राप्त करता है और दोहरे H100s का उपयोग करते हुए 140 टोकन प्रति सेकंड की गति से संचालित होता है, लेकिन इसकी धीमी गति और पुनरावृत्ति के मुद्दे इसके व्यावहारिकता पर सवाल उठाते हैं।",
      "गतिशील क्वांटाइजेशन प्रदर्शन में सहायता करता है, फिर भी पहुंच, लागत, और मॉडल के प्रशिक्षण लागत के दावों के बारे में चिंताएं बनी रहती हैं, जिससे जांच की आवश्यकता होती है।",
      "मॉडल का बाजार पर उल्लेखनीय प्रभाव है, इसके परिणामों की नकल करने के प्रयास चल रहे हैं, हालांकि इसके प्रदर्शन की तुलना बड़े मॉडलों से की जाती है।"
    ],
    "points": 596,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1738054367
  },
  {
    "id": 42852866,
    "title": "कोड के लिए डीपसीक R1 से आशाजनक परिणाम",
    "originLink": "https://simonwillison.net/2025/Jan/27/llamacpp-pr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42852866",
    "commentBody": "",
    "originSummary": [
      "Xuan-Son Nguyen द्वारा llama.cpp के लिए एक पुल अनुरोध (PR) वेबअसेंबली (WASM) की गति को सिंगल इंस्ट्रक्शन, मल्टीपल डेटा (SIMD) निर्देशों का उपयोग करके बढ़ाता है, जिसमें DeekSeek-R1 का महत्वपूर्ण योगदान है।",
      "पीआर में एपीआई प्रतिक्रियाओं से निर्मित एक गतिशील मॉडल_मैप शामिल है, जो हार्डकोडेड संस्करणों की आवश्यकता को समाप्त करता है, और प्लगइन विकास में नवाचार को प्रदर्शित करता है।",
      "साइमन विलिसन का वेबलॉग हाल के विषयों जैसे ओपन सोर्स प्रोजेक्ट्स, एंथ्रोपिक का सिटेशन्स एपीआई, और बड़े भाषा मॉडल (एलएलएम) प्रोजेक्ट्स को भी कवर करता है, जो अत्याधुनिक तकनीकी चर्चाओं पर ध्यान केंद्रित करने का संकेत देता है।"
    ],
    "commentSummary": [
      "डीपसीक R1 ने कोडिंग में एआई की क्षमता का प्रदर्शन किया है, जिसमें इसने लामा.cpp के लिए 99% पुल अनुरोध (PR) लिखा है, जो सॉफ्टवेयर विकास में एआई की बढ़ती भूमिका को दर्शाता है।",
      "ऐडर जैसे उपकरण अब रिलीज़ में नए कोड का 70-82% उत्पन्न करने के लिए जिम्मेदार हैं, जो एआई सहायता के माध्यम से उत्पादकता में महत्वपूर्ण वृद्धि को दर्शाता है।",
      "इन प्रगतियों के बावजूद, एआई को अभी भी जटिल समस्या-समाधान और मौजूदा कोडबेस के साथ एकीकरण के लिए मानव पर्यवेक्षण की आवश्यकता होती है, जो उद्योग में नौकरी की गतिशीलता और कौशल आवश्यकताओं में बदलाव का संकेत देता है।"
    ],
    "points": 482,
    "commentCount": 295,
    "retryCount": 0,
    "time": 1738075446
  },
  {
    "id": 42845488,
    "title": "द इलस्ट्रेटेड डीपसीक-आर1",
    "originLink": "https://newsletter.languagemodels.co/p/the-illustrated-deepseek-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845488",
    "commentBody": "",
    "originSummary": [
      "डीपसीक-आर1 एक नया जारी किया गया एआई मॉडल है जो एक संरचित तीन-चरणीय प्रशिक्षण प्रक्रिया के माध्यम से उन्नत तर्क क्षमताओं पर जोर देता है: भाषा मॉडलिंग, पर्यवेक्षित फाइन-ट्यूनिंग (एसएफटी), और प्राथमिकता ट्यूनिंग। मॉडल में तर्क डेटा की लंबी श्रृंखलाएं, एक अंतरिम तर्क मॉडल, और बड़े पैमाने पर सुदृढीकरण शिक्षण (आरएल) शामिल हैं, जो सोचने वाले टोकन उत्पन्न करके तर्क कार्यों में उत्कृष्टता प्राप्त करता है। यह विशेषज्ञों के मिश्रण की वास्तुकला का उपयोग करता है, जो इसे जटिल तर्क कार्यों को कुशलतापूर्वक संभालने की अनुमति देता है, एआई मॉडल डिज़ाइन में एक महत्वपूर्ण प्रगति को चिह्नित करता है।"
    ],
    "commentSummary": [
      "डीपसीक-आर1 अपनी प्रदर्शन और लागत दक्षता के कारण चर्चा में है, विशेष रूप से जीपीटी और जेमिनी जैसे मॉडलों की तुलना में, जहां कुछ उपयोगकर्ता सामान्य बड़े भाषा मॉडल (एलएलएम) मुद्दों को नोट कर रहे हैं। यह मॉडल अपनी कम कंप्यूट आवश्यकताओं और ओपन-सोर्स प्रकृति के लिए उल्लेखनीय है, जो एआई परिदृश्य को बाधित कर सकता है और एआई विकास को अधिक सुलभ बना सकता है। एक चीनी हेज फंड द्वारा विकसित, डीपसीक-आर1 अपने प्रशिक्षण डेटा और भू-राजनीतिक प्रभावों के बारे में सवाल उठाता है, हालांकि इसके कोडिंग क्षमताओं पर मिश्रित समीक्षाएं हैं।"
    ],
    "points": 465,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1738011088
  },
  {
    "id": 42847834,
    "title": "उत्पादन में मशीन लर्निंग (सीएमयू कोर्स)",
    "originLink": "https://mlip-cmu.github.io/s2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42847834",
    "commentBody": "",
    "originSummary": [
      "कार्नेगी मेलन यूनिवर्सिटी वसंत 2025 के लिए \"मशीन लर्निंग इन प्रोडक्शन/एआई इंजीनियरिंग\" नामक एक कोर्स प्रदान करती है, जो मशीन लर्निंग-सक्षम सॉफ्टवेयर उत्पादों के निर्माण, तैनाती और रखरखाव पर केंद्रित है। यह कोर्स जिम्मेदार एआई प्रथाओं और एमएलऑप्स (मशीन लर्निंग ऑपरेशंस) पर जोर देता है, जो प्रोटोटाइप से लेकर उत्पादन तक के पूरे जीवनचक्र को कवर करता है। यह कोर्स डेटा साइंस और बुनियादी प्रोग्रामिंग कौशल वाले छात्रों के लिए डिज़ाइन किया गया है, जिसमें व्याख्यान, प्रयोगशालाएं और एक समूह परियोजना शामिल है, और संसाधन GitHub पर उपलब्ध हैं।"
    ],
    "commentSummary": [
      "सीएमयू का प्रोडक्शन में मशीन लर्निंग पर कोर्स व्यावहारिक उपकरणों जैसे कि काफ्का, डॉकर, कुबेरनेट्स, और जेनकिंस को प्रस्तुत करता है, जो एमएलऑप्स (मशीन लर्निंग ऑपरेशन्स), व्याख्यात्मकता, निष्पक्षता, और निगरानी पर जोर देता है।",
      "यह मशीन लर्निंग और उत्पादन प्रणालियों के बीच एक पुल के रूप में कार्य करता है, हालांकि कुछ इसे प्रवेश स्तर का मानते हैं और इसे कौशल की तुलना में उपकरण एकीकरण पर अधिक केंद्रित मानते हैं।",
      "कुछ उपकरणों की दीर्घकालिक प्रासंगिकता और पाठ्यक्रम में डेटा गुणवत्ता पर सीमित जोर को लेकर चिंताएँ उठाई गई हैं, फिर भी इसे कंप्यूटर विज्ञान के छात्रों के लिए एक नया प्रवेश बिंदु माना जाता है।"
    ],
    "points": 423,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1738027135
  },
  {
    "id": 42849536,
    "title": "Open-R1: DeepSeek-R1 का एक खुला पुनरुत्पादन",
    "originLink": "https://huggingface.co/blog/open-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42849536",
    "commentBody": "",
    "originSummary": [
      "ओपन-आर1 एक पहल है जिसका उद्देश्य डीपसीक-आर1, एक तर्क मॉडल जो ओपनएआई के ओ1 के समान है, को दोहराना है, जो पारदर्शिता और ओपन-सोर्स सहयोग पर केंद्रित है।",
      "यह परियोजना DeepSeek-R1 के डेटासेट्स और प्रशिक्षण पाइपलाइन को पुनः निर्मित करने का प्रयास करती है, जो वर्तमान में अघोषित हैं, बिना मानव पर्यवेक्षण के सुदृढीकरण शिक्षण (RL) का उपयोग करके।",
      "ओपन-आर1 समुदाय के योगदान को प्रोत्साहित करता है ताकि मॉडल के अनुप्रयोगों को गणित से परे, जैसे कोडिंग और चिकित्सा जैसे क्षेत्रों में विस्तारित किया जा सके।"
    ],
    "commentSummary": [
      "ओपन-आर1 एक पहल है जिसका उद्देश्य ओपन-सोर्स सिद्धांतों का उपयोग करके डीपसीक-आर1 मॉडल को फिर से बनाना है, हालांकि यह अभी तक एक वास्तविक मॉडल नहीं है।",
      "चर्चा में सीमित बजट पर एआई मॉडलों को पुन: उत्पन्न करने की चुनौतियों और संभावित लाभों के साथ-साथ शिक्षा पर एआई के प्रभाव और व्यापक सामाजिक निहितार्थों पर जोर दिया गया है।",
      "यह बातचीत तकनीकी प्रगति के प्रति उत्साह और एआई को व्यापक दर्शकों के लिए अधिक सुलभ बनाने में ओपन-सोर्स आंदोलन की भूमिका को भी उजागर करती है।"
    ],
    "points": 376,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1738046447
  },
  {
    "id": 42845017,
    "title": "रेबल का भविष्य",
    "originLink": "https://rebble.io/2025/01/27/the-future-of-rebble.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845017",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "चर्चा में पेबल स्मार्टवॉच के लिए पुरानी यादों को उजागर किया गया है, जिन्हें उनकी ई-इंक जैसी स्क्रीन और लंबी बैटरी लाइफ के लिए सराहा गया था, और यह सवाल उठाया गया है कि इसी तरह की तकनीक को अधिक व्यापक रूप से क्यों नहीं अपनाया गया है।",
      "रेबल, एक समुदाय-संचालित परियोजना, और संबंधित स्मार्टवॉच परियोजनाओं की ओपन-सोर्स प्रकृति से नए हार्डवेयर की संभावनाओं में रुचि है।",
      "वॉचि और पाइनटाइम जैसे विकल्पों का उल्लेख किया गया है, जिसमें उपयोगकर्ता ओपन-सोर्स स्मार्टवॉच क्षेत्र में सॉफ़्टवेयर चुनौतियों का सामना करने की बात करते हैं।"
    ],
    "points": 374,
    "commentCount": 25,
    "retryCount": 0,
    "time": 1738008202
  },
  {
    "id": 42844619,
    "title": "अल्फा मिथक: कैसे बंदी भेड़ियों ने हमें गुमराह किया",
    "originLink": "https://anthonydavidadams.substack.com/p/the-alpha-myth-how-captive-wolves",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42844619",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "भेड़ियों में \"अल्फा मेल\" की अवधारणा, जो मूल रूप से कैद में किए गए अध्ययनों पर आधारित थी, को खारिज कर दिया गया है; जंगली भेड़ियों के झुंड पारिवारिक इकाइयों की तरह कार्य करते हैं न कि पदानुक्रमित संरचनाओं की तरह।",
      "हालांकि इसे खारिज कर दिया गया है, 'अल्फा' विचार प्रतिस्पर्धी वातावरण, जैसे कि सिलिकॉन वैली में, और कुछ सामाजिक और मनोवैज्ञानिक आवश्यकताओं के साथ इसके सामंजस्य के कारण बना रहता है।",
      "यह विश्वास कि 'अल्फा' मिथक सच है, इस बात को रेखांकित करता है कि किस प्रकार कथाएँ हमारे सामाजिक गतिशीलता की धारणा को प्रभावित कर सकती हैं, भले ही वे गलत धारणाओं पर आधारित हों।"
    ],
    "points": 354,
    "commentCount": 311,
    "retryCount": 0,
    "time": 1738005715
  },
  {
    "id": 42845323,
    "title": "गो 1.24 का गो टूल वर्षों में पारिस्थितिकी तंत्र में सबसे अच्छे परिवर्धनों में से एक है।",
    "originLink": "https://www.jvt.me/posts/2025/01/27/go-tools-124/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845323",
    "commentBody": "",
    "originSummary": [
      "गो 1.24 एक नया `go tool` कमांड और `tool` निर्देशिका `go.mod` में पेश करता है, जो गो इकोसिस्टम में प्रोजेक्ट टूल्स के प्रबंधन को बेहतर बनाता है।",
      "यह अपडेट `tools.go` पैटर्न से संबंधित समस्याओं को संबोधित करता है, जैसे प्रदर्शन पर प्रभाव और निर्भरता वृक्ष का विस्तार, अधिक कुशल उपकरण प्रबंधन की अनुमति देकर और अनावश्यक निर्भरताओं को कम करके।",
      "हालांकि `go tool` कमांड `go run` इनवोकेशन्स को कैश करके प्रदर्शन में सुधार करता है, लेकिन टूल निर्भरताओं को अप्रत्यक्ष रूप से मानने के बारे में चिंताएँ हैं, जो संभावित रूप से निर्भरता टकराव का कारण बन सकती हैं।"
    ],
    "commentSummary": [
      "Go 1.24 में \"गो टूल\" की शुरुआत ने निर्भरता प्रबंधन पर बहस को जन्म दिया है, जिसमें टूल और प्रोजेक्ट निर्भरताओं के विलय से संघर्ष उत्पन्न होने की चिंताएँ शामिल हैं।",
      "आलोचक अलग मॉड्यूल फाइलों या बेहतर संस्करण नियंत्रण के लिए Nix जैसे उपकरणों के उपयोग जैसे विकल्प प्रस्तावित करते हैं।",
      "गो के दृष्टिकोण के समर्थक तर्क देते हैं कि यह सादगी और प्रभावशीलता प्रदान करता है, जो प्रोग्रामिंग भाषाओं में निर्भरता प्रबंधन की व्यापक चुनौतियों को दर्शाता है।"
    ],
    "points": 270,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1738010023
  },
  {
    "id": 42845933,
    "title": "मैंने एक LLM पर भरोसा किया, अब मैं एक दोपहर की परियोजना के दिन 4 पर हूँ।",
    "originLink": "https://nemo.foo/blog/day-4-of-an-afternoon-project",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845933",
    "commentBody": "",
    "originSummary": [
      "लेखक ने डेस्कथैंग नामक एक परियोजना शुरू की, जिसका उद्देश्य रास्पबेरी पाई पिको, एलसीडी डिस्प्ले और आरजीबी एलईडी का उपयोग करके एक डेस्क डिवाइस बनाना था, साथ ही एआई की क्षमताओं का परीक्षण करना था।",
      "एआई उपकरण जैसे कि ChatGPT और Claude ने प्रारंभ में सहायता की, लेकिन अंततः एक बग्गी कार्यान्वयन की ओर ले गए, जिससे बफर संघर्ष और डेटा भ्रष्टाचार जैसी समस्याएं उत्पन्न हुईं।",
      "मुख्य सबक में शामिल हैं एआई को एक उपकरण के रूप में पहचानना न कि सह-पायलट के रूप में, सीखने में घर्षण और गलतियों के मूल्य को समझना, और आत्मविश्वास से अधिक धैर्य के महत्व को समझना।"
    ],
    "commentSummary": [
      "बड़े भाषा मॉडल (एलएलएम) सरल कार्यों के लिए लाभकारी हो सकते हैं, लेकिन यदि जटिल समस्याओं के लिए उचित निगरानी के बिना उन पर निर्भर किया जाए, तो वे परियोजना की समयसीमा को बढ़ा सकते हैं।",
      "वे जानकारी को संश्लेषित करने में प्रभावी होते हैं, लेकिन विशेष विषयों या नए ज्ञान के साथ संघर्ष कर सकते हैं, जिसके लिए उपयोगकर्ताओं को मजबूत बुनियादी समझ और अनुभव की आवश्यकता होती है।",
      "उपयोगकर्ताओं को स्पष्ट संकेत प्रदान करके और आउटपुट की आलोचनात्मक समीक्षा करके LLMs की पूरी क्षमता का प्रभावी ढंग से उपयोग करने के लिए नियंत्रण बनाए रखना चाहिए।"
    ],
    "points": 263,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1738013879
  },
  {
    "id": 42845681,
    "title": "एनवीडिया का बाजार पूंजीकरण लगभग $600 बिलियन घटा",
    "originLink": "https://www.cnbc.com/2025/01/27/nvidia-sheds-almost-600-billion-in-market-cap-biggest-drop-ever.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845681",
    "commentBody": "",
    "originSummary": [
      "एनवीडिया के बाजार पूंजीकरण को लगभग $600 बिलियन का ऐतिहासिक नुकसान हुआ, जिसमें शेयरों में 17% की गिरावट आई, जिसका कारण चीनी एआई लैब डीपसीक से प्रतिस्पर्धा की चिंताएं थीं।",
      "बिकवाली ने व्यापक अमेरिकी तकनीकी क्षेत्र को प्रभावित किया, जिससे डेल और ओरेकल जैसी कंपनियों में गिरावट आई और नैस्डैक सूचकांक में 3.1% की गिरावट का योगदान दिया।",
      "डीपसीक के नए एआई मॉडल, जिसे एनवीडिया के H800 चिप्स का उपयोग करके विकसित किया गया है, ने प्रतिस्पर्धा की चिंताओं को बढ़ा दिया है, जिससे एनवीडिया के स्टॉक पर प्रभाव पड़ा है, इसके पहले के लाभों के बावजूद, और सीईओ जेनसन हुआंग की नेट वर्थ में $21 बिलियन की कमी आई है।"
    ],
    "commentSummary": [
      "एनवीडिया के बाजार पूंजीकरण में लगभग $600 बिलियन की महत्वपूर्ण गिरावट आई, जिससे कंपनी के मूल्यांकन और क्या यह अधिक मूल्यांकित थी, इस पर बहस छिड़ गई।",
      "बाजार की प्रतिक्रिया के बावजूद, एनवीडिया के जीपीयू एआई-संबंधित कार्यों के लिए महत्वपूर्ण बने हुए हैं, जो तकनीकी उद्योग में उनकी महत्ता को रेखांकित करता है।",
      "मीडिया का ध्यान बड़े वित्तीय नुकसान पर बिना मुद्रास्फीति पर विचार किए केंद्रित होना भ्रामक हो सकता है, लेकिन प्रमुख निगमों में भी एनवीडिया की गिरावट उल्लेखनीय है।"
    ],
    "points": 242,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1738012390
  },
  {
    "id": 42852400,
    "title": "जनस प्रो 1बी वेबजीपीयू पर 100% स्थानीय रूप से इन-ब्राउज़र चल रहा है",
    "originLink": "https://old.reddit.com/r/LocalLLaMA/comments/1ibnso0/janus_pro_1b_running_100_locally_inbrowser_on/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42852400",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "जेनस प्रो 1बी एक मॉडल है जो वेबजीपीयू का उपयोग करके ब्राउज़र में स्थानीय रूप से चलता है, जो ब्राउज़र वातावरण में एआई मॉडल को निष्पादित करने की क्षमता को प्रदर्शित करता है। इसके कम पैरामीटर संख्या के बावजूद, जो इसकी क्षमताओं को सीमित करता है, यह मॉडल निम्न-स्तरीय जीपीयू पर चल सकता है, जो इसकी पहुंच को उजागर करता है। जबकि छवि उत्पन्न करने के परिणाम असंगत हैं, ब्राउज़र में स्थानीय रूप से ऐसे मॉडल चलाने की क्षमता एक महत्वपूर्ण तकनीकी प्रगति है, हालांकि यह वर्तमान में मोबाइल उपकरणों का समर्थन नहीं करता है।"
    ],
    "points": 156,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1738073061
  },
  {
    "id": 42855283,
    "title": "बर्कले के शोधकर्ताओं ने केवल $30 में डीपसीक R1 की मुख्य तकनीक को दोहराया: एक छोटा संशोधन",
    "originLink": "https://xyzlabs.substack.com/p/berkeley-researchers-replicate-deepseek",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42855283",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "बर्कले के शोधकर्ताओं ने केवल $30 में डीपसीक आर1 की मुख्य तकनीक को सफलतापूर्वक दोहराया है, जो विशेष कार्यों जैसे कि गेम काउंटडाउन खेलने पर केंद्रित है।",
      "यह नवाचार सुदृढीकरण शिक्षण का उपयोग करता है, जो मशीन लर्निंग का एक प्रकार है जिसमें एक एजेंट अपने पर्यावरण के साथ बातचीत करके सीखता है, तर्क मॉडलों को बढ़ाने के लिए, हालांकि इसका उपयोग केवल उन क्षेत्रों तक सीमित है जहां सत्यापन योग्य समाधान होते हैं।",
      "चर्चा एआई के आत्म-सुधार की क्षमता और भविष्य के एआई विकास के लिए इसके प्रभावों पर जोर देती है, हालांकि लेख के भ्रामक शीर्षक और उचित स्रोत लिंक की कमी की आलोचना की गई है।"
    ],
    "points": 153,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1738085791
  }
]
