[
  {
    "id": 42845091,
    "title": "Pebble'ı geri getiriyoruz",
    "originLink": "https://repebble.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845091",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Pebble, Google'dan aldığı destekle yeniden canlandırılıyor ve hacklenebilirlik, uzun pil ömrü ve telefon uzantısı olarak hizmet etme gibi orijinal güçlü yönlerine odaklanıyor.",
      "Yeniden canlandırma, Pebble'ın açık kaynak doğasını korumayı ve zorunlu bulut aboneliklerinden kaçınmayı hedefleyerek hackerlar ve teknoloji meraklılarına hitap ediyor.",
      "Topluluk, Pebble'ın geri dönüşü hakkında heyecanlı, giyilebilir teknoloji üzerindeki benzersiz özelliklerini ve etkisini yansıtıyor."
    ],
    "points": 2443,
    "commentCount": 625,
    "retryCount": 0,
    "time": 1738008679
  },
  {
    "id": 42845070,
    "title": "Google, Pebble OS'u açık kaynak haline getirdi",
    "originLink": "https://opensource.googleblog.com/2025/01/see-code-that-powered-pebble-smartwatches.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845070",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Google, Pebble OS'u açık kaynak haline getirdi ve bu durum, akıllı saat teknolojisinde potansiyel yeni gelişmeler için hayranlar ve geliştiriciler arasında heyecan yarattı.",
      "GitHub'daki sürüm, sistem yazı tipleri ve Bluetooth yığını gibi tescilli bileşenleri içermediğinden, mevcut haliyle derlenemez.",
      "Bu hamle, Google'dan gelen olumlu bir jest olarak görülüyor, içsel çabalara atfediliyor ve Pebble akıllı saat ekosistemini canlandırma yönünde bir adım olarak değerlendiriliyor."
    ],
    "points": 1207,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1738008549
  },
  {
    "id": 42850222,
    "title": "DeepSeek R1 Dynamic 1.58-bit'i çalıştır",
    "originLink": "https://unsloth.ai/blog/deepseekr1-dynamic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42850222",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek R1 Dynamic 1.58-bit, %80 oranında bir boyut küçültme sağlar ve çift H100 kullanarak saniyede 140 token hızında çalışır, ancak yavaş hızı ve tekrar sorunları, pratikliği hakkında soru işaretleri yaratır.",
      "Dinamik kuantizasyon performansa yardımcı olur, ancak erişilebilirlik, maliyet ve modelin eğitim maliyeti iddiaları hakkındaki endişeler devam etmekte ve bu durum incelemeye yol açmaktadır.",
      "Model, pazarda kayda değer bir etkiye sahip olup, sonuçlarını tekrarlama çabaları sürerken, performansı daha büyük modellerle karşılaştırıldığında tartışılmaktadır."
    ],
    "points": 596,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1738054367
  },
  {
    "id": 42852866,
    "title": "DeepSeek R1 için umut verici sonuçlar",
    "originLink": "https://simonwillison.net/2025/Jan/27/llamacpp-pr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42852866",
    "commentBody": "",
    "originSummary": [
      "Xuan-Son Nguyen tarafından llama.cpp için yapılan bir çekme isteği (PR), DeekSeek-R1'in önemli katkılarıyla Tek Komut, Çoklu Veri (SIMD) talimatlarını kullanarak WebAssembly (WASM) hızını artırıyor.",
      "PR, eklenti geliştirmede yeniliği sergileyerek, API yanıtlarından oluşturulan dinamik bir model_haritası içeriyor ve sabit kodlanmış sürümlere olan gereksinimi ortadan kaldırıyor.",
      "Simon Willison'un Web Günlüğü, açık kaynak projeleri, Anthropic'in Citations API'si ve Büyük Dil Modeli (LLM) projeleri gibi son konuları da ele alarak, ileri teknoloji tartışmalarına odaklandığını gösteriyor."
    ],
    "commentSummary": [
      "DeepSeek R1, yapay zekanın yazılım geliştirmedeki artan rolünü sergileyerek, llama.cpp için bir çekme isteğinin (PR) %99'unu yazarak kodlamadaki potansiyelini gösteriyor.",
      "Yardımcı araçlar, artık sürümlerdeki yeni kodun %70-82'sini üretmekten sorumlu olup, yapay zeka yardımıyla verimlilikte önemli bir artış olduğunu göstermektedir.",
      "Bu gelişmelere rağmen, yapay zeka hala karmaşık problem çözme ve mevcut kod tabanlarıyla entegrasyon için insan gözetimine ihtiyaç duymaktadır, bu da sektörde iş dinamikleri ve beceri gereksinimlerinde bir değişimi önermektedir."
    ],
    "points": 482,
    "commentCount": 295,
    "retryCount": 0,
    "time": 1738075446
  },
  {
    "id": 42845488,
    "title": "Resimli DeepSeek-R1",
    "originLink": "https://newsletter.languagemodels.co/p/the-illustrated-deepseek-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845488",
    "commentBody": "",
    "originSummary": [
      "DeepSeek-R1, dil modelleme, denetimli ince ayar (SFT) ve tercih ayarlama olmak üzere yapılandırılmış üç aşamalı bir eğitim süreci aracılığıyla geliştirilmiş akıl yürütme yeteneklerini vurgulayan yeni bir AI modelidir. Model, uzun akıl yürütme veri zincirlerini, ara akıl yürütme modelini ve büyük ölçekli pekiştirmeli öğrenmeyi (RL) içermekte olup, düşünme belirteçleri üreterek akıl yürütme görevlerinde üstünlük sağlamaktadır. Karmaşık akıl yürütme görevlerini verimli bir şekilde ele almasına olanak tanıyan uzman karışımı mimarisini kullanarak, AI model tasarımında önemli bir ilerlemeyi işaret etmektedir."
    ],
    "commentSummary": [
      "DeepSeek-R1, GPT ve Gemini gibi modellerle karşılaştırıldığında performansı ve maliyet etkinliği nedeniyle tartışma yaratıyor, bazı kullanıcılar tipik büyük dil modeli (LLM) sorunlarını belirtiyor. Model, düşük hesaplama gereksinimleri ve açık kaynaklı yapısıyla dikkat çekiyor, potansiyel olarak yapay zeka alanını sarsarak yapay zeka geliştirmeyi daha erişilebilir hale getiriyor. Bir Çinli hedge fonu tarafından geliştirilen DeepSeek-R1, kodlama yetenekleri hakkında karışık yorumlar almasına rağmen, eğitim verileri ve jeopolitik etkileri hakkında sorular ortaya çıkarıyor."
    ],
    "points": 465,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1738011088
  },
  {
    "id": 42847834,
    "title": "Üretimde Makine Öğrenimi (CMU Dersi)",
    "originLink": "https://mlip-cmu.github.io/s2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42847834",
    "commentBody": "",
    "originSummary": [
      "Carnegie Mellon Üniversitesi, 2025 Bahar dönemi için \"Üretimde Makine Öğrenimi/AI Mühendisliği\" başlıklı bir ders sunuyor. Bu ders, makine öğrenimi destekli yazılım ürünlerinin oluşturulması, dağıtılması ve bakımına odaklanıyor. Ders, sorumlu AI uygulamaları ve MLOps (Makine Öğrenimi Operasyonları) üzerinde durarak prototipten üretime kadar olan tüm yaşam döngüsünü kapsıyor. Veri bilimi ve temel programlama becerilerine sahip öğrenciler için tasarlanmış olup, dersler, laboratuvarlar ve bir grup projesi içermekte ve GitHub'da kaynaklar sunulmaktadır."
    ],
    "commentSummary": [
      "CMU'nun Üretimde Makine Öğrenimi kursu, MLOps (Makine Öğrenimi Operasyonları), açıklanabilirlik, adalet ve izleme konularına vurgu yaparak Kafka, Docker, Kubernetes ve Jenkins gibi pratik araçları tanıtmaktadır.",
      "Makine öğrenimi ile üretim sistemleri arasında bir köprü görevi görür, ancak bazıları bunu giriş seviyesi olarak görür ve ustalıktan çok araç entegrasyonuna odaklandığını düşünür.",
      "Belirli araçların uzun vadeli geçerliliği ve dersin veri kalitesine sınırlı vurgu yapması konusunda endişeler dile getirilse de, bilgisayar bilimi öğrencileri için yeni bir giriş noktası olarak kabul edilmektedir."
    ],
    "points": 423,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1738027135
  },
  {
    "id": 42849536,
    "title": "Open-R1: DeepSeek-R1'in açık bir reprodüksiyonu",
    "originLink": "https://huggingface.co/blog/open-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42849536",
    "commentBody": "",
    "originSummary": [
      "Open-R1, şeffaflık ve açık kaynak iş birliğine odaklanan, OpenAI'nin o1 modeline benzer bir akıl yürütme modeli olan DeepSeek-R1'i çoğaltma girişimidir.",
      "Proje, şu anda açıklanmayan DeepSeek-R1'in veri setlerini ve eğitim hattını, insan denetimi olmadan pekiştirmeli öğrenme (RL) kullanarak yeniden oluşturmayı amaçlamaktadır.",
      "Open-R1, modelin uygulamalarını matematik dışındaki alanlara, kodlama ve tıp gibi alanlara genişletmek için topluluk katkılarını teşvik eder."
    ],
    "commentSummary": [
      "Open-R1, açık kaynak ilkelerini kullanarak DeepSeek-R1 modelini yeniden oluşturmayı amaçlayan bir girişimdir, ancak henüz gerçek bir model değildir.",
      "Metin, sınırlı bir bütçeyle yapay zeka modellerinin yeniden üretilmesinin zorluklarını ve potansiyel faydalarını, ayrıca yapay zekanın eğitim üzerindeki etkisini ve daha geniş toplumsal sonuçlarını vurgulamaktadır.",
      "Konuşma, teknolojik ilerlemeler etrafındaki heyecanı ve yapay zekayı daha geniş bir kitleye daha erişilebilir hale getirmede açık kaynak hareketinin rolünü de vurguluyor."
    ],
    "points": 376,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1738046447
  },
  {
    "id": 42845017,
    "title": "Rebble'nin geleceği",
    "originLink": "https://rebble.io/2025/01/27/the-future-of-rebble.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845017",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Metin, e-mürekkep benzeri ekranları ve uzun pil ömrü ile takdir edilen Pebble akıllı saatlerine duyulan nostaljiyi vurguluyor ve benzer teknolojinin neden daha yaygın bir şekilde benimsenmediğini sorguluyor.",
      "Rebble, topluluk odaklı bir proje, ve ilgili akıllı saat projelerinin açık kaynak doğası, yeni donanım potansiyeline olan ilgiyi artırıyor.",
      "Watchy ve PineTime gibi alternatiflerden bahsediliyor ve kullanıcılar, açık kaynaklı akıllı saat alanında karşılaşılan yazılım zorluklarına dikkat çekiyor."
    ],
    "points": 374,
    "commentCount": 25,
    "retryCount": 0,
    "time": 1738008202
  },
  {
    "id": 42844619,
    "title": "Alfa Miti: Esaret Altındaki Kurtların Bizi Yanılttığı Yol",
    "originLink": "https://anthonydavidadams.substack.com/p/the-alpha-myth-how-captive-wolves",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42844619",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Başlangıçta esaret altındaki çalışmalarına dayanan kurtlardaki \"alfa erkek\" kavramı çürütülmüştür; vahşi kurt sürüleri, hiyerarşik yapılardan ziyade daha çok aile birimleri gibi işlev görür.",
      "Çürütülmüş olmasına rağmen, \"alfa\" fikri, rekabetçi ortamlar, örneğin Silikon Vadisi gibi yerlerdeki çekiciliği ve belirli toplumsal ve psikolojik ihtiyaçlarla uyumu nedeniyle varlığını sürdürmektedir.",
      "Alfa miti\"ne olan sürekli inanç, anlatıların sosyal dinamikler algımızı nasıl etkileyebileceğini, hatta yanlış varsayımlara dayandıklarında bile, vurgulamaktadır."
    ],
    "points": 354,
    "commentCount": 311,
    "retryCount": 0,
    "time": 1738005715
  },
  {
    "id": 42845323,
    "title": "Go 1.24'ün go aracı, yıllardır ekosisteme yapılan en iyi eklemelerden biridir.",
    "originLink": "https://www.jvt.me/posts/2025/01/27/go-tools-124/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845323",
    "commentBody": "",
    "originSummary": [
      "Go 1.24, Go ekosistemindeki proje araçlarının yönetimini geliştiren yeni bir `go tool` komutu ve `go.mod` içinde `tool` yönergesini tanıtıyor.",
      "Bu güncelleme, daha verimli araç yönetimine izin vererek ve gereksiz bağımlılıkları azaltarak, `tools.go` deseniyle ilgili performans etkileri ve bağımlılık ağacının şişmesi gibi sorunları ele alır.",
      "Go aracı komutu, `go run` çağrılarını önbelleğe alarak performansı artırırken, araç bağımlılıklarının dolaylı olarak ele alınması ve potansiyel olarak bağımlılık çakışmalarına yol açması konusunda endişeler bulunmaktadır."
    ],
    "commentSummary": [
      "Go 1.24'te \"go tool\"un tanıtılması, bağımlılık yönetimi üzerindeki etkisi hakkında tartışmalara yol açtı ve araç ile proje bağımlılıklarının birleştirilmesinin çatışmalara neden olabileceği konusunda endişeler ortaya çıktı.",
      "Eleştirmenler, geliştirilmiş sürüm kontrolü için ayrı modül dosyaları veya Nix gibi araçların kullanılmasını içeren alternatifler öneriyor.",
      "Go'nun yaklaşımını destekleyenler, bunun basitlik ve etkinlik sunduğunu, programlama dilleri genelinde bağımlılık yönetimindeki daha geniş zorlukları yansıttığını savunuyorlar."
    ],
    "points": 270,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1738010023
  },
  {
    "id": 42845933,
    "title": "Bir LLM'ye güvendim, şimdi bir öğleden sonra projesinin 4. günündeyim.",
    "originLink": "https://nemo.foo/blog/day-4-of-an-afternoon-project",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845933",
    "commentBody": "",
    "originSummary": [
      "Yazar, bir Raspberry Pi Pico, LCD ekran ve RGB LED'ler kullanarak bir masa cihazı oluşturmayı amaçlayan Deskthang adlı bir projeye başladı ve bu sırada yapay zekanın yeteneklerini test etti.",
      "ChatGPT ve Claude gibi yapay zeka araçları başlangıçta yardımcı oldu ancak nihayetinde hatalı bir uygulamaya yol açarak tampon çatışmaları ve veri bozulması gibi sorunlara neden oldu.",
      "Öğrenilen temel dersler arasında, yapay zekayı bir yardımcı pilot yerine bir araç olarak tanımak, öğrenmede sürtünme ve hataların değerini anlamak ve aşırı özgüven yerine sabrın önemini kavramak yer alıyor."
    ],
    "commentSummary": [
      "Büyük Dil Modelleri (LLM'ler) basit görevler için faydalı olabilir, ancak uygun denetim olmadan karmaşık problemler için bunlara güvenilirse proje zaman çizelgelerini uzatabilir.",
      "Bilgiyi sentezlemede etkilidirler ancak niş konular veya yeni bilgilerle ilgili zorluk yaşayabilirler, bu da kullanıcıların sağlam bir temel ve deneyime sahip olmasını gerektirir.",
      "Kullanıcılar, LLM'lerin tam potansiyelini etkili bir şekilde kullanabilmek için net komutlar vererek ve çıktıları eleştirel bir şekilde gözden geçirerek kontrolü sağlamalıdır."
    ],
    "points": 263,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1738013879
  },
  {
    "id": 42845681,
    "title": "Nvidia, piyasa değerinde neredeyse 600 milyar dolar kaybetti.",
    "originLink": "https://www.cnbc.com/2025/01/27/nvidia-sheds-almost-600-billion-in-market-cap-biggest-drop-ever.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42845681",
    "commentBody": "",
    "originSummary": [
      "Nvidia'nın piyasa değeri, Çinli yapay zeka laboratuvarı DeepSeek'ten kaynaklanan rekabet endişeleri nedeniyle hisselerin %17 düşmesiyle neredeyse 600 milyar dolarlık tarihi bir kayıp yaşadı.",
      "Satış dalgası, Dell ve Oracle gibi şirketlerde düşüşlere neden olarak daha geniş ABD teknoloji sektörünü etkiledi ve Nasdaq endeksinde %3,1'lik bir düşüşe katkıda bulundu.",
      "DeepSeek'in Nvidia'nın H800 çiplerini kullanarak geliştirdiği yeni yapay zeka modeli, rekabet endişelerini artırdı ve bu durum, Nvidia'nın daha önceki kazançlarına rağmen hisse senedini etkiledi, CEO Jensen Huang'ın net değerini 21 milyar dolar azalttı."
    ],
    "commentSummary": [
      "Nvidia'nın piyasa değeri yaklaşık 600 milyar dolarlık önemli bir düşüş yaşadı ve bu durum, şirketin değerlemesi ve aşırı değerlenip değerlenmediği konusunda tartışmalara yol açtı.",
      "Piyasa tepkisine rağmen, Nvidia'nın GPU'ları AI ile ilgili görevler için kritik olmaya devam ediyor ve bu durum teknoloji endüstrisindeki önemlerini vurguluyor.",
      "Medyanın, enflasyonu dikkate almadan büyük finansal kayıplara odaklanması yanıltıcı olabilir, ancak Nvidia'nın düşüşü büyük şirketler arasında bile dikkat çekicidir."
    ],
    "points": 242,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1738012390
  },
  {
    "id": 42852400,
    "title": "Janus Pro 1B, WebGPU üzerinde tarayıcıda %100 yerel olarak çalışıyor",
    "originLink": "https://old.reddit.com/r/LocalLLaMA/comments/1ibnso0/janus_pro_1b_running_100_locally_inbrowser_on/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42852400",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Janus Pro 1B, WebGPU kullanarak tarayıcıda yerel olarak çalışan bir modeldir ve AI modellerinin tarayıcı ortamında çalıştırılabilme yeteneğini sergilemektedir. Düşük parametre sayısı nedeniyle yetenekleri sınırlı olsa da, model düşük seviye GPU'larda çalışabilir, bu da erişilebilirliğini vurgular. Görüntü oluşturma sonuçları tutarsız olsa da, bu tür modellerin yerel olarak bir tarayıcıda çalıştırılabilmesi önemli bir teknolojik ilerlemedir, ancak şu anda mobil cihazları desteklememektedir."
    ],
    "points": 156,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1738073061
  },
  {
    "id": 42855283,
    "title": "Berkeley Araştırmacıları, DeepSeek R1'in Temel Teknolojisini Sadece 30 Dolara Kopyaladı: Küçük Bir Değişiklik",
    "originLink": "https://xyzlabs.substack.com/p/berkeley-researchers-replicate-deepseek",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42855283",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Berkeley araştırmacıları, Countdown oyununu oynamak gibi belirli görevlere odaklanarak, DeepSeek R1'in çekirdek teknolojisini sadece 30 dolara başarıyla kopyaladılar.",
      "Yenilik, bir ajanın çevresiyle etkileşimde bulunarak öğrendiği bir makine öğrenimi türü olan pekiştirmeli öğrenmeyi, doğrulanabilir çözümlere sahip alanlarla sınırlı olsa da, akıl yürütme modellerini geliştirmek için kullanmayı içerir.",
      "Makale başlığının yanıltıcı olması ve uygun kaynak bağlantılarının eksikliği eleştirilerine rağmen, tartışma, yapay zekanın kendi kendini geliştirme potansiyelini ve bunun gelecekteki yapay zeka gelişimi üzerindeki etkilerini vurgulamaktadır."
    ],
    "points": 153,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1738085791
  }
]
