[
  {
    "id": 42287231,
    "title": "2024 குறியீட்டு வருகை",
    "originLink": "https://adventofcode.com/2024/about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42287231",
    "commentBody": "",
    "originSummary": [
      "Advent of Code, எரிக் வாஸ்ட்லால் உருவாக்கப்பட்டது, அனைத்து திறன் நிலைகளுக்கும் ஏற்றதான நிரலாக்க புதிர்களை கொண்ட ஒரு Advent நாட்காட்டி ஆகும், இது எந்த நிரலாக்க மொழியிலும் தீர்க்கப்படலாம்.",
      "பழைய ஹார்ட்வேர் மீது திறம்பட இயங்க하도록 புதிர்கள் வடிவமைக்கப்பட்டுள்ளன மற்றும் கணினி அறிவியல் பின்னணி தேவையின்றி பயிற்சி, நேர்முகங்கள் அல்லது பொழுதுபோக்கு நோக்கங்களுக்காக உருவாக்கப்பட்டுள்ளன.",
      "பங்கேற்பாளர்கள் தங்கள் அனுபவங்களைப் பகிர்ந்து கொள்ளவும், உதாரணங்களுடன் தீர்வுகளைச் சோதிக்கவும், தேவைப்பட்டால் உதவியை நாடவும் ஊக்குவிக்கப்படுகிறார்கள், புதிர்களைத் தீர்க்க AI ஐப் பயன்படுத்தாதது மற்றும் வர்த்தக முத்திரை விதிகளை மதிப்பது போன்ற வழிகாட்டுதல்களைப் பின்பற்றவும்."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். Advent of Code 2024 தொடங்கியுள்ளது, இதில் பங்கேற்பாளர்கள் சிருஷ்டிப்பூர்வமான சிக்கல் தீர்வில் ஈடுபட்டு, தங்கள் அனுபவங்களை பகிர்ந்து கொள்கின்றனர்.- சில பங்கேற்பாளர்கள், C ஐ நிலையான நூலகங்கள் இல்லாமல் பயன்படுத்துவது அல்லது Swift அல்லது Ada போன்ற புதிய நிரலாக்க மொழிகளை ஆராய்வது போன்ற தனித்துவமான அணுகுமுறைகளை முயற்சிக்கின்றனர்.- AI இன் தலைப்பட்டியலில் தாக்கம் பற்றிய கவலைகள் இருந்தாலும், இந்த நிகழ்வு முதன்மையாக தனிப்பட்ட மகிழ்ச்சி, கற்றல் மற்றும் சமூக தொடர்பை ஊக்குவிக்கிறது."
    ],
    "points": 726,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1733044175
  },
  {
    "id": 42284202,
    "title": "ஒரு பிரேசிலிய CA, மைக்ரோசாஃப்ட் மட்டுமே நம்பிய, google.com க்கு ஒரு சான்றிதழை வழங்கியுள்ளது",
    "originLink": "https://follow.agwa.name/notice/AoZSMI38xcA3TrN1sm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284202",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஒரு பிரேசிலிய சான்றிதழ் அதிகாரம் (CA), மைக்ரோசாஃப்ட் மட்டுமே நம்பிக்கையுடன் வைத்திருப்பது, கூகிளின் சான்றிதழ் அதிகார அங்கீகார (CAA) விதிகளை மீறி, google.com க்கு ஒரு சான்றிதழை வழங்கியது.",
      "இந்த சம்பவம் CA இன் நம்பகத்தன்மை மற்றும் மைக்ரோசாஃப்ட் அதை நம்பியிருப்பது குறித்து கவலைகளை எழுப்புகிறது, ஏனெனில் பிற முக்கிய உலாவிகள் அவ்வாறு செய்யவில்லை.",
      "சான்றிதழ் மிடில்-மிடில் தாக்குதல்களை எளிதாக்கக்கூடும், இது தாக்குதலாளர்களை கூகுளை போல நடித்து, தீங்கிழைக்கும் மென்பொருளை பரப்ப அனுமதிக்கிறது, இது CA நம்பகத்தன்மை முடிவுகளில் கடுமையான கண்காணிப்பு மற்றும் வெளிப்படைத்தன்மையின் தேவையை வலியுறுத்துகிறது."
    ],
    "points": 438,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1733002503
  },
  {
    "id": 42284412,
    "title": "திறந்த மூல தனியார் வீட்டு பாதுகாப்பு கேமரா அமைப்பு (முடிவு-to-முடிவு குறியாக்கம்)",
    "originLink": "https://github.com/privastead/privastead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284412",
    "commentBody": "",
    "originSummary": [
      "TEXT: ஆசிரியர் Privastead என்ற வீட்டுப் பாதுகாப்பு கேமரா அமைப்பை உருவாக்கினார், OpenMLS உடன் முடிவு-to-முடிவு குறியாக்கத்தைப் பயன்படுத்தி தனியுரிமையை மையமாகக் கொண்டு, பெரும்பாலும் Rust இல் செயல்படுத்தினார்.- Privastead தனியுரிமை பற்றாக்குறையுள்ளவர்களுக்கு திறந்த மூலமாக உள்ளது, அமைப்புக்கு பொருந்தக்கூடிய IP கேமரா, ஒரு உள்ளூர் இயந்திரம், ஒரு சர்வர் மற்றும் ஒரு Android ஸ்மார்ட்போன் தேவைப்படுகிறது.- தற்போது, இந்த அமைப்பு ஒரு IP கேமரா மற்றும் Android ஐ மட்டுமே ஆதரிக்கிறது, ஆனால் அதன் திறன்களை மேம்படுத்த சமூக கருத்துக்களையும் பங்களிப்புகளையும் ஆசிரியர் எதிர்பார்க்கிறார். TEXT:"
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். Privastead என்பது திறந்த மூல வீட்டுப் பாதுகாப்பு கேமரா அமைப்பு ஆகும், இது தற்போதைய தீர்வுகளின் தனியுரிமை கவலைகளை தீர்க்க உருவாக்கப்பட்டுள்ளது, OpenMLS மூலம் முடிவு-to-முடிவு குறியாக்கத்தைப் பயன்படுத்துகிறது.- இந்த அமைப்பு முதன்மையாக Rust இல் செயல்படுத்தப்பட்டுள்ளது மற்றும் செயல்பாட்டிற்கு ஆதரிக்கப்படும் IP கேமரா, ஒரு உள்ளூர் இயந்திரம், ஒரு சேவையகம் மற்றும் ஒரு Android ஸ்மார்ட்போன் தேவைப்படுகிறது.- இந்த திட்டம் GitHub இல் கிடைக்கிறது, அதன் செயல்பாட்டை மேம்படுத்த சமூகத்திடமிருந்து கருத்துக்களையும் பங்களிப்புகளையும் வரவேற்கிறது."
    ],
    "points": 386,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733004829
  },
  {
    "id": 42283950,
    "title": "Ntfs2btrfs NTFS கோப்பு முறைமையை திறந்த மூல Btrfs ஆக இடத்தில் மாற்றுகிறது",
    "originLink": "https://github.com/maharmstone/ntfs2btrfs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283950",
    "commentBody": "",
    "originSummary": [
      "Ntfs2btrfs என்பது NTFS கோப்பு அமைப்புகளை Btrfs ஆக மாற்றுவதற்காக வடிவமைக்கப்பட்ட ஒரு கருவி ஆகும், இது அசல் படத்தை ஒரு ரெஃப்லிங்க் நகலாக பாதுகாத்து, இடத்தை மீட்டெடுக்க வாய்ப்பு அளிக்கிறது.",
      "கருவி Windows மற்றும் Linux இரண்டிற்கும் கிடைக்கிறது, ஒவ்வொரு தளத்திற்கும் குறிப்பிட்ட நிறுவல் வழிமுறைகள் மற்றும் சார்புகளை உடையதாக உள்ளது, மேலும் இது சுருக்க ஆதரவு மற்றும் NTFS க்கு பின்வாங்குதல் போன்ற அம்சங்களை உள்ளடக்கியது.",
      "வரையறைகள் என்பது பழைய விரிவாக்கப்பட்ட பண்புகளுக்கு ஆதரவு இல்லாமை, பெரிய மாற்று தரவோட்டங்கள் (ADS), மற்றும் குறியாக்கப்பட்ட கோப்புகள் ஆகியவற்றை உள்ளடக்கியது, குறிப்பிட்ட நிபந்தனைகள் Btrfs கோப்பு முறைமையிலிருந்து Windows ஐ துவக்குவதற்கு தேவைப்படுகிறது."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். Ntfs2btrfs என்பது NTFS (புதிய தொழில்நுட்ப கோப்பு அமைப்பு) இல் இருந்து Btrfs (B-மரம் கோப்பு அமைப்பு) க்கு இடத்தில் மாற்றத்தை செயல்படுத்தும் ஒரு கருவி ஆகும், இது அதன் பயன்பாடு மற்றும் பெரிய தரவுப் பரிமாற்றங்களுக்கு நேரம் பற்றிய விவாதங்களை தூண்டுகிறது.",
      "பயனர்கள் Btrfs உடன் கலந்த அனுபவங்களை பகிர்ந்து கொள்கிறார்கள், ஸ்னாப்ஷாட்கள் போன்ற அம்சங்களை பாராட்டுகிறார்கள் ஆனால் முந்தைய நிலைத்தன்மை பிரச்சினைகளை நினைவுகூர்கிறார்கள், அதேசமயம் ZFS மற்றும் bcachefs போன்ற பிற கோப்பக அமைப்புகளைப் பற்றியும் விவாதிக்கிறார்கள்.",
      "உரையாடல் கோப்பக மேலாண்மையின் சிக்கல்களையும் ஆபத்துகளையும் வலியுறுத்துகிறது, சில பயனர்கள் மாற்று கருவிகளுக்கு பதிலாக காப்புப்பிரதிகள் மற்றும் புதிய வடிவமைப்புகளை ஆதரிக்கின்றனர்."
    ],
    "points": 367,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1732999808
  },
  {
    "id": 42283933,
    "title": "ஏஎம்டி சென் 4 இன் லூப் பஃபரை முடக்குகிறது",
    "originLink": "https://chipsandcheese.com/p/amd-disables-zen-4s-loop-buffer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283933",
    "commentBody": "",
    "originSummary": [
      "AMD தனது Zen 4 CPUகளில் லூப் பஃபரை முடக்கியுள்ளது, இது செயல்திறன் மேம்பாட்டிற்காக அல்லாமல் மின்சார ஒப்பீட்டிற்காக உருவாக்கப்பட்ட ஒரு அம்சமாகும். - செயல்திறன் சோதனைகள் லூப் பஃபர் முடக்கப்பட்டபோது மிகச்சிறிய வேறுபாடுகளை காட்டுகின்றன, ஏனெனில் ஒப் கேச் போதுமான வலுவுடன் ஈடுகொடுக்கிறது. - ஒரு ஹார்ட்வேர் பிழை காரணமாக லூப் பஃபரை முடக்குவதற்கான முடிவு செயல்திறன் அல்லது மின்சார நுகர்வை குறிப்பிடத்தக்க வகையில் பாதிக்க வாய்ப்பில்லை, மேலும் இந்த அம்சம் AMD மூலம் பரவலாக ஆவணப்படுத்தப்படவில்லை."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். AMD அதன் Zen 4 CPUகளில் லூப் பஃபரை முடக்கியுள்ளது, இது வெளிப்படுத்தப்படாத ஹார்ட்வேர் பாதிப்புகளுக்காக இருக்கக்கூடும், சில சூழ்நிலைகளில் சிறிய செயல்திறன் குறைவாக முடிகிறது.- லூப் பஃபர் மின்சார திறன் மற்றும் செயல்திறனை மேம்படுத்த வடிவமைக்கப்பட்டது, ஆனால் அதன் நீக்கம் அது முக்கியமான நன்மைகளை வழங்கவில்லை என்பதை குறிக்கிறது.- லூப் பஃபரை முடக்குவதற்கான அமைதியான முடிவு வெளிப்படைத்தன்மை மற்றும் ஹார்ட்வேர் பாதிப்புகளின் மேலாண்மை குறித்து கவலைகளை ஏற்படுத்தியுள்ளது."
    ],
    "points": 271,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1732999655
  },
  {
    "id": 42285689,
    "title": "TEXT: OpenWRT ஒன் வெளியிடப்பட்டது: OpenWrt க்காக குறிப்பாக வடிவமைக்கப்பட்ட முதல் ரூட்டர்.",
    "originLink": "https://sfconservancy.org/news/2024/nov/29/openwrt-one-wireless-router-now-ships-black-friday/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285689",
    "commentBody": "",
    "originSummary": [
      "சாப்ட்வேர் சுதந்திரக் கன்சர்வன்சி (SFC) மற்றும் ஓபன்விர்ட், சாப்ட்வேர் சுதந்திரம் மற்றும் பழுது பார்க்கும் உரிமையை ஊக்குவிக்க வடிவமைக்கப்பட்ட ஓபன்விர்ட் ஒன் என்ற வயர்லெஸ் ரவுடரை வெளியிட்டுள்ளன, இது கேஸுடன் $89 அல்லது போர்டுக்காக $68.42 விலையில் கிடைக்கிறது.",
      "ரூட்டர் முற்றிலும் அழிக்க முடியாதது, முழுமையாக காப்புரிமை வலிமை கொண்டது மற்றும் MediaTek MT7981B SoC, MT7976C வைஃபை, 1 GiB DDR4 RAM கொண்டது, எதர்வழி மின்சாரம் (PoE) மற்றும் USB-C மின்சாரம் ஆதரிக்கிறது, மேலும் மேம்பட்ட பயனர்களுக்கான USB தொடர் இடைமுகத்துடன் உள்ளது.",
      "சாதனம் FCC உடன் இணக்கமானது, மென்பொருள் பழுது பார்க்கும் உரிமை ஒழுங்குமுறை தேவைகளுடன் இணங்க முடியும் என்பதை காட்டுகிறது, மேலும் ஒவ்வொரு கொள்முதல் மற்றும் $10 நன்கொடை மென்பொருள் சுதந்திர பாதுகாப்பில் உள்ள OpenWrt க்கு வழங்கப்படுகிறது."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். OpenWRT One, OpenWrt திறந்த மூல மென்பொருளுக்காக குறிப்பாக வடிவமைக்கப்பட்ட முதல் ரவுடர், $89 விலையில் வெளியிடப்பட்டுள்ளது.- இது copyleft இணக்கத்தன்மையை FCC விதிமுறைகளுடன் சமநிலைப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது, ஆனால் Wi-Fi செயல்பாட்டிற்காக சில சொந்த பைனரி பிளாப்களை இன்னும் உள்ளடக்கியுள்ளது.- இந்த வெளியீடு, நெட்வொர்க் ஹார்ட்வேர் இல் அதிக நெகிழ்வுத்தன்மைக்காக ரவுடர் மற்றும் Wi-Fi செயல்பாடுகளை பிரிப்பதன் நன்மைகள் குறித்த விவாதங்களை தூண்டியுள்ளது."
    ],
    "points": 242,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733020464
  },
  {
    "id": 42285128,
    "title": "ஜெஃப் டீன் அல்பா சிப் குறித்து EDA தொழில்துறைக்கு பதிலளிக்கிறார்",
    "originLink": "https://twitter.com/JeffDean/status/1858540085794451906",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285128",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஜெஃப் டீன் கூகுளின் அல்பாசிப் குறித்து எழுந்த விமர்சனங்களைப் பற்றி பேசினார், விமர்சகர்கள் முக்கியமான மறுபிரதி நடவடிக்கைகளைப் பின்பற்றவில்லை, உதாரணமாக முன் பயிற்சி போன்றவை. - அல்பாசிப் செயல்திறன் தற்போதைய கருவிகளுடன் சமமாக உள்ளதா என்ற விவாதம் எழுகிறது, சிலர் கூகுளின் கூற்றுகள் மிகைப்படுத்தப்பட்டதாகக் கூறுகின்றனர். - இந்த விவாதம் கூகுளுக்கும் மின்னணு வடிவமைப்பு தானியங்கி (EDA) தொழில்துறைக்கும் இடையிலான பதற்றங்களை வலியுறுத்துகிறது, இதில் பாகுபாடு குறித்த குற்றச்சாட்டுகள் மற்றும் கூகுளின் ஆராய்ச்சியின் மறுபிரதி செய்யக்கூடிய தன்மை குறித்த கவலைகள் அடங்கும்."
    ],
    "points": 178,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733012884
  }
]
