[
  {
    "id": 42287231,
    "title": "„Adventi Kód 2024”",
    "originLink": "https://adventofcode.com/2024/about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42287231",
    "commentBody": "",
    "originSummary": [
      "„Az Advent of Code, amelyet Eric Wastl hozott létre, egy adventi naptár, amely programozási rejtvényeket tartalmaz, és minden szintű készséghez megfelelő, bármilyen programozási nyelven megoldható.”",
      "„A rejtvények úgy vannak kialakítva, hogy hatékonyan fussanak régebbi hardvereken, és gyakorlásra, interjúkra vagy szórakozásra szolgálnak, anélkül, hogy számítástechnikai háttérre lenne szükség.”",
      "„A résztvevőket arra ösztönzik, hogy osszák meg tapasztalataikat, próbálják ki a megoldásokat példákkal, és kérjenek segítséget, ha szükséges, miközben betartják az irányelveket, például nem használják az AI-t a rejtvények megoldására, és tiszteletben tartják a védjegyszabályokat.”"
    ],
    "commentSummary": [
      "„A 2024-es Advent of Code elkezdődött, a résztvevők kreatív problémamegoldásban vesznek részt, és megosztják tapasztalataikat. Néhány résztvevő egyedi megközelítésekkel kísérletezik, például C nyelv használatával standard könyvtárak nélkül, vagy új programozási nyelvek, mint a Swift vagy az Ada felfedezésével. Bár vannak aggodalmak az AI ranglistára gyakorolt hatása miatt, az esemény elsősorban a személyes élvezetet, a tanulást és a közösségi interakciót támogatja.”"
    ],
    "points": 726,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1733044175
  },
  {
    "id": 42284202,
    "title": "„Egy brazil hitelesítésszolgáltató, amelyet csak a Microsoft bízik meg, kiadott egy tanúsítványt a google.com számára.”",
    "originLink": "https://follow.agwa.name/notice/AoZSMI38xcA3TrN1sm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284202",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Egy brazil tanúsítványkiadó hatóság (CA), amelyet kizárólag a Microsoft bízik meg, tanúsítványt adott ki a google.com számára, megsértve ezzel a Google Tanúsítványkiadó Hatóság Engedélyezési (CAA) szabályait.”",
      "„Ez az eset aggodalmakat vet fel a hitelesítésszolgáltató megbízhatóságával és a Microsoft döntésével kapcsolatban, hogy megbízik benne, mivel más nagy böngészők nem teszik ezt.”",
      "„A tanúsítvány lehetővé teheti a közbeékelődéses támadásokat, lehetővé téve a támadók számára, hogy a Google-t megszemélyesítsék és rosszindulatú szoftvereket terjesszenek, ami aláhúzza a szigorúbb felügyelet és átláthatóság szükségességét a CA bizalmi döntésekben.”"
    ],
    "points": 438,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1733002503
  },
  {
    "id": 42284412,
    "title": "„Nyílt forráskódú privát otthoni biztonsági kamerarendszer (végpontok közötti titkosítással)”",
    "originLink": "https://github.com/privastead/privastead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284412",
    "commentBody": "",
    "originSummary": [
      "„A szerző kifejlesztett egy Privastead nevű otthoni biztonsági kamerarendszert, amely a magánélet védelmére összpontosít, végpontok közötti titkosítást alkalmazva az OpenMLS segítségével, és nagyrészt Rust nyelven valósította meg. - A Privastead nyílt forráskódú azok számára, akik aggódnak a magánéletük miatt, és a beállításhoz kompatibilis IP kamerát, helyi gépet, szervert és Android okostelefont igényel. - Jelenleg a rendszer csak egy IP kamerát és Androidot támogat, de a szerző közösségi visszajelzéseket és hozzájárulásokat vár a képességeinek bővítése érdekében.”"
    ],
    "commentSummary": [
      "„A Privastead egy nyílt forráskódú otthoni biztonsági kamerarendszer, amelyet a meglévő megoldásokkal kapcsolatos adatvédelmi aggályok kezelésére fejlesztettek ki, végpontok közötti titkosítást alkalmazva az OpenMLS segítségével. A rendszert elsősorban Rust nyelven valósították meg, és működéséhez egy támogatott IP kamera, egy helyi gép, egy szerver és egy Android okostelefon szükséges. A projekt elérhető a GitHubon, ahol a közösség visszajelzéseit és hozzájárulásait várják a funkcionalitásának javítása érdekében.”"
    ],
    "points": 386,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733004829
  },
  {
    "id": 42283950,
    "title": "„Az Ntfs2btrfs helyben végzi az NTFS fájlrendszer átalakítását a nyílt forráskódú Btrfs-re.”",
    "originLink": "https://github.com/maharmstone/ntfs2btrfs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283950",
    "commentBody": "",
    "originSummary": [
      "„Az Ntfs2btrfs egy eszköz, amelyet arra terveztek, hogy az NTFS fájlrendszereket helyben Btrfs-re alakítsa át, miközben az eredeti képet reflink másolatként megőrzi a lehetséges tárhely-visszanyerés érdekében.”",
      "„Az eszköz elérhető mind Windows, mind Linux rendszerekre, mindkét platformhoz specifikus telepítési utasításokkal és függőségekkel, és olyan funkciókat tartalmaz, mint a tömörítés támogatása és a visszaállítás NTFS-re.”",
      "„A korlátok közé tartozik a régebbi kiterjesztett attribútumok, a nagy alternatív adatfolyamok (ADS) és a titkosított fájlok támogatásának hiánya, valamint a Windows Btrfs fájlrendszerről történő indításához szükséges speciális feltételek.”"
    ],
    "commentSummary": [
      "„Az Ntfs2btrfs egy eszköz, amely lehetővé teszi az NTFS (New Technology File System) fájlrendszer Btrfs (B-tree File System) fájlrendszerré történő helyben történő átalakítását, ami vitákat vált ki annak hasznosságáról és időzítéséről nagy adatátvitelek esetén.”",
      "„A felhasználók vegyes tapasztalatokat osztanak meg a Btrfs-sel kapcsolatban, értékelve az olyan funkciókat, mint a pillanatképek, de felidézve a múltbeli stabilitási problémákat is, miközben más fájlrendszerekről, például a ZFS-ről és a bcachefs-ről is beszélgetnek.”",
      "„A beszélgetés rávilágít a fájlrendszer-kezelés összetettségére és kockázataira, mivel néhány felhasználó a biztonsági mentéseket és a friss formázásokat részesíti előnyben az átalakító eszközökkel szemben.”"
    ],
    "points": 367,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1732999808
  },
  {
    "id": 42283933,
    "title": "„Az AMD letiltja a Zen 4 hurokpufferét”",
    "originLink": "https://chipsandcheese.com/p/amd-disables-zen-4s-loop-buffer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283933",
    "commentBody": "",
    "originSummary": [
      "„Az AMD letiltotta a loop buffer-t a Zen 4 CPU-iban, amely funkció inkább a teljesítmény optimalizálására, semmint a teljesítmény növelésére szolgált. A teljesítménytesztek elhanyagolható különbségeket mutatnak a loop buffer letiltásával, mivel az op cache elegendő sávszélességgel kompenzál. A döntés, hogy letiltják a loop buffer-t, valószínűleg egy hardverhiba miatt történt, de nem valószínű, hogy jelentősen befolyásolja a teljesítményt vagy az energiafogyasztást, és az AMD nem dokumentálta széles körben ezt a funkciót.”"
    ],
    "commentSummary": [
      "„Az AMD letiltotta a loop buffer-t a Zen 4 CPU-iban, valószínűleg nem nyilvános hardveres sebezhetőségek miatt, ami bizonyos helyzetekben kisebb teljesítménycsökkenést eredményezett. A loop buffer-t eredetileg a teljesítmény és az energiahatékonyság javítására tervezték, de annak eltávolítása azt jelzi, hogy talán nem nyújtott jelentős előnyöket. A loop buffer csendes letiltása aggodalmakat keltett az átláthatósággal és a hardveres sebezhetőségek kezelésével kapcsolatban.”"
    ],
    "points": 271,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1732999655
  },
  {
    "id": 42285689,
    "title": "„Megjelent az OpenWRT One: Az első router, amelyet kifejezetten az OpenWrt számára terveztek”",
    "originLink": "https://sfconservancy.org/news/2024/nov/29/openwrt-one-wireless-router-now-ships-black-friday/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285689",
    "commentBody": "",
    "originSummary": [
      "„A Software Freedom Conservancy (SFC) és az OpenWrt kiadta az OpenWrt One-t, egy vezeték nélküli útválasztót, amely a szoftverszabadságot és a javításhoz való jogot hivatott előmozdítani, 89 dolláros áron tokkal vagy 68,42 dollárért az alaplapért.”",
      "„Az útválasztó nem tehető tönkre, teljesen copyleft-kompatibilis, és egy MediaTek MT7981B SoC-t, MT7976C wifi-t, 1 GiB DDR4 RAM-ot tartalmaz, támogatja a Power over Ethernet (PoE) és USB-C tápellátást, valamint rendelkezik egy USB soros interfésszel a haladó felhasználók számára.”",
      "„A készülék megfelel az FCC előírásainak, ami azt mutatja, hogy a szoftverek javításának joga összhangba hozható a szabályozási követelményekkel, és minden vásárlás magában foglal egy 10 dolláros adományt az OpenWrt számára a Software Freedom Conservancy-nál.”"
    ],
    "commentSummary": [
      "„Az OpenWRT One, az első router, amelyet kifejezetten az OpenWrt nyílt forráskódú firmware-hez terveztek, megjelent, 89 dolláros áron. Célja, hogy egyensúlyt teremtsen a copyleft megfelelőség és az FCC szabályozások között, bár még mindig tartalmaz néhány zárt forráskódú bináris blobot a Wi-Fi funkciókhoz. A megjelenés vitákat váltott ki a router és a Wi-Fi funkciók szétválasztásának előnyeiről a hálózati hardverek nagyobb rugalmassága érdekében.”"
    ],
    "points": 242,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733020464
  },
  {
    "id": 42285128,
    "title": "„Jeff Dean válaszol az EDA iparágnak az AlphaChip kapcsán”",
    "originLink": "https://twitter.com/JeffDean/status/1858540085794451906",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285128",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Jeff Dean foglalkozott a Google AlphaChip kritikáival, megjegyezve, hogy a kritikusok nem tartották be az alapvető replikációs lépéseket, mint például az előképzést. A vita azt kérdőjelezi meg, hogy az AlphaChip teljesítménye felér-e a meglévő eszközökkel, néhányan azt sugallják, hogy a Google állításai túlzóak lehetnek. Ez a vita feszültségeket hangsúlyoz a Google és az Elektronikai Tervezés Automatizálás (EDA) iparág között, amely magában foglalja az elfogultság vádjait és a Google kutatásainak megismételhetőségével kapcsolatos aggodalmakat.”"
    ],
    "points": 178,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733012884
  }
]
