[
  {
    "id": 42287231,
    "title": "قدوم الكود 2024",
    "originLink": "https://adventofcode.com/2024/about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42287231",
    "commentBody": "",
    "originSummary": [
      "تقويم Advent of Code، الذي أنشأه إريك واستل، هو تقويم للمغامرات يتضمن ألغاز برمجية مناسبة لجميع مستويات المهارة، ويمكن حلها بأي لغة برمجة.",
      "تم تصميم الألغاز لتعمل بكفاءة على الأجهزة القديمة وهي مخصصة للممارسة أو المقابلات أو الترفيه، دون الحاجة إلى خلفية في علوم الكمبيوتر.",
      "يُشجَّع المشاركون على مشاركة تجاربهم، واختبار الحلول بالأمثلة، وطلب المساعدة إذا لزم الأمر، مع الالتزام بالإرشادات مثل عدم استخدام الذكاء الاصطناعي لحل الألغاز واحترام قواعد العلامات التجارية."
    ],
    "commentSummary": [
      "بدأت فعالية Advent of Code 2024، حيث يشارك المشاركون في حل المشكلات بطرق إبداعية ومشاركة تجاربهم. - يقوم بعض المشاركين بتجربة أساليب فريدة، مثل استخدام لغة C بدون المكتبات القياسية أو استكشاف لغات برمجة جديدة مثل Swift أو Ada. - وعلى الرغم من وجود مخاوف بشأن تأثير الذكاء الاصطناعي على لوحة المتصدرين، إلا أن الحدث يركز بشكل أساسي على الاستمتاع الشخصي، التعلم، والتفاعل المجتمعي."
    ],
    "points": 726,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1733044175
  },
  {
    "id": 42284202,
    "title": "أصدرت سلطة تصديق برازيلية موثوقة فقط من قبل مايكروسوفت شهادة لموقع google.com",
    "originLink": "https://follow.agwa.name/notice/AoZSMI38xcA3TrN1sm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284202",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أصدرت سلطة إصدار الشهادات البرازيلية (CA)، التي تثق بها مايكروسوفت فقط، شهادة لموقع google.com، مما يعد انتهاكًا لقواعد تفويض سلطة إصدار الشهادات (CAA) الخاصة بجوجل.",
      "يثير هذا الحادث مخاوف بشأن موثوقية سلطة الشهادات وقرار مايكروسوفت بالثقة بها، حيث لا تقوم المتصفحات الرئيسية الأخرى بذلك.",
      "يمكن أن يسهل الشهادة هجمات الرجل في الوسط، مما يسمح للمهاجمين بانتحال شخصية جوجل وتوزيع البرمجيات الخبيثة، مما يبرز الحاجة إلى رقابة أكثر صرامة وشفافية في قرارات الثقة الخاصة بسلطات الشهادات."
    ],
    "points": 438,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1733002503
  },
  {
    "id": 42284412,
    "title": "نظام كاميرات أمنية منزلية خاصة مفتوح المصدر (تشفير من طرف إلى طرف)",
    "originLink": "https://github.com/privastead/privastead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284412",
    "commentBody": "",
    "originSummary": [
      "طور المؤلف نظام كاميرات أمنية منزلية يسمى Privastead، يركز على الخصوصية باستخدام التشفير من طرف إلى طرف مع OpenMLS وتنفيذه بشكل رئيسي بلغة Rust. - Privastead مفتوح المصدر لأولئك الذين لديهم مخاوف بشأن الخصوصية، ويتطلب كاميرا IP متوافقة، وجهاز محلي، وخادم، وهاتف ذكي يعمل بنظام Android للإعداد. - حاليًا، يدعم النظام كاميرا IP واحدة فقط ونظام Android، لكن المؤلف يسعى للحصول على ملاحظات المجتمع ومساهماتهم لتعزيز قدراته."
    ],
    "commentSummary": [
      "Privastead هو نظام كاميرات أمان منزلي مفتوح المصدر تم تطويره لمعالجة مخاوف الخصوصية مع الحلول الحالية، باستخدام التشفير من طرف إلى طرف عبر OpenMLS. يتم تنفيذ النظام بشكل أساسي بلغة Rust ويتطلب كاميرا IP مدعومة، وجهاز محلي، وخادم، وهاتف ذكي يعمل بنظام Android للتشغيل. المشروع متاح على GitHub، ويدعو إلى تقديم الملاحظات والمساهمات من المجتمع لتعزيز وظيفته."
    ],
    "points": 386,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733004829
  },
  {
    "id": 42283950,
    "title": "يقوم Ntfs2btrfs بتحويل نظام الملفات NTFS إلى نظام Btrfs مفتوح المصدر في مكانه.",
    "originLink": "https://github.com/maharmstone/ntfs2btrfs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283950",
    "commentBody": "",
    "originSummary": [
      "Ntfs2btrfs هو أداة مصممة لتحويل أنظمة الملفات NTFS إلى Btrfs في مكانها، مع الحفاظ على الصورة الأصلية كنسخة مرجعية لاستعادة المساحة المحتملة.",
      "الأداة متاحة لكل من نظامي التشغيل ويندوز ولينكس، مع تعليمات تثبيت محددة ومتطلبات لكل منصة، وتشمل ميزات مثل دعم الضغط والعودة إلى نظام الملفات NTFS.",
      "تشمل القيود عدم دعم السمات الموسعة القديمة، وتيارات البيانات البديلة الكبيرة (ADS)، والملفات المشفرة، مع وجود شروط محددة مطلوبة لتشغيل نظام ويندوز من نظام ملفات Btrfs."
    ],
    "commentSummary": [
      "Ntfs2btrfs هو أداة تتيح التحويل في الموقع من نظام الملفات NTFS (نظام ملفات التكنولوجيا الجديدة) إلى Btrfs (نظام ملفات الشجرة B)، مما يثير مناقشات حول فائدتها وتوقيتها لنقل البيانات الكبيرة.",
      "يشارك المستخدمون تجارب متباينة مع Btrfs، حيث يقدرون ميزات مثل اللقطات لكنهم يتذكرون مشكلات الاستقرار السابقة، بينما يناقشون أيضًا أنظمة ملفات أخرى مثل ZFS وbcachefs.",
      "تؤكد المحادثة على تعقيدات ومخاطر إدارة نظام الملفات، حيث يوصي بعض المستخدمين بالنسخ الاحتياطي وإعادة التهيئة بدلاً من استخدام أدوات التحويل."
    ],
    "points": 367,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1732999808
  },
  {
    "id": 42283933,
    "title": "تعطيل AMD لذواكر الحلقة في Zen 4",
    "originLink": "https://chipsandcheese.com/p/amd-disables-zen-4s-loop-buffer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283933",
    "commentBody": "",
    "originSummary": [
      "قامت شركة AMD بتعطيل المخزن المؤقت للحلقات في معالجات Zen 4 الخاصة بها، وهي ميزة كانت مخصصة لتحسين استهلاك الطاقة بدلاً من تعزيز الأداء. تشير اختبارات الأداء إلى وجود اختلافات طفيفة مع تعطيل المخزن المؤقت للحلقات، حيث يعوض ذاكرة التخزين المؤقت للعمليات عن ذلك بعرض نطاق كافٍ. من غير المرجح أن يؤثر قرار تعطيل المخزن المؤقت للحلقات، ربما بسبب خطأ في الأجهزة، بشكل كبير على الأداء أو استهلاك الطاقة، ولم تكن هذه الميزة موثقة بشكل واسع من قبل AMD."
    ],
    "commentSummary": [
      "قامت شركة AMD بتعطيل المخزن المؤقت للحلقات في معالجات Zen 4 الخاصة بها، على الأرجح بسبب ثغرات في الأجهزة لم يتم الكشف عنها، مما أدى إلى انخفاض طفيف في الأداء في بعض الحالات. كان المخزن المؤقت للحلقات مصممًا لتعزيز كفاءة الطاقة والأداء، لكن إزالته تشير إلى أنه ربما لم يقدم فوائد كبيرة. القرار الهادئ لتعطيل المخزن المؤقت للحلقات أثار مخاوف بشأن الشفافية وإدارة الثغرات في الأجهزة."
    ],
    "points": 271,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1732999655
  },
  {
    "id": 42285689,
    "title": "إصدار OpenWRT One: أول جهاز توجيه مصمم خصيصًا لـ OpenWrt",
    "originLink": "https://sfconservancy.org/news/2024/nov/29/openwrt-one-wireless-router-now-ships-black-friday/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285689",
    "commentBody": "",
    "originSummary": [
      "أصدرت مؤسسة الحفاظ على حرية البرمجيات (SFC) وOpenWrt جهاز التوجيه اللاسلكي OpenWrt One، المصمم لتعزيز حرية البرمجيات وحق الإصلاح، بسعر 89 دولارًا مع غلاف أو 68.42 دولارًا للوحة.",
      "الموجه غير قابل للتعطيل، متوافق تمامًا مع حقوق الطبع والنشر المفتوحة، ويتميز بشريحة MediaTek MT7981B SoC، وواي فاي MT7976C، وذاكرة وصول عشوائي DDR4 بسعة 1 جيجابايت، ويدعم الطاقة عبر الإيثرنت (PoE) وطاقة USB-C، مع واجهة تسلسلية USB للمستخدمين المتقدمين.",
      "الجهاز متوافق مع لجنة الاتصالات الفيدرالية (FCC)، مما يوضح أن حق إصلاح البرمجيات يمكن أن يتماشى مع المتطلبات التنظيمية، وكل عملية شراء تتضمن تبرعًا بقيمة 10 دولارات لمشروع OpenWrt في مؤسسة حرية البرمجيات."
    ],
    "commentSummary": [
      "تم إصدار OpenWRT One، وهو أول جهاز توجيه مصمم خصيصًا للبرمجيات الثابتة مفتوحة المصدر OpenWrt، بسعر 89 دولارًا. يهدف إلى تحقيق التوازن بين الامتثال لحقوق النشر المفتوحة ولوائح لجنة الاتصالات الفيدرالية، على الرغم من أنه لا يزال يتضمن بعض الأجزاء الثنائية الملكية لوظائف Wi-Fi. أثار الإصدار مناقشات حول فوائد فصل وظائف جهاز التوجيه وWi-Fi لتحقيق مرونة أكبر في أجهزة الشبكات."
    ],
    "points": 242,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733020464
  },
  {
    "id": 42285128,
    "title": "جيف دين يرد على صناعة EDA بشأن AlphaChip",
    "originLink": "https://twitter.com/JeffDean/status/1858540085794451906",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285128",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تطرق جيف دين إلى الانتقادات المتعلقة بشريحة ألفا من جوجل، مشيرًا إلى أن النقاد لم يلتزموا بالخطوات الأساسية للتكرار، مثل التدريب المسبق. - تثير المناقشة تساؤلات حول ما إذا كان أداء شريحة ألفا يتماشى مع الأدوات الحالية، حيث يقترح البعض أن ادعاءات جوجل قد تكون مبالغًا فيها. - تؤكد هذه المناقشة على التوترات بين جوجل وصناعة أتمتة التصميم الإلكتروني (EDA)، والتي تتضمن اتهامات بالتحيز ومخاوف بشأن إمكانية تكرار أبحاث جوجل."
    ],
    "points": 178,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733012884
  }
]
