[
  {
    "id": 42287231,
    "title": "Пришествие кода 2024",
    "originLink": "https://adventofcode.com/2024/about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42287231",
    "commentBody": "",
    "originSummary": [
      "Advent of Code, созданный Эриком Вастлом, представляет собой адвент-календарь с задачами по программированию, подходящими для всех уровней навыков, которые можно решать на любом языке программирования.",
      "Головоломки разработаны так, чтобы эффективно работать на старом оборудовании и предназначены для практики, собеседований или развлечения, не требуя знаний в области компьютерных наук.",
      "Участников призывают делиться своим опытом, проверять решения на примерах и обращаться за помощью при необходимости, соблюдая такие правила, как не использовать ИИ для решения головоломок и уважать правила товарных знаков."
    ],
    "commentSummary": [
      "Начался Advent of Code 2024, и участники занимаются творческим решением задач и делятся своими впечатлениями. Некоторые участники экспериментируют с уникальными подходами, такими как использование C без стандартных библиотек или изучение новых языков программирования, таких как Swift или Ada. Хотя существуют опасения по поводу влияния ИИ на таблицу лидеров, мероприятие в первую очередь способствует личному удовольствию, обучению и взаимодействию в сообществе."
    ],
    "points": 726,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1733044175
  },
  {
    "id": 42284202,
    "title": "Бразильский центр сертификации, которому доверяет только Microsoft, выдал сертификат для google.com.",
    "originLink": "https://follow.agwa.name/notice/AoZSMI38xcA3TrN1sm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284202",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Бразильский центр сертификации (CA), которому доверяет исключительно Microsoft, выдал сертификат для google.com, нарушив правила авторизации центра сертификации Google (CAA).",
      "Этот инцидент вызывает опасения по поводу надежности удостоверяющего центра (CA) и решения Microsoft доверять ему, в то время как другие крупные браузеры этого не делают.",
      "Сертификат может облегчить атаки типа «человек посередине», позволяя злоумышленникам выдавать себя за Google и распространять вредоносное ПО, что подчеркивает необходимость более строгого контроля и прозрачности в решениях о доверии к центрам сертификации."
    ],
    "points": 438,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1733002503
  },
  {
    "id": 42284412,
    "title": "Открытая система частных домашних камер видеонаблюдения (сквозное шифрование)",
    "originLink": "https://github.com/privastead/privastead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284412",
    "commentBody": "",
    "originSummary": [
      "Автор разработал систему домашнего видеонаблюдения под названием Privastead, сосредоточив внимание на конфиденциальности с использованием сквозного шифрования с OpenMLS и реализовав её в основном на языке Rust. Privastead является проектом с открытым исходным кодом для тех, кто обеспокоен вопросами конфиденциальности, и требует совместимую IP-камеру, локальный компьютер, сервер и смартфон на базе Android для настройки. В настоящее время система поддерживает только одну IP-камеру и Android, но автор ищет отзывы и вклад сообщества для улучшения её возможностей."
    ],
    "commentSummary": [
      "Privastead — это система домашнего видеонаблюдения с открытым исходным кодом, разработанная для решения проблем конфиденциальности, связанных с существующими решениями, с использованием сквозного шифрования через OpenMLS. Система в основном реализована на языке Rust и требует поддерживаемую IP-камеру, локальный компьютер, сервер и смартфон на базе Android для работы. Проект доступен на GitHub, приглашая сообщество оставлять отзывы и вносить вклад в улучшение его функциональности."
    ],
    "points": 386,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733004829
  },
  {
    "id": 42283950,
    "title": "Ntfs2btrfs выполняет конвертацию файловой системы NTFS в открытую файловую систему Btrfs на месте.",
    "originLink": "https://github.com/maharmstone/ntfs2btrfs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283950",
    "commentBody": "",
    "originSummary": [
      "Ntfs2btrfs — это инструмент, предназначенный для преобразования файловых систем NTFS в Btrfs на месте, сохраняя оригинальное изображение в виде копии reflink для возможного восстановления пространства.",
      "Инструмент доступен как для Windows, так и для Linux, с конкретными инструкциями по установке и зависимостями для каждой платформы, и включает такие функции, как поддержка сжатия и откат к NTFS.",
      "Ограничения включают отсутствие поддержки для старых расширенных атрибутов, больших альтернативных потоков данных (ADS) и зашифрованных файлов, с особыми условиями, необходимыми для загрузки Windows с файловой системы Btrfs."
    ],
    "commentSummary": [
      "Ntfs2btrfs — это инструмент, который позволяет выполнять конвертацию файловой системы NTFS (New Technology File System) в Btrfs (B-tree File System) на месте, вызывая обсуждения о его полезности и времени для передачи больших объемов данных.",
      "Пользователи делятся смешанными впечатлениями от Btrfs, ценя такие функции, как снимки, но вспоминая прошлые проблемы со стабильностью, а также обсуждая другие файловые системы, такие как ZFS и bcachefs.",
      "Разговор подчеркивает сложность и риски управления файловой системой, при этом некоторые пользователи выступают за резервное копирование и свежие форматы вместо инструментов конверсии."
    ],
    "points": 367,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1732999808
  },
  {
    "id": 42283933,
    "title": "AMD отключает буфер цикла Zen 4",
    "originLink": "https://chipsandcheese.com/p/amd-disables-zen-4s-loop-buffer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283933",
    "commentBody": "",
    "originSummary": [
      "AMD отключила буфер цикла в своих процессорах Zen 4, функция, предназначенная для оптимизации энергопотребления, а не для повышения производительности. Тесты производительности показывают незначительные различия с отключенным буфером цикла, так как кэш операций компенсирует это достаточной пропускной способностью. Решение отключить буфер цикла, возможно, из-за аппаратной ошибки, вряд ли существенно повлияет на производительность или энергопотребление, и эта функция не была широко задокументирована AMD."
    ],
    "commentSummary": [
      "«AMD отключила буфер цикла в своих процессорах Zen 4, вероятно, из-за нераскрытых уязвимостей оборудования, что привело к незначительному снижению производительности в определенных ситуациях. Буфер цикла был разработан для повышения энергоэффективности и производительности, но его удаление указывает на то, что он мог не предоставлять значительных преимуществ. Тихое решение отключить буфер цикла вызвало обеспокоенность по поводу прозрачности и управления уязвимостями оборудования.»"
    ],
    "points": 271,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1732999655
  },
  {
    "id": 42285689,
    "title": "Выпущен OpenWRT One: первый маршрутизатор, разработанный специально для OpenWrt",
    "originLink": "https://sfconservancy.org/news/2024/nov/29/openwrt-one-wireless-router-now-ships-black-friday/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285689",
    "commentBody": "",
    "originSummary": [
      "Фонд Software Freedom Conservancy (SFC) и проект OpenWrt выпустили OpenWrt One, беспроводной маршрутизатор, разработанный для продвижения свободы программного обеспечения и права на ремонт, стоимостью $89 с корпусом или $68.42 за плату.",
      "Маршрутизатор не подлежит блокировке, полностью соответствует требованиям копилефта и оснащен SoC MediaTek MT7981B, Wi-Fi MT7976C, 1 ГиБ оперативной памяти DDR4, поддерживает питание через Ethernet (PoE) и питание через USB-C, а также имеет USB-серийный интерфейс для продвинутых пользователей.",
      "Устройство соответствует требованиям FCC, что демонстрирует, что право на ремонт программного обеспечения может соответствовать нормативным требованиям, и каждая покупка включает пожертвование в размере 10 долларов США в пользу OpenWrt в Software Freedom Conservancy."
    ],
    "commentSummary": [
      "OpenWRT One, первый маршрутизатор, специально разработанный для прошивки с открытым исходным кодом OpenWrt, был выпущен по цене $89. Он стремится сбалансировать соблюдение копилефта с нормативами FCC, хотя все еще включает некоторые проприетарные бинарные блобы для функциональности Wi-Fi. Выпуск вызвал обсуждения о преимуществах разделения функций маршрутизатора и Wi-Fi для большей гибкости в сетевом оборудовании."
    ],
    "points": 242,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733020464
  },
  {
    "id": 42285128,
    "title": "Джефф Дин отвечает индустрии EDA о AlphaChip",
    "originLink": "https://twitter.com/JeffDean/status/1858540085794451906",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285128",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Джефф Дин ответил на критику в адрес AlphaChip от Google, отметив, что критики не придерживались необходимых шагов репликации, таких как предварительное обучение. - Дискуссия ставит под вопрос, соответствует ли производительность AlphaChip существующим инструментам, и некоторые предполагают, что заявления Google могут быть преувеличены. - Это обсуждение подчеркивает напряженность между Google и индустрией автоматизации проектирования электроники (EDA), включая обвинения в предвзятости и обеспокоенность по поводу воспроизводимости исследований Google."
    ],
    "points": 178,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733012884
  }
]
