[
  {
    "id": 42287231,
    "title": "कोड 2024 का आगमन",
    "originLink": "https://adventofcode.com/2024/about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42287231",
    "commentBody": "",
    "originSummary": [
      "एडवेंट ऑफ कोड, एरिक वास्टल द्वारा निर्मित, एक एडवेंट कैलेंडर है जिसमें प्रोग्रामिंग पहेलियाँ होती हैं जो सभी कौशल स्तरों के लिए उपयुक्त हैं, और जिन्हें किसी भी प्रोग्रामिंग भाषा में हल किया जा सकता है।",
      "पहेलियाँ पुराने हार्डवेयर पर कुशलता से चलने के लिए डिज़ाइन की गई हैं और इन्हें अभ्यास, साक्षात्कार, या मनोरंजन के लिए बनाया गया है, जिसमें कंप्यूटर विज्ञान की पृष्ठभूमि की आवश्यकता नहीं होती है।",
      "प्रतिभागियों को अपने अनुभव साझा करने, उदाहरणों के साथ समाधान का परीक्षण करने और आवश्यकता पड़ने पर मदद मांगने के लिए प्रोत्साहित किया जाता है, जबकि उन्हें इस तरह के दिशा-निर्देशों का पालन करना चाहिए जैसे कि पहेलियों को हल करने के लिए एआई का उपयोग न करना और ट्रेडमार्क नियमों का सम्मान करना।"
    ],
    "commentSummary": [
      "एडवेंट ऑफ कोड 2024 शुरू हो गया है, जिसमें प्रतिभागी रचनात्मक समस्या-समाधान में संलग्न हैं और अपने अनुभव साझा कर रहे हैं।- कुछ प्रतिभागी अनोखे दृष्टिकोणों के साथ प्रयोग कर रहे हैं, जैसे कि बिना मानक लाइब्रेरी के C का उपयोग करना या स्विफ्ट या एडा जैसी नई प्रोग्रामिंग भाषाओं का अन्वेषण करना।- जबकि लीडरबोर्ड पर एआई के प्रभाव को लेकर चिंताएं हैं, यह आयोजन मुख्य रूप से व्यक्तिगत आनंद, सीखने और सामुदायिक बातचीत को बढ़ावा देता है।"
    ],
    "points": 726,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1733044175
  },
  {
    "id": 42284202,
    "title": "माइक्रोसॉफ्ट द्वारा ही विश्वसनीय एक ब्राज़ीलियाई सीए ने google.com के लिए एक प्रमाणपत्र जारी किया है।",
    "originLink": "https://follow.agwa.name/notice/AoZSMI38xcA3TrN1sm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284202",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक ब्राज़ीलियाई प्रमाणपत्र प्राधिकरण (सीए), जो केवल माइक्रोसॉफ्ट द्वारा विश्वसनीय है, ने google.com के लिए एक प्रमाणपत्र जारी किया, जिससे गूगल के प्रमाणपत्र प्राधिकरण प्राधिकरण (सीएए) नियमों का उल्लंघन हुआ।",
      "यह घटना CA की विश्वसनीयता और इसे भरोसा करने के माइक्रोसॉफ्ट के निर्णय के बारे में चिंताएं उठाती है, क्योंकि अन्य प्रमुख ब्राउज़र ऐसा नहीं करते।",
      "प्रमाणपत्र मैन-इन-द-मिडल हमलों को सुगम बना सकता है, जिससे हमलावर गूगल का प्रतिरूपण कर सकते हैं और मैलवेयर वितरित कर सकते हैं, जो CA विश्वास निर्णयों में कड़ी निगरानी और पारदर्शिता की आवश्यकता को रेखांकित करता है।"
    ],
    "points": 438,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1733002503
  },
  {
    "id": 42284412,
    "title": "ओपन-सोर्स निजी होम सुरक्षा कैमरा प्रणाली (एंड-टू-एंड एन्क्रिप्शन)",
    "originLink": "https://github.com/privastead/privastead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42284412",
    "commentBody": "",
    "originSummary": [
      "लेखक ने एक होम सुरक्षा कैमरा प्रणाली विकसित की है जिसे प्राइवास्टेड कहा जाता है, जो गोपनीयता पर ध्यान केंद्रित करता है और ओपनएमएलएस के साथ एंड-टू-एंड एन्क्रिप्शन का उपयोग करता है और इसे ज्यादातर रस्ट में लागू किया गया है।- प्राइवास्टेड उन लोगों के लिए ओपन-सोर्स किया गया है जिनकी गोपनीयता को लेकर चिंताएं हैं, इसके लिए एक संगत आईपी कैमरा, एक स्थानीय मशीन, एक सर्वर, और सेटअप के लिए एक एंड्रॉइड स्मार्टफोन की आवश्यकता होती है।- वर्तमान में, प्रणाली केवल एक आईपी कैमरा और एंड्रॉइड का समर्थन करती है, लेकिन लेखक इसकी क्षमताओं को बढ़ाने के लिए समुदाय की प्रतिक्रिया और योगदान की तलाश कर रहे हैं।"
    ],
    "commentSummary": [
      "प्राइवास्टेड एक ओपन-सोर्स होम सिक्योरिटी कैमरा सिस्टम है जिसे मौजूदा समाधानों के साथ गोपनीयता चिंताओं को संबोधित करने के लिए विकसित किया गया है, जो ओपनएमएलएस के माध्यम से एंड-टू-एंड एन्क्रिप्शन का उपयोग करता है।- यह सिस्टम मुख्य रूप से रस्ट में कार्यान्वित किया गया है और इसके संचालन के लिए एक समर्थित आईपी कैमरा, एक स्थानीय मशीन, एक सर्वर, और एक एंड्रॉइड स्मार्टफोन की आवश्यकता होती है।- यह प्रोजेक्ट गिटहब पर उपलब्ध है, जो इसकी कार्यक्षमता को बढ़ाने के लिए समुदाय से प्रतिक्रिया और योगदान आमंत्रित करता है।"
    ],
    "points": 386,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733004829
  },
  {
    "id": 42283950,
    "title": "Ntfs2btrfs ओपन-सोर्स Btrfs में NTFS फाइल सिस्टम का इन-प्लेस रूपांतरण करता है।",
    "originLink": "https://github.com/maharmstone/ntfs2btrfs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283950",
    "commentBody": "",
    "originSummary": [
      "Ntfs2btrfs एक उपकरण है जिसे NTFS फाइल सिस्टम को Btrfs में इन-प्लेस रूप से परिवर्तित करने के लिए डिज़ाइन किया गया है, जो संभावित स्थान पुनर्प्राप्ति के लिए मूल छवि को एक रिफलिंक कॉपी के रूप में संरक्षित करता है।",
      "यह उपकरण विंडोज और लिनक्स दोनों के लिए उपलब्ध है, प्रत्येक प्लेटफॉर्म के लिए विशिष्ट स्थापना निर्देश और निर्भरताएँ हैं, और इसमें संपीड़न समर्थन और NTFS पर रोलबैक जैसी विशेषताएँ शामिल हैं।",
      "सीमाओं में पुराने विस्तारित विशेषताओं, बड़े वैकल्पिक डेटा स्ट्रीम (ADS), और एन्क्रिप्टेड फाइलों के लिए समर्थन की कमी शामिल है, जिसमें Btrfs फाइल सिस्टम से विंडोज को बूट करने के लिए विशिष्ट शर्तों की आवश्यकता होती है।"
    ],
    "commentSummary": [
      "Ntfs2btrfs एक उपकरण है जो NTFS (न्यू टेक्नोलॉजी फाइल सिस्टम) से Btrfs (बी-ट्री फाइल सिस्टम) में इन-प्लेस रूपांतरण को सक्षम बनाता है, जिससे बड़े डेटा ट्रांसफर के लिए इसके उपयोगिता और समय पर चर्चाएं शुरू होती हैं।",
      "उपयोगकर्ता Btrfs के साथ मिश्रित अनुभव साझा करते हैं, स्नैपशॉट जैसी विशेषताओं की सराहना करते हैं लेकिन पिछले स्थिरता मुद्दों को याद करते हैं, जबकि ZFS और bcachefs जैसे अन्य फाइल सिस्टम पर भी चर्चा करते हैं।",
      "यह बातचीत फाइल सिस्टम प्रबंधन की जटिलताओं और जोखिमों को उजागर करती है, जिसमें कुछ उपयोगकर्ता बैकअप और ताज़ा प्रारूपों को रूपांतरण उपकरणों पर प्राथमिकता देने की वकालत करते हैं।"
    ],
    "points": 367,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1732999808
  },
  {
    "id": 42283933,
    "title": "एएमडी ने ज़ेन 4 के लूप बफर को अक्षम किया",
    "originLink": "https://chipsandcheese.com/p/amd-disables-zen-4s-loop-buffer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42283933",
    "commentBody": "",
    "originSummary": [
      "एएमडी ने अपने ज़ेन 4 सीपीयू में लूप बफर को निष्क्रिय कर दिया है, जो कि प्रदर्शन वृद्धि के बजाय पावर अनुकूलन के लिए एक विशेषता थी। - प्रदर्शन परीक्षणों से पता चलता है कि लूप बफर के निष्क्रिय होने पर नगण्य अंतर होता है, क्योंकि ऑप कैश पर्याप्त बैंडविड्थ के साथ इसकी भरपाई करता है। - लूप बफर को निष्क्रिय करने का निर्णय, संभवतः हार्डवेयर बग के कारण, प्रदर्शन या पावर खपत पर महत्वपूर्ण प्रभाव डालने की संभावना नहीं है, और इस विशेषता का एएमडी द्वारा व्यापक रूप से दस्तावेजीकरण नहीं किया गया था।"
    ],
    "commentSummary": [
      "एएमडी ने अपने ज़ेन 4 सीपीयू में लूप बफर को अक्षम कर दिया है, संभवतः अज्ञात हार्डवेयर कमजोरियों के कारण, जिसके परिणामस्वरूप कुछ स्थितियों में मामूली प्रदर्शन में कमी आई है।- लूप बफर को पावर दक्षता और प्रदर्शन को बढ़ाने के लिए डिज़ाइन किया गया था, लेकिन इसके हटाने से संकेत मिलता है कि यह शायद महत्वपूर्ण लाभ नहीं प्रदान कर रहा था।- लूप बफर को अक्षम करने के इस शांत निर्णय ने पारदर्शिता और हार्डवेयर कमजोरियों के प्रबंधन के संबंध में चिंताएं उत्पन्न की हैं।"
    ],
    "points": 271,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1732999655
  },
  {
    "id": 42285689,
    "title": "ओपनडब्ल्यूआरटी वन जारी: ओपनडब्ल्यूआरटी के लिए विशेष रूप से डिज़ाइन किया गया पहला राउटर",
    "originLink": "https://sfconservancy.org/news/2024/nov/29/openwrt-one-wireless-router-now-ships-black-friday/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285689",
    "commentBody": "",
    "originSummary": [
      "सॉफ्टवेयर फ्रीडम कंजरवेंसी (SFC) और ओपनवर्ट ने ओपनवर्ट वन जारी किया है, जो एक वायरलेस राउटर है जिसे सॉफ्टवेयर स्वतंत्रता और मरम्मत के अधिकार को बढ़ावा देने के लिए डिज़ाइन किया गया है, जिसकी कीमत केस के साथ $89 या बोर्ड के लिए $68.42 है।",
      "राउटर अनब्रिकेबल है, पूरी तरह से कॉपीलेफ्ट-अनुपालन करता है, और इसमें मीडियाटेक MT7981B SoC, MT7976C वाईफाई, 1 GiB DDR4 रैम है, जो पावर ओवर ईथरनेट (PoE) और USB-C पावर का समर्थन करता है, और उन्नत उपयोगकर्ताओं के लिए एक USB सीरियल इंटरफेस है।",
      "यह उपकरण FCC के अनुरूप है, यह दर्शाता है कि सॉफ़्टवेयर की मरम्मत का अधिकार नियामक आवश्यकताओं के साथ मेल खा सकता है, और प्रत्येक खरीद में सॉफ़्टवेयर फ्रीडम कंजरवेंसी में OpenWrt को $10 का दान शामिल है।"
    ],
    "commentSummary": [
      "OpenWRT वन, जो OpenWrt ओपन-सोर्स फर्मवेयर के लिए विशेष रूप से डिज़ाइन किया गया पहला राउटर है, जारी किया गया है, जिसकी कीमत $89 है। इसका उद्देश्य कॉपीलेफ्ट अनुपालन को FCC विनियमों के साथ संतुलित करना है, हालांकि इसमें वाई-फाई कार्यक्षमता के लिए कुछ स्वामित्व वाले बाइनरी ब्लॉब्स शामिल हैं। इस रिलीज़ ने नेटवर्किंग हार्डवेयर में अधिक लचीलापन के लिए राउटर और वाई-फाई कार्यों को अलग करने के लाभों पर चर्चाओं को जन्म दिया है।"
    ],
    "points": 242,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733020464
  },
  {
    "id": 42285128,
    "title": "जेफ डीन ने अल्फाचिप के बारे में ईडीए उद्योग को जवाब दिया",
    "originLink": "https://twitter.com/JeffDean/status/1858540085794451906",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42285128",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "जेफ डीन ने गूगल के अल्फाचिप के संबंध में आलोचनाओं का जवाब दिया, यह बताते हुए कि आलोचकों ने आवश्यक पुनरावृत्ति कदमों का पालन नहीं किया, जैसे कि पूर्व-प्रशिक्षण।- बहस इस बात पर है कि क्या अल्फाचिप का प्रदर्शन मौजूदा उपकरणों के बराबर है, कुछ का सुझाव है कि गूगल के दावे अतिरंजित हो सकते हैं।- यह चर्चा गूगल और इलेक्ट्रॉनिक डिज़ाइन ऑटोमेशन (ईडीए) उद्योग के बीच तनाव को उजागर करती है, जिसमें पक्षपात के आरोप और गूगल के अनुसंधान की पुनरावृत्ति क्षमता के बारे में चिंताएं शामिल हैं।"
    ],
    "points": 178,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1733012884
  }
]
