[
  {
    "id": 42420352,
    "title": "Larangan smartphone di sekolah menghasilkan tidur yang lebih baik dan suasana hati yang meningkat: studi",
    "originLink": "https://www.york.ac.uk/news-and-events/news/2024/research/school-smartphone-ban-better-sleep/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42420352",
    "commentBody": "",
    "originSummary": [
      "Studi oleh psikolog di University of York menemukan bahwa melarang smartphone di sekolah meningkatkan tidur dan suasana hati di kalangan anak-anak. Siswa kelas 8 di The Stanway School di Colchester berpartisipasi dalam larangan smartphone selama 21 hari, yang menghasilkan waktu tidur lebih cepat dan tambahan satu jam istirahat per malam. Studi tersebut melaporkan penurunan 17% dalam depresi dan penurunan 18% dalam kecemasan, menyoroti potensi manfaat larangan smartphone saat pemerintah mengevaluasi dampaknya pada kaum muda."
    ],
    "commentSummary": [
      "Sebuah studi mengungkapkan bahwa pelarangan smartphone di sekolah menghasilkan tidur yang lebih baik dan suasana hati yang meningkat di kalangan siswa Kelas 8, yang mendapatkan tambahan satu jam tidur selama 21 hari. Studi ini menyoroti perdebatan tentang apakah masalahnya terletak pada aplikasi yang adiktif atau pada ponsel itu sendiri, karena larangan tersebut memberikan jeda bebas layar yang dianggap bermanfaat oleh orang tua dan pendidik. Diskusi berlanjut tentang apakah harus membatasi penggunaan ponsel di sekolah atau fokus pada pengaturan desain aplikasi untuk mengurangi kecanduan."
    ],
    "points": 889,
    "commentCount": 568,
    "retryCount": 0,
    "time": 1734220304
  },
  {
    "id": 42419469,
    "title": "Mereka melihat foto-foto Anda",
    "originLink": "https://theyseeyourphotos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42419469",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "MerekaLihatFotoAnda.com mengeksplorasi risiko privasi yang terkait dengan berbagi foto secara online dan memberikan panduan tentang cara menghapus metadata menggunakan alat baris perintah. Diskusi mencakup kemampuan AI dalam mendeteksi modifikasi gambar, tantangan dalam menghapus watermark, dan efektivitas hashing perseptual. Kekhawatiran privasi terkait layanan foto awan dan pentingnya memahami bagaimana perusahaan memanfaatkan data pribadi juga dibahas."
    ],
    "points": 370,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1734210591
  },
  {
    "id": 42423409,
    "title": "Tinjauan visual bahwa a^2 – b^2 = (a + b)(a – b)",
    "originLink": "https://www.futilitycloset.com/2024/12/15/tidy-2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42423409",
    "commentBody": "",
    "originSummary": [
      "Terdapat bukti visual yang menunjukkan identitas aljabar \\(a^2 - b^2 = (a + b)(a - b)\\), yang merupakan konsep dasar dalam aljabar.",
      "Tanggapan oleh Sophie Germain menyoroti keterkaitan antara aljabar dan geometri, menunjukkan bahwa aljabar dapat direpresentasikan secara visual melalui diagram geometris."
    ],
    "commentSummary": [
      "Sebuah bukti visual untuk identitas matematika \\(a^2 - b^2 = (a + b)(a - b)\\) memicu perdebatan tentang keandalan bukti visual.",
      "Kritikus berpendapat bahwa bukti visual dapat menyesatkan, seperti yang dicontohkan oleh sebuah video yang secara keliru \"membuktikan\" bahwa \\(\\pi\\) sama dengan 4, menekankan perlunya asumsi yang hati-hati.",
      "Teks tersebut menekankan bahwa meskipun bukti visual dapat meningkatkan intuisi, mereka sering kali kurang memiliki ketelitian komprehensif dibandingkan dengan bukti aljabar dan mungkin tidak mencakup semua kemungkinan kasus, terutama dengan bilangan negatif."
    ],
    "points": 282,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1734271297
  },
  {
    "id": 42418982,
    "title": "IRATA.ONLINE: Sebuah Komunitas untuk Penggemar Komputasi Retro",
    "originLink": "https://irata.online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42418982",
    "commentBody": "",
    "originSummary": [
      "IRATA.ONLINE adalah platform komunitas untuk penggemar retro-komputing, menggunakan sistem berbasis PLATO yang dikenal dengan kemampuan multi-pengguna, grafis, dan interaktifnya. Platform ini mendukung berbagai platform komputasi klasik seperti Atari, Commodore, dan Apple, memungkinkan pengguna untuk terhubung melalui terminal web atau perangkat lunak khusus seperti PLATOTERM. Platform ini menawarkan permainan multi-pemain, fitur sosial, dan lingkungan pengembangan menggunakan bahasa pemrograman TUTOR, melayani minat dalam permainan dan pengembangan."
    ],
    "commentSummary": [
      "IRATA.ONLINE adalah komunitas yang berfokus pada retro-komputasi, memanfaatkan sistem PLATO untuk pesan, permainan, dan aplikasi. Komunitas ini menghidupkan kembali lingkungan pembelajaran jaringan PLATO, dengan diskusi tentang sejarahnya dan proyek terkait. Akses dapat dilakukan melalui berbagai perangkat lunak klien, termasuk emulator microM8 Apple IIe, dengan berita yang dibagikan di Facebook dan saran untuk platform pengumuman alternatif."
    ],
    "points": 204,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1734205370
  },
  {
    "id": 42421157,
    "title": "Tenstorrent dan Keadaan Startup Perangkat Keras AI",
    "originLink": "https://irrationalanalysis.substack.com/p/tenstorrent-and-the-state-of-ai-hardware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42421157",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Tenstorrent dan startup perangkat keras AI lainnya sedang mengeksplorasi potensi IP CPU RISC-V seiring dengan meningkatnya biaya lisensi ARM, menyoroti pergeseran dalam lanskap arsitektur CPU.",
      "Perselisihan hukum yang sedang berlangsung antara Qualcomm dan ARM mengenai perjanjian lisensi arsitektur (ALA) tetap belum terselesaikan, dengan kedua perusahaan mengklaim kepatuhan terhadap ketentuan kontrak, menambah ketidakpastian di pasar.",
      "Nvidia terus mendominasi pasar perangkat keras AI, menimbulkan tantangan bagi pesaing seperti Tenstorrent, sementara diskusi juga mempertimbangkan dampak ganda dari model bahasa besar (LLM) terhadap pembelajaran dan pemahaman insinyur junior."
    ],
    "points": 198,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1734231598
  },
  {
    "id": 42422077,
    "title": "Ketika Bola Kristal Tidak Cukup untuk Membuat Anda Kaya",
    "originLink": "https://elmwealth.com/crystal-ball/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42422077",
    "commentBody": "",
    "originSummary": [
      "Dalam \"The Crystal Ball Challenge\" tahun 2023, 118 orang dewasa muda yang terlatih dalam bidang keuangan diberikan $50 untuk memperdagangkan S&P 500 dan obligasi Treasury AS 30 tahun dengan menggunakan berita sehari sebelumnya, tetapi tanpa data harga.",
      "Meskipun memiliki berita sebelumnya, setengah dari peserta kehilangan uang, dan satu dari enam bangkrut, dengan keuntungan rata-rata hanya 3,2%, karena prediksi pasar yang salah dan ukuran perdagangan yang buruk.",
      "Percobaan tersebut menyoroti bahwa bahkan dengan pandangan ke depan, perdagangan yang sukses memerlukan keterampilan dan strategi, seperti yang ditunjukkan oleh lima pedagang berpengalaman yang mencapai hasil yang lebih baik."
    ],
    "commentSummary": [
      "Artikel tersebut mengeksplorasi kesulitan dalam menggunakan berita keuangan untuk memprediksi pergerakan pasar saham, menekankan kompleksitas dan ketidakpastian reaksi pasar.",
      "Sebuah studi menunjukkan bahwa pedagang berpengalaman tampil lebih baik, kemungkinan karena ingatan mereka tentang peristiwa masa lalu, tetapi secara keseluruhan, berita keuangan dianggap sebagian besar sebagai kebisingan.",
      "Ini menunjukkan bahwa tren jangka panjang lebih dapat diandalkan untuk keputusan investasi daripada berita jangka pendek, dengan mencatat penurunan kualitas sumber berita dan pengaruh perdagangan frekuensi tinggi."
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1734247357
  }
]
