[
  {
    "id": 42420352,
    "title": "Okulda akıllı telefon yasağı daha iyi uyku ve gelişmiş ruh hali ile sonuçlanıyor: çalışma",
    "originLink": "https://www.york.ac.uk/news-and-events/news/2024/research/school-smartphone-ban-better-sleep/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42420352",
    "commentBody": "",
    "originSummary": [
      "York Üniversitesi'ndeki psikologlar tarafından yapılan bir araştırma, okullarda akıllı telefonların yasaklanmasının çocuklar arasında uyku ve ruh hali üzerinde iyileşme sağladığını buldu.- Colchester'daki The Stanway School'da 8. sınıf öğrencileri, 21 günlük bir akıllı telefon yasağına katıldı ve bu, daha hızlı uykuya dalma ve gecelik bir saat ekstra dinlenme ile sonuçlandı.- Araştırma, depresyonda %17 ve anksiyetede %18 azalma bildirdi ve hükümetler gençler üzerindeki etkilerini değerlendirirken akıllı telefon yasaklarının potansiyel faydalarını vurguladı."
    ],
    "commentSummary": [
      "Bir çalışma, okullarda akıllı telefonların yasaklanmasının, 21 gün boyunca fazladan bir saat uyku kazanan 8. sınıf öğrencileri arasında daha iyi uyku ve gelişmiş bir ruh hali ile sonuçlandığını ortaya koydu. Çalışma, sorunun bağımlılık yapan uygulamalarda mı yoksa telefonların kendisinde mi olduğu konusundaki tartışmayı vurguluyor, çünkü yasak, ebeveynler ve eğitimciler tarafından faydalı görülen ekransız bir mola sundu. Okullarda telefon kullanımını kısıtlamak mı yoksa bağımlılığı azaltmak için uygulama tasarımını düzenlemeye odaklanmak mı gerektiği konusundaki tartışma devam ediyor."
    ],
    "points": 889,
    "commentCount": 568,
    "retryCount": 0,
    "time": 1734220304
  },
  {
    "id": 42419469,
    "title": "Fotoğraflarınızı görüyorlar",
    "originLink": "https://theyseeyourphotos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42419469",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OnlarFotoğraflarınızıGörüyor.com, çevrimiçi fotoğraf paylaşımıyla ilgili gizlilik risklerini araştırır ve komut satırı araçlarını kullanarak meta verilerin kaldırılması konusunda rehberlik sağlar.- Tartışma, görüntü değişikliklerini algılamadaki yapay zekanın yeteneklerini, filigranların kaldırılmasındaki zorlukları ve algısal karma oluşturmanın etkinliğini içerir.- Bulut fotoğraf hizmetleriyle ilgili gizlilik endişeleri ve şirketlerin kişisel verileri nasıl kullandığını anlamanın önemi de ele alınmaktadır."
    ],
    "points": 370,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1734210591
  },
  {
    "id": 42423409,
    "title": "Bir görsel kanıt: a^2 – b^2 = (a + b)(a – b)",
    "originLink": "https://www.futilitycloset.com/2024/12/15/tidy-2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42423409",
    "commentBody": "",
    "originSummary": [
      "Bir görsel ispat, cebirde temel bir kavram olan \\(a^2 - b^2 = (a + b)(a - b)\\) cebirsel özdeşliğini gösterir.",
      "Bu ifade, Sophie Germain tarafından yapılan, cebir ve geometri arasındaki bağlantıyı vurgulamakta ve cebirin geometrik diyagramlar aracılığıyla görsel olarak temsil edilebileceğini önermektedir."
    ],
    "commentSummary": [
      "Matematiksel kimlik için görsel bir kanıt olan \\(a^2 - b^2 = (a + b)(a - b)\\), görsel kanıtların güvenilirliği üzerine bir tartışma başlattı.",
      "Eleştirmenler, görsel kanıtların yanıltıcı olabileceğini, \\(\\pi\\) sayısının 4'e eşit olduğunu yanlış bir şekilde \"kanıtlayan\" bir video örneğiyle vurgulayarak, dikkatli varsayımların gerekliliğini savunuyorlar.",
      "Bu tartışma, görsel kanıtların sezgiyi artırabilmesine rağmen, genellikle cebirsel kanıtların kapsamlı titizliğinden yoksun olduğunu ve özellikle negatif sayılarla ilgili tüm olası durumları ele almayabileceğini vurgulamaktadır."
    ],
    "points": 282,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1734271297
  },
  {
    "id": 42418982,
    "title": "IRATA.ONLINE: Retro Bilgisayar Meraklıları için Bir Topluluk",
    "originLink": "https://irata.online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42418982",
    "commentBody": "",
    "originSummary": [
      "IRATA.ONLINE, retro bilgisayar meraklıları için bir topluluk platformudur ve çok kullanıcılı, grafiksel ve etkileşimli özellikleriyle bilinen PLATO tabanlı bir sistemi kullanır. Atari, Commodore ve Apple gibi çeşitli klasik bilgisayar platformlarını destekler ve kullanıcıların web terminalleri veya PLATOTERM gibi özel yazılımlar aracılığıyla bağlanmalarına olanak tanır. Platform, çok oyunculu oyunlar, sosyal özellikler ve TUTOR programlama dilini kullanarak bir geliştirme ortamı sunarak hem oyun hem de geliştirme ilgilerine hitap eder."
    ],
    "commentSummary": [
      "IRATA.ONLINE, mesajlaşma, oyun ve uygulamalar için PLATO sistemini kullanan, retro-bilgisayar odaklı bir topluluktur. - Topluluk, PLATO ağ tabanlı öğrenme ortamını canlandırarak, tarihi ve ilgili projeler hakkında tartışmalar yürütmektedir. - Erişim, microM8 Apple IIe emülatörü de dahil olmak üzere çeşitli istemci yazılımları aracılığıyla mümkündür ve haberler Facebook'ta paylaşılmakta, alternatif duyuru platformları için öneriler sunulmaktadır."
    ],
    "points": 204,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1734205370
  },
  {
    "id": 42421157,
    "title": "Tenstorrent ve Yapay Zeka Donanım Girişimlerinin Durumu",
    "originLink": "https://irrationalanalysis.substack.com/p/tenstorrent-and-the-state-of-ai-hardware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42421157",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Tenstorrent ve diğer yapay zeka donanım girişimleri, ARM'ın lisanslama maliyetlerinin artmasıyla birlikte RISC-V CPU IP'nin potansiyelini araştırıyor ve bu durum CPU mimarisi manzarasında bir değişimi vurguluyor.",
      "Qualcomm ve ARM arasındaki mimari lisans anlaşmaları (ALA'lar) üzerindeki devam eden yasal anlaşmazlık çözümsüz kalmaya devam ediyor, her iki şirket de sözleşme şartlarına uyduklarını iddia ederek piyasada belirsizlik yaratıyor.",
      "Nvidia, AI donanım pazarında hakimiyetini sürdürerek Tenstorrent gibi rakipler için zorluklar oluşturuyor. Aynı zamanda, büyük dil modellerinin (LLM'ler) genç mühendislerin öğrenme ve anlama süreçleri üzerindeki çift yönlü etkisi de tartışılıyor."
    ],
    "points": 198,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1734231598
  },
  {
    "id": 42422077,
    "title": "Bir Kristal Küre Sizi Zengin Etmeye Yetmediğinde",
    "originLink": "https://elmwealth.com/crystal-ball/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42422077",
    "commentBody": "",
    "originSummary": [
      "2023 \"Kristal Küre Yarışması\"nda, finans eğitimi almış 118 genç yetişkine, bir gün öncesinin haberlerini kullanarak S&P 500 ve 30 yıllık ABD Hazine tahvilleriyle işlem yapmaları için 50 dolar verildi, ancak fiyat verileri sağlanmadı.",
      "İleri haberleri olmasına rağmen, katılımcıların yarısı para kaybetti ve altı kişiden biri iflas etti, yanlış piyasa tahminleri ve kötü ticaret boyutlandırması nedeniyle ortalama sadece %3,2 kazanç sağladı.",
      "Deney, öngörüye sahip olunsa bile başarılı ticaretin beceri ve strateji gerektirdiğini, beş deneyimli tüccarın daha iyi sonuçlar elde etmesiyle gösterdi."
    ],
    "commentSummary": [
      "Makale, finansal haberleri kullanarak borsa hareketlerini tahmin etmenin zorluğunu araştırıyor ve piyasa tepkilerinin karmaşıklığına ve öngörülemezliğine vurgu yapıyor.",
      "Bir çalışma, deneyimli yatırımcıların muhtemelen geçmiş olaylara dair hafızaları nedeniyle daha iyi performans gösterdiğini, ancak genel olarak finansal haberlerin çoğunlukla gürültü olarak kabul edildiğini gösterdi.",
      "Uzun vadeli eğilimlerin, yatırım kararları için kısa vadeli haberlerden daha güvenilir olduğunu, haber kaynaklarının kalitesindeki düşüşü ve yüksek frekanslı ticaretin etkisini belirttiğini öne sürüyor."
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1734247357
  }
]
