[
  {
    "id": 42420352,
    "title": "„Az iskolai okostelefon-tilalom jobb alvást és javult hangulatot eredményez: tanulmány”",
    "originLink": "https://www.york.ac.uk/news-and-events/news/2024/research/school-smartphone-ban-better-sleep/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42420352",
    "commentBody": "",
    "originSummary": [
      "„A Yorki Egyetem pszichológusai által végzett tanulmány megállapította, hogy az okostelefonok iskolai betiltása javította a gyermekek alvását és hangulatát. A colchesteri The Stanway School nyolcadik osztályos diákjai részt vettek egy 21 napos okostelefon-tilalomban, amely gyorsabb elalvást és éjszakánként egy órával több pihenést eredményezett. A tanulmány 17%-os csökkenést jelentett a depresszióban és 18%-os csökkenést a szorongásban, kiemelve az okostelefon-tilalmak lehetséges előnyeit, miközben a kormányok értékelik azok hatását a fiatalokra.”"
    ],
    "commentSummary": [
      "„Egy tanulmány kimutatta, hogy az okostelefonok iskolai betiltása jobb alvást és javult hangulatot eredményezett a 8. évfolyamos diákok körében, akik 21 nap alatt egy órával több alvást nyertek. - A tanulmány rávilágít arra a vitára, hogy a probléma az addiktív alkalmazásokkal vagy magukkal a telefonokkal van-e, mivel a tilalom egy képernyőmentes szünetet biztosított, amelyet a szülők és a pedagógusok hasznosnak találtak. - A vita folytatódik arról, hogy korlátozni kell-e a telefonhasználatot az iskolákban, vagy inkább az alkalmazástervezés szabályozására kellene összpontosítani a függőség enyhítése érdekében.”"
    ],
    "points": 889,
    "commentCount": 568,
    "retryCount": 0,
    "time": 1734220304
  },
  {
    "id": 42419469,
    "title": "„Látják a fotóidat”",
    "originLink": "https://theyseeyourphotos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42419469",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„A TheySeeYourPhotos.com a fotók online megosztásával kapcsolatos adatvédelmi kockázatokat vizsgálja, és útmutatást nyújt a metaadatok eltávolításához parancssori eszközök segítségével. A megbeszélés kiterjed az AI képességeire a képmódosítások észlelésében, a vízjelek eltávolításának kihívásaira, valamint a perceptuális hashelés hatékonyságára. Az adatvédelmi aggályok a felhőalapú fotószolgáltatásokkal kapcsolatban, valamint annak fontossága, hogy megértsük, a vállalatok hogyan használják fel a személyes adatokat, szintén tárgyalásra kerülnek.”"
    ],
    "points": 370,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1734210591
  },
  {
    "id": 42423409,
    "title": "„Egy vizuális bizonyítás arra, hogy a^2 – b^2 = (a + b)(a – b)”",
    "originLink": "https://www.futilitycloset.com/2024/12/15/tidy-2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42423409",
    "commentBody": "",
    "originSummary": [
      "„Egy vizuális bizonyítás bemutatja az algebrai azonosságot \\(a^2 - b^2 = (a + b)(a - b)\\), amely az algebra egyik alapvető fogalma.”",
      "„Sophie Germain kijelentése kiemeli az algebra és a geometria összekapcsoltságát, azt sugallva, hogy az algebra vizuálisan ábrázolható geometriai diagramok segítségével.”"
    ],
    "commentSummary": [
      "„Egy vizuális bizonyítás az \\(a^2 - b^2 = (a + b)(a - b)\\) matematikai azonosságra vitát indított a vizuális bizonyítások megbízhatóságáról.”",
      "„A kritikusok azzal érvelnek, hogy a vizuális bizonyítékok félrevezetőek lehetnek, amint azt egy videó is példázza, amely hamisan „bizonyítja”, hogy \\(\\pi\\) egyenlő 4-gyel, hangsúlyozva a körültekintő feltételezések szükségességét.”",
      "„A vita hangsúlyozza, hogy bár a vizuális bizonyítások fokozhatják az intuíciót, gyakran hiányzik belőlük az algebrai bizonyítások átfogó szigora, és előfordulhat, hogy nem foglalkoznak minden lehetséges esettel, különösen a negatív számok esetében.”"
    ],
    "points": 282,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1734271297
  },
  {
    "id": 42418982,
    "title": "„IRATA.ONLINE: Egy közösség a retro-számítógép rajongók számára”",
    "originLink": "https://irata.online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42418982",
    "commentBody": "",
    "originSummary": [
      "„Az IRATA.ONLINE egy közösségi platform a retro-számítógépek rajongói számára, amely egy PLATO-alapú rendszert használ, amely ismert a többfelhasználós, grafikus és interaktív képességeiről. Támogatja a klasszikus számítástechnikai platformok széles skáláját, mint például az Atari, a Commodore és az Apple, lehetővé téve a felhasználók számára, hogy webes terminálokon vagy speciális szoftvereken, mint a PLATOTERM, keresztül csatlakozzanak. A platform többjátékos játékokat, közösségi funkciókat és egy fejlesztési környezetet kínál a TUTOR programozási nyelv használatával, kielégítve mind a játék, mind a fejlesztési érdeklődést.”"
    ],
    "commentSummary": [
      "„Az IRATA.ONLINE egy közösség, amely a retro-számítástechnikára összpontosít, a PLATO rendszert használva üzenetküldésre, játékra és alkalmazásokra. A közösség újjáéleszti a PLATO hálózati tanulási környezetet, történetével és kapcsolódó projektekkel kapcsolatos vitákkal. A hozzáférés különféle kliens szoftvereken keresztül lehetséges, beleértve a microM8 Apple IIe emulátort, a híreket pedig a Facebookon osztják meg, és javaslatokat tesznek alternatív bejelentési platformokra.”"
    ],
    "points": 204,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1734205370
  },
  {
    "id": 42421157,
    "title": "„Tenstorrent és az AI hardver startupok helyzete”",
    "originLink": "https://irrationalanalysis.substack.com/p/tenstorrent-and-the-state-of-ai-hardware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42421157",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„A Tenstorrent és más AI hardver startupok a RISC-V CPU IP lehetőségeit vizsgálják, mivel az ARM licencdíjai emelkednek, ami a CPU architektúra területén bekövetkező változásokat hangsúlyozza.”",
      "„A Qualcomm és az ARM közötti folyamatban lévő jogi vita az architektúra licencszerződésekről (ALA) továbbra sem oldódott meg, mivel mindkét vállalat állítja, hogy megfelel a szerződés feltételeinek, ami bizonytalanságot okoz a piacon.”",
      "„Az Nvidia továbbra is uralja az AI hardverpiacot, kihívásokat jelentve a versenytársak, például a Tenstorrent számára, miközben a viták a nagy nyelvi modellek (LLM-ek) kettős hatását is figyelembe veszik a kezdő mérnökök tanulására és megértésére.”"
    ],
    "points": 198,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1734231598
  },
  {
    "id": 42422077,
    "title": "„Amikor egy kristálygömb nem elég ahhoz, hogy meggazdagodj”",
    "originLink": "https://elmwealth.com/crystal-ball/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42422077",
    "commentBody": "",
    "originSummary": [
      "„A 2023-as „The Crystal Ball Challenge” során 118 pénzügyi képzettséggel rendelkező fiatal felnőtt kapott 50 dollárt, hogy az S&P 500 és a 30 éves amerikai államkötvényekkel kereskedjenek egy nappal előre megkapott hírek alapján, de árfolyamadatok nélkül.”",
      "„Annak ellenére, hogy előzetes információkkal rendelkeztek, a résztvevők fele pénzt veszített, és minden hatodik csődbe ment, az átlagos nyereség mindössze 3,2% volt a helytelen piaci előrejelzések és a rossz kereskedési méretezés miatt.”",
      "„A kísérlet rávilágított arra, hogy még előrelátással is, a sikeres kereskedéshez készség és stratégia szükséges, amit öt tapasztalt kereskedő is bizonyított, akik jobb eredményeket értek el.”"
    ],
    "commentSummary": [
      "„A cikk azt vizsgálja, milyen nehézségekkel jár a pénzügyi hírek felhasználása a tőzsdei mozgások előrejelzésére, hangsúlyozva a piaci reakciók összetettségét és kiszámíthatatlanságát.”",
      "„Egy tanulmány kimutatta, hogy a tapasztalt kereskedők jobban teljesítettek, valószínűleg a múltbeli események emléke miatt, de összességében a pénzügyi híreket többnyire zajnak tekintik.”",
      "„Azt sugallja, hogy a hosszú távú trendek megbízhatóbbak a befektetési döntésekhez, mint a rövid távú hírek, megjegyezve a hírcsatornák minőségének csökkenését és a nagyfrekvenciás kereskedés hatását.”"
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1734247357
  }
]
