[
  {
    "id": 42420352,
    "title": "„Zákaz smartfónov v školách vedie k lepšiemu spánku a zlepšenej nálade: štúdia“",
    "originLink": "https://www.york.ac.uk/news-and-events/news/2024/research/school-smartphone-ban-better-sleep/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42420352",
    "commentBody": "",
    "originSummary": [
      "„Štúdia psychológov na Univerzite v Yorku zistila, že zákaz smartfónov v školách zlepšil spánok a náladu medzi deťmi. - Žiaci 8. ročníka na škole The Stanway School v Colchesteri sa zúčastnili 21-dňového zákazu smartfónov, čo viedlo k rýchlejšiemu zaspávaniu a extra hodine odpočinku za noc. - Štúdia uviedla 17% zníženie depresie a 18% zníženie úzkosti, čo poukazuje na potenciálne výhody zákazov smartfónov, keď vlády hodnotia ich vplyv na mládež.“"
    ],
    "commentSummary": [
      "„Štúdia odhalila, že zákaz smartfónov v školách viedol k lepšiemu spánku a zlepšenej nálade medzi žiakmi ôsmeho ročníka, ktorí získali o hodinu spánku viac počas 21 dní. Štúdia poukazuje na debatu o tom, či je problém v návykových aplikáciách alebo v samotných telefónoch, keďže zákaz poskytol prestávku bez obrazoviek, ktorú rodičia a pedagógovia považovali za prospešnú. Diskusia pokračuje o tom, či obmedziť používanie telefónov v školách alebo sa zamerať na reguláciu dizajnu aplikácií na zmiernenie závislosti.“"
    ],
    "points": 889,
    "commentCount": 568,
    "retryCount": 0,
    "time": 1734220304
  },
  {
    "id": 42419469,
    "title": "„Videli tvoje fotky“",
    "originLink": "https://theyseeyourphotos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42419469",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„TheySeeYourPhotos.com skúma riziká súkromia spojené so zdieľaním fotografií online a poskytuje návod na odstránenie metadát pomocou nástrojov príkazového riadku. Diskusia zahŕňa schopnosti AI pri detekcii úprav obrázkov, výzvy pri odstraňovaní vodoznakov a účinnosť percepčného hashovania. Riešia sa aj obavy o súkromie týkajúce sa cloudových služieb na ukladanie fotografií a dôležitosť porozumenia, ako spoločnosti využívajú osobné údaje.“"
    ],
    "points": 370,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1734210591
  },
  {
    "id": 42423409,
    "title": "„Vizualizácia dôkazu, že a^2 – b^2 = (a + b)(a – b)“",
    "originLink": "https://www.futilitycloset.com/2024/12/15/tidy-2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42423409",
    "commentBody": "",
    "originSummary": [
      "„Vizualizovaný dôkaz demonštruje algebraickú identitu \\(a^2 - b^2 = (a + b)(a - b)\\), čo je základný koncept v algebre.“",
      "„Vyjadrenie Sophie Germain zdôrazňuje prepojenosť algebry a geometrie, naznačujúc, že algebru je možné vizuálne znázorniť prostredníctvom geometrických diagramov.“"
    ],
    "commentSummary": [
      "„Vizualizovaný dôkaz matematickej identity \\(a^2 - b^2 = (a + b)(a - b)\\) vyvolal diskusiu o spoľahlivosti vizuálnych dôkazov.“",
      "„Kritici tvrdia, že vizuálne dôkazy môžu byť zavádzajúce, ako to ilustruje video, ktoré falošne „dokazuje“, že \\(\\pi\\) sa rovná 4, čo zdôrazňuje potrebu opatrných predpokladov.“",
      "„Diskusia zdôrazňuje, že hoci vizuálne dôkazy môžu zlepšiť intuíciu, často im chýba komplexná prísnosť algebraických dôkazov a nemusia riešiť všetky možné prípady, najmä s negatívnymi číslami.“"
    ],
    "points": 282,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1734271297
  },
  {
    "id": 42418982,
    "title": "„IRATA.ONLINE: Komunita pre nadšencov retro počítačov“",
    "originLink": "https://irata.online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42418982",
    "commentBody": "",
    "originSummary": [
      "„IRATA.ONLINE je komunitná platforma pre nadšencov retro počítačov, ktorá využíva systém založený na PLATO, známy svojimi multi-užívateľskými, grafickými a interaktívnymi schopnosťami. Podporuje rad klasických počítačových platforiem ako Atari, Commodore a Apple, umožňujúc používateľom pripojiť sa cez webové terminály alebo špecifický softvér ako PLATOTERM. Platforma ponúka hry pre viacerých hráčov, sociálne funkcie a vývojové prostredie využívajúce programovací jazyk TUTOR, čím uspokojuje záujmy v oblasti hier aj vývoja.“"
    ],
    "commentSummary": [
      "„IRATA.ONLINE je komunita zameraná na retro-počítačovanie, využívajúca systém PLATO na zasielanie správ, hranie hier a aplikácie. - Komunita oživuje sieťové vzdelávacie prostredie PLATO, s diskusiami o jeho histórii a súvisiacich projektoch. - Prístup je možný prostredníctvom rôzneho klientského softvéru, vrátane emulátora microM8 Apple IIe, s novinkami zdieľanými na Facebooku a návrhmi na alternatívne platformy pre oznamy.“"
    ],
    "points": 204,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1734205370
  },
  {
    "id": 42421157,
    "title": "„Tenstorrent a stav startupov v oblasti AI hardvéru“",
    "originLink": "https://irrationalanalysis.substack.com/p/tenstorrent-and-the-state-of-ai-hardware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42421157",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Tenstorrent a ďalšie startupy v oblasti AI hardvéru skúmajú potenciál RISC-V CPU IP, keďže licenčné náklady ARM rastú, čo poukazuje na posun v oblasti architektúry CPU.“",
      "„Prebiehajúci právny spor medzi spoločnosťami Qualcomm a ARM týkajúci sa licenčných zmlúv na architektúru (ALA) zostáva nevyriešený, pričom obe spoločnosti tvrdia, že dodržiavajú podmienky zmluvy, čo pridáva neistotu na trhu.“",
      "„Nvidia naďalej dominuje na trhu s hardvérom pre umelú inteligenciu, čo predstavuje výzvy pre konkurentov ako Tenstorrent, pričom diskusie tiež zohľadňujú dvojitý vplyv veľkých jazykových modelov (LLM) na učenie a porozumenie mladších inžinierov.“"
    ],
    "points": 198,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1734231598
  },
  {
    "id": 42422077,
    "title": "„Keď krištáľová guľa nestačí na to, aby vás urobila bohatým“",
    "originLink": "https://elmwealth.com/crystal-ball/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42422077",
    "commentBody": "",
    "originSummary": [
      "„V roku 2023 v súťaži „The Crystal Ball Challenge“ dostalo 118 mladých dospelých s finančným vzdelaním 50 dolárov na obchodovanie s indexom S&P 500 a 30-ročnými americkými štátnymi dlhopismi, pričom mali k dispozícii správy deň vopred, ale bez údajov o cenách.“",
      "„Napriek tomu, že mali vopred informácie, polovica účastníkov prišla o peniaze a jeden zo šiestich skrachoval, pričom priemerný zisk bol len 3,2 % kvôli nesprávnym predpovediam trhu a zlej veľkosti obchodov.“",
      "„Experiment poukázal na to, že aj s predvídavosťou si úspešné obchodovanie vyžaduje zručnosť a stratégiu, ako to ukázali piati skúsení obchodníci, ktorí dosiahli lepšie výsledky.“"
    ],
    "commentSummary": [
      "„Článok skúma ťažkosti pri používaní finančných správ na predpovedanie pohybov na akciovom trhu, pričom zdôrazňuje zložitosť a nepredvídateľnosť reakcií trhu.“",
      "„Štúdia ukázala, že skúsení obchodníci dosahovali lepšie výsledky, pravdepodobne vďaka svojej pamäti na minulé udalosti, ale celkovo sa finančné správy považujú za väčšinou šum.“",
      "„Naznačuje, že dlhodobé trendy sú spoľahlivejšie pre investičné rozhodnutia ako krátkodobé správy, pričom poukazuje na pokles kvality spravodajských zdrojov a vplyv vysokofrekvenčného obchodovania.“"
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1734247357
  }
]
