[
  {
    "id": 42420352,
    "title": "स्कूल में स्मार्टफोन पर प्रतिबंध से बेहतर नींद और सुधरे हुए मूड के परिणाम: अध्ययन",
    "originLink": "https://www.york.ac.uk/news-and-events/news/2024/research/school-smartphone-ban-better-sleep/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42420352",
    "commentBody": "",
    "originSummary": [
      "यॉर्क विश्वविद्यालय के मनोवैज्ञानिकों द्वारा किए गए एक अध्ययन में पाया गया कि स्कूलों में स्मार्टफोन पर प्रतिबंध लगाने से बच्चों की नींद और मूड में सुधार हुआ।- कोलचेस्टर के द स्टैनवे स्कूल के आठवीं कक्षा के छात्रों ने 21-दिन के स्मार्टफोन प्रतिबंध में भाग लिया, जिसके परिणामस्वरूप तेजी से नींद आना और प्रति रात अतिरिक्त एक घंटे का आराम मिला।- अध्ययन में अवसाद में 17% की कमी और चिंता में 18% की कमी की सूचना दी गई, जो स्मार्टफोन प्रतिबंधों के संभावित लाभों को उजागर करता है क्योंकि सरकारें युवाओं पर उनके प्रभाव का मूल्यांकन करती हैं।"
    ],
    "commentSummary": [
      "एक अध्ययन से पता चला है कि स्कूलों में स्मार्टफोन पर प्रतिबंध लगाने से आठवीं कक्षा के छात्रों में बेहतर नींद और सुधरी हुई मनोदशा देखी गई, जिन्होंने 21 दिनों में एक अतिरिक्त घंटे की नींद प्राप्त की।- अध्ययन इस बहस को उजागर करता है कि समस्या नशे की लत वाले ऐप्स के साथ है या फोन के साथ ही, क्योंकि प्रतिबंध ने एक स्क्रीन-मुक्त ब्रेक प्रदान किया जिसे माता-पिता और शिक्षकों द्वारा लाभकारी माना गया।- चर्चा जारी है कि स्कूलों में फोन के उपयोग को प्रतिबंधित किया जाए या नशे की लत को कम करने के लिए ऐप डिज़ाइन को विनियमित करने पर ध्यान केंद्रित किया जाए।"
    ],
    "points": 889,
    "commentCount": 568,
    "retryCount": 0,
    "time": 1734220304
  },
  {
    "id": 42419469,
    "title": "वे आपकी तस्वीरें देखते हैं",
    "originLink": "https://theyseeyourphotos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42419469",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "वेसीयोरफोटोस.कॉम ऑनलाइन फोटो साझा करने से जुड़े गोपनीयता जोखिमों की जांच करता है और कमांड लाइन टूल्स का उपयोग करके मेटाडेटा हटाने के लिए मार्गदर्शन प्रदान करता है।- चर्चा में छवि संशोधनों का पता लगाने में एआई की क्षमताएं, वॉटरमार्क हटाने में चुनौतियां, और परसेप्चुअल हैशिंग की प्रभावशीलता शामिल है।- क्लाउड फोटो सेवाओं के संबंध में गोपनीयता चिंताओं और कंपनियों द्वारा व्यक्तिगत डेटा के उपयोग को समझने के महत्व को भी संबोधित किया गया है।"
    ],
    "points": 370,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1734210591
  },
  {
    "id": 42423409,
    "title": "एक दृश्य प्रमाण कि a^2 – b^2 = (a + b)(a – b)",
    "originLink": "https://www.futilitycloset.com/2024/12/15/tidy-2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42423409",
    "commentBody": "",
    "originSummary": [
      "एक दृश्य प्रमाण बीजीय पहचान \\(a^2 - b^2 = (a + b)(a - b)\\) को प्रदर्शित करता है, जो बीजगणित में एक मौलिक अवधारणा है।",
      "सोफी जर्मेन के बयान में बीजगणित और ज्यामिति के आपसी संबंध को उजागर किया गया है, यह सुझाव देते हुए कि बीजगणित को ज्यामितीय आरेखों के माध्यम से दृश्य रूप में प्रस्तुत किया जा सकता है।"
    ],
    "commentSummary": [
      "गणितीय पहचान \\(a^2 - b^2 = (a + b)(a - b)\\) के लिए एक दृश्य प्रमाण ने दृश्य प्रमाणों की विश्वसनीयता पर बहस शुरू कर दी।",
      "आलोचकों का तर्क है कि दृश्य प्रमाण भ्रामक हो सकते हैं, जैसा कि एक वीडियो द्वारा झूठा \"साबित\" किया गया है कि \\(\\pi\\) 4 के बराबर है, जो सावधानीपूर्वक धारणाओं की आवश्यकता पर जोर देता है।",
      "चर्चा इस बात पर जोर देती है कि जबकि दृश्य प्रमाण अंतर्ज्ञान को बढ़ा सकते हैं, वे अक्सर बीजगणितीय प्रमाणों की व्यापक कठोरता की कमी रखते हैं और विशेष रूप से ऋणात्मक संख्याओं के साथ सभी संभावित मामलों को संबोधित नहीं कर सकते।"
    ],
    "points": 282,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1734271297
  },
  {
    "id": 42418982,
    "title": "IRATA.ONLINE: रेट्रो-कंप्यूटिंग उत्साही लोगों के लिए एक समुदाय",
    "originLink": "https://irata.online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42418982",
    "commentBody": "",
    "originSummary": [
      "IRATA.ONLINE एक समुदाय मंच है जो रेट्रो-कंप्यूटिंग के शौकीनों के लिए है, जो एक PLATO-आधारित प्रणाली का उपयोग करता है जो अपने बहु-उपयोगकर्ता, ग्राफिकल, और इंटरैक्टिव क्षमताओं के लिए जाना जाता है।- यह अटारी, कमोडोर, और एप्पल जैसे क्लासिक कंप्यूटिंग प्लेटफार्मों की एक श्रृंखला का समर्थन करता है, जिससे उपयोगकर्ता वेब टर्मिनलों या PLATOTERM जैसे विशिष्ट सॉफ़्टवेयर के माध्यम से कनेक्ट कर सकते हैं।- यह मंच मल्टी-प्लेयर गेम्स, सामाजिक विशेषताएं, और TUTOR प्रोग्रामिंग भाषा का उपयोग करके एक विकास वातावरण प्रदान करता है, जो गेमिंग और विकास दोनों रुचियों को पूरा करता है।"
    ],
    "commentSummary": [
      "IRATA.ONLINE एक समुदाय है जो रेट्रो-कंप्यूटिंग पर केंद्रित है, जो संदेश, गेमिंग और अनुप्रयोगों के लिए PLATO प्रणाली का उपयोग करता है।- यह समुदाय PLATO नेटवर्क वाले शिक्षण वातावरण को पुनर्जीवित करता है, इसके इतिहास और संबंधित परियोजनाओं पर चर्चाओं के साथ।- विभिन्न क्लाइंट सॉफ़्टवेयर के माध्यम से पहुंच संभव है, जिसमें microM8 Apple IIe एमुलेटर शामिल है, और समाचार फेसबुक पर साझा किए जाते हैं और वैकल्पिक घोषणा प्लेटफार्मों के लिए सुझाव दिए जाते हैं।"
    ],
    "points": 204,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1734205370
  },
  {
    "id": 42421157,
    "title": "टेनस्टॉरेंट और एआई हार्डवेयर स्टार्टअप्स की स्थिति",
    "originLink": "https://irrationalanalysis.substack.com/p/tenstorrent-and-the-state-of-ai-hardware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42421157",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "टेनस्टॉरेंट और अन्य एआई हार्डवेयर स्टार्टअप्स आरआईएससी-वी सीपीयू आईपी की संभावनाओं का पता लगा रहे हैं क्योंकि एआरएम के लाइसेंसिंग लागत में वृद्धि हो रही है, जो सीपीयू आर्किटेक्चर परिदृश्य में एक बदलाव को उजागर करता है।",
      "क्वालकॉम और एआरएम के बीच आर्किटेक्चर लाइसेंस समझौतों (एएलए) को लेकर चल रहा कानूनी विवाद अब भी अनसुलझा है, जिसमें दोनों कंपनियां अनुबंध की शर्तों के अनुपालन का दावा कर रही हैं, जिससे बाजार में अनिश्चितता बढ़ रही है।",
      "Nvidia एआई हार्डवेयर बाजार में अपना प्रभुत्व बनाए हुए है, जिससे Tenstorrent जैसे प्रतिस्पर्धियों के लिए चुनौतियाँ उत्पन्न हो रही हैं, जबकि चर्चाएँ यह भी विचार करती हैं कि बड़े भाषा मॉडल (LLMs) का जूनियर इंजीनियरों के सीखने और समझने पर दोहरा प्रभाव कैसे पड़ता है।"
    ],
    "points": 198,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1734231598
  },
  {
    "id": 42422077,
    "title": "जब एक क्रिस्टल बॉल आपको अमीर बनाने के लिए पर्याप्त नहीं होती",
    "originLink": "https://elmwealth.com/crystal-ball/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42422077",
    "commentBody": "",
    "originSummary": [
      "2023 के \"द क्रिस्टल बॉल चैलेंज\" में, 118 वित्त प्रशिक्षित युवा वयस्कों को $50 दिए गए थे ताकि वे S&P 500 और 30-वर्षीय अमेरिकी ट्रेजरी बॉन्ड्स का व्यापार कर सकें, एक दिन पहले की खबरों का उपयोग करते हुए, लेकिन बिना मूल्य डेटा के।",
      "हालांकि अग्रिम समाचार होने के बावजूद, आधे प्रतिभागियों ने पैसे खो दिए, और हर छह में से एक दिवालिया हो गया, केवल 3.2% की औसत वृद्धि के साथ, गलत बाजार भविष्यवाणियों और खराब व्यापार आकार के कारण।",
      "प्रयोग ने यह उजागर किया कि पूर्वानुमान के बावजूद, सफल व्यापार के लिए कौशल और रणनीति की आवश्यकता होती है, जैसा कि पांच अनुभवी व्यापारियों द्वारा प्रदर्शित किया गया जिन्होंने बेहतर परिणाम प्राप्त किए।"
    ],
    "commentSummary": [
      "यह लेख वित्तीय समाचारों का उपयोग करके स्टॉक मार्केट की चालों की भविष्यवाणी करने की कठिनाई की जांच करता है, बाजार की प्रतिक्रियाओं की जटिलता और अप्रत्याशितता पर जोर देते हुए।",
      "एक अध्ययन से पता चला कि अनुभवी व्यापारियों ने बेहतर प्रदर्शन किया, संभवतः उनके पिछले घटनाओं की स्मृति के कारण, लेकिन कुल मिलाकर, वित्तीय समाचार को ज्यादातर शोर माना जाता है।",
      "यह सुझाव देता है कि निवेश निर्णयों के लिए दीर्घकालिक रुझान अल्पकालिक समाचारों की तुलना में अधिक विश्वसनीय होते हैं, यह देखते हुए कि समाचार स्रोतों की गुणवत्ता में गिरावट आई है और उच्च-आवृत्ति व्यापार का प्रभाव बढ़ा है।"
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1734247357
  }
]
