[
  {
    "id": 42568399,
    "title": "मेरे एक शोध पत्र को आज अस्वीकार कर दिया गया।",
    "originLink": "https://mathstodon.xyz/@tao/113721192051328193",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42568399",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "प्रसिद्ध गणितज्ञ टेरेंस ताओ के एक पेपर को अस्वीकृत कर दिया गया, जिससे यह स्पष्ट हुआ कि शीर्ष अकादमिक भी अस्वीकृति का सामना करते हैं, और इसने अकादमिक क्षेत्र में पेपर अस्वीकृति की व्यापकता पर एक व्यापक चर्चा को जन्म दिया। - इस चर्चा में सहकर्मी समीक्षा प्रक्रिया के भीतर मुद्दों को उजागर किया गया, जिसमें पूर्वाग्रह और बार-बार प्रकाशन के दबाव शामिल थे, और कई लोगों ने अस्वीकृति के व्यक्तिगत अनुभव साझा किए। - सुधार के लिए सुझावों में वैकल्पिक मूल्यांकन और प्रकाशन प्रणालियों की खोज शामिल थी, जैसे कि खुले इंटरनेट-केंद्रित समीक्षाएं, जबकि यह स्वीकार करते हुए कि अस्वीकृति अकादमिक यात्रा का एक मानक पहलू है।"
    ],
    "points": 779,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1735758777
  },
  {
    "id": 42572662,
    "title": "MitmProxy2Swagger: स्वचालित रूप से रिवर्स-इंजीनियर REST APIs",
    "originLink": "https://github.com/alufers/mitmproxy2swagger",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42572662",
    "commentBody": "",
    "originSummary": [
      "mitmproxy2swagger एक उपकरण है जो mitmproxy कैप्चर को OpenAPI 3.0 विनिर्देशों में परिवर्तित करता है, जिससे एप्लिकेशन ट्रैफिक को कैप्चर करके REST APIs की रिवर्स-इंजीनियरिंग की सुविधा मिलती है। - यह उपकरण अब ब्राउज़र डेवलपर टूल्स से HTTP आर्काइव (HAR) फाइलों का समर्थन करता है, जिससे डेवलपर्स के लिए इसकी उपयोगिता बढ़ जाती है। - इंस्टॉलेशन Python3 और pip या Docker का उपयोग करके किया जा सकता है, और परियोजना विकास के लिए poetry, pre-commit, और pytest जैसे उपकरणों का उपयोग करती है, और यह MIT लाइसेंस के तहत है।"
    ],
    "commentSummary": [
      "MitmProxy2Swagger एक उपकरण है जिसे mitmproxy के साथ कैप्चर किए गए ट्रैफिक का विश्लेषण करके REST APIs को रिवर्स-इंजीनियर करने के लिए डिज़ाइन किया गया है, जो HTTP/HTTPS ट्रैफिक को इंटरसेप्ट करने के लिए एक लोकप्रिय उपकरण है।",
      "उपयोगकर्ताओं ने इसे सफलतापूर्वक गेम्स के लिए निजी सर्वर पुनः बनाने और एंड्रॉइड एप्लिकेशनों के लिए एपीआई को रिवर्स-इंजीनियर करने के लिए उपयोग किया है, जो एपीआई एंडपॉइंट्स की पहचान में इसकी प्रभावशीलता को दर्शाता है।",
      "यह उपकरण विशेष रूप से विरासत प्रणालियों या बिना दस्तावेज़ीकरण वाले एपीआई के साथ काम करने के लिए लाभकारी है, हालांकि यह गैर-मानक एपीआई के साथ चुनौतियों का सामना कर सकता है और चर्चाओं में एपीआई को रिवर्स इंजीनियरिंग से बचाने के तरीकों को शामिल किया गया है, जैसे कि कैप्चा और प्रमाणपत्र पिनिंग।"
    ],
    "points": 459,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1735805295
  },
  {
    "id": 42570988,
    "title": "GPU, न कि TPM, हार्डवेयर DRM की जड़ है",
    "originLink": "https://mjg59.dreamwidth.org/70954.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42570988",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "हार्डवेयर डिजिटल राइट्स मैनेजमेंट (DRM) का मुख्य भाग ग्राफिक्स प्रोसेसिंग यूनिट्स (GPUs) से जुड़ा होता है, न कि ट्रस्टेड प्लेटफॉर्म मॉड्यूल्स (TPMs) से, और वर्तमान में मीडिया DRM GPU विक्रेताओं से संबंधित है।",
      "डीआरएम का दीर्घकालिक लक्ष्य उपकरणों पर पूर्ण नियंत्रण स्थापित करना हो सकता है, जो संभावित रूप से एडब्लॉकर जैसे सॉफ़्टवेयर को प्रभावित कर सकता है, जिससे व्यक्तिगत कंप्यूटिंग के भविष्य के बारे में चिंताएँ बढ़ रही हैं।",
      "फ्री सॉफ्टवेयर फाउंडेशन (FSF) शायद TPMs पर ध्यान केंद्रित करके गलत दिशा में जा रही है, क्योंकि GPU विक्रेताओं ने पहले ही DRM तकनीक को एकीकृत कर लिया है, जो उपयोगकर्ता अधिकारों की सुरक्षा के लिए विधायी हस्तक्षेप की आवश्यकता को उजागर करता है।"
    ],
    "points": 346,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1735783785
  },
  {
    "id": 42572057,
    "title": "ज़ैस्पर: जुपिटरलैब के लिए एक आधुनिक और कुशल विकल्प, जो गो में निर्मित है",
    "originLink": "https://github.com/zasper-io/zasper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42572057",
    "commentBody": "",
    "originSummary": [
      "ज़ैस्पर एक उच्च-प्रदर्शन इंटीग्रेटेड डेवलपमेंट एनवायरनमेंट (IDE) है जो जुपिटर से प्रेरित है, और विशाल समवर्तीता और न्यूनतम मेमोरी उपयोग के लिए अनुकूलित है। - इसे गो प्रोग्रामिंग भाषा के साथ बनाया गया है ताकि समवर्तीता और प्रदर्शन को बढ़ाया जा सके, और यह इलेक्ट्रॉन और वेब ऐप संस्करण दोनों में उपलब्ध है, और AGPL-3.0 लाइसेंस के तहत ओपन-सोर्स है। - ज़ैस्पर REPL-शैली (रीड-इवैल-प्रिंट लूप) डेटा अनुप्रयोगों का समर्थन करता है और जुपिटर नोटबुक्स से परे कस्टम डेटा अनुप्रयोगों का समर्थन करने का लक्ष्य रखता है, जिसमें मैक पर पूर्ण समर्थन और लिनक्स पर सीमित समर्थन है।"
    ],
    "commentSummary": [
      "ज़ैस्पर जुपिटरलैब का एक नया विकल्प है, जो गो प्रोग्रामिंग भाषा में विकसित किया गया है, और यह कम RAM और CPU उपयोग के साथ बेहतर दक्षता का वादा करता है।",
      "यह बेहतर कर्नेल प्रबंधन के लिए गो कोरूटीन का उपयोग करता है, जो जुपिटरलैब के पायथन-आधारित दृष्टिकोण के विपरीत है, और कर्नेल प्रबंधन और पैकेज स्थापना जैसी समस्याओं को हल करने का लक्ष्य रखता है।",
      "यह परियोजना अपने प्रारंभिक चरण में है, जुपिटर समुदाय के समर्थन के साथ, और यह प्रतिक्रिया और सहयोग के लिए खुली है, जो विविध फ्रंटेंड्स के लाभों और Emacs जैसे उपकरणों के साथ संभावित एकीकरण को उजागर करती है।"
    ],
    "points": 339,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1735797320
  },
  {
    "id": 42569236,
    "title": "हर चीज के लिए रेल्स",
    "originLink": "https://literallythevoid.com/blog/rails_for_everything.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569236",
    "commentBody": "",
    "originSummary": [
      "रेल्स 8 छोटे प्रोजेक्ट्स और एकल डेवलपर्स के लिए अनुकूलित है, जो पूर्ण विशेषताओं वाले अनुप्रयोगों के निर्माण के लिए एक व्यापक \"रेल्स के साथ शुरुआत करें\" गाइड प्रदान करता है।",
      "SQLite अब Rails 8 में उत्पादन के लिए तैयार है, जिससे PostgreSQL या Redis पर निर्भरता कम हो जाती है, और इसमें 2000 मुफ्त GitHub एक्शन मिनटों के साथ बुनियादी निरंतर एकीकरण (CI) कॉन्फ़िगरेशन शामिल है।",
      "नया प्रमाणीकरण जनरेटर और कमल के साथ सीधा परिनियोजन उपयोगकर्ता साइन-इन और एसएसएल के साथ लाइव ऐप सेटअप को आसान बनाता है, जिससे सर्वोत्तम प्रथाओं को बढ़ावा मिलता है।"
    ],
    "commentSummary": [
      "रेल्स वेब ऐप विकास के लिए एक लोकप्रिय फ्रेमवर्क है, जो अपनी सरलता और दक्षता के लिए जाना जाता है, विशेष रूप से अन्य आधुनिक स्टैक्स जैसे स्प्रिंग बूट या माइक्रोनॉट की तुलना में। - यह पूर्ण-स्टैक वेब ऐप्स को तेजी से बनाने के लिए पसंद किया जाता है, जिसमें एक्टिवस्टोरेज और सिस्टम परीक्षण जैसी एकीकृत विशेषताएं होती हैं, जो इसे एकल डेवलपर्स और छोटे टीमों के लिए आदर्श बनाती हैं। - इसकी प्रासंगिकता के बारे में चल रही बहसों के बावजूद, रेल्स हाल के अपडेट्स के साथ विकसित होता रहता है, अपनी क्षमताओं को बढ़ाता है और विकास समुदाय में अपनी अपील बनाए रखता है।"
    ],
    "points": 325,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1735765084
  },
  {
    "id": 42573875,
    "title": "40 के बाद कहाँ काम करें?",
    "originLink": "https://news.ycombinator.com/item?id=42573875",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42573875",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "40 के बाद करियर के रास्ते काफी भिन्न हो सकते हैं, जिनमें मिड-साइज बी2बी (बिजनेस-टू-बिजनेस) कंपनियों में शामिल होना, परामर्श देना, या पेशेवर सेवाएं शामिल हैं।",
      "व्यक्तिगत लक्ष्य, वित्तीय आवश्यकताएँ, और रुचियाँ निर्णय को मार्गदर्शित करनी चाहिए, जिसमें नेटवर्किंग और पिछले अनुभव नए अवसरों की खोज में महत्वपूर्ण भूमिका निभाते हैं।",
      "आदर्श करियर पथ व्यक्तिपरक होता है और यह व्यक्तिगत प्राथमिकताओं और परिस्थितियों के आधार पर भिन्न होता है।"
    ],
    "points": 230,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1735821184
  },
  {
    "id": 42569109,
    "title": "मेरी पसंदीदा कंप्यूटर एर्गोनॉमिक्स हैक",
    "originLink": "https://blog.jacobvosmaer.nl/0036-beeper/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569109",
    "commentBody": "",
    "originSummary": [
      "जैकब वॉस्मेयर \"द बीपर\" नामक एक DIY डिवाइस का परिचय देते हैं, जिसे कंप्यूटर स्क्रीन के बहुत लंबे समय तक अनलॉक रहने पर बीप करके आंदोलन को प्रोत्साहित करने के लिए डिज़ाइन किया गया है। - बीपर हार्डवेयर (Adafruit Feather Huzzah ESP8266, स्विच, पिज़ो बजर), फर्मवेयर (Lua स्क्रिप्ट), और सॉफ़्टवेयर से बना है जो सक्रियण को प्रबंधित करता है। - इसकी सरलता के बावजूद, यह डिवाइस नियमित आंदोलन को प्रभावी ढंग से प्रोत्साहित करता है, और जैकब इस परियोजना में अपनी पत्नी के समर्थन को स्वीकार करते हैं।"
    ],
    "commentSummary": [
      "उपयोगकर्ताओं ने कार्यस्थल पर अनिवार्य RSIGuard सॉफ़्टवेयर के प्रति निराशा व्यक्त की, जो निश्चित समय के साथ ब्रेक को लागू करता है और विघटनकारी पॉप-अप दिखाता है। - चर्चा में विभिन्न एर्गोनोमिक हैक्स शामिल थे, जैसे नियमित ब्रेक के लिए पानी पीना, तंग कपड़े पहनना, और एप्पल वॉच रिमाइंडर्स पर निर्भर रहना। - रिपीटेटिव स्ट्रेन इंजरी (RSI) को प्रबंधित करने और एर्गोनॉमिक्स में सुधार के लिए AntiRSI, Workrave, कस्टम समाधान, और Bangle.js2 जैसे स्मार्टवॉच जैसे विकल्प सुझाए गए।"
    ],
    "points": 216,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1735763993
  },
  {
    "id": 42576443,
    "title": "UBlockOrigin GPL कोड को Honey ब्राउज़र एक्सटेंशन के पीछे की टीम द्वारा चुराया जा रहा है",
    "originLink": "https://old.reddit.com/r/uBlockOrigin/comments/1hr6xjc/ubo_quick_filters_list_being_stolen_by_team/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42576443",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "हनी ब्राउज़र एक्सटेंशन टीम पर आरोप है कि उन्होंने यूब्लॉकओरिजिन से जीपीएल (जनरल पब्लिक लाइसेंस) कोड का उचित श्रेय दिए बिना उपयोग किया, जिससे विवाद उत्पन्न हो गया है।",
      "Reddit उपयोगकर्ता धोखाधड़ीपूर्ण व्यापारिक प्रथाओं के बारे में चिंताएं व्यक्त करते हैं, ग्राहकों और तकनीकी उद्योग पर इसके नकारात्मक प्रभाव को उजागर करते हुए।",
      "चर्चा व्यापक मुद्दों को उजागर करती है, जिसमें कॉर्पोरेट नैतिकता, राजनीति में धन का प्रभाव, और व्यापारिक ईमानदारी बनाए रखने की चुनौतियाँ शामिल हैं, साथ ही कंपनियों द्वारा संभावित शोषण के कारण ओपन-सोर्स परियोजनाओं के भविष्य के प्रति संदेह भी है।"
    ],
    "points": 213,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1735838848
  },
  {
    "id": 42571367,
    "title": "ब्लॉग सड़ते हैं। विकी इंतजार करते हैं।",
    "originLink": "https://j3s.sh/thought/blogs-rot-wikis-wait.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42571367",
    "commentBody": "",
    "originSummary": [
      "पोस्ट विकियों की स्थायी प्रकृति की तुलना ब्लॉगों की क्षणिक प्रकृति से करती है, यह सुझाव देते हुए कि 2025 तक विकी अधिक व्यक्तिगत और सार्थक हो जाएंगे।",
      "विकियों को लेखक के विकसित होते विचारों के रूप में गतिशील और प्रतिबिंबित करने वाला बताया गया है, जबकि ब्लॉगों की तुलना स्थिर, भूले हुए स्टोरफ्रंट से की जाती है।",
      "लेखक पारंपरिक वेबसाइट से विकी प्रारूप में स्थानांतरित हो रहे हैं, जो यह दर्शाता है कि व्यक्तिगत सामग्री को प्रबंधित और साझा करने के तरीके में बदलाव हो रहा है।"
    ],
    "commentSummary": [
      "ब्लॉग एक लेखक के विचारों की समय-विशिष्ट झलक प्रदान करते हैं, जिससे नए पोस्ट के माध्यम से अपडेट की अनुमति मिलती है, लेकिन अक्सर संदर्भ के लिए समय-चिह्न की कमी होती है। - विकी, जैसे कि विकिपीडिया, अपडेट के समय और विश्वसनीयता पर स्पष्टता के साथ संघर्ष कर सकते हैं, जिससे संभावित रूप से पुरानी जानकारी हो सकती है। - ब्लॉग और विकी दोनों के पास अद्वितीय लाभ हैं और वे सह-अस्तित्व में रह सकते हैं, सामग्री निर्माण और ज्ञान साझा करने में विभिन्न उद्देश्यों की सेवा कर सकते हैं।"
    ],
    "points": 176,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1735788777
  },
  {
    "id": 42571608,
    "title": "मेटा फेसबुक और इंस्टाग्राम पर अधिक एआई बॉट्स चाहती है",
    "originLink": "https://nymag.com/intelligencer/article/meta-wants-more-ai-bots-on-facebook-and-instagram.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42571608",
    "commentBody": "",
    "originSummary": [
      "मेटा फेसबुक और इंस्टाग्राम पर एआई बॉट्स लॉन्च करने के लिए तैयार है ताकि युवा उपयोगकर्ताओं को जोड़ा जा सके और जनरेटिव एआई तकनीक में अपने निवेश का लाभ उठाया जा सके। - ये एआई बॉट्स प्रोफाइल बनाएंगे और सामग्री तैयार करेंगे, जो सामान्य सोशल मीडिया खातों की तरह काम करेंगे, मेटा के सोशलएआई के अधिग्रहण के बाद। - यह पहल मेटा की व्यापक रणनीति को दर्शाती है जो सामाजिक इंटरैक्शन और सामग्री क्यूरेशन को स्वचालित करने की दिशा में है, जो कि कैरेक्टर.एआई जैसे ऐप्स में देखे गए रुझानों के साथ मेल खाती है।"
    ],
    "commentSummary": [
      "मेटा फेसबुक और इंस्टाग्राम पर अधिक एआई बॉट्स पेश कर रहा है ताकि उपयोगकर्ता सहभागिता को बढ़ावा दिया जा सके, जो कि एआई का उपयोग करके उपयोगकर्ता अनुभव को बढ़ाने की व्यापक उद्योग प्रवृत्ति को दर्शाता है।",
      "इन प्लेटफार्मों पर एआई-जनित सामग्री वास्तविक मानव संबंधों को प्रभावित कर सकती है, जिससे इंटरैक्शन की प्रामाणिकता को लेकर चिंताएँ हैं।",
      "आलोचकों को चिंता है कि एआई की बढ़ती उपस्थिति से सोशल मीडिया का अनुभव कम प्रामाणिक हो सकता है, जिससे उन उपयोगकर्ताओं को अलग-थलग किया जा सकता है जो वास्तविक बातचीत को महत्व देते हैं।"
    ],
    "points": 172,
    "commentCount": 308,
    "retryCount": 0,
    "time": 1735791600
  },
  {
    "id": 42569913,
    "title": "एआई और एमएल में मेरी 25 साल की यात्रा",
    "originLink": "https://austinhenley.com/blog/25yearsofai.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569913",
    "commentBody": "",
    "originSummary": [
      "ऑस्टिन जेड. हेनली, जो कार्नेगी मेलन विश्वविद्यालय में एसोसिएट टीचिंग प्रोफेसर हैं, अपने 25 साल के एआई (कृत्रिम बुद्धिमत्ता) और एमएल (मशीन लर्निंग) के सफर को साझा करते हैं, जिसमें वे अपनी प्रारंभिक अरुचि से लेकर विभिन्न परियोजनाओं के माध्यम से सक्रिय भागीदारी तक के परिवर्तन को उजागर करते हैं।",
      "उनके करियर पथ में सरल खेलों का विकास, एआई और न्यूरल नेटवर्क का अध्ययन, और उनके पीएचडी के दौरान कोड संपादक डेटा का विश्लेषण करने के लिए निर्णय वृक्ष और क्लस्टरिंग का उपयोग शामिल है।",
      "हेनले 2022 में माइक्रोसॉफ्ट के प्रोग्राम सिंथेसिस टीम में शामिल हुए, जहां उन्होंने एआई परियोजनाओं पर काम किया, जिसमें एलएलएम (लार्ज लैंग्वेज मॉडल) पर आधारित उपकरण शामिल हैं, और शिक्षण के दौरान स्वतंत्र रूप से एआई उपकरणों का अन्वेषण करना जारी रखा।"
    ],
    "commentSummary": [
      "एआई (कृत्रिम बुद्धिमत्ता) और एमएल (मशीन लर्निंग) क्षेत्रों में एक बढ़ती प्रवृत्ति है कि एआई का उपयोग किया जाए, भले ही सरल समाधान अधिक प्रभावी हो सकते हैं। - कुछ पेशेवर इस प्रवृत्ति के खिलाफ तर्क देते हैं, व्यावहारिक दृष्टिकोण की आवश्यकता पर जोर देते हुए और हर अनुप्रयोग में एआई की आवश्यकता पर सवाल उठाते हैं। - यह बहस इंजीनियरिंग टीमों के भीतर संचार के महत्व को रेखांकित करती है ताकि नवाचार और व्यावहारिकता के बीच संतुलन बना रहे, साथ ही पारंपरिक मानव भूमिकाओं और रचनात्मकता पर एआई के सामाजिक प्रभाव पर भी विचार किया जा सके।"
    ],
    "points": 172,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1735771276
  }
]
