[
  {
    "id": 42568399,
    "title": "என் கட்டுரைகளில் ஒன்று இன்று நிராகரிக்கப்பட்டது",
    "originLink": "https://mathstodon.xyz/@tao/113721192051328193",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42568399",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பிரபல கணிதவியலாளர் டெரன்ஸ் டாவோவின் ஒரு ஆய்வு கட்டுரை நிராகரிக்கப்பட்டது, இது முன்னணி கல்வியாளர்களும் நிராகரிப்பை சந்திக்கின்றனர் என்பதை விளக்குகிறது, கல்வியியல் துறையில் கட்டுரை நிராகரிப்பின் பரவல்பற்றிய ஒரு விரிவான விவாதத்தை தூண்டியது. - இந்த விவாதம் மதிப்பீட்டு செயல்முறையில் உள்ள சிக்கல்களை, உட்பட பாகுபாடுகள் மற்றும் அடிக்கடி வெளியிடும் அழுத்தத்தை, பலர் நிராகரிப்பின் தனிப்பட்ட அனுபவங்களை பகிர்ந்து கொண்டனர். - மேம்படுத்தலுக்கான பரிந்துரைகள், திறந்த இணைய மைய மதிப்பீடுகள் போன்ற மாற்று மதிப்பீட்டு மற்றும் வெளியீட்டு முறைகளை ஆராய்வதை உள்ளடக்கியது, அதேசமயம் நிராகரிப்பு கல்வியியல் பயணத்தின் ஒரு நிலையான அம்சம் என்பதை ஒப்புக்கொள்கிறது."
    ],
    "points": 779,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1735758777
  },
  {
    "id": 42572662,
    "title": "MitmProxy2Swagger: REST APIகளை தானாகவே ரிவர்ஸ்-என்ஜினியர் செய்யுங்கள்",
    "originLink": "https://github.com/alufers/mitmproxy2swagger",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42572662",
    "commentBody": "",
    "originSummary": [
      "mitmproxy2swagger என்பது mitmproxy பிடிப்புகளை OpenAPI 3.0 குறிப்புகளாக மாற்றும் ஒரு கருவி ஆகும், இது பயன்பாட்டு போக்குவரத்தைப் பிடிப்பதன் மூலம் REST APIகளை பின்புறம் பொறியியல் செய்ய உதவுகிறது. - இக்கருவி இப்போது உலாவி டெவலப்பர் டூல்களில் இருந்து HTTP Archive (HAR) கோப்புகளை ஆதரிக்கிறது, இது டெவலப்பர்களுக்கு அதன் பயன்பாட்டை விரிவாக்குகிறது. - நிறுவல் Python3 மற்றும் pip அல்லது Docker பயன்படுத்தி செய்யப்படலாம், மேலும் திட்டம் poetry, pre-commit, மற்றும் pytest போன்ற கருவிகளை மேம்பாட்டிற்காக பயன்படுத்துகிறது, மேலும் இது MIT உரிமத்துடன் வருகிறது."
    ],
    "commentSummary": [
      "MitmProxy2Swagger என்பது REST APIகளை ரிவர்ஸ்-என்ஜினியர் செய்ய உருவாக்கப்பட்ட ஒரு கருவி ஆகும், இது HTTP/HTTPS போக்குவரத்தை மிட்ம் ப்ராக்ஸி மூலம் பிடித்தல் மூலம் பகுப்பாய்வு செய்வதன் மூலம் செயல்படுகிறது, இது HTTP/HTTPS போக்குவரத்தை மறு வழிமாற்றுவதற்கான பிரபலமான கருவி ஆகும்.",
      "TEXT: பயனர்கள் இதைப் பயன்படுத்தி விளையாட்டுகளுக்கான தனியார் சர்வர்களை மீண்டும் உருவாக்கவும், Android பயன்பாடுகளுக்கான APIகளை ரிவர்ஸ்-எஞ்சினியர் செய்யவும் வெற்றிகரமாக பயன்படுத்தியுள்ளனர், API இறுதிநிலைகளை அடையாளம் காணும் திறனை இது வலியுறுத்துகிறது.",
      "இந்த கருவி பழைய அமைப்புகள் அல்லது ஆவணமற்ற APIகளுடன் வேலை செய்வதற்கு குறிப்பாக பயனுள்ளதாக உள்ளது, ஆனால் இது நிலையான அல்லாத APIகளுடன் சவால்களை எதிர்கொள்ளக்கூடும் மற்றும் APIகளை ரிவர்ஸ் என்ஜினியரிங் இருந்து பாதுகாக்கும் முறைகள், உதாரணமாக CAPTCHAs மற்றும் சான்றிதழ் பினிங் போன்றவை பற்றிய விவாதங்களை உள்ளடக்கியது."
    ],
    "points": 459,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1735805295
  },
  {
    "id": 42570988,
    "title": "GPU, TPM அல்ல, ஹார்ட்வேர் DRM இன் மூல காரணம் ஆகும்",
    "originLink": "https://mjg59.dreamwidth.org/70954.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42570988",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். உருவாக்கம்: ஹார்ட்வேர் டிஜிட்டல் உரிமைகள் மேலாண்மையின் (DRM) மையம் நம்பகமான தள மாட்யூல்கள் (TPMs) அல்ல, மாறாக கிராபிக்ஸ் செயலாக்க அலகுகள் (GPUs) உடன் தொடர்புடையது, மேலும் ஊடக DRM தற்போது GPU விற்பனையாளர்களுடன் இணைக்கப்பட்டுள்ளது.",
      "DRM இன் நீண்டகால இலக்கு சாதனங்கள் மீது முழுமையான கட்டுப்பாட்டை செலுத்துவதாக இருக்கலாம், இது விளம்பரத் தடுப்பிகள் போன்ற மென்பொருள்களை பாதிக்கக்கூடும், தனிப்பட்ட கணினி பயன்பாட்டின் எதிர்காலத்தைப் பற்றிய கவலைகளை எழுப்புகிறது.",
      "தமிழில் எழுத வேண்டும். மூலமேற்கோள்: இலவச மென்பொருள் அறக்கட்டளை (FSF) TPMகளில் கவனம் செலுத்துவதில் தவறாக வழிநடத்தப்படலாம், ஏனெனில் GPU விற்பனையாளர்கள் ஏற்கனவே DRM தொழில்நுட்பத்தை ஒருங்கிணைத்துள்ளனர், பயனர் உரிமைகளை பாதுகாக்க சட்டமன்ற தலையீடு தேவை என்பதை வெளிப்படுத்துகிறது. மூலமேற்கோள்."
    ],
    "points": 346,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1735783785
  },
  {
    "id": 42572057,
    "title": "சாஸ்பர்: ஜூபைட்டர் லேப் க்கு ஒரு நவீன மற்றும் திறமையான மாற்று, கோ மொழியில் உருவாக்கப்பட்டது",
    "originLink": "https://github.com/zasper-io/zasper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42572057",
    "commentBody": "",
    "originSummary": [
      "Zasper என்பது Jupyter மூலம் ஈர்க்கப்பட்ட, அதிக செயல்திறன் கொண்ட ஒருங்கிணைந்த மேம்பாட்டு சூழல் (IDE) ஆகும், இது பெரும் ஒருங்கிணைப்பு மற்றும் குறைந்த நினைவக பயன்பாட்டிற்காக மேம்படுத்தப்பட்டுள்ளது. - இது அதிக ஒருங்கிணைப்பு மற்றும் செயல்திறனை வழங்குவதற்காக Go நிரலாக்க மொழியுடன் கட்டப்பட்டுள்ளது, இரு Electron மற்றும் வலை பயன்பாட்டு பதிப்புகளையும் வழங்குகிறது, மேலும் AGPL-3.0 உரிமத்தின் கீழ் திறந்த மூலமாக உள்ளது. - Zasper, REPL-பாணி (வாசி-மதிப்பீடு-அச்சிடு மடக்கு) தரவுத் பயன்பாடுகளை ஆதரிக்கிறது மற்றும் Jupyter நோட்புக்குகளைத் தாண்டி விரிவடைய, தனிப்பயன் தரவுத் பயன்பாடுகளை ஆதரிக்க முயல்கிறது, Mac இல் முழு ஆதரவும், Linux இல் வரையறுக்கப்பட்ட ஆதரவும் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "Zasper என்பது JupyterLab க்கு புதிய மாற்றாக, Go நிரல்மொழியில் உருவாக்கப்பட்டதாகும், இது குறைந்த RAM மற்றும் CPU பயன்பாட்டுடன் மேம்பட்ட செயல்திறனை வாக்களிக்கிறது.",
      "இது மேம்பட்ட கர்னல் மேலாண்மைக்காக Go கோரூட்டின்களை பயன்படுத்துகிறது, இது JupyterLab இன் பைதான் அடிப்படையிலான அணுகுமுறையுடன் மாறுபடுகிறது, மேலும் கர்னல் மேலாண்மை மற்றும் தொகுப்பு நிறுவல் போன்ற சிக்கல்களை சமாளிக்க நோக்கமாகக் கொண்டுள்ளது.",
      "தமிழில் எழுத வேண்டும். திட்டம் அதன் ஆரம்ப நிலைகளில் உள்ளது, Jupyter சமூகத்தின் ஆதரவுடன், கருத்துக்களையும் ஒத்துழைப்பையும் வரவேற்கிறது, பல்வேறு முன்புறங்களின் நன்மைகள் மற்றும் Emacs போன்ற கருவிகளுடன் ஒருங்கிணைப்பின் சாத்தியங்களை வெளிப்படுத்துகிறது."
    ],
    "points": 339,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1735797320
  },
  {
    "id": 42569236,
    "title": "எல்லாவற்றிற்கும் ரெயில்கள்",
    "originLink": "https://literallythevoid.com/blog/rails_for_everything.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569236",
    "commentBody": "",
    "originSummary": [
      "ரெயில்ஸ் 8 சிறிய திட்டங்கள் மற்றும் தனி டெவலப்பர்களுக்காக மேம்படுத்தப்பட்டுள்ளது, முழுமையான செயல்பாடுகளுடன் கூடிய பயன்பாடுகளை உருவாக்க 'ரெயில்ஸ் உடன் தொடங்குவது' என்ற விரிவான வழிகாட்டியை வழங்குகிறது.",
      "SQLite இப்போது Rails 8 இல் உற்பத்தி தயாராக உள்ளது, PostgreSQL அல்லது Redis மீது சார்பை குறைத்து, 2000 இலவச GitHub செயல்பாட்டு நிமிடங்களுடன் அடிப்படை தொடர்ச்சியான ஒருங்கிணைப்பு (CI) கட்டமைப்பை உள்ளடக்கியுள்ளது.",
      "புதிய அங்கீகார ஜெனரேட்டரும், கமலுடன் எளிமையான பிரயோகமும், பயனர் உள்நுழைவு மற்றும் SSL உடன் நேரடி பயன்பாட்டு அமைப்பை எளிதாக்குகின்றன, சிறந்த நடைமுறைகளை ஊக்குவிக்கின்றன."
    ],
    "commentSummary": [
      "ரெயில்ஸ் என்பது வலை பயன்பாட்டு மேம்பாட்டிற்கான பிரபலமான கட்டமைப்பு ஆகும், இது Spring Boot அல்லது Micronaut போன்ற பிற நவீன ஸ்டாக்குகளுடன் ஒப்பிடும்போது அதன் எளிமை மற்றும் திறமைக்காக அறியப்படுகிறது. - இது முழுமையான ஸ்டாக் வலை பயன்பாடுகளை விரைவாக உருவாக்குவதற்காக விரும்பப்படுகிறது, ActiveStorage மற்றும் சிஸ்டம் சோதனைகள் போன்ற ஒருங்கிணைந்த அம்சங்களுடன், தனிப்பட்ட டெவலப்பர்கள் மற்றும் சிறிய குழுக்களுக்கு இது சிறந்ததாக இருக்கிறது. - அதன் தொடர்புடையதன்மை குறித்து தொடர்ந்து விவாதங்கள் இருந்தாலும், ரெயில்ஸ் சமீபத்திய புதுப்பிப்புகளுடன் தொடர்ந்து மேம்படுகிறது, அதன் திறன்களை மேம்படுத்தி, மேம்பாட்டு சமூகத்தில் அதன் கவர்ச்சியை பராமரிக்கிறது."
    ],
    "points": 325,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1735765084
  },
  {
    "id": 42573875,
    "title": "40 வயதுக்கு பிறகு எங்கு வேலை செய்யலாம்?",
    "originLink": "https://news.ycombinator.com/item?id=42573875",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42573875",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "40 வயதுக்கு பிறகு தொழில் பாதைகள் குறிப்பிடத்தக்க வகையில் மாறுபடக்கூடும், அதில் நடுத்தர அளவிலான B2B (வணிகத்திற்கான வணிகம்) நிறுவனங்களில் சேருதல், ஆலோசனை அல்லது தொழில்முறை சேவைகள் போன்ற விருப்பங்கள் அடங்கும்.",
      "தனிப்பட்ட இலக்குகள், நிதி தேவைகள் மற்றும் விருப்பங்கள் முடிவை வழிநடத்த வேண்டும், அதேசமயம் நெட்வொர்க்கிங் மற்றும் முந்தைய அனுபவங்கள் புதிய வாய்ப்புகளை கண்டுபிடிக்க முக்கிய பங்கு வகிக்கின்றன.",
      "சிறந்த தொழில் பாதை என்பது தனிப்பட்ட விருப்பங்கள் மற்றும் சூழ்நிலைகளின் அடிப்படையில் மாறுபடும்."
    ],
    "points": 230,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1735821184
  },
  {
    "id": 42569109,
    "title": "எனது விருப்பமான கணினி எர்கோனாமிக்ஸ் ஹேக்",
    "originLink": "https://blog.jacobvosmaer.nl/0036-beeper/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569109",
    "commentBody": "",
    "originSummary": [
      "ஜேக்கப் வோஸ்மயர் \"தி பீப்பர்\" என்ற DIY சாதனத்தை அறிமுகப்படுத்துகிறார், இது கணினி திரை நீண்ட நேரம் திறந்த நிலையில் இருந்தால் பீப் செய்து இயக்கத்தை ஊக்குவிக்க வடிவமைக்கப்பட்டுள்ளது. - தி பீப்பர் ஹார்ட்வேர் (அடாஃப்ரூட் ஃபெதர் ஹுச்சா ESP8266, சுவிட்ச், பைசோ பஸ்ஸர்), ஃபார்ம்வேர் (Lua ஸ்கிரிப்ட்), மற்றும் செயல்பாட்டை நிர்வகிக்கும் மென்பொருளால் உருவாக்கப்பட்டுள்ளது. - அதன் எளிமைக்குப் பிறகும், இந்த சாதனம் வழக்கமான இயக்கத்தை பயனுள்ளதாக ஊக்குவிக்கிறது, மேலும் ஜேக்கப் தனது மனைவியின் ஆதரவுக்கு நன்றி தெரிவிக்கிறார்."
    ],
    "commentSummary": [
      "பயனர்கள் வேலை இடத்தில் கட்டாயமாக உள்ள RSIGuard மென்பொருளால் ஏற்பட்ட சிரமத்தை வெளிப்படுத்தினர், இது நிர்ணயிக்கப்பட்ட நேரத்துடன் இடைவெளிகளை கட்டாயமாக்குகிறது மற்றும் இடையூறு விளைவிக்கும் பாப்-அப் செய்திகளை காட்டுகிறது. - விவாதத்தில், தண்ணீர் குடிப்பது போன்ற பல்வேறு எர்கோனாமிக் தந்திரங்கள், இறுக்கமான ஆடைகளை அணிதல், மற்றும் ஆப்பிள் வாட்ச் நினைவூட்டல்களை நம்புதல் ஆகியவை அடங்கும். - AntiRSI, Workrave, தனிப்பயன் தீர்வுகள், மற்றும் Bangle.js2 போன்ற ஸ்மார்ட்வாட்ச்கள் போன்ற மாற்று வழிகள் மீண்டும் மீண்டும் ஏற்படும் காயம் (RSI) மற்றும் எர்கோனாமிக்ஸை மேம்படுத்த பரிந்துரைக்கப்பட்டன."
    ],
    "points": 216,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1735763993
  },
  {
    "id": 42576443,
    "title": "UBlockOrigin GPL குறியீடு Honey உலாவி நீட்சியின் பின்னணி குழுவால் திருடப்படுகிறது",
    "originLink": "https://old.reddit.com/r/uBlockOrigin/comments/1hr6xjc/ubo_quick_filters_list_being_stolen_by_team/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42576443",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஹனி உலாவி நீட்டிப்பு குழு GPL (பொது பொதுமறைவு உரிமம்) குறியீட்டு மொழியை UBlockOrigin இலிருந்து சரியான அடையாளம் அளிக்காமல் பயன்படுத்தியதாக குற்றம் சாட்டப்பட்டுள்ளது, இது சர்ச்சையை ஏற்படுத்தியுள்ளது.",
      "Reddit பயனர்கள் வாடிக்கையாளர்கள் மற்றும் தொழில்நுட்ப துறையில் ஏற்படும் எதிர்மறை விளைவுகளை வலியுறுத்தி மோசமான வணிக நடைமுறைகள் குறித்து கவலை வெளியிடுகின்றனர்.",
      "தமிழில் எழுத வேண்டும். இந்த விவாதம், நிறுவன நெறிமுறைகள், அரசியலில் பணத்தின் தாக்கம், வணிக நேர்மையை பராமரிக்கும் சவால்கள் போன்ற பரந்த பிரச்சினைகளை வெளிப்படுத்துகிறது, நிறுவனங்களால் சாத்தியமான சுரண்டலால் திறந்த மூல திட்டங்களின் எதிர்காலம் குறித்த சந்தேகத்துடன்."
    ],
    "points": 213,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1735838848
  },
  {
    "id": 42571367,
    "title": "வலைப்பதிவுகள் அழுகுகின்றன. விக்கிகள் காத்திருக்கின்றன",
    "originLink": "https://j3s.sh/thought/blogs-rot-wikis-wait.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42571367",
    "commentBody": "",
    "originSummary": [
      "TEXT: இந்த பதிவு விக்கிகளின் நிலைத்தன்மையை வலைப்பதிவுகளின் தற்காலிக தன்மையுடன் ஒப்பிட்டு, 2025 ஆம் ஆண்டிற்குள் விக்கிகள் மேலும் தனிப்பட்ட மற்றும் அர்த்தமுள்ளவையாக மாறும் என்று பரிந்துரைக்கிறது. TEXT:",
      "விக்கிகள் எழுத்தாளரின் வளர்ந்து வரும் எண்ணங்களை பிரதிபலிக்கும் மற்றும் மாறுபடும் தன்மையுடையவை என விவரிக்கப்படுகின்றன, அதே சமயம் வலைப்பதிவுகள் நிலையான, மறக்கப்பட்ட கடை முனைகளுடன் ஒப்பிடப்படுகின்றன.",
      "ஆசிரியர் பாரம்பரிய இணையதளத்திலிருந்து விக்கி வடிவமைப்புக்கு மாறுகிறார், இது தனிப்பட்ட உள்ளடக்கம் எவ்வாறு நிர்வகிக்கப்படுகிறது மற்றும் பகிரப்படுகிறது என்பதில் ஒரு மாற்றத்தை குறிக்கிறது."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். வலைப்பதிவுகள் ஒரு எழுத்தாளரின் எண்ணங்களை காலக்கட்டத்திற்கு ஏற்ப காட்டுகின்றன, புதிய பதிவுகள் மூலம் புதுப்பிக்க அனுமதிக்கின்றன, ஆனால் பெரும்பாலும் சூழலுக்கான நேரக்குறிப்புகளை இழக்கின்றன. - விக்கிகள், உதாரணமாக விக்கிப்பீடியா, புதுப்பிப்பு நேரம் மற்றும் நம்பகத்தன்மை பற்றிய தெளிவின்மையால் போராடலாம், இது பழைய தகவல்களை ஏற்படுத்த முடியும். - வலைப்பதிவுகள் மற்றும் விக்கிகள் இரண்டுக்கும் தனித்தன்மையான நன்மைகள் உள்ளன மற்றும் உள்ளடக்க உருவாக்கம் மற்றும் அறிவு பகிர்வில் வெவ்வேறு நோக்கங்களுக்காக இணைந்து இயங்க முடியும்."
    ],
    "points": 176,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1735788777
  },
  {
    "id": 42571608,
    "title": "மெட்டா ஃபேஸ்புக் மற்றும் இன்ஸ்டாகிராமில் மேலும் ஏஐ பாட்டுகளை விரும்புகிறது",
    "originLink": "https://nymag.com/intelligencer/article/meta-wants-more-ai-bots-on-facebook-and-instagram.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42571608",
    "commentBody": "",
    "originSummary": [
      "மெட்டா, தனது ஜெனரேட்டிவ் AI தொழில்நுட்பத்தில் முதலீட்டை பயன்படுத்தி இளம் பயனர்களை ஈர்க்க, ஃபேஸ்புக் மற்றும் இன்ஸ்டாகிராமில் AI பாட்டுகளை அறிமுகப்படுத்த உள்ளது. - இந்த AI பாட்டுகள், மெட்டா SocialAI ஐக் கையகப்படுத்தியதைத் தொடர்ந்து, சாதாரண சமூக ஊடக கணக்குகளைப் போலவே செயல்பட்டு, ப்ரொஃபைல்களையும் உள்ளடக்கத்தையும் உருவாக்கும். - இந்த முயற்சி, சமூக தொடர்புகள் மற்றும் உள்ளடக்கத் தேர்வுகளை தானியங்கி செய்யும் மெட்டாவின் பரந்த உத்தியை பிரதிபலிக்கிறது, Character.ai போன்ற பயன்பாடுகளில் காணப்படும் போக்குகளுடன் ஒத்துப்போகிறது."
    ],
    "commentSummary": [
      "மெட்டா, பயனர் ஈடுபாட்டை அதிகரிக்க, தொடர்புகளை ஒத்திகை செய்வதன் மூலம், ஃபேஸ்புக் மற்றும் இன்ஸ்டாகிராமில் மேலும் ஏ.ஐ. பாட்டுகளை அறிமுகப்படுத்துகிறது, இது பயனர் அனுபவத்தை மேம்படுத்த ஏ.ஐ.யை பயன்படுத்தும் பரந்த தொழில்துறை போக்கை பிரதிபலிக்கிறது.",
      "AI உருவாக்கிய உள்ளடக்கம் இந்த தளங்களில் உண்மையான மனித தொடர்புகளை மிஞ்சக்கூடும் என்பதால் தொடர்புகளின் உண்மைத்தன்மை குறித்து கவலைகள் உள்ளன.",
      "விமர்சகர்கள் அதிகரித்த AI இருப்பு ஒரு குறைவான உண்மையான சமூக ஊடக அனுபவத்தை ஏற்படுத்தக்கூடும் என்று கவலைப்படுகின்றனர், இது உண்மையான தொடர்புகளை மதிக்கும் பயனர்களை விலக்கக்கூடும்."
    ],
    "points": 172,
    "commentCount": 308,
    "retryCount": 0,
    "time": 1735791600
  },
  {
    "id": 42569913,
    "title": "என் 25 ஆண்டுகால சாகசம் AI மற்றும் ML இல்",
    "originLink": "https://austinhenley.com/blog/25yearsofai.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569913",
    "commentBody": "",
    "originSummary": [
      "ஆஸ்டின் Z. ஹென்லி, கார்னெகி மெலன் பல்கலைக்கழகத்தில் இணை ஆசிரியர் பேராசிரியராக உள்ளார், AI (கிரகிய நுண்ணறிவு) மற்றும் ML (இயந்திர கற்றல்) துறையில் தனது 25 ஆண்டுகால பயணத்தை பகிர்ந்து கொள்கிறார், ஆரம்ப காலத்தில் இருந்த அக்கறையின்மையிலிருந்து பல்வேறு திட்டங்கள் மூலம் செயல்பாடுகளில் ஈடுபடுவதற்கான அவரது மாற்றத்தை சிறப்பிக்கிறார்.",
      "அவரின் தொழில்முறை பாதையில் எளிய விளையாட்டுகளை உருவாக்குதல், செயற்கை நுண்ணறிவு மற்றும் நரம்பியல் வலையமைப்புகளை ஆய்வு செய்தல், மற்றும் அவரது முனைவர் பட்ட ஆய்வின் போது முடிவெடுக்கும் மரங்கள் மற்றும் குழுக்களாக்கத்தை பயன்படுத்தி குறியீட்டு தொகுப்பி தரவுகளை பகுப்பாய்வு செய்தல் ஆகியவை அடங்கும்.",
      "ஹென்லி 2022 ஆம் ஆண்டில் மைக்ரோசாஃப்ட் நிறுவனத்தின் திட்ட உற்பத்தி குழுவில் சேர்ந்தார், எல்.எல்.எம்.க்கள் (பெரிய மொழி மாதிரிகள்) அடிப்படையிலான கருவிகள் உள்ளிட்ட ஏ.ஐ. திட்டங்களில் பணியாற்றி வருகிறார், மேலும் கற்பித்தல் செய்யும் போது தனிப்பட்ட முறையில் ஏ.ஐ. கருவிகளை ஆராய்ந்து வருகிறார்."
    ],
    "commentSummary": [
      "AI (கிரகிய நுண்ணறிவு) மற்றும் ML (இயந்திர கற்றல்) துறைகளில் எளிய தீர்வுகள் அதிக பயனுள்ளதாக இருக்கக்கூடிய போதிலும், AI ஐப் பயன்படுத்தும் போக்கு அதிகரித்து வருகிறது. - சில நிபுணர்கள் இந்தப் போக்குக்கு எதிராக வாதிடுகின்றனர், நடைமுறை அணுகுமுறைகளின் தேவையை வலியுறுத்தி, ஒவ்வொரு பயன்பாட்டிலும் AI இன் அவசியத்தை கேள்வி எழுப்புகின்றனர். - இந்த விவாதம், புதுமையை நடைமுறையுடன் சமநிலைப்படுத்துவதற்கான பொறியியல் குழுக்களுக்குள் தொடர்பின் முக்கியத்துவத்தை வலியுறுத்துகிறது, அதே சமயம் பாரம்பரிய மனித பங்குகள் மற்றும் படைப்பாற்றலின் மீது AI இன் சமூக தாக்கத்தை கருத்தில் கொள்ளவும்."
    ],
    "points": 172,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1735771276
  }
]
