[
  {
    "id": 42568399,
    "title": "تم رفض إحدى أوراقي اليوم",
    "originLink": "https://mathstodon.xyz/@tao/113721192051328193",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42568399",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم رفض ورقة بحثية للرياضي الشهير تيرينس تاو، مما يوضح أن حتى الأكاديميين البارزين يواجهون الرفض، مما أثار نقاشًا أوسع حول انتشار رفض الأوراق في الأوساط الأكاديمية. - سلط النقاش الضوء على القضايا داخل عملية مراجعة الأقران، بما في ذلك التحيزات والضغط للنشر بشكل متكرر، حيث شارك الكثيرون تجاربهم الشخصية مع الرفض. - تضمنت الاقتراحات للتحسين استكشاف أنظمة تقييم ونشر بديلة، مثل المراجعات المفتوحة عبر الإنترنت، مع الاعتراف بأن الرفض هو جزء قياسي من الرحلة الأكاديمية."
    ],
    "points": 779,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1735758777
  },
  {
    "id": 42572662,
    "title": "MitmProxy2Swagger: عكس هندسة واجهات برمجة التطبيقات REST تلقائيًا",
    "originLink": "https://github.com/alufers/mitmproxy2swagger",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42572662",
    "commentBody": "",
    "originSummary": [
      "mitmproxy2swagger هو أداة تقوم بتحويل تسجيلات mitmproxy إلى مواصفات OpenAPI 3.0، مما يسهل عملية الهندسة العكسية لواجهات برمجة التطبيقات REST من خلال التقاط حركة مرور التطبيقات. - تدعم الأداة الآن ملفات أرشيف HTTP (HAR) من أدوات المطور في المتصفح، مما يوسع من قابليتها للاستخدام للمطورين. - يمكن تثبيت الأداة باستخدام Python3 و pip أو Docker، ويستخدم المشروع أدوات مثل poetry و pre-commit و pytest للتطوير، وهو مرخص برخصة MIT."
    ],
    "commentSummary": [
      "MitmProxy2Swagger هو أداة مصممة لعكس هندسة واجهات برمجة التطبيقات REST من خلال تحليل حركة المرور التي تم التقاطها باستخدام mitmproxy، وهي أداة شهيرة لاعتراض حركة مرور HTTP/HTTPS.",
      "لقد نجح المستخدمون في استخدامه لإعادة إنشاء خوادم خاصة للألعاب وهندسة عكسية لواجهات برمجة التطبيقات لتطبيقات أندرويد، مما يبرز فعاليته في تحديد نقاط نهاية واجهات برمجة التطبيقات.",
      "تعتبر الأداة مفيدة بشكل خاص عند العمل مع الأنظمة القديمة أو واجهات برمجة التطبيقات غير الموثقة، على الرغم من أنها قد تواجه تحديات مع واجهات برمجة التطبيقات غير القياسية وتشمل المناقشات طرقًا لحماية واجهات برمجة التطبيقات من الهندسة العكسية، مثل استخدام CAPTCHAs وتثبيت الشهادات."
    ],
    "points": 459,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1735805295
  },
  {
    "id": 42570988,
    "title": "وحدة معالجة الرسوميات (GPU)، وليست وحدة النظام الأساسي الموثوق (TPM)، هي الجذر في إدارة الحقوق الرقمية للأجهزة (DRM).",
    "originLink": "https://mjg59.dreamwidth.org/70954.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42570988",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يرتبط جوهر إدارة الحقوق الرقمية للأجهزة (DRM) بوحدات معالجة الرسوميات (GPUs) بدلاً من الوحدات الموثوقة (TPMs)، حيث ترتبط إدارة الحقوق الرقمية للوسائط حاليًا بموردي وحدات معالجة الرسوميات.",
      "قد يكون الهدف طويل الأمد لإدارة الحقوق الرقمية (DRM) هو فرض السيطرة الكاملة على الأجهزة، مما قد يؤثر على البرمجيات مثل حاصرات الإعلانات، مما يثير القلق بشأن مستقبل الحوسبة الشخصية.",
      "قد تكون مؤسسة البرمجيات الحرة (FSF) مضللة في تركيزها على وحدات المنصة الموثوقة (TPMs)، حيث أن بائعي وحدات معالجة الرسوميات (GPU) قد دمجوا بالفعل تقنية إدارة الحقوق الرقمية (DRM)، مما يبرز الحاجة إلى تدخل تشريعي لحماية حقوق المستخدمين."
    ],
    "points": 346,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1735783785
  },
  {
    "id": 42572057,
    "title": "زاسبر: بديل حديث وفعال لـ JupyterLab، مبني بلغة Go",
    "originLink": "https://github.com/zasper-io/zasper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42572057",
    "commentBody": "",
    "originSummary": [
      "Zasper هو بيئة تطوير متكاملة عالية الأداء مستوحاة من Jupyter، ومُحسّنة للتشغيل المتزامن الضخم واستخدام الذاكرة الأدنى. - تم بناؤها باستخدام لغة البرمجة Go لتعزيز التشغيل المتزامن والأداء، وتقدم نسخًا لكل من تطبيقات Electron وتطبيقات الويب، وهي مفتوحة المصدر تحت رخصة AGPL-3.0. - تدعم Zasper تطبيقات البيانات بأسلوب REPL (حلقة القراءة والتقييم والطباعة) وتهدف إلى التوسع إلى ما بعد دفاتر Jupyter لدعم تطبيقات البيانات المخصصة، مع دعم كامل على نظام Mac ودعم محدود على نظام Linux."
    ],
    "commentSummary": [
      "زاسبر هو بديل جديد لـ JupyterLab، تم تطويره بلغة البرمجة Go، ويعد بكفاءة محسنة مع تقليل استخدام الذاكرة العشوائية ووحدة المعالجة المركزية.",
      "يستخدم الروتينات المتزامنة في لغة Go لتحسين إدارة النواة، مما يختلف عن نهج JupyterLab القائم على بايثون، ويهدف إلى معالجة قضايا مثل إدارة النواة وتثبيت الحزم.",
      "المشروع في مراحله الأولى، بدعم من مجتمع Jupyter، وهو مفتوح للتغذية الراجعة والتعاون، مما يبرز فوائد الواجهات الأمامية المتنوعة والإمكانية للتكامل مع أدوات مثل Emacs."
    ],
    "points": 339,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1735797320
  },
  {
    "id": 42569236,
    "title": "سكك حديدية لكل شيء",
    "originLink": "https://literallythevoid.com/blog/rails_for_everything.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569236",
    "commentBody": "",
    "originSummary": [
      "تم تحسين Rails 8 للمشاريع الصغيرة والمطورين الفرديين، حيث يقدم دليلًا شاملاً بعنوان \"البدء مع Rails\" لبناء تطبيقات متكاملة الميزات.",
      "أصبح SQLite جاهزًا للإنتاج الآن في Rails 8، مما يقلل الاعتماد على PostgreSQL أو Redis، ويتضمن تكوينًا أساسيًا للتكامل المستمر (CI) مع 2000 دقيقة مجانية من إجراءات GitHub.",
      "يُسهّل المولد الجديد للمصادقة والنشر المباشر مع كامال عملية تسجيل دخول المستخدم وإعداد التطبيق المباشر باستخدام SSL، مما يعزز أفضل الممارسات."
    ],
    "commentSummary": [
      "يُعتبر Rails إطار عمل شائع لتطوير تطبيقات الويب، ويُعرف ببساطته وكفاءته مقارنةً بأطر العمل الحديثة الأخرى مثل Spring Boot أو Micronaut. - يُفضّل لبناء تطبيقات ويب كاملة بسرعة، مع ميزات مدمجة مثل ActiveStorage والاختبارات النظامية، مما يجعله مثاليًا للمطورين الفرديين والفرق الصغيرة. - وعلى الرغم من النقاشات المستمرة حول أهميته، يواصل Rails التطور مع التحديثات الأخيرة، مما يعزز من قدراته ويحافظ على جاذبيته في مجتمع التطوير."
    ],
    "points": 325,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1735765084
  },
  {
    "id": 42573875,
    "title": "أين تعمل بعد سن الأربعين؟",
    "originLink": "https://news.ycombinator.com/item?id=42573875",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42573875",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يمكن أن تختلف المسارات المهنية بعد سن الأربعين بشكل كبير، مع خيارات تشمل الانضمام إلى شركات B2B (من شركة إلى شركة) متوسطة الحجم، أو العمل في الاستشارات أو الخدمات المهنية.",
      "يجب أن توجه الأهداف الشخصية والاحتياجات المالية والاهتمامات القرار، مع لعب الشبكات والخبرات السابقة دورًا حاسمًا في اكتشاف الفرص الجديدة.",
      "المسار المهني المثالي هو أمر ذاتي ويختلف بناءً على تفضيلات وظروف الأفراد."
    ],
    "points": 230,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1735821184
  },
  {
    "id": 42569109,
    "title": "حيلتي المفضلة في تحسين بيئة العمل على الكمبيوتر",
    "originLink": "https://blog.jacobvosmaer.nl/0036-beeper/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569109",
    "commentBody": "",
    "originSummary": [
      "يعرض جاكوب فوسماير جهاز \"ذا بيبر\"، وهو جهاز DIY مصمم لتشجيع الحركة عن طريق إصدار صوت تنبيه إذا بقيت شاشة الكمبيوتر غير مقفلة لفترة طويلة. - يتكون ذا بيبر من مكونات مادية (Adafruit Feather Huzzah ESP8266، مفتاح، صفارة بيزو)، وبرمجيات ثابتة (سكريبت Lua)، وبرمجيات تدير التفعيل. - على الرغم من بساطته، فإن الجهاز يعزز الحركة المنتظمة بشكل فعال، ويعترف جاكوب بدعم زوجته في المشروع."
    ],
    "commentSummary": [
      "أعرب المستخدمون عن إحباطهم من برنامج RSIGuard الإلزامي في العمل، الذي يفرض فترات راحة بتوقيت ثابت ونوافذ منبثقة مزعجة. - تضمنت المناقشة حيلًا مختلفة لتحسين بيئة العمل، مثل شرب الماء لأخذ فترات راحة منتظمة، وارتداء ملابس ضيقة، والاعتماد على تذكيرات ساعة آبل. - تم اقتراح بدائل مثل AntiRSI وWorkrave وحلول مخصصة وساعات ذكية مثل Bangle.js2 لإدارة إصابات الإجهاد المتكرر (RSI) وتحسين بيئة العمل."
    ],
    "points": 216,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1735763993
  },
  {
    "id": 42576443,
    "title": "سرقة كود UBlockOrigin GPL من قبل الفريق المسؤول عن إضافة متصفح Honey",
    "originLink": "https://old.reddit.com/r/uBlockOrigin/comments/1hr6xjc/ubo_quick_filters_list_being_stolen_by_team/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42576443",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم اتهام فريق إضافة المتصفح Honey باستخدام كود مرخص تحت رخصة GPL (الرخصة العامة العامة) من UBlockOrigin دون الإشارة المناسبة، مما أثار جدلاً.",
      "يعبر مستخدمو Reddit عن مخاوفهم بشأن الممارسات التجارية الخادعة، مؤكدين على التأثير السلبي على العملاء وصناعة التكنولوجيا.",
      "تسلط المناقشة الضوء على قضايا أوسع، بما في ذلك أخلاقيات الشركات، وتأثير المال في السياسة، والتحديات في الحفاظ على نزاهة الأعمال، مع وجود شكوك حول مستقبل المشاريع مفتوحة المصدر بسبب الاستغلال المحتمل من قبل الشركات."
    ],
    "points": 213,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1735838848
  },
  {
    "id": 42571367,
    "title": "المدونات تتعفن. الويكيات تنتظر",
    "originLink": "https://j3s.sh/thought/blogs-rot-wikis-wait.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42571367",
    "commentBody": "",
    "originSummary": [
      "تتناول المشاركة الفرق بين الطبيعة الدائمة للويكيات والطبيعة العابرة للمدونات، مشيرة إلى أنه بحلول عام 2025، ستصبح الويكيات أكثر شخصية وذات مغزى.",
      "تُوصف الويكيات بأنها ديناميكية وتعكس تطور أفكار الكاتب، في حين تُشبه المدونات بالواجهات التجارية الثابتة والمنسية.",
      "المؤلف ينتقل من موقع ويب تقليدي إلى تنسيق ويكي، مما يشير إلى تحول في كيفية إدارة ومشاركة المحتوى الشخصي."
    ],
    "commentSummary": [
      "توفر المدونات لمحة زمنية محددة عن أفكار الكاتب، مما يسمح بالتحديثات من خلال منشورات جديدة، لكنها غالبًا ما تفتقر إلى الطوابع الزمنية للسياق. - تواجه الويكيات، مثل ويكيبيديا، صعوبة في توضيح توقيت التحديث والموثوقية، مما يؤدي إلى احتمال وجود معلومات قديمة. - تتمتع كل من المدونات والويكيات بمزايا فريدة ويمكن أن تتعايش، حيث تخدم أغراضًا مختلفة في إنشاء المحتوى ومشاركة المعرفة."
    ],
    "points": 176,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1735788777
  },
  {
    "id": 42571608,
    "title": "ميتا تريد المزيد من الروبوتات الذكية على فيسبوك وإنستغرام",
    "originLink": "https://nymag.com/intelligencer/article/meta-wants-more-ai-bots-on-facebook-and-instagram.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42571608",
    "commentBody": "",
    "originSummary": [
      "تستعد شركة ميتا لإطلاق روبوتات ذكاء اصطناعي على فيسبوك وإنستغرام لجذب المستخدمين الأصغر سنًا والاستفادة من استثمارها في تكنولوجيا الذكاء الاصطناعي التوليدي. - ستتمتع هذه الروبوتات بملفات شخصية وتقوم بإنشاء محتوى، وتعمل بشكل مشابه لحسابات وسائل التواصل الاجتماعي العادية، وذلك بعد استحواذ ميتا على شركة SocialAI. - تعكس هذه المبادرة استراتيجية ميتا الأوسع في أتمتة التفاعلات الاجتماعية وتنظيم المحتوى، بما يتماشى مع الاتجاهات التي شوهدت في تطبيقات مثل Character.ai."
    ],
    "commentSummary": [
      "تقوم شركة ميتا بإدخال المزيد من الروبوتات الذكية على فيسبوك وإنستغرام لتعزيز تفاعل المستخدمين من خلال محاكاة التفاعلات، مما يعكس اتجاهًا أوسع في الصناعة لاستخدام الذكاء الاصطناعي لتحسين تجربة المستخدم.",
      "هناك مخاوف بشأن أصالة التفاعلات، حيث قد يطغى المحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي على الروابط الإنسانية الحقيقية على هذه المنصات.",
      "ينتاب النقاد القلق من أن زيادة وجود الذكاء الاصطناعي قد تؤدي إلى تجربة أقل أصالة على وسائل التواصل الاجتماعي، مما قد ينفر المستخدمين الذين يقدرون التفاعلات الحقيقية."
    ],
    "points": 172,
    "commentCount": 308,
    "retryCount": 0,
    "time": 1735791600
  },
  {
    "id": 42569913,
    "title": "مغامرتي التي استمرت 25 عامًا في الذكاء الاصطناعي وتعلم الآلة",
    "originLink": "https://austinhenley.com/blog/25yearsofai.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42569913",
    "commentBody": "",
    "originSummary": [
      "أوستن ز. هينلي، أستاذ تدريس مشارك في جامعة كارنيجي ميلون، يشارك رحلته التي استمرت 25 عامًا في مجال الذكاء الاصطناعي (AI) وتعلم الآلة (ML)، مسلطًا الضوء على انتقاله من عدم الاهتمام الأولي إلى المشاركة الفعالة من خلال مشاريع متنوعة.",
      "تشمل مسيرته المهنية تطوير ألعاب بسيطة، ودراسة الذكاء الاصطناعي والشبكات العصبية، وتطبيق أشجار القرار والتجميع خلال دراسته للدكتوراه لتحليل بيانات محرر الشفرات.",
      "انضم هينلي إلى فريق توليف البرامج في مايكروسوفت في عام 2022، حيث عمل على مشاريع الذكاء الاصطناعي، بما في ذلك الأدوات المستندة إلى النماذج اللغوية الكبيرة (LLMs)، ويواصل استكشاف أدوات الذكاء الاصطناعي بشكل مستقل أثناء التدريس."
    ],
    "commentSummary": [
      "هناك اتجاه متزايد في مجالات الذكاء الاصطناعي (AI) وتعلم الآلة (ML) لاستخدام الذكاء الاصطناعي حتى عندما قد تكون الحلول الأبسط أكثر فعالية. - يجادل بعض المهنيين ضد هذا الاتجاه، مؤكدين على الحاجة إلى نهج عملي والتشكيك في ضرورة استخدام الذكاء الاصطناعي في كل تطبيق. - يبرز النقاش أهمية التواصل داخل فرق الهندسة لتحقيق التوازن بين الابتكار والعملية، مع الأخذ في الاعتبار أيضًا التأثير الاجتماعي للذكاء الاصطناعي على الأدوار البشرية التقليدية والإبداع."
    ],
    "points": 172,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1735771276
  }
]
