[
  {
    "id": 42690473,
    "title": "Een Snyk-beveiligingsonderzoeker implementeert kwaadaardige NPM-pakketten die gericht zijn op cursor.com",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "Een Snyk-beveiligingsonderzoeker heeft kwaadaardige NPM-pakketten vrijgegeven die gericht zijn op Cursor.com, een AI-coderingsbedrijf, om systeemgegevens te verzamelen en deze naar een door een aanvaller gecontroleerde dienst te sturen.",
      "De pakketten, geïdentificeerd als \"cursor-retrieval,\" \"cursor-always-local,\" en \"cursor-shadow-workspace,\" werden gemarkeerd door de OpenSSF-pakketanalysescanner, resulterend in adviezen MAL-2025-27, MAL-2025-28, en MAL-2025-29.",
      "Dit voorval benadrukt het belang van het onderzoeken van NPM-pakketten voordat ze worden geïnstalleerd om mogelijke beveiligingsbedreigingen te vermijden."
    ],
    "commentSummary": [
      "Een Snyk-beveiligingsonderzoeker heeft kwaadaardige NPM (Node Package Manager) pakketten vrijgegeven die gericht zijn op cursor.com, waarmee afhankelijkheidsverwarringskwetsbaarheden worden benadrukt. - Het incident heeft een debat aangewakkerd over de ethiek van beveiligingsonderzoek, met name met betrekking tot de publieke blootstelling van omgevingsvariabelen. - Cursor.com verduidelijkte dat zij de actie niet hebben geautoriseerd, en Snyk heeft sindsdien zijn excuses aangeboden, waarmee de uitdagingen worden onderstreept in het balanceren van offensief beveiligingsonderzoek met ethische normen."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "Ik ben overgestapt naar Firefox en heb nooit meer achterom gekeken",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "Firefox wordt geprezen voor zijn superieure tabbladbeheer, ingebouwde Pocket-functie voor het opslaan van links en een privacygerichte e-mailrelay, waardoor het een sterk alternatief voor Chrome is. - Extra functies zoals een gebruiksvriendelijke screenshot-tool, een ChatGPT-knop, Picture-in-Picture, aanpasbare zoekopties en soepel scrollen verbeteren de browse-ervaring. - Hoewel Firefox de webapp-functie van Chrome mist, maken het doordachte ontwerp en de verminderde hulpbroneisen het voor sommige gebruikers een voorkeurskeuze."
    ],
    "commentSummary": [
      "Firefox-brukere møter utfordringer fra plattformer som YouTube, som kan med vilje forringe opplevelsen for ikke-Google-nettlesere eller brukere som benytter adblockere. - Denne trenden vekker bekymringer om brukernes autonomi, da den straffer de som velger en annonsefri og overvåkingsfri nettopplevelse. - Firefox tilbyr unike funksjoner, som container-faner, som forbedrer personvern og brukervennlighet, noe som gjør det til et foretrukket valg for brukere som søker uavhengighet fra store, bedriftskontrollerte nettlesere."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "Sonos-CEO stapt op na debacle met app-update",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "De CEO van Sonos heeft ontslag genomen na een controversiële app-update die gebruikers dwong om dure geluidssystemen te vervangen, wat leidde tot ontevredenheid bij klanten. - De update introduceerde een cloud-gebaseerd systeem, waarmee werd afgestapt van het betrouwbare Universal Plug and Play (UPnP), wat leidde tot verbindingsproblemen en verhoogde complexiteit. - Deze situatie benadrukt het conflict tussen bedrijfsstrategieën en het behouden van klantvertrouwen, terwijl de CEO overgaat naar een adviserende rol met een ontslagvergoeding."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "De buik van de MrBeast",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Het essay onderzoekt hoe het algoritme van YouTube invloed heeft op het maken van content, met MrBeast als casestudy, en benadrukt een verschuiving naar engagement-gedreven in plaats van betekenisvolle content. - Het bespreekt de bredere implicaties voor mediageletterdheid en de culturele impact van platforms zoals YouTube en TikTok, en suggereert een trend naar oppervlakkige en reactionaire content. - Verschillende perspectieven worden overwogen over de rol van algoritmen in het vormgeven van content en de invloed van populaire makers op culturele normen."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "GitHub Git-bewerkingen zijn niet beschikbaar",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub kreeg te maken met een storing in Git-operaties op 13 januari 2025, als gevolg van een configuratiewijziging die de interne load balancer beïnvloedde, en duurde van 23:35 tot 00:24 UTC. - Het probleem werd opgelost door de configuratiewijziging terug te draaien, en GitHub werkt aan het verbeteren van monitoring- en implementatieprocessen om soortgelijke incidenten te voorkomen. - De storing beïnvloedde ook de Actions- en Pages-diensten van GitHub, wat de onderling verbonden aard van hun platformdiensten benadrukt."
    ],
    "commentSummary": [
      "GitHub sto overfor et stort driftsavbrudd som påvirket git-operasjoner, noe som førte til forvirring blant utviklere som først mistenkte problemer med sine SSH-nøkler eller lokale konfigurasjoner. - Hendelsen understreket utfordringene ved å stole på sentraliserte tjenester, og førte til diskusjoner om fordelene ved selvhosting og desentraliserte systemer. - Selv om problemet ble løst, fremhevet det bekymringer om GitHubs pålitelighet og risikoene ved å være avhengig av tredjepartsplattformer for essensielle oppgaver."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3 uitgebracht met ZFS raidz-uitbreiding",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0 har blitt utgitt, og introduserer betydelige funksjoner som RAIDZ-utvidelse, rask deduplisering, direkte inn-/utdata, JSON-utdata og støtte for lange filnavn. - Utgivelsen inkluderer essensielle feilrettinger og ytelsesforbedringer, kompatibel med Linux-kjerner 4.18 - 6.12 og FreeBSD-versjoner 13.3, 14.0 - 14.2. - Oppdateringen er et samarbeid fra 134 bidragsytere, med omfattende dokumentasjon og en endringslogg tilgjengelig for gjennomgang."
    ],
    "commentSummary": [
      "ZFS 2.3 har blitt lansert, og introduserer funksjoner som RAIDZ-utvidelse, rask deduplisering, direkte IO, JSON-utdata og støtte for lange filnavn. - RAIDZ-utvidelse er spesielt bemerkelsesverdig da det lar brukere legge til nye enheter i en eksisterende RAIDZ-pool uten nedetid, noe som øker lagringskapasiteten. - Utgivelsen anses som et betydelig fremskritt for ZFS-brukere, og trekker sammenligninger med andre filsystemer som Btrfs og Windows Storage Spaces, til tross for noen begrensninger som manglende evne til å krympe pools."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "Webtop – Alpine, Ubuntu, Fedora og Arch containere som inneholder komplette skrivebordsmiljøer",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop biedt containers gebaseerd op Alpine, Ubuntu, Fedora en Arch met volledige desktopomgevingen die toegankelijk zijn via webbrowsers, en ondersteunt zowel x86-64 als arm64 architecturen.",
      "Gebruikers kunnen kiezen uit verschillende desktopomgevingen zoals XFCE, KDE, MATE, i3, Openbox en IceWM door specifieke afbeeldingslabels te gebruiken en toegang te krijgen tot de Webtop via aangewezen URL's.",
      "Beveiligingsfuncties omvatten Docker's seccomp-optie en authenticatie-instellingen, met aanpassingsmogelijkheden beschikbaar via omgevingsvariabelen, en ondersteuning voor GPU-versnelling met open-source stuurprogramma's."
    ],
    "commentSummary": [
      "Webtop biedt containers met volledige desktopomgevingen voor Alpine, Ubuntu, Fedora en Arch, geschikt voor snelle installaties achter een VPN.",
      "Gebruikers prijzen Webtop voor zijn snelheid en gebruiksgemak, vooral wanneer het wordt gebruikt met de Gluetun-container voor veilige verbindingen, maar waarschuwen tegen het blootstellen van containers aan het internet zonder beveiligingsmaatregelen vanwege het ontbreken van standaardauthenticatie.",
      "Het project wordt gewaardeerd omdat het open-source en flexibel is, waarbij gebruikers configuraties delen, en alternatieven zoals Kasm en Selkies worden opgemerkt voor soortgelijke doeleinden."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "1 op de 5 online vacatures is ofwel nep of wordt nooit ingevuld, blijkt uit onderzoek",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "Een recente studie wijst uit dat 20% van de online vacatures ofwel nep zijn of onvervuld blijven, wat bijdraagt aan de frustratie van werkzoekenden. - Deze trend van \"spookbanen\" kan een tactiek zijn voor bedrijven om een beeld van groei te projecteren. - Banenplatforms zoals Greenhouse en LinkedIn hebben diensten voor vacatureverificatie geïntroduceerd om gebruikers te helpen echte kansen te identificeren."
    ],
    "commentSummary": [
      "Een studie onthult dat 20% van de online vacatures ofwel nep zijn of onvervuld blijven, vaak omdat bedrijven moeten voldoen aan de Amerikaanse immigratiebeleid. - Bedrijven kunnen ook vacatures laten staan om ideale kandidaten te vinden, eisen te veranderen, of omdat ze al interne kandidaten hebben geselecteerd. - De arbeidsmarkt is moeilijk voor sollicitanten, die vaak te maken krijgen met ghosting en geautomatiseerde afwijzingen, wat oproept tot regelgevende interventie."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "Een kruispunt onveilig maken voor voetgangers om seconden te besparen voor automobilisten",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Het debat draait om de vraag of kruispunten de veiligheid van voetgangers of de efficiëntie van bestuurders moeten prioriteren, waarbij sommigen de voorkeur geven aan lichtgeregelde kruispunten en voetgangersscrambles boven 4-wegstops.",
      "De meningen over verkeerswetten en infrastructuurontwerp lopen uiteen, met discussies over de veiligheid van het oversteken buiten de oversteekplaats en de risico's die gepaard gaan met rechtsaf slaan bij rood licht.",
      "Enkele pleiten voor alternatieve oplossingen zoals rotondes of het aannemen van Nederlandse verkeerskundige normen om zowel de veiligheid als de efficiëntie te verbeteren."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL is het Database Management Systeem van het Jaar 2024",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL is bekroond met de titel DBMS van het Jaar 2024 door DB-Engines, en behaalt deze erkenning voor de vijfde keer, waarmee het 423 andere databasebeheersystemen overtreft.",
      "PostgreSQL, med en historie som strekker seg over nesten 35 år, fortsetter å innovere, noe som ses i de nylige forbedringene av PostgreSQL 17, utgitt i september 2024.",
      "Snowflake en Microsoft sikret seg henholdsvis andre- og tredjeplass, med Snowflake kjent for sin skybaserte datalagring og støtte for flere skyer, mens Microsoft tilbyr robuste administrerte relasjonsdatabaser gjennom Azure SQL Database og SQL Server."
    ],
    "commentSummary": [
      "PostgreSQL is bekroond met de titel Database Management System van het Jaar 2024 door db-engines.com, wat de groeiende populariteit en erkenning in de industrie benadrukt.",
      "Gebruikers overwegen over te stappen van Microsoft SQL Server naar PostgreSQL vanwege de hoge licentiekosten en beperkingen in middelen, ondanks mogelijke migratie-uitdagingen.",
      "PostgreSQL wordt geprefereerd vanwege zijn robuuste functies en kosteneffectiviteit, waardoor het een voorkeurskeuze is voor toekomstige projecten, hoewel sommige gebruikers alternatieven zoals Babelfish verkennen om kosten te verlagen."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "De OAuth-login van Google beschermt niet tegen het kopen van een mislukte startup-domein.",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "De discussie benadrukt een kwetsbaarheid in het OAuth-inlogsysteem van Google wanneer het domein van een mislukte startup wordt overgenomen door een nieuwe eigenaar, wat mogelijk ongeautoriseerde toegang tot diensten kan toestaan.",
      "Dit probleem ontstaat omdat Google mogelijk geen onderscheid maakt tussen de oorspronkelijke en nieuwe domeineigenaren, wat van invloed is op elk systeem dat domeingebaseerde authenticatie gebruikt.",
      "Een voorgestelde oplossing is om unieke identificatoren te gebruiken die constant blijven in de tijd, hoewel de implementatie van deze oplossing varieert tussen identiteitsaanbieders."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "Codering gebruiken om passief inkomen te genereren",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "De auteur ging over van een CTO-rol naar een solopreneur en verdiende met succes meer door middel van een portfolio van softwareproducten.",
      "Belangrijke strategieën omvatten het richten op diep werk, beginnen met kleine projecten, snel itereren en tijd besteden aan marketinginspanningen.",
      "De reis benadrukt veerkracht vanwege onzekerheden, maar benadrukt de ongeëvenaarde autonomie en vrijheid van dit carrièrepad, en moedigt degenen met codeervaardigheden aan om het te overwegen voor passief inkomen."
    ],
    "commentSummary": [
      "Een gebruiker beschreef het genereren van passief inkomen via SEO-spamwebsites met behulp van verlopen domeinnamen, waarbij hij ongeveer $30.000 per jaar verdiende, ondanks ethische bezwaren en Google's uiteindelijke optreden.",
      "De post veroorzaakte een debat over passief inkomen, waarbij sommige gebruikers betoogden dat het meer lijkt op het runnen van een bedrijf dan op echt passieve inkomsten.",
      "Deelnemers deelden ervaringen en uitdagingen in nevenprojecten, waarbij ze het belang van tijd, veerkracht en strategische planning benadrukten."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "Spanje stelt een belasting van 100% voor op woningen die door niet-EU-ingezetenen worden gekocht",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "Spanje overweegt een belasting van 100% op vastgoed aankopen door niet-EU ingezetenen, met als doel de woningcrisis aan te pakken en speculatieve aankopen te beperken.",
      "Het voorstel van premier Pedro Sánchez omvat de uitbreiding van sociale huisvesting en het reguleren van toeristische verhuur om de kloof tussen woningprijzen en inkomens aan te pakken.",
      "De fremtidige statusen til forslaget som lov er usikker, med noen analytikere som ser det som en avskrekkende faktor for utenlandske investorer snarere enn en garantert lovendring."
    ],
    "commentSummary": [
      "Spanje overweegt een belasting van 100% op woningen die door niet-EU-ingezetenen worden gekocht om problemen met betaalbaarheid van woningen aan te pakken. - Critici suggereren dat buitenlandse kopers niet de primaire oorzaak zijn van de hoge huizenprijzen, en wijzen op trage bureaucratie en bestemmingsplannen als belangrijkere factoren. - Het voorstel heeft een debat aangewakkerd over de rol van buitenlands eigendom in woningmarkten en de effectiviteit ervan bij het oplossen van betaalbaarheidsproblemen."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "Apple zal binnenkort 'made in America'-chips ontvangen van TSMC's fabriek in Arizona",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "Apple tester prosessorer fra TSMCs anlegg i Arizona, med planer om masseproduksjon innen første kvartal, og kan potensielt bli TSMCs første amerikanske kunde for lokalt produserte brikker. - Dette initiativet har som mål å styrke USAs silisiumuavhengighet, og redusere avhengigheten av Taiwan, som er sårbar for geopolitiske og naturlige risikoer. - TSMCs fabrikk i Arizona skal produsere avanserte 3nm og 2nm brikker, med pågående innsats for å forbedre lokal rekruttering og partnerskap med amerikanske universiteter, selv om pakking i utgangspunktet vil skje i Taiwan inntil anlegget i Peoria er operativt."
    ],
    "commentSummary": [
      "Apple vil motta brikker fra TSMCs fabrikk i Arizona, men de må sendes tilbake til Taiwan for pakking på grunn av utilstrekkelige fasiliteter i USA. - Over 50 % av arbeidsstyrken ved fabrikken i Arizona er fra Taiwan, noe som indikerer et gap i USAs STEM-felt (vitenskap, teknologi, ingeniørfag og matematikk). - CHIPS Act-initiativet, som har som mål å styrke USAs halvlederproduksjon, står overfor utfordringer ettersom \"Made in America\"-merket blir stilt spørsmål ved på grunn av pakkeprosessen som skjer i Taiwan, med planer om amerikanske pakkemuligheter innen 2027."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "43.000 færre sjåfører på veiene i Manhattan etter at veiprisene ble aktivert",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "Na de invoering van tolheffing voor congestie was er een vermindering van 7,5% in het aantal bestuurders dat Manhattan onder 60th Street binnenreed, wat neerkomt op 43.000 minder bestuurders per weekdag.",
      "De vermindering van het verkeer heeft de doorstroming verbeterd en de snelheid van bussen verhoogd, waarbij sommige snelbussen een hogere bezetting ervaren.",
      "De Metropolitan Transportation Authority (MTA) gebruikt de tolinkomsten, geschat op $500 miljoen per jaar, voor verbeteringen in het openbaar vervoer, ondanks enige politieke tegenstand."
    ],
    "commentSummary": [
      "De implementatie van congestieheffing in Manhattan heeft geresulteerd in 43.000 minder automobilisten, wat heeft geleid tot hogere bussnelheden en mogelijk betere responstijden voor nooddiensten.",
      "Het beleid is ontworpen om verkeersopstoppingen te verminderen en de luchtkwaliteit te verbeteren, hoewel het debat heeft aangewakkerd over de impact ervan op mensen met een lager inkomen.",
      "Voorstanders beweren dat de voordelen efficiënter openbaar vervoer en schonere lucht omvatten, terwijl de discussies doorgaan over het balanceren van deze voordelen met de behoeften van automobilisten."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
