[
  {
    "id": 42690473,
    "title": "ச்னிக் பாதுகாப்பு ஆராய்ச்சியாளர் cursor.com ஐ இலக்காகக் கொண்ட தீங்கிழைக்கும் NPM தொகுப்புகளைப் பரப்புகிறார்",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "ஒரு Snyk பாதுகாப்பு ஆராய்ச்சியாளர் Cursor.com என்ற AI குறியீட்டு நிறுவனத்தை இலக்காகக் கொண்ட தீங்கிழைக்கும் NPM தொகுப்புகளை வெளியிட்டு, கணினி தரவுகளை சேகரித்து, அதை தாக்குதலாளி கட்டுப்பாட்டில் உள்ள சேவைக்கு அனுப்பினார்.",
      "பொதியங்கள், \"கர்சர்-மீட்டெடுப்பு,\" \"கர்சர்-எப்போதும்-உள்ளூர்,\" மற்றும் \"கர்சர்-நிழல்-வேலைநிலம்\" என அடையாளம் காணப்பட்டன, OpenSSF பொதிய பகுப்பாய்வு ஸ்கேனர் மூலம் குறிக்கப்படுவதால், MAL-2025-27, MAL-2025-28, மற்றும் MAL-2025-29 என அறிவுறுத்தல்கள் வெளியிடப்பட்டன.",
      "இந்த நிகழ்வு, சாத்தியமான பாதுகாப்பு அச்சுறுத்தல்களை தவிர்க்க, நிறுவுவதற்கு முன் NPM தொகுப்புகளை ஆராய்வதின் முக்கியத்துவத்தை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "ஒரு Snyk பாதுகாப்பு ஆராய்ச்சியாளர் cursor.com-ஐ குறிவைத்து தீங்கிழைக்கும் NPM (Node Package Manager) தொகுப்புகளை வெளியிட்டார், சார்பு குழப்பம் பாதிப்புகளை வெளிப்படுத்தினார். - இந்த சம்பவம் பாதுகாப்பு ஆராய்ச்சியின் நெறிமுறைகள் குறித்து விவாதத்தை தூண்டியுள்ளது, குறிப்பாக சூழல் மாறிலிகளை பொது வெளியில் வெளிப்படுத்துவது தொடர்பாக. - Cursor.com அவர்கள் இந்த நடவடிக்கையை அங்கீகரிக்கவில்லை என்று தெளிவுபடுத்தியது, மேலும் Snyk மன்னிப்பு கேட்டுள்ளது, நெறிமுறைகள் மற்றும் தாக்குதல் பாதுகாப்பு ஆராய்ச்சியை சமநிலைப்படுத்துவதில் உள்ள சவால்களை வலியுறுத்துகிறது."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "நான் ஃபயர்பாக்ஸுக்கு மாறினேன் மற்றும் மீண்டும் ஒருபோதும் திரும்பிப் பார்க்கவில்லை",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "Firefox அதன் மேம்பட்ட தாவல் மேலாண்மை, இணைக்கப்பட்ட பாக்கெட் அம்சம் மூலம் இணைப்புகளை சேமிக்க, மற்றும் தனியுரிமை மையமாகிய மின்னஞ்சல் ரிலே ஆகியவற்றிற்காக பாராட்டப்படுகிறது, இதனால் இது Chrome க்கு ஒரு வலுவான மாற்றாக உள்ளது. - பயனர் நட்பு ஸ்கிரீன்ஷாட் கருவி, ChatGPT பொத்தான், படம்-இன்-படம், தனிப்பயனாக்கக்கூடிய தேடல் விருப்பங்கள், மற்றும் மென்மையான ஸ்க்ரோலிங் போன்ற கூடுதல் அம்சங்கள் உலாவல் அனுபவத்தை மேம்படுத்துகின்றன. - Firefox Chrome இன் வலை பயன்பாட்டு அம்சத்தை கொண்டிருக்கவில்லை என்றாலும், அதன் சிந்தனையுடன் வடிவமைப்பு மற்றும் குறைந்த வள தேவைகள் சில பயனர்களுக்கு விருப்பமான தேர்வாக இதை மாற்றுகின்றன."
    ],
    "commentSummary": [
      "பயன்பாட்டாளர்கள், யூடியூப் போன்ற தளங்களால் எதிர்கொள்ளும் சவால்கள், குறிப்பாக கூகிள் அல்லாத உலாவிகள் அல்லது விளம்பர தடுப்பிகளை பயன்படுத்தும் பயனர்களுக்கு அனுபவத்தை குறைக்கலாம். - இந்த போக்கு பயனர் சுயாதீனத்திற்கான கவலைகளை எழுப்புகிறது, ஏனெனில் இது விளம்பரமற்ற மற்றும் கண்காணிப்பற்ற இணைய அனுபவத்தை தேர்ந்தெடுக்கும் பயனர்களை தண்டிக்கிறது. - பயனர் சுயாதீனத்திற்காக பெரும் நிறுவனங்களால் கட்டுப்படுத்தப்படும் உலாவிகளில் இருந்து விடுபட விரும்பும் பயனர்களுக்கு, பிரத்தியேக தன்மை மற்றும் பயன்பாட்டை மேம்படுத்தும் கொண்டெய்னர் டேப்கள் போன்ற தனித்துவமான அம்சங்களை வழங்குவதால், ஃபயர்பாக்ஸ் ஒரு விருப்பமான தேர்வாக உள்ளது."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "சோனோஸ் தலைமை நிர்வாக அதிகாரி செயலி புதுப்பிப்பு சிக்கலுக்குப் பிறகு பதவி விலகினார்",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "சோனோஸ் நிறுவனத்தின் தலைமை நிர்வாக அதிகாரி, வாடிக்கையாளர்களின் அதிருப்தியை ஏற்படுத்திய விலையுயர்ந்த ஒலிக்கருவிகளை மாற்ற வலியுறுத்திய சர்ச்சைக்குரிய செயலி புதுப்பிப்பைத் தொடர்ந்து ராஜினாமா செய்துள்ளார். - இந்த புதுப்பிப்பு மேக அடிப்படையிலான அமைப்பை அறிமுகப்படுத்தியது, நம்பகமான யுனிவர்சல் பிளக் அண்ட் பிளே (UPnP) முறையிலிருந்து விலகியது, இது இணைப்பு சிக்கல்களை மற்றும் அதிகரித்த சிக்கல்களை ஏற்படுத்தியது. - இந்த நிலைமை வணிக உத்திகள் மற்றும் வாடிக்கையாளர் நம்பிக்கையை பராமரிப்பதற்கிடையிலான மோதலை வலியுறுத்துகிறது, ஏனெனில் தலைமை நிர்வாக அதிகாரி ஒரு ஆலோசனைப் பங்கிற்கு மாற்றம் செய்யப்படுகிறார் மற்றும் ஒரு பிரிவு தொகுப்புடன்."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "MrBeast என்பவரின் வயிற்றில்",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "கட்டுரை YouTube இன் ஆல்கொரிதம் உள்ளடக்க உருவாக்கத்தை எவ்வாறு பாதிக்கிறது என்பதை ஆய்வு செய்கிறது, MrBeast ஐ ஒரு வழக்குக் கற்பிதமாகக் கொண்டு, ஈர்ப்பை மையமாகக் கொண்ட உள்ளடக்கத்திற்கேற்ற மாற்றத்தை வெளிப்படுத்துகிறது. - இது ஊடக கல்வி மற்றும் YouTube மற்றும் TikTok போன்ற தளங்களின் கலாச்சார தாக்கம் பற்றிய பரந்த விளைவுகளை விவரிக்கிறது, மேற்பரப்பான மற்றும் எதிர்வினை உள்ளடக்கத்திற்கான ஒரு போக்கை முன்மொழிகிறது. - ஆல்கொரிதங்கள் உள்ளடக்கத்தை வடிவமைப்பதில் மற்றும் பிரபலமான உருவாக்குநர்கள் கலாச்சார நெறிமுறைகளில் ஏற்படுத்தும் தாக்கத்தில் பல்வேறு பார்வைகள் பரிசீலிக்கப்படுகின்றன."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "GitHub Git செயல்பாடுகள் செயலிழந்துள்ளன",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub, ஜனவரி 13, 2025 அன்று, உள்துறை சுமை சமநிலை மாற்றத்தை பாதித்த ஒரு கட்டமைப்பு மாற்றம் காரணமாக Git செயல்பாடுகள் தடை ஏற்பட்டது, இது 23:35 முதல் 00:24 UTC வரை நீடித்தது. - இந்த பிரச்சினை கட்டமைப்பு மாற்றத்தை மாற்றுவதன் மூலம் தீர்க்கப்பட்டது, மேலும் இதுபோன்ற சம்பவங்களைத் தடுக்க கண்காணிப்பு மற்றும் பிரசாரம் செயல்முறைகளை மேம்படுத்த GitHub பணியாற்றி வருகிறது. - இந்த தடை GitHub இன் Actions மற்றும் Pages சேவைகளையும் பாதித்தது, அவர்களின் தள சேவைகளின் பரஸ்பர இணைந்த தன்மையை வெளிப்படுத்தியது."
    ],
    "commentSummary": [
      "GitHub ஒரு முக்கியமான சேவையின்மை பிரச்சினையை எதிர்கொண்டது, இது git செயல்பாடுகளை பாதித்தது, இதனால் முதலில் தங்கள் SSH விசைகள் அல்லது உள்ளூர் கட்டமைப்புகளுடன் பிரச்சினைகள் உள்ளன என்று சந்தேகித்த டெவலப்பர்களுக்கு குழப்பம் ஏற்பட்டது. - இந்த சம்பவம் மையமயமாக்கப்பட்ட சேவைகளின் மீது நம்பிக்கை வைப்பதன் சவால்களை வலியுறுத்தியது, சுய-ஹோஸ்டிங் மற்றும் மையமற்ற அமைப்புகளின் நன்மைகள் பற்றிய விவாதங்களைத் தூண்டியது. - பிரச்சினை தீர்க்கப்பட்டாலும், GitHub இன் நம்பகத்தன்மை மற்றும் முக்கிய பணிகளுக்காக மூன்றாம் தரப்பு தளங்களின் மீது நம்பிக்கை வைப்பதன் அபாயங்களைப் பற்றிய கவலைகளை இது வெளிப்படுத்தியது."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3 வெளியிடப்பட்டது ZFS raidz விரிவாக்கத்துடன்",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "TEXT: OpenZFS 2.3.0 வெளியிடப்பட்டுள்ளது, RAIDZ விரிவாக்கம், வேகமான Deduplication, நேரடி உள்ளீடு/வெளியீடு, JSON வெளியீடு மற்றும் நீண்ட கோப்பு பெயர்களுக்கு ஆதரவு போன்ற முக்கிய அம்சங்களை அறிமுகப்படுத்துகிறது. - இந்த வெளியீடு முக்கிய பிழை திருத்தங்கள் மற்றும் செயல்திறன் மேம்பாடுகளை உள்ளடக்கியது, Linux kernels 4.18 - 6.12 மற்றும் FreeBSD பதிப்புகள் 13.3, 14.0 - 14.2 உடன் இணக்கமானது. - இந்த புதுப்பிப்பு 134 பங்களிப்பாளர்களின் கூட்டாண்மை முயற்சியாகும், விரிவான ஆவணங்கள் மற்றும் மாற்றம் பதிவு மதிப்பீட்டிற்காக கிடைக்கின்றன."
    ],
    "commentSummary": [
      "ZFS 2.3 வெளியிடப்பட்டுள்ளது, RAIDZ விரிவாக்கம், வேகமான டிடுப்ளிகேஷன், நேரடி IO, JSON வெளியீடு, நீண்ட கோப்பு பெயர்களுக்கு ஆதரவு போன்ற அம்சங்களை அறிமுகப்படுத்துகிறது. - RAIDZ விரிவாக்கம் குறிப்பாக குறிப்பிடத்தக்கது, ஏனெனில் இது பயனர்களுக்கு எந்த இடையூறும் இல்லாமல் உள்ள RAIDZ குளத்தில் புதிய சாதனங்களைச் சேர்க்க அனுமதிக்கிறது, சேமிப்பு திறனை மேம்படுத்துகிறது. - இந்த வெளியீடு ZFS பயனர்களுக்கு ஒரு முக்கிய முன்னேற்றமாகக் கருதப்படுகிறது, Btrfs மற்றும் Windows Storage Spaces போன்ற பிற கோப்பக அமைப்புகளுடன் ஒப்பிடப்படுகிறது, குளங்களைச் சுருக்க முடியாதது போன்ற சில வரம்புகள் இருந்தாலும்."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "வலைமேடை – முழுமையான டெஸ்க்டாப் சூழல்களைக் கொண்ட ஆல்பைன், உபுண்டு, ஃபெடோரா மற்றும் ஆர்ச் கண்டெய்னர்கள்",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop ஆனது Alpine, Ubuntu, Fedora, மற்றும் Arch அடிப்படையிலான கன்டெய்னர்களை வழங்குகிறது, அவை முழுமையான டெஸ்க்டாப் சூழல்களை வலை உலாவிகளின் மூலம் அணுகக்கூடியவாறு செய்கின்றன, மேலும் x86-64 மற்றும் arm64 கட்டமைப்புகளையும் ஆதரிக்கின்றன.",
      "பயனர்கள் XFCE, KDE, MATE, i3, Openbox, மற்றும் IceWM போன்ற பல்வேறு டெஸ்க்டாப் சூழல்களில் இருந்து தேர்வு செய்யலாம், குறிப்பிட்ட படக்குறிகளைப் பயன்படுத்தி, குறிப்பிட்ட URLகளின் மூலம் வலைமேடையை அணுகலாம்.",
      "பாதுகாப்பு அம்சங்களில் Docker இன் seccomp விருப்பம் மற்றும் அங்கீகார அமைப்பு அடங்கும், சூழல் மாறிகள் மூலம் தனிப்பயனாக்கல் விருப்பங்கள் கிடைக்கின்றன, மேலும் திறந்த மூல இயக்கிகள் மூலம் GPU வேகப்படுத்தலுக்கான ஆதரவு உள்ளது."
    ],
    "commentSummary": [
      "Webtop, Alpine, Ubuntu, Fedora, மற்றும் Arch ஆகியவற்றிற்கான முழுமையான டெஸ்க்டாப் சூழல்களுடன் கொண்டெய்னர்களை வழங்குகிறது, இது VPN பின்னால் விரைவான அமைப்புகளுக்கு ஏற்றதாகும்.",
      "பயனர்கள் Webtop ஐ அதன் வேகம் மற்றும் பயன்படுத்த எளிமையான தன்மைக்காக பாராட்டுகின்றனர், குறிப்பாக Gluetun கொண்டெய்னருடன் பாதுகாப்பான இணைப்புகளுக்கு பயன்படுத்தும்போது, ஆனால் இயல்புநிலை அங்கீகாரம் இல்லாததால் பாதுகாப்பு நடவடிக்கைகள் இல்லாமல் கொண்டெய்னர்களை இணையத்துடன் வெளிப்படுத்துவதை எச்சரிக்கின்றனர்.",
      "தமிழில் எழுத வேண்டும். இந்த திட்டம் திறந்த மூலமாகவும், நெகிழ்வானதாகவும் மதிக்கப்படுகிறது, பயனர்கள் கட்டமைப்புகளை பகிர்ந்து கொள்கின்றனர், மேலும் Kasm மற்றும் Selkies போன்ற மாற்றுகள் இதே போன்ற நோக்கங்களுக்காக குறிப்பிடப்படுகின்றன."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "ஆன்லைன் வேலைவாய்ப்பு விளம்பரங்களில் 5 இல் 1 என்பது போலியானது அல்லது ஒருபோதும் நிரப்பப்படாதது என்று ஆய்வு கண்டறிந்துள்ளது",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "சமீபத்திய ஆய்வு ஒன்று, ஆன்லைன் வேலைவாய்ப்பு அறிவிப்புகளில் 20% போலியானவையாகவோ அல்லது நிரப்பப்படாதவையாகவோ உள்ளன என்று காட்டுகிறது, இது வேலை தேடுபவர்களின் ஏமாற்றத்தை அதிகரிக்கிறது. - இந்த \"பேய் வேலை\" போக்கு, நிறுவனங்கள் வளர்ச்சி படத்தை வெளிப்படுத்தும் உத்தியாக இருக்கலாம். - கிரீன்ஹவுஸ் மற்றும் லிங்க்ட்இன் போன்ற வேலைவாய்ப்பு தளங்கள், பயனர்களுக்கு உண்மையான வேலை வாய்ப்புகளை அடையாளம் காண உதவ வேலை சரிபார்ப்பு சேவைகளை அறிமுகப்படுத்தியுள்ளன."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். ஒரு ஆய்வு தெரிவிக்கிறது, ஆன்லைன் வேலைவாய்ப்பு அறிவிப்புகளில் 20% போலியானவையாகவோ அல்லது நிரப்பப்படாதவையாகவோ உள்ளன, பெரும்பாலும் அமெரிக்க குடியேற்றக் கொள்கைகளை பின்பற்ற நிறுவனங்கள் தேவைப்படும் காரணத்தினால். - நிறுவனங்கள் கூடுதல் நேரத்திற்காக வேலைவாய்ப்பு அறிவிப்புகளை வைத்திருக்கலாம், சிறந்த வேட்பாளர்களைத் தேட, தேவைகளை மாற்ற, அல்லது முன்பே தேர்ந்தெடுக்கப்பட்ட உள்நாட்டு வேட்பாளர்களை வைத்திருக்கலாம். - வேலை சந்தை விண்ணப்பதாரர்களுக்கு கடினமாக உள்ளது, அவர்கள் அடிக்கடி 'கோஸ்டிங்' மற்றும் தானியங்கி மறுப்புகளை சந்திக்கின்றனர், இது ஒழுங்குமுறை தலையீட்டை கோருகிறது."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "வாகன ஓட்டிகளுக்காக விநாடிகளை சேமிக்க பாதசாரிகளுக்கு ஒரு சந்திப்பை பாதுகாப்பற்றதாக மாற்றுதல்",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். விவாதம் சந்திப்புகளில் பாதசாரி பாதுகாப்பை முன்னுரிமைப்படுத்த வேண்டுமா அல்லது வாகன ஓட்டுநரின் செயல்திறனை முன்னுரிமைப்படுத்த வேண்டுமா என்பதைக் குறிக்கிறது, சிலர் ஒளி கட்டுப்பாட்டிலான சந்திப்புகள் மற்றும் பாதசாரி சறுக்கல்களை 4 வழி நிறுத்தங்களுக்குப் பதிலாக ஆதரிக்கின்றனர்.",
      "பாதுகாப்பற்ற இடங்களில் சாலையை கடக்குதல் மற்றும் சிவப்பு விளக்கில் வலதுபுறம் திரும்புவதால் ஏற்படும் அபாயங்கள் குறித்து போக்குவரத்து சட்டங்கள் மற்றும் உள்கட்டமைப்பு வடிவமைப்பில் கருத்துக்கள் மாறுபடுகின்றன.",
      "தமிழில் எழுத வேண்டும்: சிலர் பாதுகாப்பையும் செயல்திறனையும் மேம்படுத்துவதற்காக சுற்றுச்சாலை அல்லது டச்சு போக்குவரத்து பொறியியல் தரநிலைகளை ஏற்கும் மாற்று தீர்வுகளை ஆதரிக்கின்றனர்."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL 2024 ஆம் ஆண்டின் தரவுத்தள மேலாண்மை அமைப்பாகும்",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL, 2024 ஆம் ஆண்டிற்கான DBMS ஆஃப் தி இயர் விருதை DB-Engines மூலம் பெற்றுள்ளது, 423 பிற தரவுத்தள மேலாண்மை அமைப்புகளை முந்தி, ஐந்தாவது முறையாக இந்த அங்கீகாரத்தை பெற்றுள்ளது.",
      "PostgreSQL, 35 ஆண்டுகளுக்கு மேல் நீடிக்கும் வரலாற்றுடன், 2024 செப்டம்பரில் வெளியிடப்பட்ட PostgreSQL 17 இன் சமீபத்திய மேம்பாடுகளில் காணப்படும் புதிய முயற்சிகளை தொடர்ந்து மேற்கொள்கிறது.",
      "Snowflake மற்றும் Microsoft முறையே இரண்டாம் மற்றும் மூன்றாம் இடங்களைப் பெற்றன, Snowflake அதன் மேக அடிப்படையிலான தரவுத்தொகுப்பு மற்றும் பல மேக ஆதரவுக்காக குறிப்பிடப்பட்டது, அதேசமயம் Microsoft Azure SQL Database மற்றும் SQL Server மூலம் வலுவான மேலாண்மை செய்யப்பட்ட தொடர்பு தரவுத்தொகுப்புகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "PostgreSQL 2024 ஆம் ஆண்டிற்கான தரவுத்தள மேலாண்மை அமைப்பு விருதை db-engines.com மூலம் பெற்றுள்ளது, இது அதன் வளர்ந்து வரும் பிரபலத்தையும், தொழில்துறையில் கிடைக்கும் அங்கீகாரத்தையும் வெளிப்படுத்துகிறது.",
      "பயனர்கள் மைக்ரோசாஃப்ட் SQL சர்வர் இருந்து PostgreSQL க்கு மாறுவதைக் கருதுகின்றனர், அதிக உரிமம் செலவுகள் மற்றும் வளக் கட்டுப்பாடுகள் காரணமாக, இடமாற்ற சவால்கள் இருந்தாலும்.",
      "PostgreSQL அதன் வலுவான அம்சங்கள் மற்றும் செலவுக் குறைவுக்காக விரும்பப்படுகிறது, இது எதிர்கால திட்டங்களுக்கு விருப்பமான தேர்வாக இருக்கிறது, ஆனால் சில பயனர்கள் செலவுகளை குறைக்க Babelfish போன்ற மாற்றங்களை ஆராய்கிறார்கள்."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "Google இன் OAuth உள்நுழைவு ஒரு தோல்வியுற்ற ஸ்டார்ட்அப் டொமைனை வாங்குவதிலிருந்து பாதுகாக்காது",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "இந்த விவாதம், தோல்வியடைந்த ஸ்டார்ட்அப்பின் டொமைன் புதிய உரிமையாளரால் கைப்பற்றப்படும் போது, கூகிளின் OAuth உள்நுழைவு அமைப்பில் உள்ள ஒரு பாதிப்பை வெளிப்படுத்துகிறது, இது அனுமதியற்ற அணுகலை சேவைகளுக்கு அனுமதிக்கக்கூடும்.",
      "இந்த பிரச்சனை உருவாகிறது, ஏனெனில் கூகுள் அசல் மற்றும் புதிய டொமைன் உரிமையாளர்களை வேறுபடுத்தாமல் இருக்கலாம், இது டொமைன் அடிப்படையிலான அங்கீகாரத்தைப் பயன்படுத்தும் எந்தவொரு அமைப்பையும் பாதிக்கக்கூடும்.",
      "ஒரு பரிந்துரைக்கப்பட்ட தீர்வு என்பது காலப்போக்கில் மாறாத தனித்துவமான அடையாளங்களைப் பயன்படுத்துவது, ஆனால் இந்த தீர்வின் செயலாக்கம் அடையாள வழங்குநர்களிடையே மாறுபடுகிறது."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "கோடிங் திறன்களை பயன்படுத்தி பாசிவ் வருமானம் பெறுதல்",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "TEXT: ஆசிரியர் CTO பங்கிலிருந்து தனியார் தொழில்முனைவோராக மாறி, மென்பொருள் தயாரிப்புகளின் தொகுப்பின் மூலம் அதிக வருமானம் ஈட்டினார். TEXT:",
      "முக்கிய உத்திகள் ஆழமான பணியில் கவனம் செலுத்துவது, சிறிய திட்டங்களுடன் தொடங்குவது, விரைவாக திருத்துவது மற்றும் சந்தைப்படுத்தல் முயற்சிகளுக்கு நேரத்தை ஒதுக்குவது ஆகியவற்றை உள்ளடக்கியவை.",
      "இந்த பயணம் நிச்சயமற்ற தன்மையால் பொறுமையை வலியுறுத்துகிறது, ஆனால் இந்த தொழில் பாதையின் ஒப்பற்ற சுயாதீனத்தையும் சுதந்திரத்தையும் சிறப்பிக்கிறது, குறியீட்டு திறன்களைக் கொண்டவர்களை இதை பாசிவ் வருமானத்திற்காக பரிசீலிக்க ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "ஒரு பயனர், முடிவடையும் டொமைன் பெயர்களைப் பயன்படுத்தி SEO ஸ்பாம் வலைத்தளங்கள் மூலம் பாசிவ் வருமானத்தை உருவாக்கி, ஆண்டுக்கு சுமார் $30k சம்பாதிப்பதாக, நெறிமுறைக் கவலைகள் மற்றும் கூகிளின் இறுதியில் நடவடிக்கை எடுப்பதைப் பொருட்படுத்தாமல் விவரித்தார்.",
      "TEXT: இந்த பதிவு, சில பயனர்கள் உண்மையில் பாசிவ் வருமானத்தை விட ஒரு வணிகத்தை நடத்துவது போன்றது என்று வாதிடுவதால், பாசிவ் வருமானம் குறித்த விவாதத்தை தூண்டியது. TEXT:",
      "TEXT: பங்கேற்பாளர்கள் பக்கத் திட்டங்களில் அனுபவங்களையும் சவால்களையும் பகிர்ந்து கொண்டனர், நேரம், பொறுமை மற்றும் மூலோபாய திட்டமிடலின் முக்கியத்துவத்தை வலியுறுத்தினர்."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "ஸ்பெயின், ஐரோப்பிய ஒன்றியத்திற்கு வெளியே உள்ள குடியிருப்பாளர்களால் வாங்கப்படும் வீடுகளுக்கு 100% வரி விதிக்க முன்மொழிகிறது",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "ஸ்பெயின், வீட்டு வசதி நெருக்கடியை சமாளிக்கவும், ஊக வணிகத்தை கட்டுப்படுத்தவும் நோக்கி, ஐரோப்பிய ஒன்றியத்திற்கு வெளியே உள்ள குடியிருப்பாளர்களால் செய்யப்படும் நில விற்பனை வாங்குதல்களுக்கு 100% வரி விதிப்பதை பரிசீலிக்கிறது.",
      "பிரதமர் பெட்ரோ சாஞ்சஸ் முன்மொழிந்த திட்டம் சமூக வீடுகளை விரிவுபடுத்துவதையும், வீட்டு விலை மற்றும் வருமானங்களுக்கிடையேயான வேறுபாட்டை சமாளிக்க சுற்றுலா வாடகைகளை ஒழுங்குபடுத்துவதையும் உள்ளடக்கியது.",
      "தமிழில் எழுத வேண்டும். சில பகுப்பாய்வாளர்கள் இதை ஒரு உறுதியான சட்ட மாற்றமாக அல்லாமல், வெளிநாட்டு முதலீட்டாளர்களுக்கு தடையாகக் காண்கிறார்கள் என்பதால், அந்த முன்மொழிவின் சட்டமாக்கலின் எதிர்காலம் நிச்சயமற்றதாக உள்ளது."
    ],
    "commentSummary": [
      "ஸ்பெயின், இல்லத்திற்கான விலை ஏற்றத்தை சமாளிக்க, ஐரோப்பிய ஒன்றியத்திற்கு வெளியே உள்ள குடியிருப்பாளர்களால் வாங்கப்படும் வீடுகளுக்கு 100% வரி விதிக்க பரிசீலிக்கிறது. - விமர்சகர்கள், வெளிநாட்டு வாங்குபவர்கள் இல்லத்திற்கான விலை உயர்வின் முதன்மை காரணம் அல்ல என்று கூறி, மந்தமான நிர்வாகம் மற்றும் மண்டல சட்டங்கள் போன்றவை முக்கியமான காரணிகள் எனக் குறிப்பிடுகின்றனர். - இந்த முன்மொழிவு, வீட்டு சந்தைகளில் வெளிநாட்டு சொந்தக்காரர்களின் பங்கு மற்றும் விலை ஏற்றத்தை தீர்க்க அதன் பயன்தன்மை குறித்து விவாதத்தை தூண்டியுள்ளது."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "ஆப்பிள் விரைவில் TSMC இன் அரிசோனா தொழிற்சாலையில் இருந்து 'அமெரிக்காவில் தயாரிக்கப்பட்ட' சிப்களை பெறும்",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "உரை: ஆப்பிள் TSMC இன் அரிசோனா தொழிற்சாலையில் இருந்து செயலிகளை சோதித்து வருகிறது, முதல் காலாண்டிற்குள் பெருமளவில் உற்பத்தி செய்ய திட்டமிட்டுள்ளது, இது உள்ளூர் தயாரிக்கப்பட்ட சிப்களுக்கான TSMC இன் முதல் அமெரிக்க வாடிக்கையாளராக ஆப்பிள் மாறக்கூடும். - இந்த முயற்சி அமெரிக்காவின் சிலிகான் சுயாதீனத்தை வலுப்படுத்துவதற்காக, புவியியல் மற்றும் இயற்கை அபாயங்களுக்கு ஆளாகக்கூடிய தைவானின் மீது சார்பை குறைப்பதற்காக மேற்கொள்ளப்படுகிறது. - TSMC இன் அரிசோனா தொழிற்சாலை மேம்பட்ட 3nm மற்றும் 2nm சிப்களை தயாரிக்க அமைக்கப்பட்டுள்ளது, உள்ளூர் ஆட்சேர்ப்பு மற்றும் அமெரிக்க பல்கலைக்கழகங்களுடன் கூட்டாண்மைகளை மேம்படுத்தும் முயற்சிகள் நடைபெற்று வருகின்றன, ஆனால் பேக்கேஜிங் ஆரம்பத்தில் தைவானில் நடைபெறும், பியோரியா தொழிற்சாலை செயல்பாட்டுக்கு வரும்வரை."
    ],
    "commentSummary": [
      "உரை: ஆப்பிள் TSMC இன் அரிசோனா ஆலையிலிருந்து சிப்களைப் பெறும், ஆனால் போதுமான அமெரிக்க வசதிகள் இல்லாததால் அவற்றை திருப்பி தைவானுக்கு அனுப்பி மூடுவதற்குத் தேவையாகிறது. - அரிசோனா ஆலையில் பணிபுரியும் பணியாளர்களில் 50% க்கும் மேற்பட்டோர் தைவானிலிருந்து வந்தவர்கள், இது அமெரிக்காவின் STEM (அறிவியல், தொழில்நுட்பம், பொறியியல் மற்றும் கணிதம்) துறையில் ஒரு இடைவெளியைக் குறிக்கிறது. - அமெரிக்க அரைக்கட்டமைப்பு உற்பத்தியை மேம்படுத்தும் நோக்கில் CHIPS சட்டம் முயற்சி சவால்களை எதிர்கொள்கிறது, ஏனெனில் \"அமெரிக்காவில் தயாரிக்கப்பட்டது\" என்ற லேபிள் கேள்விக்குறியாகிறது, மூடுதல் செயல்முறை தைவானில் நடைபெறுவதால், 2027 ஆம் ஆண்டுக்குள் அமெரிக்க மூடுதல் திறன்களை உருவாக்கும் திட்டங்களுடன்."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "மெருகூட்டல் கட்டணம் செயல்படுத்தப்பட்ட பிறகு மான்ஹாட்டன் சாலைகளில் 43,000 ஓட்டுநர்கள் குறைந்துள்ளனர்",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "கூட்ட நெரிசல் விலை நிர்ணயம் செயல்படுத்தப்பட்ட பிறகு, 60வது தெருவுக்கு கீழே மான்ஹாட்டனில் நுழையும் வாகன ஓட்டிகளின் எண்ணிக்கை 7.5% குறைந்தது, இது வாரத்தின் ஒவ்வொரு வேலை நாளிலும் 43,000 வாகன ஓட்டிகள் குறைவாக உள்ளனர் என்பதற்கு சமமாகும்.",
      "பேருந்து போக்குவரத்து குறைந்ததன் காரணமாக போக்குவரத்து ஓட்டம் மேம்பட்டுள்ளது மற்றும் பேருந்து வேகங்கள் அதிகரித்துள்ளன, சில விரைவு பேருந்துகளில் பயணிகள் எண்ணிக்கை அதிகரித்துள்ளது.",
      "மெட்ரோபாலிடன் போக்குவரத்து ஆணையம் (MTA) ஆண்டுக்கு $500 மில்லியன் என மதிப்பிடப்பட்ட சுங்க வருவாயை, சில அரசியல் எதிர்ப்புகள் இருந்தபோதிலும், போக்குவரத்து மேம்பாடுகளுக்காக பயன்படுத்துகிறது."
    ],
    "commentSummary": [
      "மஹாட்டனில் நெரிசல் கட்டணத்தை நடைமுறைப்படுத்துவதன் மூலம் 43,000 கார் ஓட்டிகள் குறைந்துள்ளனர், இது பேருந்து வேகங்களை அதிகரிக்கவும், அவசர சேவை நேரங்களை மேம்படுத்தவும் வழிவகுக்கிறது.",
      "கொள்கை போக்குவரத்து நெரிசலை குறைத்து காற்றின் தரத்தை மேம்படுத்த வடிவமைக்கப்பட்டுள்ளது, ஆனால் இது குறைந்த வருமானம் கொண்ட நபர்களின் மீது அதன் தாக்கம் குறித்து விவாதத்தை ஏற்படுத்தியுள்ளது.",
      "ஆதரவாளர்கள், அதிக செயல்திறன் கொண்ட பொது போக்குவரத்து மற்றும் சுத்தமான காற்று போன்ற நன்மைகளை உள்ளடக்கியதாக வாதிடுகின்றனர், அதே நேரத்தில் இவை சாரதிகளின் தேவைகளுடன் சமநிலைப்படுத்துவது பற்றிய விவாதங்கள் தொடர்கின்றன."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
