[
  {
    "id": 42690473,
    "title": "„Badacz ds. bezpieczeństwa z firmy Snyk wdraża złośliwe pakiety NPM, które są wymierzone w cursor.com”",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "„Badacz ds. bezpieczeństwa z firmy Snyk opublikował złośliwe pakiety NPM, które były wymierzone w Cursor.com, firmę zajmującą się kodowaniem AI, w celu zbierania danych systemowych i wysyłania ich do usługi kontrolowanej przez atakującego.”",
      "„Pakiety, zidentyfikowane jako „cursor-retrieval”, „cursor-always-local” i „cursor-shadow-workspace”, zostały oznaczone przez skaner analizy pakietów OpenSSF, co skutkowało wydaniem ostrzeżeń MAL-2025-27, MAL-2025-28 i MAL-2025-29.”",
      "„Ten incydent podkreśla znaczenie dokładnego sprawdzania pakietów NPM przed instalacją, aby uniknąć potencjalnych zagrożeń bezpieczeństwa.”"
    ],
    "commentSummary": [
      "„Badacz bezpieczeństwa z firmy Snyk opublikował złośliwe pakiety NPM (Node Package Manager) skierowane na cursor.com, podkreślając podatności związane z zamieszaniem w zależnościach. - Incydent wywołał debatę na temat etyki badań bezpieczeństwa, szczególnie w kontekście publicznego ujawniania zmiennych środowiskowych. - Cursor.com wyjaśniło, że nie autoryzowali tego działania, a Snyk przeprosił, podkreślając wyzwania związane z równoważeniem ofensywnych badań bezpieczeństwa z normami etycznymi.”"
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "„Przeszedłem na Firefox i nigdy nie oglądałem się za siebie”",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "„Firefox jest chwalony za doskonałe zarządzanie kartami, wbudowaną funkcję Pocket do zapisywania linków oraz skoncentrowany na prywatności przekaźnik e-mail, co czyni go silną alternatywą dla Chrome. - Dodatkowe funkcje, takie jak przyjazne dla użytkownika narzędzie do zrzutów ekranu, przycisk ChatGPT, tryb Picture-in-Picture, konfigurowalne opcje wyszukiwania i płynne przewijanie, poprawiają wrażenia z przeglądania. - Chociaż Firefox nie ma funkcji aplikacji internetowych Chrome, jego przemyślany design i zmniejszone zapotrzebowanie na zasoby sprawiają, że jest preferowanym wyborem dla niektórych użytkowników.”"
    ],
    "commentSummary": [
      "„Użytkownicy Firefoksa napotykają trudności ze strony platform takich jak YouTube, które mogą celowo pogarszać doświadczenie dla przeglądarek innych niż Google lub użytkowników korzystających z blokad reklam. - Ten trend budzi obawy dotyczące autonomii użytkowników, ponieważ karze tych, którzy wybierają internet bez reklam i nadzoru. - Firefox oferuje unikalne funkcje, takie jak karty kontenerowe, które zwiększają prywatność i użyteczność, czyniąc go ulubionym wyborem dla użytkowników poszukujących niezależności od przeglądarek kontrolowanych przez duże korporacje.”"
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "„Dyrektor generalny Sonos rezygnuje po fiasku aktualizacji aplikacji”",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„CEO firmy Sonos zrezygnował po kontrowersyjnej aktualizacji aplikacji, która wymagała od użytkowników wymiany kosztownych systemów dźwiękowych, co spowodowało niezadowolenie klientów. - Aktualizacja wprowadziła system oparty na chmurze, odchodząc od niezawodnego Universal Plug and Play (UPnP), co doprowadziło do problemów z łącznością i zwiększonej złożoności. - Ta sytuacja podkreśla konflikt między strategiami biznesowymi a utrzymaniem zaufania klientów, gdy CEO przechodzi do roli doradczej z pakietem odprawowym.”"
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "„W brzuchu MrBeast”",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Esej bada, w jaki sposób algorytm YouTube wpływa na tworzenie treści, używając MrBeast jako studium przypadku, podkreślając przesunięcie w kierunku treści napędzanych zaangażowaniem, a nie znaczących. - Omawia szersze implikacje dla edukacji medialnej i wpływ kulturowy platform takich jak YouTube i TikTok, sugerując trend w kierunku powierzchownych i reakcyjnych treści. - Rozważane są różne perspektywy na temat roli algorytmów w kształtowaniu treści oraz wpływu popularnych twórców na normy kulturowe.”"
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "„Operacje Git na GitHubie są niedostępne”",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "„GitHub doświadczył awarii operacji Git 13 stycznia 2025 roku z powodu zmiany konfiguracji wpływającej na wewnętrzny load balancer, trwającej od 23:35 do 00:24 UTC. - Problem został rozwiązany poprzez cofnięcie zmiany konfiguracji, a GitHub pracuje nad poprawą procesów monitorowania i wdrażania, aby zapobiec podobnym incydentom. - Awaria wpłynęła również na usługi GitHub Actions i Pages, co podkreśla wzajemne powiązania ich usług platformowych.”"
    ],
    "commentSummary": [
      "„GitHub doświadczył poważnej awarii wpływającej na operacje git, co spowodowało zamieszanie wśród deweloperów, którzy początkowo podejrzewali problemy z kluczami SSH lub lokalnymi konfiguracjami. - Incydent ten podkreślił wyzwania związane z poleganiem na scentralizowanych usługach, wywołując dyskusje na temat zalet hostingu własnego i systemów zdecentralizowanych. - Chociaż problem został rozwiązany, uwydatnił obawy dotyczące niezawodności GitHub i ryzyka związanego z poleganiem na platformach zewnętrznych do wykonywania kluczowych zadań.”"
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "„ZFS 2.3 wydany z rozszerzeniem ZFS raidz”",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "„OpenZFS 2.3.0 został wydany, wprowadzając znaczące funkcje, takie jak rozszerzenie RAIDZ, szybka deduplikacja, bezpośrednie wejście/wyjście, wyjście w formacie JSON oraz obsługa długich nazw plików. - Wydanie zawiera istotne poprawki błędów i ulepszenia wydajności, kompatybilne z jądrami Linuxa 4.18 - 6.12 oraz wersjami FreeBSD 13.3, 14.0 - 14.2. - Aktualizacja jest wynikiem współpracy 134 współtwórców, z dostępną obszerną dokumentacją i dziennikiem zmian do wglądu.”"
    ],
    "commentSummary": [
      "„ZFS 2.3 został wydany, wprowadzając funkcje takie jak rozszerzenie RAIDZ, szybka deduplikacja, bezpośrednie IO, wyjście JSON i obsługa długich nazw plików. - Rozszerzenie RAIDZ jest szczególnie godne uwagi, ponieważ pozwala użytkownikom na dodawanie nowych urządzeń do istniejącej puli RAIDZ bez przestojów, zwiększając pojemność magazynową. - Wydanie to jest uważane za znaczący postęp dla użytkowników ZFS, porównywane z innymi systemami plików, takimi jak Btrfs i Windows Storage Spaces, pomimo pewnych ograniczeń, takich jak niemożność zmniejszenia puli.”"
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "„Webtop – kontenery Alpine, Ubuntu, Fedora i Arch zawierające pełne środowiska desktopowe”",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "„Linuxserver/webtop dostarcza kontenery oparte na Alpine, Ubuntu, Fedora i Arch z pełnymi środowiskami graficznymi dostępnymi przez przeglądarki internetowe, obsługującymi zarówno architektury x86-64, jak i arm64.”",
      "„Użytkownicy mogą wybierać spośród różnych środowisk pulpitu, takich jak XFCE, KDE, MATE, i3, Openbox i IceWM, używając określonych tagów obrazów, oraz uzyskiwać dostęp do Webtop za pośrednictwem wyznaczonych adresów URL.”",
      "„Funkcje zabezpieczeń obejmują opcję seccomp Dockera i konfigurację uwierzytelniania, z możliwością dostosowania poprzez zmienne środowiskowe oraz wsparcie dla akceleracji GPU z użyciem sterowników open-source.”"
    ],
    "commentSummary": [
      "„Webtop dostarcza kontenery z pełnymi środowiskami desktopowymi dla Alpine, Ubuntu, Fedora i Arch, odpowiednie do szybkich konfiguracji za VPN.”",
      "„Użytkownicy chwalą Webtop za jego szybkość i łatwość obsługi, szczególnie w połączeniu z kontenerem Gluetun dla bezpiecznych połączeń, ale ostrzegają przed wystawianiem kontenerów na internet bez środków bezpieczeństwa z powodu braku domyślnego uwierzytelniania.”",
      "„Projekt jest ceniony za to, że jest open-source i elastyczny, a użytkownicy dzielą się konfiguracjami, a alternatywy takie jak Kasm i Selkies są zauważane w podobnych celach.”"
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "„1 na 5 ofert pracy online jest albo fałszywa, albo nigdy nie zostaje obsadzona, jak wynika z badania”",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "„Niedawne badanie wskazuje, że 20% ofert pracy online jest albo fałszywych, albo pozostaje nieobsadzonych, co zwiększa frustrację osób poszukujących pracy. - Ten trend „widmowych ofert pracy” może być taktyką firm mającą na celu kreowanie wizerunku wzrostu. - Platformy pracy, takie jak Greenhouse i LinkedIn, wprowadziły usługi weryfikacji ofert pracy, aby pomóc użytkownikom w identyfikacji prawdziwych możliwości zatrudnienia.”"
    ],
    "commentSummary": [
      "„Badanie ujawnia, że 20% ofert pracy online jest albo fałszywych, albo pozostaje nieobsadzonych, często z powodu konieczności spełnienia przez firmy amerykańskich przepisów imigracyjnych. - Firmy mogą również pozostawiać oferty pracy, aby znaleźć idealnych kandydatów, zmieniać wymagania lub mieć wcześniej wybranych wewnętrznych kandydatów. - Rynek pracy jest trudny dla aplikantów, którzy często napotykają na brak odpowiedzi i automatyczne odrzucenia, co skłania do wezwania do interwencji regulacyjnej.”"
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "„Uczynienie skrzyżowania niebezpiecznym dla pieszych, aby zaoszczędzić sekundy dla kierowców”",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Debata koncentruje się wokół tego, czy skrzyżowania powinny priorytetowo traktować bezpieczeństwo pieszych czy efektywność kierowców, przy czym niektórzy preferują skrzyżowania z sygnalizacją świetlną i przejścia dla pieszych nad skrzyżowaniami z czterema znakami stopu.”",
      "„Opinie na temat przepisów drogowych i projektowania infrastruktury są różne, a dyskusje dotyczą bezpieczeństwa przechodzenia na czerwonym świetle oraz ryzyka związanego z prawoskrętami na czerwonym świetle.”",
      "„Niektórzy opowiadają się za alternatywnymi rozwiązaniami, takimi jak ronda lub przyjęcie holenderskich standardów inżynierii ruchu drogowego, aby zwiększyć zarówno bezpieczeństwo, jak i efektywność.”"
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "„PostgreSQL jest Systemem Zarządzania Bazą Danych Roku 2024”",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "„PostgreSQL został nagrodzony tytułem DBMS Roku 2024 przez DB-Engines, zdobywając to wyróżnienie po raz piąty, przewyższając 423 inne systemy zarządzania bazami danych.”",
      "„PostgreSQL, z historią sięgającą niemal 35 lat, nadal wprowadza innowacje, co widać w ostatnich usprawnieniach PostgreSQL 17, wydanych we wrześniu 2024 roku.”",
      "„Snowflake i Microsoft zajęły odpowiednio drugie i trzecie miejsce, przy czym Snowflake wyróżnia się magazynowaniem danych w chmurze i wsparciem dla wielu chmur, podczas gdy Microsoft oferuje solidne zarządzane relacyjne bazy danych za pośrednictwem Azure SQL Database i SQL Server.”"
    ],
    "commentSummary": [
      "„PostgreSQL został nagrodzony tytułem Systemu Zarządzania Bazą Danych Roku 2024 przez db-engines.com, co podkreśla jego rosnącą popularność i uznanie w branży.”",
      "„Użytkownicy rozważają przejście z Microsoft SQL Server na PostgreSQL z powodu wysokich kosztów licencji i ograniczeń zasobów, pomimo potencjalnych wyzwań związanych z migracją.”",
      "„PostgreSQL jest ceniony za swoje solidne funkcje i opłacalność, co czyni go preferowanym wyborem dla przyszłych projektów, chociaż niektórzy użytkownicy rozważają alternatywy, takie jak Babelfish, aby obniżyć koszty.”"
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "„Logowanie OAuth Google nie chroni przed zakupem domeny upadłego startupu”",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Dyskusja podkreśla lukę w systemie logowania OAuth Google, gdy domena nieudanej firmy startupowej zostaje przejęta przez nowego właściciela, co potencjalnie umożliwia nieautoryzowany dostęp do usług.”",
      "„Ten problem pojawia się, ponieważ Google może nie rozróżniać między oryginalnymi a nowymi właścicielami domen, co wpływa na każdy system korzystający z uwierzytelniania opartego na domenie.”",
      "„Proponowanym rozwiązaniem jest użycie unikalnych identyfikatorów, które pozostają niezmienne w czasie, chociaż wdrożenie tego rozwiązania różni się w zależności od dostawców tożsamości.”"
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "„Wykorzystywanie umiejętności kodowania do generowania pasywnego dochodu”",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "„Autor przeszedł z roli CTO do solopreneur, z powodzeniem zarabiając więcej dzięki portfolio produktów software'owych.”",
      "„Kluczowe strategie obejmują skupienie się na głębokiej pracy, rozpoczynanie od małych projektów, szybkie iterowanie oraz poświęcanie czasu na działania marketingowe.”",
      "„Podróż podkreśla odporność w obliczu niepewności, ale uwydatnia niezrównaną autonomię i wolność tej ścieżki kariery, zachęcając osoby z umiejętnościami kodowania do rozważenia jej jako źródła pasywnego dochodu.”"
    ],
    "commentSummary": [
      "„Użytkownik opisał generowanie pasywnego dochodu poprzez strony spamowe SEO, wykorzystując wygasające nazwy domen, zarabiając około 30 tys. dolarów rocznie, pomimo obaw etycznych i ostatecznego rozprawienia się Google.”",
      "„Post wywołał debatę na temat dochodu pasywnego, z niektórymi użytkownikami argumentującymi, że jest to bardziej zbliżone do prowadzenia biznesu niż do prawdziwie pasywnych zarobków.”",
      "„Uczestnicy dzielili się doświadczeniami i wyzwaniami związanymi z projektami pobocznymi, podkreślając znaczenie czasu, odporności i strategicznego planowania.”"
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "„Hiszpania proponuje 100% podatek od domów kupowanych przez mieszkańców spoza UE”",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "„Hiszpania rozważa wprowadzenie 100% podatku od zakupu nieruchomości przez mieszkańców spoza UE, mając na celu rozwiązanie kryzysu mieszkaniowego i ograniczenie spekulacyjnych zakupów.”",
      "„Propozycja premiera Pedro Sáncheza obejmuje rozszerzenie zasobów mieszkań socjalnych oraz regulację wynajmu turystycznego w celu rozwiązania problemu dysproporcji między cenami mieszkań a dochodami.”",
      "„Przyszłość propozycji jako prawa jest niepewna, a niektórzy analitycy postrzegają ją jako czynnik odstraszający zagranicznych inwestorów, a nie jako gwarantowaną zmianę legislacyjną.”"
    ],
    "commentSummary": [
      "„Hiszpania rozważa wprowadzenie 100% podatku na domy kupowane przez mieszkańców spoza UE, aby rozwiązać problemy z dostępnością mieszkań. - Krytycy sugerują, że zagraniczni nabywcy nie są główną przyczyną wysokich cen mieszkań, wskazując na powolną biurokrację i przepisy dotyczące zagospodarowania przestrzennego jako bardziej znaczące czynniki. - Propozycja wywołała debatę na temat roli zagranicznej własności na rynkach mieszkaniowych i jej skuteczności w rozwiązywaniu problemów z dostępnością.”"
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "„Apple wkrótce otrzyma 'wyprodukowane w Ameryce' chipy z fabryki TSMC w Arizonie”",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "„Apple testuje procesory z zakładu TSMC w Arizonie, planując masową produkcję do pierwszego kwartału, co może uczynić Apple pierwszym amerykańskim klientem TSMC dla lokalnie produkowanych chipów. - Inicjatywa ta ma na celu wzmocnienie niezależności USA w zakresie produkcji krzemu, zmniejszając zależność od Tajwanu, który jest narażony na ryzyko geopolityczne i naturalne. - Fabryka TSMC w Arizonie ma produkować zaawansowane chipy 3nm i 2nm, z trwającymi wysiłkami na rzecz zwiększenia lokalnej rekrutacji i współpracy z amerykańskimi uniwersytetami, chociaż pakowanie początkowo będzie odbywać się na Tajwanie, dopóki zakład w Peorii nie będzie operacyjny.”"
    ],
    "commentSummary": [
      "„Apple będzie otrzymywać chipy z fabryki TSMC w Arizonie, ale muszą one zostać odesłane do Tajwanu w celu pakowania z powodu niewystarczających amerykańskich obiektów. - Ponad 50% siły roboczej w fabryce w Arizonie pochodzi z Tajwanu, co wskazuje na lukę w amerykańskim sektorze STEM (nauka, technologia, inżynieria i matematyka). - Inicjatywa CHIPS Act, mająca na celu wzmocnienie amerykańskiej produkcji półprzewodników, napotyka wyzwania, ponieważ etykieta „Made in America” jest kwestionowana z powodu procesu pakowania odbywającego się na Tajwanie, z planami na amerykańskie możliwości pakowania do 2027 roku.”"
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "„43 tysiące mniej kierowców na drogach Manhattanu po wprowadzeniu opłat za wjazd do centrum”",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "„Po wprowadzeniu opłat za wjazd do centrum, liczba kierowców wjeżdżających do Manhattanu poniżej 60. ulicy zmniejszyła się o 7,5%, co oznacza 43 000 mniej kierowców każdego dnia roboczego.”",
      "„Zmniejszenie ruchu poprawiło płynność ruchu i zwiększyło prędkości autobusów, a niektóre autobusy ekspresowe odnotowały większą liczbę pasażerów.”",
      "„Metropolitan Transportation Authority (MTA) wykorzystuje wpływy z opłat drogowych, szacowane na 500 milionów dolarów rocznie, na poprawę transportu, pomimo pewnego sprzeciwu politycznego.”"
    ],
    "commentSummary": [
      "„Wprowadzenie opłat za wjazd do zatłoczonych obszarów na Manhattanie spowodowało zmniejszenie liczby kierowców o 43 000, co przyczyniło się do zwiększenia prędkości autobusów i potencjalnie lepszych czasów reakcji służb ratunkowych.”",
      "„Polityka ta ma na celu zmniejszenie zatorów drogowych i poprawę jakości powietrza, choć wywołała debatę na temat jej wpływu na osoby o niższych dochodach.”",
      "„Zwolennicy twierdzą, że korzyści obejmują bardziej efektywny transport publiczny i czystsze powietrze, podczas gdy trwają dyskusje na temat równoważenia tych zalet z potrzebami kierowców.”"
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
