[
  {
    "id": 42690473,
    "title": "„Výskumník bezpečnosti Snyk nasadzuje škodlivé balíky NPM zamerané na cursor.com“",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "„Bezpečnostný výskumník zo spoločnosti Snyk vydal škodlivé NPM balíčky zamerané na Cursor.com, spoločnosť zaoberajúcu sa AI kódovaním, s cieľom zhromažďovať systémové údaje a posielať ich na službu kontrolovanú útočníkom.“",
      "„Balíky, identifikované ako „cursor-retrieval“, „cursor-always-local“ a „cursor-shadow-workspace“, boli označené skenerom analýzy balíkov OpenSSF, čo viedlo k upozorneniam MAL-2025-27, MAL-2025-28 a MAL-2025-29.“",
      "„Tento incident zdôrazňuje dôležitosť dôkladného preskúmania NPM balíkov pred ich inštaláciou, aby sa predišlo potenciálnym bezpečnostným hrozbám.“"
    ],
    "commentSummary": [
      "„Bezpečnostný výskumník zo spoločnosti Snyk zverejnil škodlivé balíčky NPM (Node Package Manager) zamerané na cursor.com, čím poukázal na zraniteľnosti spôsobené zmätkom v závislostiach. - Tento incident vyvolal diskusiu o etike bezpečnostného výskumu, najmä pokiaľ ide o verejné zverejňovanie premenných prostredia. - Cursor.com objasnil, že túto akciu neautorizovali, a Snyk sa odvtedy ospravedlnil, čím zdôraznil výzvy pri vyvažovaní ofenzívneho bezpečnostného výskumu s etickými normami.“"
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "„Prešiel som na Firefox a nikdy som sa neobzrel späť“",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "„Firefox je chválený za svoju vynikajúcu správu kariet, vstavanú funkciu Pocket na ukladanie odkazov a súkromie zameraný emailový relé, čo z neho robí silnú alternatívu k Chrome. - Ďalšie funkcie ako užívateľsky prívetivý nástroj na snímanie obrazovky, tlačidlo ChatGPT, funkcia Obraz v obraze, prispôsobiteľné možnosti vyhľadávania a plynulé posúvanie zlepšujú zážitok z prehliadania. - Aj keď Firefox nemá funkciu webových aplikácií ako Chrome, jeho premyslený dizajn a znížené nároky na zdroje ho robia preferovanou voľbou pre niektorých používateľov.“"
    ],
    "commentSummary": [
      "„Používatelia Firefoxu čelia výzvam zo strany platforiem ako YouTube, ktoré môžu úmyselne zhoršovať zážitok pre používateľov ne-Google prehliadačov alebo tých, ktorí používajú blokovače reklám. - Tento trend vyvoláva obavy o autonómiu používateľov, pretože penalizuje tých, ktorí sa rozhodnú pre web bez reklám a sledovania. - Firefox ponúka jedinečné funkcie, ako sú kontajnerové karty, ktoré zvyšujú súkromie a použiteľnosť, čo z neho robí obľúbenú voľbu pre používateľov hľadajúcich nezávislosť od veľkých korporátne kontrolovaných prehliadačov.“"
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "„Generálny riaditeľ spoločnosti Sonos odstupuje po fiasku s aktualizáciou aplikácie“",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Generálny riaditeľ spoločnosti Sonos rezignoval po kontroverznej aktualizácii aplikácie, ktorá vyžadovala, aby používatelia nahradili drahé zvukové systémy, čo spôsobilo nespokojnosť zákazníkov. - Aktualizácia zaviedla systém založený na cloude, čím sa vzdialila od spoľahlivého Universal Plug and Play (UPnP), čo viedlo k problémom s pripojením a zvýšenej zložitosti. - Táto situácia zdôrazňuje konflikt medzi obchodnými stratégiami a udržiavaním dôvery zákazníkov, keďže generálny riaditeľ prechádza do poradenskej úlohy s odstupným balíkom.“"
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "„V bruchu MrBeasta“",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Esej skúma, ako YouTube algoritmus ovplyvňuje tvorbu obsahu, pričom ako prípadovú štúdiu používa MrBeasta, a zdôrazňuje posun smerom k obsahu zameranému na zapojenie skôr než na zmysluplný obsah. - Diskutuje o širších dôsledkoch pre mediálnu gramotnosť a kultúrny vplyv platforiem ako YouTube a TikTok, naznačujúc trend smerom k povrchnému a reakčnému obsahu. - Zvažujú sa rôzne perspektívy o úlohe algoritmov pri formovaní obsahu a vplyve populárnych tvorcov na kultúrne normy.“"
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "„Operácie Git na GitHube sú nefunkčné“",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "„GitHub čelil výpadku operácií Git 13. januára 2025 kvôli zmene konfigurácie, ktorá ovplyvnila interný vyvažovač záťaže, a trval od 23:35 do 00:24 UTC. - Problém bol vyriešený návratom k pôvodnej konfigurácii a GitHub pracuje na zlepšení monitorovacích a nasadzovacích procesov, aby sa predišlo podobným incidentom. - Výpadok tiež ovplyvnil služby GitHub Actions a Pages, čo poukazuje na prepojenú povahu ich platformových služieb.“"
    ],
    "commentSummary": [
      "„GitHub čelil veľkému výpadku, ktorý ovplyvnil git operácie, čo viedlo k zmätku medzi vývojármi, ktorí spočiatku podozrievali problémy so svojimi SSH kľúčmi alebo lokálnymi konfiguráciami. - Incident zdôraznil výzvy spojené so spoliehaním sa na centralizované služby, čo podnietilo diskusie o výhodách samohostovania a decentralizovaných systémov. - Hoci bol problém vyriešený, poukázal na obavy o spoľahlivosť GitHubu a riziká spoliehania sa na platformy tretích strán pre základné úlohy.“"
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "„ZFS 2.3 vydaný s rozšírením ZFS raidz“",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "„OpenZFS 2.3.0 bol vydaný a prináša významné funkcie ako rozšírenie RAIDZ, rýchlu deduplikáciu, priamy vstup/výstup, výstup vo formáte JSON a podporu pre dlhé názvy súborov. - Vydanie zahŕňa dôležité opravy chýb a vylepšenia výkonu, kompatibilné s jadrami Linuxu 4.18 - 6.12 a verziami FreeBSD 13.3, 14.0 - 14.2. - Aktualizácia je výsledkom spolupráce 134 prispievateľov, s dostupnou komplexnou dokumentáciou a záznamom zmien na preštudovanie.“"
    ],
    "commentSummary": [
      "„ZFS 2.3 bol vydaný, prinášajúc funkcie ako rozšírenie RAIDZ, rýchlu deduplikáciu, priamy IO, výstup v JSON a podporu pre dlhé názvy súborov. - Rozšírenie RAIDZ je obzvlášť pozoruhodné, pretože umožňuje používateľom pridávať nové zariadenia do existujúceho RAIDZ poolu bez prestojov, čím zvyšuje kapacitu úložiska. - Vydanie je považované za významný pokrok pre používateľov ZFS, pričom sa porovnáva s inými súborovými systémami ako Btrfs a Windows Storage Spaces, napriek niektorým obmedzeniam, ako je neschopnosť zmenšiť pooly.“"
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "„Webtop – kontajnery Alpine, Ubuntu, Fedora a Arch obsahujúce plné desktopové prostredia“",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "„Linuxserver/webtop poskytuje kontajnery založené na Alpine, Ubuntu, Fedora a Arch s plnými desktopovými prostrediami prístupnými cez webové prehliadače, podporujúcimi architektúry x86-64 aj arm64.“",
      "„Používatelia si môžu vybrať z rôznych desktopových prostredí, ako sú XFCE, KDE, MATE, i3, Openbox a IceWM, pomocou špecifických značiek obrázkov a pristupovať k Webtopu prostredníctvom určených URL adries.“",
      "„Bezpečnostné funkcie zahŕňajú možnosť seccomp v Dockeri a nastavenie autentifikácie, s možnosťami prispôsobenia prostredníctvom premenných prostredia a podporou akcelerácie GPU s open-source ovládačmi.“"
    ],
    "commentSummary": [
      "„Webtop poskytuje kontajnery s plnými desktopovými prostrediami pre Alpine, Ubuntu, Fedora a Arch, vhodné pre rýchle nastavenia za VPN.“",
      "„Používatelia chvália Webtop za jeho rýchlosť a jednoduchosť použitia, najmä keď sa používa s kontajnerom Gluetun pre zabezpečené pripojenia, ale varujú pred vystavením kontajnerov internetu bez bezpečnostných opatrení kvôli absencii predvolenej autentifikácie.“",
      "„Projekt je cenený za to, že je open-source a flexibilný, pričom používatelia zdieľajú konfigurácie, a alternatívy ako Kasm a Selkies sú známe pre podobné účely.“"
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "„1 z 5 online pracovných ponúk je buď falošná, alebo nikdy nie je obsadená, zistila štúdia“",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "„Nedávna štúdia naznačuje, že 20 % online pracovných ponúk je buď falošných, alebo zostáva neobsadených, čo pridáva k frustrácii uchádzačov o zamestnanie. - Tento trend „duchovných pracovných miest“ môže byť taktikou spoločností na projekciu obrazu rastu. - Pracovné platformy ako Greenhouse a LinkedIn zaviedli služby overovania pracovných miest, aby pomohli používateľom identifikovať skutočné pracovné príležitosti.“"
    ],
    "commentSummary": [
      "„Štúdia odhaľuje, že 20 % online pracovných ponúk je buď falošných, alebo zostáva neobsadených, často kvôli tomu, že spoločnosti musia dodržiavať imigračné politiky USA. - Spoločnosti môžu tiež ponechať pracovné ponuky zverejnené, aby našli ideálnych kandidátov, zmenili požiadavky alebo mali vopred vybraných interných kandidátov. - Trh práce je pre uchádzačov náročný, často sa stretávajú s ignorovaním a automatizovanými odmietnutiami, čo vyvoláva výzvy na regulačné zásahy.“"
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "„Urobiť križovatku nebezpečnou pre chodcov, aby sa ušetrili sekundy pre vodičov“",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Debata sa sústreďuje na to, či by križovatky mali uprednostňovať bezpečnosť chodcov alebo efektívnosť vodičov, pričom niektorí uprednostňujú svetelne riadené križovatky a prechody pre chodcov pred štvorcestnými zastaveniami.“",
      "„Názory na dopravné zákony a návrh infraštruktúry sa líšia, pričom sa diskutuje o bezpečnosti prechádzania mimo priechodu a rizikách spojených s odbočovaním doprava na červenú.“",
      "„Niektorí obhajujú alternatívne riešenia, ako sú kruhové objazdy alebo prijatie holandských štandardov dopravného inžinierstva na zvýšenie bezpečnosti a efektívnosti.“"
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "„PostgreSQL je systém na správu databáz roka 2024“",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "„PostgreSQL získal ocenenie DBMS roka 2024 od DB-Engines, čím dosiahol toto uznanie už piatykrát, prekonávajúc 423 ďalších systémov na správu databáz.“",
      "„PostgreSQL, s históriou trvajúcou takmer 35 rokov, naďalej inovuje, čo je vidieť na nedávnych vylepšeniach PostgreSQL 17, vydaných v septembri 2024.“",
      "„Snowflake a Microsoft si zabezpečili druhé a tretie miesto, pričom Snowflake je známy svojím cloudovým dátovým skladovaním a podporou viacerých cloudov, zatiaľ čo Microsoft ponúka robustné spravované relačné databázy prostredníctvom Azure SQL Database a SQL Server.“"
    ],
    "commentSummary": [
      "„PostgreSQL bol ocenený ako Systém na správu databáz roka 2024 podľa db-engines.com, čo zdôrazňuje jeho rastúcu popularitu a uznanie v priemysle.“",
      "„Používatelia zvažujú prechod z Microsoft SQL Server na PostgreSQL kvôli vysokým licenčným nákladom a obmedzeniam zdrojov, napriek potenciálnym výzvam pri migrácii.“",
      "„PostgreSQL je obľúbený pre svoje robustné funkcie a nákladovú efektívnosť, čo z neho robí preferovanú voľbu pre budúce projekty, hoci niektorí používatelia skúmajú alternatívy ako Babelfish na zníženie nákladov.“"
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "„Google OAuth prihlásenie nechráni pred kúpou domény neúspešného startupu“",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Diskusia poukazuje na zraniteľnosť v systéme prihlásenia Google OAuth, keď doménu neúspešného startupu získa nový vlastník, čo môže potenciálne umožniť neoprávnený prístup k službám.“",
      "„Tento problém vzniká, pretože Google nemusí rozlišovať medzi pôvodnými a novými vlastníkmi domény, čo ovplyvňuje akýkoľvek systém, ktorý používa autentifikáciu založenú na doméne.“",
      "„Navrhovaným riešením je použitie jedinečných identifikátorov, ktoré zostávajú konštantné v priebehu času, hoci implementácia tohto riešenia sa líši medzi poskytovateľmi identity.“"
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "„Používanie programovacích zručností na vytváranie pasívneho príjmu“",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "„Autor prešiel z pozície CTO na solopodnikateľa a úspešne zarába viac prostredníctvom portfólia softvérových produktov.“",
      "„Kľúčové stratégie zahŕňajú zameranie sa na hlbokú prácu, začínanie s malými projektmi, rýchle iterovanie a venovanie času marketingovým aktivitám.“",
      "„Cesta zdôrazňuje odolnosť kvôli neistotám, ale vyzdvihuje neprekonateľnú autonómiu a slobodu tejto kariérnej cesty, čím povzbudzuje tých, ktorí majú zručnosti v kódovaní, aby ju zvážili ako pasívny príjem.“"
    ],
    "commentSummary": [
      "„Používateľ opísal generovanie pasívneho príjmu prostredníctvom SEO spamových webových stránok pomocou expirovaných doménových mien, pričom zarábal približne 30 tisíc dolárov ročne, napriek etickým obavám a následnému zásahu zo strany Googlu.“",
      "„Príspevok vyvolal diskusiu o pasívnom príjme, pričom niektorí používatelia tvrdili, že je to skôr podobné vedeniu podnikania než skutočne pasívnym zárobkom.“",
      "„Účastníci sa podelili o skúsenosti a výzvy v bočných projektoch, pričom zdôraznili dôležitosť času, odolnosti a strategického plánovania.“"
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "„Španielsko navrhuje 100% daň na domy kúpené obyvateľmi mimo EÚ“",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "„Španielsko zvažuje 100% daň na nákupy nehnuteľností obyvateľmi mimo EÚ, s cieľom riešiť krízu bývania a obmedziť špekulatívne nákupy.“",
      "„Návrh premiéra Pedra Sáncheza zahŕňa rozšírenie sociálneho bývania a reguláciu turistických prenájmov na riešenie rozdielu medzi cenami bývania a príjmami.“",
      "„Budúcnosť návrhu ako zákona je neistá, pričom niektorí analytici ho vnímajú skôr ako odstrašujúci prostriedok pre zahraničných investorov než ako zaručenú legislatívnu zmenu.“"
    ],
    "commentSummary": [
      "„Španielsko zvažuje 100% daň na domy kúpené obyvateľmi mimo EÚ, aby riešilo problémy s dostupnosťou bývania. - Kritici naznačujú, že zahraniční kupci nie sú hlavnou príčinou vysokých cien bývania, pričom ako významnejšie faktory uvádzajú pomalú byrokraciu a územné zákony. - Návrh vyvolal diskusiu o úlohe zahraničného vlastníctva na trhoch s bývaním a jeho účinnosti pri riešení problémov s dostupnosťou.“"
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "„Apple čoskoro dostane čipy 'vyrobené v Amerike' z továrne TSMC v Arizone“",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "„Apple testuje procesory z arizonského závodu TSMC s plánmi na hromadnú výrobu do prvého štvrťroka, pričom by sa mohol stať prvým americkým zákazníkom TSMC pre lokálne vyrábané čipy. - Táto iniciatíva má za cieľ posilniť americkú nezávislosť na silikóne, čím sa zníži závislosť na Taiwane, ktorý je zraniteľný voči geopolitickým a prírodným rizikám. - Arizonská továreň TSMC má vyrábať pokročilé 3nm a 2nm čipy, pričom prebiehajú snahy o zlepšenie miestneho náboru a partnerstiev s americkými univerzitami, hoci balenie sa spočiatku bude vykonávať na Taiwane, kým nebude prevádzková továreň v Peorii.“"
    ],
    "commentSummary": [
      "„Apple dostane čipy z arizonskej továrne TSMC, ale musia byť poslané späť na Taiwan na balenie kvôli nedostatočným zariadeniam v USA. - Viac ako 50 % pracovnej sily v arizonskej továrni pochádza z Taiwanu, čo naznačuje medzeru v oblasti STEM (veda, technológia, inžinierstvo a matematika) v USA. - Iniciatíva CHIPS Act, zameraná na posilnenie výroby polovodičov v USA, čelí výzvam, pretože označenie „Vyrobené v Amerike“ je spochybňované kvôli procesu balenia prebiehajúcemu na Taiwane, s plánmi na americké baliace kapacity do roku 2027.“"
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "„O 43 tisíc menej vodičov na cestách v Manhattane po zavedení poplatkov za preťaženie dopravy“",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "„Po zavedení poplatkov za preťaženie došlo k zníženiu počtu vodičov vstupujúcich do Manhattanu pod 60. ulicou o 7,5 %, čo predstavuje o 43 000 menej vodičov každý pracovný deň.“",
      "„Zníženie premávky zlepšilo plynulosť dopravy a zvýšilo rýchlosť autobusov, pričom niektoré expresné autobusy zaznamenali vyšší počet cestujúcich.“",
      "„Metropolitný dopravný úrad (MTA) využíva príjmy z mýta, odhadované na 500 miliónov dolárov ročne, na zlepšenie dopravy, napriek určitému politickému odporu.“"
    ],
    "commentSummary": [
      "„Zavedenie poplatkov za preťaženie dopravy na Manhattane viedlo k zníženiu počtu vodičov o 43 000, čo viedlo k zvýšeniu rýchlosti autobusov a potenciálne lepším časom reakcie záchranných služieb.“",
      "„Politika je navrhnutá tak, aby znížila dopravné zápchy a zlepšila kvalitu ovzdušia, hoci vyvolala diskusiu o jej dopade na osoby s nižšími príjmami.“",
      "„Zástancovia tvrdia, že výhody zahŕňajú efektívnejšiu verejnú dopravu a čistejší vzduch, zatiaľ čo diskusie pokračujú o vyvážení týchto výhod s potrebami vodičov.“"
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
