[
  {
    "id": 42690473,
    "title": "Bir Snyk güvenlik araştırmacısı, cursor.com'u hedef alan kötü niyetli NPM paketleri dağıtıyor.",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "Bir Snyk güvenlik araştırmacısı, sistem verilerini toplamak ve saldırgan kontrolündeki bir hizmete göndermek amacıyla, bir yapay zeka kodlama şirketi olan Cursor.com'u hedef alan kötü niyetli NPM paketleri yayımladı.",
      "Bu paketler, \"cursor-retrieval,\" \"cursor-always-local\" ve \"cursor-shadow-workspace\" olarak tanımlandı ve OpenSSF paket analiz tarayıcısı tarafından işaretlenerek MAL-2025-27, MAL-2025-28 ve MAL-2025-29 uyarılarına yol açtı.",
      "Bu olay, potansiyel güvenlik tehditlerinden kaçınmak için NPM paketlerini yüklemeden önce dikkatlice incelemenin önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "Snyk güvenlik araştırmacısı, cursor.com'u hedef alan kötü amaçlı NPM (Node Package Manager) paketlerini yayınlayarak bağımlılık karışıklığı açıklarını vurguladı. - Olay, özellikle ortam değişkenlerinin kamuya açıklanması konusunda güvenlik araştırmalarının etiği üzerine bir tartışma başlattı. - Cursor.com, bu eylemi yetkilendirmediklerini açıkladı ve Snyk, saldırgan güvenlik araştırmalarını etik standartlarla dengelemenin zorluklarını vurgulayarak özür diledi."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "Firefox'a Geçtim ve Bir Daha Asla Geriye Bakmadım",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "Firefox, üstün sekme yönetimi, bağlantıları kaydetmek için yerleşik Pocket özelliği ve gizlilik odaklı e-posta yönlendirmesi ile övülmekte olup, Chrome'a güçlü bir alternatif oluşturmaktadır. - Kullanıcı dostu ekran görüntüsü aracı, ChatGPT düğmesi, Resim içinde Resim, özelleştirilebilir arama seçenekleri ve akıcı kaydırma gibi ek özellikler, gezinme deneyimini geliştirmektedir. - Firefox, Chrome'un web uygulama özelliğinden yoksun olsa da, düşünceli tasarımı ve azaltılmış kaynak talepleri, bazı kullanıcılar için tercih edilen bir seçenek haline getirmektedir."
    ],
    "commentSummary": [
      "Firefox kullanıcıları, YouTube gibi platformlardan, özellikle Google dışı tarayıcılar veya reklam engelleyiciler kullanan kullanıcılar için deneyimi kasıtlı olarak kötüleştirebilecek zorluklarla karşı karşıya kalıyor. - Bu eğilim, reklamsız ve gözetimsiz bir web deneyimi tercih edenleri cezalandırdığı için kullanıcı özerkliği konusunda endişeleri artırıyor. - Firefox, gizliliği ve kullanılabilirliği artıran konteyner sekmeleri gibi benzersiz özellikler sunarak, büyük şirketlerin kontrolündeki tarayıcılardan bağımsızlık arayan kullanıcılar için tercih edilen bir seçenek haline geliyor."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "Sonos CEO'su, uygulama güncelleme fiyaskosunun ardından istifa etti",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Sonos CEO'su, kullanıcıların pahalı ses sistemlerini değiştirmesini gerektiren tartışmalı bir uygulama güncellemesinin ardından istifa etti ve bu durum müşteri memnuniyetsizliğine yol açtı. - Güncelleme, güvenilir Universal Plug and Play (UPnP) sisteminden uzaklaşarak bulut tabanlı bir sistem tanıttı ve bu da bağlantı sorunlarına ve artan karmaşıklığa neden oldu. - Bu durum, iş stratejileri ile müşteri güvenini sürdürme arasındaki çatışmayı vurgularken, CEO bir kıdem tazminatı paketi ile danışmanlık rolüne geçiş yapıyor."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "MrBeast'in karnında",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Makale, YouTube'un algoritmasının içerik oluşturmayı nasıl etkilediğini inceliyor ve MrBeast'i bir vaka çalışması olarak kullanarak, anlamlı içerikten ziyade etkileşim odaklı bir kaymaya dikkat çekiyor. - Medya okuryazarlığı ve YouTube ile TikTok gibi platformların kültürel etkileri için daha geniş sonuçları tartışıyor ve yüzeysel ve tepkisel içeriğe doğru bir eğilim öneriyor. - Algoritmaların içeriği şekillendirmedeki rolü ve popüler içerik oluşturucuların kültürel normlar üzerindeki etkisi hakkında çeşitli bakış açıları ele alınıyor."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "GithHub Git İşlemleri Çalışmıyor",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub, 13 Ocak 2025'te, iç yük dengeleyicisini etkileyen bir yapılandırma değişikliği nedeniyle 23:35'ten 00:24 UTC'ye kadar süren bir Git operasyonları kesintisi yaşadı. - Sorun, yapılandırma değişikliğinin geri alınmasıyla çözüldü ve GitHub, benzer olayları önlemek için izleme ve dağıtım süreçlerini iyileştirmeye çalışıyor. - Kesinti, GitHub'ın Actions ve Pages hizmetlerini de etkiledi ve platform hizmetlerinin birbirine bağlı doğasını vurguladı."
    ],
    "commentSummary": [
      "GitHub, git işlemlerini etkileyen büyük bir kesinti yaşadı ve bu durum, başlangıçta SSH anahtarları veya yerel yapılandırmalarla ilgili sorunlar olduğunu düşünen geliştiriciler arasında kafa karışıklığına neden oldu. - Olay, merkezi hizmetlere güvenmenin zorluklarını vurguladı ve kendi kendine barındırma ve merkezi olmayan sistemlerin avantajları üzerine tartışmaları tetikledi. - Sorun çözülmüş olmasına rağmen, GitHub'ın güvenilirliği ve temel görevler için üçüncü taraf platformlara bağımlılığın riskleri konusundaki endişeleri gündeme getirdi."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3, ZFS raidz genişletmesi ile yayınlandı",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0, RAIDZ Genişletme, Hızlı Tekilleştirme, Doğrudan Giriş/Çıkış, JSON çıktısı ve uzun dosya adları desteği gibi önemli özellikler sunarak yayınlandı. - Sürüm, Linux çekirdekleri 4.18 - 6.12 ve FreeBSD sürümleri 13.3, 14.0 - 14.2 ile uyumlu olan temel hata düzeltmeleri ve performans iyileştirmelerini içeriyor. - Güncelleme, 134 katkıda bulunanın işbirliğiyle hazırlandı ve incelenmek üzere kapsamlı bir dokümantasyon ve değişiklik günlüğü mevcut."
    ],
    "commentSummary": [
      "ZFS 2.3, RAIDZ genişletme, hızlı veri tekilleştirme, doğrudan IO, JSON çıktısı ve uzun dosya adları desteği gibi özellikler sunarak piyasaya sürüldü. - RAIDZ genişletme, özellikle dikkat çekicidir çünkü kullanıcıların mevcut bir RAIDZ havuzuna yeni cihazlar eklemesine olanak tanır ve bu da depolama kapasitesini artırırken kesinti süresi olmadan yapılabilir. - Bu sürüm, ZFS kullanıcıları için önemli bir ilerleme olarak kabul edilir ve Btrfs ve Windows Storage Spaces gibi diğer dosya sistemleriyle karşılaştırmalar yapılır, havuzları küçültme yeteneği gibi bazı sınırlamalar olmasına rağmen."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "Webtop – Tam masaüstü ortamları içeren Alpine, Ubuntu, Fedora ve Arch konteynerleri",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop, web tarayıcılar aracılığıyla erişilebilen tam masaüstü ortamları sunan, Alpine, Ubuntu, Fedora ve Arch tabanlı konteynerler sağlar ve hem x86-64 hem de arm64 mimarilerini destekler.",
      "Kullanıcılar, belirli imaj etiketlerini kullanarak XFCE, KDE, MATE, i3, Openbox ve IceWM gibi çeşitli masaüstü ortamlarından seçim yapabilir ve belirlenmiş URL'ler aracılığıyla Webtop'a erişebilirler.",
      "Metin: Güvenlik özellikleri arasında Docker'ın seccomp seçeneği ve kimlik doğrulama kurulumu bulunur, ortam değişkenleri aracılığıyla özelleştirme seçenekleri mevcuttur ve açık kaynak sürücülerle GPU hızlandırma desteği sunulmaktadır."
    ],
    "commentSummary": [
      "Webtop, Alpine, Ubuntu, Fedora ve Arch için tam masaüstü ortamlarına sahip konteynerler sunar ve bir VPN arkasında hızlı kurulumlar için uygundur.",
      "Kullanıcılar, Webtop'un hızını ve kullanım kolaylığını, özellikle güvenli bağlantılar için Gluetun konteyneri ile kullanıldığında övüyorlar, ancak varsayılan kimlik doğrulama eksikliği nedeniyle konteynerleri internete güvenlik önlemleri olmadan açma konusunda uyarıda bulunuyorlar.",
      "Proje, açık kaynaklı ve esnek olması nedeniyle değerli bulunmakta, kullanıcılar yapılandırmaları paylaşmakta ve Kasm ile Selkies gibi alternatifler benzer amaçlar için belirtilmektedir."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "Çalışma, çevrimiçi iş ilanlarının 5'te 1'inin ya sahte olduğunu ya da hiç doldurulmadığını ortaya koyuyor.",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "Son yapılan bir çalışma, çevrimiçi iş ilanlarının %20'sinin ya sahte olduğunu ya da doldurulmadığını, bu durumun iş arayanların hayal kırıklığını artırdığını gösteriyor. - Bu \"hayalet iş\" trendi, şirketlerin büyüme imajı yansıtmak için bir taktik olabilir. - Greenhouse ve LinkedIn gibi iş platformları, kullanıcıların gerçek iş fırsatlarını belirlemelerine yardımcı olmak için iş doğrulama hizmetleri sunmaya başladı."
    ],
    "commentSummary": [
      "Bir çalışma, çevrimiçi iş ilanlarının %20'sinin ya sahte olduğunu ya da doldurulmadığını, bunun genellikle şirketlerin ABD göçmenlik politikalarına uyması gerektiğinden kaynaklandığını ortaya koyuyor. - Şirketler ayrıca ideal adayları bulmak, gereksinimleri değiştirmek veya önceden seçilmiş iç adaylara sahip olmak için iş ilanlarını açık bırakabilir. - İş piyasası, sık sık hayalet muamele ve otomatik reddedilme ile karşılaşan başvuru sahipleri için zordur ve bu durum düzenleyici müdahale çağrılarına yol açmaktadır."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "Yayalar için bir kavşağı güvensiz hale getirerek sürücüler için saniyeler kazanmak",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bu tartışma, kavşakların yaya güvenliğini mi yoksa sürücü verimliliğini mi önceliklendirmesi gerektiği etrafında dönüyor; bazıları ışık kontrollü kavşakları ve yaya geçitlerini 4 yönlü duraklara tercih ediyor.",
      "Fikirler, trafik yasaları ve altyapı tasarımı konusunda farklılık göstermektedir; bu, yaya geçidi olmayan yerlerde karşıdan karşıya geçmenin güvenliği ve kırmızı ışıkta sağa dönüşle ilgili riskler üzerine tartışmaları içermektedir.",
      "Kimileri, hem güvenliği hem de verimliliği artırmak için dönel kavşaklar veya Hollanda trafik mühendisliği standartlarının benimsenmesi gibi alternatif çözümleri savunuyor."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL, 2024 Yılının Veritabanı Yönetim Sistemi oldu.",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL, 423 diğer veritabanı yönetim sistemini geride bırakarak, DB-Engines tarafından 2024 Yılının DBMS'si ödülüne layık görüldü ve bu tanınırlığı beşinci kez elde etti.",
      "PostgreSQL, neredeyse 35 yıllık bir geçmişe sahip olup, Eylül 2024'te piyasaya sürülen PostgreSQL 17'nin son geliştirmelerinde görüldüğü gibi yenilik yapmaya devam ediyor.",
      "Snowflake ve Microsoft sırasıyla ikinci ve üçüncü sırayı aldı; Snowflake bulut tabanlı veri ambarı ve çoklu bulut desteği ile dikkat çekerken, Microsoft Azure SQL Veritabanı ve SQL Server aracılığıyla güçlü yönetilen ilişkisel veritabanları sunuyor."
    ],
    "commentSummary": [
      "PostgreSQL, db-engines.com tarafından 2024 Yılının Veritabanı Yönetim Sistemi ödülüne layık görüldü ve bu, endüstrideki artan popülaritesini ve tanınırlığını vurguluyor.",
      "Kullanıcılar, olası geçiş zorluklarına rağmen yüksek lisans maliyetleri ve kaynak sınırlamaları nedeniyle Microsoft SQL Server'dan PostgreSQL'e geçmeyi düşünüyor.",
      "PostgreSQL, sağlam özellikleri ve maliyet etkinliği nedeniyle gelecekteki projeler için tercih edilen bir seçenek olup, bazı kullanıcılar maliyetleri azaltmak için Babelfish gibi alternatifleri de araştırmaktadır."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "Google’ın OAuth girişi, başarısız bir girişim alan adının satın alınmasına karşı koruma sağlamaz.",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bu tartışma, başarısız bir girişimin alan adının yeni bir sahip tarafından satın alındığında, Google'ın OAuth giriş sisteminde yetkisiz erişime izin verebilecek bir güvenlik açığını vurgulamaktadır.",
      "Bu sorun, Google'ın orijinal ve yeni alan adı sahiplerini ayırt edememesi nedeniyle ortaya çıkar ve alan adı tabanlı kimlik doğrulama kullanan herhangi bir sistemi etkileyebilir.",
      "Önerilen bir çözüm, zamanla sabit kalan benzersiz tanımlayıcılar kullanmaktır, ancak bu çözümün uygulanması kimlik sağlayıcıları arasında farklılık göstermektedir."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "Pasif gelir elde etmek için kodlama becerilerini kullanma",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "Yazar, CTO rolünden soloprenörlüğe geçiş yaparak, bir dizi yazılım ürünü aracılığıyla daha fazla kazanç elde etti.",
      "Temel stratejiler arasında derin çalışmaya odaklanmak, küçük projelerle başlamak, hızlı bir şekilde yinelemek ve pazarlama çabalarına zaman ayırmak yer alır.",
      "Yolculuk, belirsizlikler nedeniyle dayanıklılığı vurgularken, bu kariyer yolunun eşsiz özerklik ve özgürlüğünü öne çıkarıyor ve kodlama becerilerine sahip olanları pasif gelir için bunu düşünmeye teşvik ediyor."
    ],
    "commentSummary": [
      "Kullanıcı, etik kaygılara ve Google'ın nihai baskısına rağmen, sona eren alan adlarını kullanarak SEO spam web siteleri aracılığıyla pasif gelir elde etmeyi ve yıllık yaklaşık 30 bin dolar kazanmayı tarif etti.",
      "Bu gönderi, pasif gelir konusunda bir tartışma başlattı ve bazı kullanıcılar bunun gerçekten pasif kazançlardan ziyade bir iş yürütmeye daha çok benzediğini savundu.",
      "Katılımcılar, yan projelerdeki deneyimlerini ve zorluklarını paylaşarak zamanın, dayanıklılığın ve stratejik planlamanın önemini vurguladılar."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "İspanya, AB üyesi olmayan sakinler tarafından satın alınan evlere %100 vergi öneriyor",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "İspanya, konut krizini ele almak ve spekülatif alımları sınırlamak amacıyla AB üyesi olmayan sakinler tarafından yapılan gayrimenkul alımlarına %100 vergi getirmeyi düşünüyor.",
      "Başbakan Pedro Sánchez'in teklifi, konut fiyatları ile gelirler arasındaki eşitsizliği ele almak için sosyal konutların genişletilmesini ve turistik kiralamaların düzenlenmesini içeriyor.",
      "Teklifin yasa olarak geleceği belirsiz, bazı analistler bunu kesin bir yasal değişiklikten ziyade yabancı yatırımcılar için bir caydırıcı olarak görüyor."
    ],
    "commentSummary": [
      "İspanya, konutların uygun fiyatlı olma sorunlarını ele almak için AB dışı sakinler tarafından satın alınan evlere %100 vergi getirmeyi düşünüyor. - Eleştirmenler, yabancı alıcıların yüksek konut fiyatlarının birincil nedeni olmadığını, yavaş bürokrasi ve imar yasalarının daha önemli faktörler olduğunu öne sürüyor. - Öneri, konut piyasalarında yabancı mülkiyetin rolü ve uygun fiyatlılık sorunlarını çözmedeki etkinliği konusunda bir tartışma başlattı."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "Apple yakında TSMC'nin Arizona fabrikasından 'Amerika'da üretilmiş' çipler alacak",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "Apple, TSMC'nin Arizona tesisinden işlemcileri test ediyor ve ilk çeyrekte seri üretime geçmeyi planlıyor, bu da TSMC'nin yerel olarak üretilen çipler için ilk ABD müşterisi olma potansiyelini taşıyor. - Bu girişim, ABD'nin silikon bağımsızlığını güçlendirmeyi, jeopolitik ve doğal risklere karşı savunmasız olan Tayvan'a bağımlılığı azaltmayı amaçlıyor. - TSMC'nin Arizona fabrikası, gelişmiş 3nm ve 2nm çipler üretecek ve yerel işe alım ile ABD üniversiteleriyle ortaklıkları geliştirme çabaları devam ediyor, ancak paketleme başlangıçta Tayvan'da gerçekleşecek ve Peoria tesisi faaliyete geçene kadar bu durum sürecek."
    ],
    "commentSummary": [
      "Apple, TSMC'nin Arizona tesisinden çip alacak, ancak ABD'deki yetersiz tesisler nedeniyle paketleme için Tayvan'a geri gönderilmeleri gerekiyor. - Arizona tesisindeki iş gücünün %50'den fazlası Tayvan'dan, bu da ABD'nin STEM (Bilim, Teknoloji, Mühendislik ve Matematik) alanında bir boşluk olduğunu gösteriyor. - ABD yarı iletken üretimini artırmayı amaçlayan CHIPS Yasası girişimi, paketleme sürecinin Tayvan'da gerçekleşmesi nedeniyle \"Amerika'da Üretildi\" etiketinin sorgulanmasıyla zorluklarla karşılaşıyor, 2027 yılına kadar ABD'de paketleme yetenekleri için planlar yapılıyor."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "Yoğunluk fiyatlandırması devreye girdikten sonra Manhattan yollarında 43 bin daha az sürücü var.",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "Yoğunluk fiyatlandırması uygulandıktan sonra, 60. Cadde'nin altındaki Manhattan'a giren sürücülerde %7,5'lik bir azalma oldu, bu da her hafta içi 43.000 daha az sürücüye eşdeğer.",
      "Trafikteki azalma, trafik akışını iyileştirmiş ve otobüs hızlarını artırmıştır, bazı ekspres otobüsler daha yüksek yolcu sayısı yaşamaktadır.",
      "MTA, bazı siyasi muhalefetlere rağmen, yıllık yaklaşık 500 milyon dolar olarak tahmin edilen geçiş ücreti gelirini ulaşım iyileştirmeleri için kullanıyor."
    ],
    "commentSummary": [
      "Manhattan'da tıkanıklık fiyatlandırmasının uygulanması, 43.000 daha az sürücüye yol açarak otobüs hızlarının artmasına ve potansiyel olarak daha iyi acil durum müdahale sürelerine neden oldu.",
      "Politika, trafik sıkışıklığını azaltmak ve hava kalitesini iyileştirmek için tasarlanmıştır, ancak düşük gelirli bireyler üzerindeki etkisi konusunda tartışmalara yol açmıştır.",
      "Destekleyenler, faydalar arasında daha verimli toplu taşıma ve daha temiz hava olduğunu savunurken, bu avantajların sürücülerin ihtiyaçlarıyla nasıl dengeleneceği konusunda tartışmalar devam ediyor."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
