[
  {
    "id": 42690473,
    "title": "חוקר אבטחה של Snyk מפרסם חבילות NPM זדוניות המכוונות ל-cursor.com",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "חוקר אבטחה של Snyk שחרר חבילות NPM זדוניות המכוונות ל-Cursor.com, חברת קידוד מבוססת בינה מלאכותית, כדי לאסוף נתוני מערכת ולשלוח אותם לשירות בשליטת תוקף.",
      "החבילות, שזוהו כ-\"cursor-retrieval\", \"cursor-always-local\", ו-\"cursor-shadow-workspace\", סומנו על ידי סורק ניתוח החבילות של OpenSSF, מה שהוביל להמלצות MAL-2025-27, MAL-2025-28, ו-MAL-2025-29.",
      "תקלה זו מדגישה את החשיבות של בדיקת חבילות NPM לפני ההתקנה כדי להימנע מאיומי אבטחה פוטנציאליים."
    ],
    "commentSummary": [
      "חוקר אבטחה של Snyk שחרר חבילות NPM (מנהל חבילות Node) זדוניות המכוונות ל-cursor.com, והדגיש פגיעויות של בלבול תלות. - האירוע עורר דיון על האתיקה של מחקר אבטחה, במיוחד בנוגע לחשיפה ציבורית של משתני סביבה. - cursor.com הבהירו שהם לא אישרו את הפעולה, ו-Snyk התנצל מאז, מה שמדגיש את האתגרים באיזון בין מחקר אבטחה התקפי לסטנדרטים אתיים."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "עברתי לפיירפוקס ולעולם לא הבטתי לאחור",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "פיירפוקס זוכה לשבחים על ניהול הלשוניות המעולה שלו, תכונת Pocket המובנית לשמירת קישורים, ושירות דואר אלקטרוני ממוקד פרטיות, מה שהופך אותו לחלופה חזקה לכרום. - תכונות נוספות כמו כלי צילום מסך ידידותי למשתמש, כפתור ChatGPT, תמונה בתוך תמונה, אפשרויות חיפוש מותאמות אישית וגלילה חלקה משפרות את חוויית הגלישה. - למרות שפיירפוקס חסר את תכונת האפליקציות האינטרנטיות של כרום, העיצוב המחושב שלו והדרישות המופחתות למשאבים הופכים אותו לבחירה מועדפת עבור חלק מהמשתמשים."
    ],
    "commentSummary": [
      "משתמשי פיירפוקס מתמודדים עם אתגרים מפלטפורמות כמו יוטיוב, שעשויות להרע בכוונה את החוויה עבור דפדפנים שאינם של גוגל או משתמשים המשתמשים בחוסמי פרסומות. מגמה זו מעוררת דאגות לגבי האוטונומיה של המשתמש, שכן היא מענישה את אלו הבוחרים בחוויית אינטרנט ללא פרסומות וללא מעקב. פיירפוקס מציעה תכונות ייחודיות, כמו כרטיסיות מכולה, המשפרות את הפרטיות והשימושיות, מה שהופך אותה לבחירה מועדפת עבור משתמשים המחפשים עצמאות מדפדפנים הנשלטים על ידי תאגידים גדולים."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "מנכ\"ל סונוס מתפטר לאחר תקרית עדכון האפליקציה",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המנכ\"ל של סונוס התפטר בעקבות עדכון אפליקציה שנוי במחלוקת שדרש מהמשתמשים להחליף מערכות קול יקרות, מה שגרם לאי שביעות רצון בקרב הלקוחות. - העדכון הציג מערכת מבוססת ענן, שהתרחקה מהמערכת האמינה Universal Plug and Play (UPnP), מה שהוביל לבעיות קישוריות והגברת המורכבות. - מצב זה מדגיש את הקונפליקט בין אסטרטגיות עסקיות לבין שמירה על אמון הלקוחות, כאשר המנכ\"ל עובר לתפקיד ייעוץ עם חבילת פיצויים."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "בבטנו של מרביסט",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המאמר בוחן כיצד האלגוריתם של יוטיוב משפיע על יצירת תוכן, תוך שימוש במר ביסט כמקרה בוחן, ומדגיש מעבר לתוכן מונע מעורבות במקום תוכן משמעותי. - הוא דן בהשלכות הרחבות יותר על אוריינות מדיה וההשפעה התרבותית של פלטפורמות כמו יוטיוב וטיקטוק, ומציע מגמה לעבר תוכן שטחי ותגובתי. - נבחנות פרספקטיבות שונות על תפקידם של אלגוריתמים בעיצוב תוכן ועל השפעתם של יוצרים פופולריים על נורמות תרבותיות."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "פעולות Git ב-GitHub מושבתות",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub חוותה הפסקת פעילות של פעולות Git ב-13 בינואר 2025, עקב שינוי תצורה שהשפיע על מאזן העומסים הפנימי, שנמשך מ-23:35 עד 00:24 לפי זמן UTC. - הבעיה נפתרה על ידי החזרת שינוי התצורה, ו-GitHub עובדת על שיפור תהליכי הניטור והפריסה כדי למנוע תקריות דומות. - ההפסקה השפיעה גם על שירותי Actions ו-Pages של GitHub, מה שמדגיש את האופי המקושר של שירותי הפלטפורמה שלהם."
    ],
    "commentSummary": [
      "GitHub חוותה תקלה משמעותית שהשפיעה על פעולות git, מה שגרם לבלבול בקרב מפתחים שחשדו בתחילה בבעיות עם מפתחות ה-SSH שלהם או בהגדרות המקומיות. - האירוע הדגיש את האתגרים שבסמיכה על שירותים מרכזיים, והוביל לדיונים על היתרונות של אירוח עצמי ומערכות מבוזרות. - למרות שהבעיה נפתרה, היא הדגישה חששות לגבי האמינות של GitHub והסיכונים שבסמיכה על פלטפורמות צד שלישי למשימות חיוניות."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "זמן שחרור ZFS 2.3 עם הרחבת ZFS raidz",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0 שוחרר, ומציג תכונות משמעותיות כמו הרחבת RAIDZ, דה-דופליקציה מהירה, קלט/פלט ישיר, פלט JSON ותמיכה בשמות קבצים ארוכים. - השחרור כולל תיקוני באגים חיוניים ושיפורי ביצועים, תואם לליבות לינוקס 4.18 - 6.12 וגרסאות FreeBSD 13.3, 14.0 - 14.2. - העדכון הוא מאמץ שיתופי של 134 תורמים, עם תיעוד מקיף ורשימת שינויים זמינים לעיון."
    ],
    "commentSummary": [
      "זי.אף.אס 2.3 שוחרר, ומציג תכונות כמו הרחבת RAIDZ, דה-דופליקציה מהירה, קלט/פלט ישיר, פלט JSON ותמיכה בשמות קבצים ארוכים. - הרחבת RAIDZ היא במיוחד בולטת מכיוון שהיא מאפשרת למשתמשים להוסיף התקנים חדשים לבריכת RAIDZ קיימת ללא זמן השבתה, מה שמגביר את קיבולת האחסון. - השחרור נחשב להתקדמות משמעותית עבור משתמשי זי.אף.אס, ומושווה למערכות קבצים אחרות כמו Btrfs ו-Windows Storage Spaces, למרות מגבלות מסוימות כמו חוסר היכולת להקטין בריכות."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "Webtop – מכולות של Alpine, Ubuntu, Fedora ו-Arch המכילות סביבות שולחן עבודה מלאות",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop מספק מכולות המבוססות על Alpine, Ubuntu, Fedora ו-Arch עם סביבות שולחן עבודה מלאות הנגישות דרך דפדפני אינטרנט, ותומכות בארכיטקטורות x86-64 ו-arm64.",
      "משתמשים יכולים לבחור מתוך סביבות שולחן עבודה שונות כמו XFCE, KDE, MATE, i3, Openbox, ו-IceWM על ידי שימוש בתגי תמונה ספציפיים, ולגשת ל-Webtop דרך כתובות URL ייעודיות.",
      "מאפייני האבטחה כוללים את אפשרות ה-seccomp של Docker והגדרת אימות, עם אפשרויות התאמה אישית זמינות דרך משתני סביבה, ותמיכה בהאצת GPU עם מנהלי התקנים בקוד פתוח."
    ],
    "commentSummary": [
      "Webtop מספקת מכולות עם סביבות שולחן עבודה מלאות עבור Alpine, Ubuntu, Fedora ו-Arch, המתאימות להתקנות מהירות מאחורי VPN.",
      "משתמשים משבחים את Webtop על מהירותו וקלות השימוש בו, במיוחד כאשר משתמשים בו עם מיכל Gluetun לחיבורים מאובטחים, אך מזהירים מפני חשיפת מיכלים לאינטרנט ללא אמצעי אבטחה בשל היעדר אימות ברירת מחדל.",
      "הפרויקט מוערך על היותו קוד פתוח וגמיש, כאשר משתמשים משתפים תצורות, ואלטרנטיבות כמו Kasm ו-Selkies נחשבות למטרות דומות."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "מחקר מגלה כי 1 מתוך 5 מודעות דרושים באינטרנט הן מזויפות או שלא מתמלאות לעולם",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "מחקר עדכני מצביע על כך ש-20% מהמשרות המפורסמות באינטרנט הן או מזויפות או נשארות לא מאוישות, מה שמוסיף לתסכול של מחפשי העבודה. - מגמת \"משרות רפאים\" זו עשויה להיות טקטיקה של חברות להציג תדמית של צמיחה. - פלטפורמות עבודה כמו Greenhouse ו-LinkedIn הציגו שירותי אימות משרות כדי לסייע למשתמשים בזיהוי הזדמנויות עבודה אמיתיות."
    ],
    "commentSummary": [
      "מחקר מגלה כי 20% מהמשרות המפורסמות באינטרנט הן מזויפות או נשארות לא מאוישות, לעיתים קרובות בגלל שחברות צריכות לעמוד במדיניות ההגירה של ארה\"ב. - חברות עשויות גם להשאיר משרות פנויות כדי למצוא מועמדים אידיאליים, לשנות דרישות, או שיש להן מועמדים פנימיים שנבחרו מראש. - שוק העבודה קשה למועמדים, אשר נתקלים לעיתים קרובות בהיעלמות תקשורת ודחיות אוטומטיות, מה שמעורר קריאות להתערבות רגולטורית."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "להפוך צומת ללא בטוחה להולכי רגל כדי לחסוך שניות לנהגים",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "הדיון מתמקד בשאלה האם צמתים צריכים להעדיף את בטיחות הולכי הרגל או את יעילות הנהגים, כאשר יש המעדיפים צמתים עם רמזורים ומעברי חצייה מרובי כיוונים על פני צמתים עם עצירה בארבעה כיוונים.",
      "יש דעות שונות לגבי חוקי התנועה ועיצוב התשתיות, עם דיונים על בטיחות חציית כביש שלא במעבר חציה והסיכונים הקשורים לפניות ימינה באור אדום.",
      "ישנם כאלה שממליצים על פתרונות חלופיים כמו כיכרות או אימוץ תקני הנדסת תנועה הולנדיים כדי לשפר הן את הבטיחות והן את היעילות."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL היא מערכת ניהול מסדי הנתונים של השנה 2024",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL זכתה בתואר מערכת ניהול בסיסי נתונים של השנה 2024 על ידי DB-Engines, וזוהי הפעם החמישית שהיא זוכה בהכרה זו, כשהיא עוקפת 423 מערכות ניהול בסיסי נתונים אחרות.",
      "PostgreSQL, עם היסטוריה המשתרעת על פני כמעט 35 שנים, ממשיך לחדש, כפי שניתן לראות בשיפורים האחרונים של PostgreSQL 17, ששוחרר בספטמבר 2024.",
      "סנופלייק ומיקרוסופט תפסו את המקומות השני והשלישי, בהתאמה, כאשר סנופלייק נודעה בזכות מחסני הנתונים מבוססי הענן שלה ותמיכה בריבוי עננים, בעוד שמיקרוסופט מציעה מסדי נתונים יחסיים מנוהלים חזקים דרך Azure SQL Database ו-SQL Server."
    ],
    "commentSummary": [
      "PostgreSQL זכתה בתואר מערכת ניהול מסדי הנתונים של השנה 2024 על ידי db-engines.com, מה שמדגיש את הפופולריות וההכרה הגוברת שלה בתעשייה.",
      "משתמשים שוקלים לעבור מ-Microsoft SQL Server ל-PostgreSQL בשל עלויות רישוי גבוהות ומגבלות משאבים, למרות אתגרי ההגירה הפוטנציאליים.",
      "PostgreSQL מועדף בשל התכונות החזקות והעלות-תועלת שלו, מה שהופך אותו לבחירה מועדפת לפרויקטים עתידיים, אם כי חלק מהמשתמשים בוחנים חלופות כמו Babelfish כדי להפחית עלויות."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "כניסת OAuth של גוגל לא מגנה מפני רכישת דומיין של סטארטאפ שנכשל",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "הדיון מדגיש פגיעות במערכת ההתחברות של OAuth של גוגל כאשר הדומיין של סטארטאפ שנכשל נרכש על ידי בעלים חדש, מה שעשוי לאפשר גישה לא מורשית לשירותים.",
      "בעיה זו מתעוררת מכיוון שגוגל עשויה לא להבחין בין הבעלים המקוריים של הדומיין לבין הבעלים החדשים, מה שמשפיע על כל מערכת שמשתמשת באימות מבוסס דומיין.",
      "פתרון מוצע הוא להשתמש במזהים ייחודיים שנשארים קבועים לאורך זמן, אם כי יישום הפתרון הזה משתנה בין ספקי הזהות."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "להשתמש בכישורי תכנות כדי להרוויח הכנסה פסיבית",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "המחבר עבר מתפקיד של CTO ליזם עצמאי, והצליח להרוויח יותר באמצעות פורטפוליו של מוצרי תוכנה.",
      "אסטרטגיות מפתח כוללות התמקדות בעבודה מעמיקה, התחלה עם פרויקטים קטנים, חזרה מהירה והקדשת זמן למאמצי שיווק.",
      "המסע מדגיש חוסן עקב אי ודאויות, אך מדגיש את האוטונומיה והחופש הבלתי משתווים של מסלול קריירה זה, ומעודד את אלו עם כישורי קידוד לשקול אותו כהכנסה פסיבית."
    ],
    "commentSummary": [
      "משתמש תיאר יצירת הכנסה פסיבית באמצעות אתרי ספאם של SEO תוך שימוש בשמות דומיין שפג תוקפם, והרוויח כ-30,000 דולר בשנה, למרות חששות אתיים והמאבק של גוגל בתופעה בסופו של דבר.",
      "הפוסט עורר דיון על הכנסה פסיבית, כאשר חלק מהמשתמשים טוענים שזה דומה יותר לניהול עסק מאשר לרווחים פסיביים באמת.",
      "משתתפים שיתפו חוויות ואתגרים בפרויקטים צדדיים, והדגישו את החשיבות של זמן, חוסן ותכנון אסטרטגי."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "ספרד מציעה מס של 100% על בתים שנרכשים על ידי תושבים שאינם מהאיחוד האירופי",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "ספרד שוקלת להטיל מס של 100% על רכישות נדל\"ן על ידי תושבים שאינם מהאיחוד האירופי, במטרה להתמודד עם משבר הדיור ולרסן רכישות ספקולטיביות.",
      "ראש הממשלה פדרו סאנצ'ס מציע להרחיב את הדיור הציבורי ולווסת את השכרת הדירות לתיירים כדי להתמודד עם הפער בין מחירי הדיור להכנסות.",
      "העתיד של ההצעה כחוק אינו ודאי, כאשר חלק מהאנליסטים רואים בה כהרתעה למשקיעים זרים ולא כשינוי חקיקתי מובטח."
    ],
    "commentSummary": [
      "ספרד שוקלת להטיל מס של 100% על בתים שנרכשים על ידי תושבים שאינם מהאיחוד האירופי כדי להתמודד עם בעיות נגישות לדיור. - מבקרים טוענים כי קונים זרים אינם הגורם העיקרי למחירי הדיור הגבוהים, ומציינים את הבירוקרטיה האיטית וחוקי התכנון כגורמים משמעותיים יותר. - ההצעה הציתה דיון על תפקיד הבעלות הזרה בשוקי הדיור ועל יעילותה בפתרון בעיות הנגישות."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "בהקדם אפל תקבל שבבים 'תוצרת אמריקה' ממפעל TSMC באריזונה",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "Apple בוחנת מעבדים ממתקן אריזונה של TSMC, עם תוכניות לייצור המוני עד הרבעון הראשון, וייתכן שתהפוך ללקוח האמריקאי הראשון של TSMC לשבבים המיוצרים מקומית. - יוזמה זו נועדה לחזק את העצמאות הסיליקונית של ארה\"ב, ולהפחית את התלות בטייוואן, שהיא פגיעה לסיכונים גיאופוליטיים וטבעיים. - המפעל של TSMC באריזונה מתוכנן לייצר שבבים מתקדמים בגודל 3 ננומטר ו-2 ננומטר, עם מאמצים מתמשכים לשיפור הגיוס המקומי ושיתופי פעולה עם אוניברסיטאות בארה\"ב, אם כי האריזה תתבצע בתחילה בטייוואן עד שהמתקן בפאוריה יהיה פעיל."
    ],
    "commentSummary": [
      "Apple תקבל שבבים ממפעל TSMC באריזונה, אך יש לשלוח אותם בחזרה לטייוואן לאריזה בשל מחסור במתקנים בארה\"ב. - מעל 50% מכוח העבודה במפעל באריזונה מגיע מטייוואן, מה שמצביע על פער בתחום ה-STEM (מדע, טכנולוגיה, הנדסה ומתמטיקה) בארה\"ב. - יוזמת חוק השבבים, שמטרתה לשפר את ייצור השבבים בארה\"ב, מתמודדת עם אתגרים כאשר תווית \"תוצרת אמריקה\" מוטלת בספק בשל תהליך האריזה המתרחש בטייוואן, עם תוכניות ליכולות אריזה בארה\"ב עד 2027."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "43 אלף נהגים פחות בכבישי מנהטן לאחר הפעלת תמחור גודש",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "לאחר יישום תמחור העומס, חלה ירידה של 7.5% במספר הנהגים הנכנסים למנהטן מתחת לרחוב ה-60, מה שמתורגם ל-43,000 נהגים פחות בכל יום חול.",
      "הירידה בתנועה שיפרה את זרימת התנועה והעלתה את מהירות האוטובוסים, כאשר חלק מהאוטובוסים המהירים חווים עלייה במספר הנוסעים.",
      "הרשות המטרופולינית לתחבורה (MTA) משתמשת בהכנסות מאגרות, המוערכות בכ-500 מיליון דולר בשנה, לשיפור התחבורה, למרות התנגדות פוליטית מסוימת."
    ],
    "commentSummary": [
      "היישום של תמחור גודש במנהטן הביא ל-43,000 נהגים פחות, מה שהוביל להאצת מהירות האוטובוסים וייתכן שגם לשיפור בזמני התגובה של שירותי החירום.",
      "המדיניות נועדה להפחית את עומסי התנועה ולשפר את איכות האוויר, אם כי היא עוררה ויכוח על השפעתה על אנשים בעלי הכנסה נמוכה יותר.",
      "תומכים טוענים כי היתרונות כוללים תחבורה ציבורית יעילה יותר ואוויר נקי יותר, בעוד שהדיונים נמשכים על איזון יתרונות אלו עם צרכי הנהגים."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
