[
  {
    "id": 42690473,
    "title": "Snyk investigador de seguridad despliega paquetes NPM maliciosos dirigidos a cursor.com",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "Un investigador de seguridad de Snyk lanzó paquetes NPM maliciosos dirigidos a Cursor.com, una empresa de codificación de IA, para recopilar datos del sistema y enviarlos a un servicio controlado por un atacante.",
      "Los paquetes, identificados como \"cursor-retrieval\", \"cursor-always-local\" y \"cursor-shadow-workspace\", fueron señalados por el escáner de análisis de paquetes de OpenSSF, lo que resultó en las advertencias MAL-2025-27, MAL-2025-28 y MAL-2025-29.",
      "Este incidente resalta la importancia de examinar los paquetes de NPM antes de la instalación para evitar posibles amenazas de seguridad."
    ],
    "commentSummary": [
      "Un investigador de seguridad de Snyk lanzó paquetes maliciosos de NPM (Node Package Manager) dirigidos a cursor.com, destacando vulnerabilidades de confusión de dependencias. - El incidente ha generado un debate sobre la ética de la investigación en seguridad, especialmente en lo que respecta a la exposición pública de variables de entorno. - Cursor.com aclaró que no autorizaron la acción, y Snyk se ha disculpado desde entonces, subrayando los desafíos de equilibrar la investigación de seguridad ofensiva con los estándares éticos."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "He cambiado a Firefox y nunca miré atrás",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "Firefox es elogiado por su superior gestión de pestañas, la función integrada de Pocket para guardar enlaces y un servicio de retransmisión de correo electrónico enfocado en la privacidad, lo que lo convierte en una fuerte alternativa a Chrome. - Características adicionales como una herramienta de captura de pantalla fácil de usar, un botón de ChatGPT, Picture-in-Picture, opciones de búsqueda personalizables y un desplazamiento suave mejoran la experiencia de navegación. - Aunque Firefox carece de la función de aplicaciones web de Chrome, su diseño cuidadoso y la reducción en el consumo de recursos lo hacen una opción preferida para algunos usuarios."
    ],
    "commentSummary": [
      "Los usuarios de Firefox enfrentan desafíos de plataformas como YouTube, que pueden degradar intencionalmente la experiencia para navegadores no pertenecientes a Google o usuarios que emplean bloqueadores de anuncios. - Esta tendencia genera preocupaciones sobre la autonomía del usuario, ya que penaliza a aquellos que optan por una experiencia web sin anuncios y sin vigilancia. - Firefox ofrece características únicas, como las pestañas de contenedores, que mejoran la privacidad y la usabilidad, convirtiéndolo en una opción preferida para los usuarios que buscan independencia de los navegadores controlados por grandes corporaciones."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "El CEO de Sonos renuncia tras el fiasco de la actualización de la aplicación",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "El CEO de Sonos ha renunciado tras una controvertida actualización de la aplicación que requería que los usuarios reemplazaran costosos sistemas de sonido, lo que causó insatisfacción entre los clientes. - La actualización introdujo un sistema basado en la nube, alejándose del confiable Universal Plug and Play (UPnP), lo que provocó problemas de conectividad y mayor complejidad. - Esta situación subraya el conflicto entre las estrategias empresariales y el mantenimiento de la confianza del cliente, mientras el CEO pasa a un rol asesor con un paquete de indemnización."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "En el vientre del MrBeast",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "La redacción examina cómo el algoritmo de YouTube influye en la creación de contenido, utilizando a MrBeast como estudio de caso, destacando un cambio hacia contenido impulsado por el compromiso en lugar de contenido significativo. - Discute las implicaciones más amplias para la alfabetización mediática y el impacto cultural de plataformas como YouTube y TikTok, sugiriendo una tendencia hacia contenido superficial y reaccionario. - Se consideran diversas perspectivas sobre el papel de los algoritmos en la conformación del contenido y la influencia de los creadores populares en las normas culturales."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "Las operaciones de Git en GitHub están caídas",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub enfrentó una interrupción de operaciones de Git el 13 de enero de 2025, debido a un cambio de configuración que afectó al equilibrador de carga interno, que duró desde las 23:35 hasta las 00:24 UTC. - El problema se resolvió revirtiendo el cambio de configuración, y GitHub está trabajando en mejorar los procesos de monitoreo y despliegue para prevenir incidentes similares. - La interrupción también afectó a los servicios de Actions y Pages de GitHub, destacando la naturaleza interconectada de sus servicios de plataforma."
    ],
    "commentSummary": [
      "GitHub enfrentó una importante interrupción que afectó las operaciones de git, lo que llevó a la confusión entre los desarrolladores que inicialmente sospecharon problemas con sus claves SSH o configuraciones locales. - El incidente subrayó los desafíos de depender de servicios centralizados, lo que provocó discusiones sobre las ventajas de la auto-hospedaje y los sistemas descentralizados. - Aunque el problema se resolvió, destacó preocupaciones sobre la fiabilidad de GitHub y los riesgos de depender de plataformas de terceros para tareas esenciales."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3 lanzado con expansión ZFS raidz",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0 ha sido lanzado, introduciendo características significativas como la expansión RAIDZ, deduplicación rápida, entrada/salida directa, salida JSON y soporte para nombres de archivos largos. - La versión incluye correcciones de errores esenciales y mejoras de rendimiento, compatible con los núcleos de Linux 4.18 - 6.12 y las versiones de FreeBSD 13.3, 14.0 - 14.2. - La actualización es un esfuerzo colaborativo de 134 contribuyentes, con documentación completa y un registro de cambios disponible para revisión."
    ],
    "commentSummary": [
      "ZFS 2.3 ha sido lanzado, introduciendo características como la expansión de RAIDZ, deduplicación rápida, IO directo, salida JSON y soporte para nombres de archivos largos. - La expansión de RAIDZ es particularmente notable ya que permite a los usuarios agregar nuevos dispositivos a un pool RAIDZ existente sin tiempo de inactividad, mejorando la capacidad de almacenamiento. - El lanzamiento se considera un avance significativo para los usuarios de ZFS, estableciendo comparaciones con otros sistemas de archivos como Btrfs y Windows Storage Spaces, a pesar de algunas limitaciones como la imposibilidad de reducir el tamaño de los pools."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "Webtop: contenedores de Alpine, Ubuntu, Fedora y Arch que contienen entornos de escritorio completos",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop proporciona contenedores basados en Alpine, Ubuntu, Fedora y Arch con entornos de escritorio completos accesibles a través de navegadores web, compatibles con arquitecturas x86-64 y arm64.",
      "Los usuarios pueden seleccionar entre varios entornos de escritorio como XFCE, KDE, MATE, i3, Openbox e IceWM utilizando etiquetas de imagen específicas, y acceder al Webtop a través de URL designadas.",
      "Las características de seguridad incluyen la opción seccomp de Docker y la configuración de autenticación, con opciones de personalización disponibles a través de variables de entorno, y soporte para aceleración de GPU con controladores de código abierto."
    ],
    "commentSummary": [
      "Webtop proporciona contenedores con entornos de escritorio completos para Alpine, Ubuntu, Fedora y Arch, adecuados para configuraciones rápidas detrás de una VPN.",
      "Los usuarios elogian a Webtop por su velocidad y facilidad de uso, especialmente cuando se utiliza con el contenedor Gluetun para conexiones seguras, pero advierten contra la exposición de contenedores a internet sin medidas de seguridad debido a la falta de autenticación predeterminada.",
      "El proyecto es valorado por ser de código abierto y flexible, con usuarios compartiendo configuraciones, y se destacan alternativas como Kasm y Selkies para propósitos similares."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "1 de cada 5 ofertas de trabajo en línea son falsas o nunca se cubren, según un estudio.",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "Un estudio reciente indica que el 20% de las ofertas de trabajo en línea son falsas o permanecen sin cubrir, lo que aumenta la frustración de los buscadores de empleo. - Esta tendencia de \"trabajos fantasma\" podría ser una táctica de las empresas para proyectar una imagen de crecimiento. - Plataformas de empleo como Greenhouse y LinkedIn han introducido servicios de verificación de empleos para ayudar a los usuarios a identificar oportunidades laborales genuinas."
    ],
    "commentSummary": [
      "Un estudio revela que el 20% de las ofertas de trabajo en línea son falsas o permanecen sin cubrir, a menudo debido a que las empresas necesitan cumplir con las políticas de inmigración de EE. UU. - Las empresas también pueden dejar las ofertas de trabajo publicadas para encontrar candidatos ideales, cambiar los requisitos o tener candidatos internos preseleccionados. - El mercado laboral es difícil para los solicitantes, que frecuentemente enfrentan el fenómeno del ghosting y rechazos automatizados, lo que provoca llamados a una intervención regulatoria."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "Hacer una intersección insegura para los peatones para ahorrar segundos a los conductores",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "La discusión se centra en si las intersecciones deben priorizar la seguridad de los peatones o la eficiencia de los conductores, con algunos que prefieren intersecciones controladas por semáforos y cruces peatonales sobre paradas de 4 vías.",
      "Las opiniones varían sobre las leyes de tráfico y el diseño de infraestructuras, con debates sobre la seguridad de cruzar la calle fuera de los pasos peatonales y los riesgos asociados con girar a la derecha en rojo.",
      "Algunos abogan por soluciones alternativas como las rotondas o la adopción de estándares de ingeniería de tráfico holandeses para mejorar tanto la seguridad como la eficiencia."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL es el Sistema de Gestión de Bases de Datos del Año 2024",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL ha sido galardonado como el DBMS del Año 2024 por DB-Engines, logrando este reconocimiento por quinta vez, superando a otros 423 sistemas de gestión de bases de datos.",
      "PostgreSQL, con una historia que abarca casi 35 años, sigue innovando, como se puede ver en las recientes mejoras de PostgreSQL 17, lanzado en septiembre de 2024.",
      "Snowflake y Microsoft aseguraron el segundo y tercer lugar, respectivamente, con Snowflake destacado por su almacenamiento de datos en la nube y soporte multi-nube, mientras que Microsoft ofrece bases de datos relacionales administradas robustas a través de Azure SQL Database y SQL Server."
    ],
    "commentSummary": [
      "PostgreSQL ha sido galardonado como el Sistema de Gestión de Bases de Datos del Año 2024 por db-engines.com, destacando su creciente popularidad y reconocimiento en la industria.",
      "Los usuarios están considerando cambiar de Microsoft SQL Server a PostgreSQL debido a los altos costos de licencias y las limitaciones de recursos, a pesar de los posibles desafíos de migración.",
      "PostgreSQL es preferido por sus características robustas y rentabilidad, lo que lo convierte en una opción preferida para futuros proyectos, aunque algunos usuarios exploran alternativas como Babelfish para reducir costos."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "El inicio de sesión de OAuth de Google no protege contra la compra de un dominio de startup fallida",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "La discusión resalta una vulnerabilidad en el sistema de inicio de sesión OAuth de Google cuando el dominio de una startup fallida es adquirido por un nuevo propietario, lo que podría permitir el acceso no autorizado a servicios.",
      "Este problema surge porque Google puede no distinguir entre los propietarios originales y nuevos del dominio, lo que afecta a cualquier sistema que utilice autenticación basada en dominios.",
      "Una solución propuesta es utilizar identificadores únicos que permanezcan constantes a lo largo del tiempo, aunque la implementación de esta solución varía entre los proveedores de identidad."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "Usar habilidades de codificación para generar ingresos pasivos",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "El autor pasó de un rol de CTO a un solopreneur, ganando exitosamente más a través de una cartera de productos de software.",
      "Las estrategias clave incluyen centrarse en el trabajo profundo, comenzar con proyectos pequeños, iterar rápidamente y dedicar tiempo a los esfuerzos de marketing.",
      "La travesía enfatiza la resiliencia debido a las incertidumbres, pero destaca la autonomía y libertad incomparables de este camino profesional, animando a aquellos con habilidades de codificación a considerarlo para obtener ingresos pasivos."
    ],
    "commentSummary": [
      "Un usuario describió cómo generar ingresos pasivos a través de sitios web de spam de SEO utilizando nombres de dominio que están por expirar, ganando aproximadamente $30,000 anualmente, a pesar de las preocupaciones éticas y la eventual represión de Google.",
      "La publicación provocó un debate sobre los ingresos pasivos, con algunos usuarios argumentando que se asemeja más a dirigir un negocio que a ganancias verdaderamente pasivas.",
      "Los participantes compartieron experiencias y desafíos en proyectos paralelos, destacando la importancia del tiempo, la resiliencia y la planificación estratégica."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "España propone un impuesto del 100% sobre las viviendas compradas por residentes no pertenecientes a la UE",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "España está considerando un impuesto del 100% sobre las compras de bienes raíces por parte de residentes no pertenecientes a la UE, con el objetivo de abordar la crisis de vivienda y frenar la compra especulativa.",
      "La propuesta del Primer Ministro Pedro Sánchez incluye la expansión de la vivienda social y la regulación de los alquileres turísticos para abordar la disparidad entre los precios de la vivienda y los ingresos.",
      "La futura aprobación de la propuesta como ley es incierta, ya que algunos analistas la ven más como un elemento disuasorio para los inversores extranjeros que como un cambio legislativo garantizado."
    ],
    "commentSummary": [
      "España está considerando un impuesto del 100% sobre las viviendas compradas por residentes no pertenecientes a la UE para abordar los problemas de asequibilidad de la vivienda. - Los críticos sugieren que los compradores extranjeros no son la causa principal de los altos precios de la vivienda, citando la burocracia lenta y las leyes de zonificación como factores más significativos. - La propuesta ha encendido un debate sobre el papel de la propiedad extranjera en los mercados de vivienda y su efectividad para resolver los problemas de asequibilidad."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "Apple pronto recibirá chips 'hechos en América' de la fábrica de TSMC en Arizona",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "Apple está probando procesadores de la planta de TSMC en Arizona, con planes para la producción en masa para el primer trimestre, lo que podría convertirla en el primer cliente estadounidense de TSMC para chips fabricados localmente. - Esta iniciativa tiene como objetivo fortalecer la independencia de silicio de EE. UU., reduciendo la dependencia de Taiwán, que es vulnerable a riesgos geopolíticos y naturales. - La fábrica de TSMC en Arizona está preparada para producir chips avanzados de 3nm y 2nm, con esfuerzos continuos para mejorar el reclutamiento local y las asociaciones con universidades estadounidenses, aunque el empaquetado se realizará inicialmente en Taiwán hasta que la instalación de Peoria esté operativa."
    ],
    "commentSummary": [
      "Apple recibirá chips de la planta de TSMC en Arizona, pero deben ser enviados de regreso a Taiwán para su empaquetado debido a la insuficiencia de instalaciones en EE. UU. - Más del 50% de la fuerza laboral en la planta de Arizona proviene de Taiwán, lo que indica una brecha en el campo STEM (Ciencia, Tecnología, Ingeniería y Matemáticas) de EE. UU. - La iniciativa de la Ley CHIPS, destinada a mejorar la fabricación de semiconductores en EE. UU., enfrenta desafíos ya que se cuestiona la etiqueta \"Hecho en América\" debido al proceso de empaquetado que ocurre en Taiwán, con planes para capacidades de empaquetado en EE. UU. para 2027."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "43,000 conductores menos en las carreteras de Manhattan después de que se activó el cobro por congestión",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "Después de que se implementó el peaje por congestión, hubo una reducción del 7.5% en los conductores que ingresaban a Manhattan por debajo de la Calle 60, lo que equivale a 43,000 conductores menos cada día de la semana.",
      "La reducción del tráfico ha mejorado el flujo vehicular y aumentado la velocidad de los autobuses, con algunos autobuses exprés experimentando un mayor número de pasajeros.",
      "La Autoridad Metropolitana de Transporte (MTA) utiliza los ingresos por peajes, estimados en 500 millones de dólares anuales, para mejoras en el transporte, a pesar de cierta oposición política."
    ],
    "commentSummary": [
      "La implementación de la tarificación por congestión en Manhattan ha resultado en 43,000 conductores menos, lo que ha llevado a un aumento en la velocidad de los autobuses y potencialmente mejores tiempos de respuesta de emergencia.",
      "La política está diseñada para reducir la congestión del tráfico y mejorar la calidad del aire, aunque ha generado debate sobre su impacto en las personas de bajos ingresos.",
      "Los defensores argumentan que los beneficios incluyen un transporte público más eficiente y un aire más limpio, mientras continúan las discusiones sobre cómo equilibrar estas ventajas con las necesidades de los conductores."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
