[
  {
    "id": 42690473,
    "title": "시닉 보안 연구원이 cursor.com을 대상으로 하는 악성 NPM 패키지를 배포하다",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "한 Snyk 보안 연구원이 AI 코딩 회사인 Cursor.com을 대상으로 시스템 데이터를 수집하고 이를 공격자가 제어하는 서비스로 전송하기 위해 악성 NPM 패키지를 배포했습니다.",
      "이 패키지들은 \"cursor-retrieval,\" \"cursor-always-local,\" 및 \"cursor-shadow-workspace\"로 식별되었으며, OpenSSF 패키지 분석 스캐너에 의해 플래그가 지정되어 권고 사항 MAL-2025-27, MAL-2025-28, 및 MAL-2025-29가 발행되었습니다.",
      "이 사건은 잠재적인 보안 위협을 피하기 위해 NPM 패키지를 설치하기 전에 면밀히 검토하는 것의 중요성을 강조합니다."
    ],
    "commentSummary": [
      "한 Snyk 보안 연구원이 cursor.com을 겨냥한 악성 NPM(Node Package Manager) 패키지를 공개하여 의존성 혼동 취약점을 강조했습니다. - 이 사건은 특히 환경 변수의 공개 노출과 관련하여 보안 연구의 윤리에 대한 논쟁을 촉발했습니다. - Cursor.com은 이 행동을 승인하지 않았다고 밝혔으며, Snyk는 이후 사과하면서 공격적 보안 연구와 윤리적 기준 간의 균형을 맞추는 데 있어 어려움을 강조했습니다."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "파이어폭스로 전환하고 다시는 돌아보지 않았다",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "Firefox는 우수한 탭 관리, 링크 저장을 위한 내장 Pocket 기능, 그리고 프라이버시 중심의 이메일 릴레이로 칭찬받으며 Chrome의 강력한 대안이 됩니다. - 사용자 친화적인 스크린샷 도구, ChatGPT 버튼, 화면 속 화면(Picture-in-Picture), 맞춤형 검색 옵션, 부드러운 스크롤링과 같은 추가 기능들이 브라우징 경험을 향상시킵니다. - Firefox는 Chrome의 웹 앱 기능이 부족하지만, 신중한 디자인과 감소된 자원 요구로 인해 일부 사용자들에게 선호되는 선택이 됩니다."
    ],
    "commentSummary": [
      "Firefox 사용자는 YouTube와 같은 플랫폼에서 비 Google 브라우저나 광고 차단기를 사용하는 사용자에게 의도적으로 경험을 저하시킬 수 있는 도전에 직면해 있습니다. - 이러한 경향은 광고 없는 감시 없는 웹 경험을 선택하는 사용자를 처벌하기 때문에 사용자 자율성에 대한 우려를 제기합니다. - Firefox는 컨테이너 탭과 같은 독특한 기능을 제공하여 프라이버시와 사용성을 향상시켜 주요 기업이 통제하는 브라우저로부터 독립을 추구하는 사용자에게 선호되는 선택이 되고 있습니다."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "Sonos CEO, 앱 업데이트 문제로 사임",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Sonos의 CEO가 논란이 된 앱 업데이트 이후 사임했습니다. 이 업데이트는 사용자들이 비싼 사운드 시스템을 교체하도록 요구하여 고객 불만을 초래했습니다. - 업데이트는 클라우드 기반 시스템을 도입하여 신뢰할 수 있는 Universal Plug and Play (UPnP)에서 벗어나게 했고, 이로 인해 연결 문제와 복잡성이 증가했습니다. - 이 상황은 비즈니스 전략과 고객 신뢰 유지 간의 갈등을 강조하며, CEO는 퇴직 패키지를 받으며 자문 역할로 전환합니다."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "MrBeast의 배 속에서",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "이 에세이는 YouTube의 알고리즘이 콘텐츠 제작에 어떻게 영향을 미치는지를 MrBeast를 사례로 사용하여 검토하며, 의미 있는 콘텐츠보다는 참여 중심으로의 전환을 강조합니다. - 이는 미디어 리터러시와 YouTube 및 TikTok과 같은 플랫폼의 문화적 영향에 대한 더 넓은 함의를 논의하며, 피상적이고 반응적인 콘텐츠로의 경향을 제안합니다. - 알고리즘이 콘텐츠를 형성하는 역할과 인기 있는 창작자들이 문화적 규범에 미치는 영향에 대한 다양한 관점이 고려됩니다."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "GitHub Git 작업이 중단되었습니다",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub은 2025년 1월 13일에 내부 로드 밸런서에 영향을 미치는 구성 변경으로 인해 Git 작업 중단을 겪었으며, 이는 23:35부터 00:24 UTC까지 지속되었습니다. - 문제는 구성 변경을 되돌림으로써 해결되었으며, GitHub은 유사한 사건을 방지하기 위해 모니터링 및 배포 프로세스를 개선하고 있습니다. - 이번 중단은 GitHub의 Actions 및 Pages 서비스에도 영향을 미쳐, 플랫폼 서비스의 상호 연결된 특성을 부각시켰습니다."
    ],
    "commentSummary": [
      "GitHub는 git 작업에 영향을 미치는 주요 장애를 겪었고, 이로 인해 개발자들은 처음에 자신의 SSH 키나 로컬 설정에 문제가 있다고 의심하게 되었습니다. - 이 사건은 중앙 집중식 서비스에 의존하는 것의 어려움을 강조하며, 자체 호스팅 및 분산 시스템의 장점에 대한 논의를 촉발했습니다. - 문제는 해결되었지만, GitHub의 신뢰성과 필수 작업을 위해 타사 플랫폼에 의존하는 것의 위험성에 대한 우려를 부각시켰습니다."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3이 ZFS raidz 확장 기능과 함께 출시되었습니다.",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0이 출시되어 RAIDZ 확장, 빠른 중복 제거, 직접 입출력, JSON 출력, 긴 파일 이름 지원과 같은 중요한 기능이 도입되었습니다. - 이번 릴리스에는 필수적인 버그 수정과 성능 향상이 포함되어 있으며, Linux 커널 4.18 - 6.12 및 FreeBSD 버전 13.3, 14.0 - 14.2와 호환됩니다. - 이 업데이트는 134명의 기여자가 협력한 결과로, 포괄적인 문서와 변경 로그가 검토를 위해 제공됩니다."
    ],
    "commentSummary": [
      "ZFS 2.3이 출시되어 RAIDZ 확장, 빠른 중복 제거, 직접 IO, JSON 출력, 긴 파일 이름 지원과 같은 기능이 도입되었습니다. - 특히 RAIDZ 확장은 사용자가 기존 RAIDZ 풀에 새로운 장치를 추가하여 다운타임 없이 저장 용량을 확장할 수 있게 해주는 점에서 주목할 만합니다. - 이번 출시는 ZFS 사용자에게 중요한 발전으로 간주되며, Btrfs 및 Windows Storage Spaces와 같은 다른 파일 시스템과 비교되고 있지만, 풀을 축소할 수 없는 등의 몇 가지 제한 사항이 있습니다."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "Webtop – 전체 데스크톱 환경을 포함한 Alpine, Ubuntu, Fedora 및 Arch 컨테이너",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop은 웹 브라우저를 통해 접근할 수 있는 전체 데스크톱 환경을 제공하는 컨테이너를 Alpine, Ubuntu, Fedora, Arch 기반으로 제공하며, x86-64 및 arm64 아키텍처를 모두 지원합니다.",
      "사용자는 특정 이미지 태그를 사용하여 XFCE, KDE, MATE, i3, Openbox, IceWM과 같은 다양한 데스크톱 환경을 선택할 수 있으며, 지정된 URL을 통해 Webtop에 접속할 수 있습니다.",
      "보안 기능에는 Docker의 seccomp 옵션과 인증 설정이 포함되며, 환경 변수를 통한 사용자 정의 옵션과 오픈 소스 드라이버를 통한 GPU 가속 지원이 포함됩니다."
    ],
    "commentSummary": [
      "Webtop은 Alpine, Ubuntu, Fedora 및 Arch에 대한 전체 데스크톱 환경을 갖춘 컨테이너를 제공하여 VPN 뒤에서 빠르게 설정할 수 있습니다.",
      "사용자들은 Webtop이 속도와 사용의 용이성 면에서 특히 Gluetun 컨테이너와 함께 사용할 때 칭찬하지만, 기본 인증이 없기 때문에 보안 조치 없이 컨테이너를 인터넷에 노출하는 것에 대해 주의를 당부합니다.",
      "이 프로젝트는 오픈 소스와 유연성으로 평가받고 있으며, 사용자들이 구성 설정을 공유하고 Kasm과 Selkies와 같은 대안들이 유사한 목적으로 주목받고 있습니다."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "연구에 따르면 온라인 구인 공고 중 5개 중 1개는 가짜이거나 채워지지 않는 것으로 나타났습니다.",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "최근 연구에 따르면 온라인 구인 공고의 20%가 가짜이거나 채워지지 않은 상태로 남아 있어 구직자들의 좌절감을 더하고 있습니다. - 이러한 '유령 일자리' 트렌드는 기업들이 성장 이미지를 투영하기 위한 전술일 수 있습니다. - Greenhouse와 LinkedIn과 같은 구인 플랫폼은 사용자들이 진정한 취업 기회를 식별할 수 있도록 돕기 위해 구인 검증 서비스를 도입했습니다."
    ],
    "commentSummary": [
      "한 연구에 따르면 온라인 구인 공고의 20%가 가짜이거나 채워지지 않은 상태로 남아 있으며, 이는 종종 기업이 미국 이민 정책을 준수해야 하기 때문입니다. - 기업은 이상적인 후보자를 찾거나, 요구 사항을 변경하거나, 내부 후보자를 미리 선정하기 위해 구인 공고를 계속 게시할 수도 있습니다. - 구직자들은 유령 구인이나 자동 거절을 자주 경험하여 규제 개입을 요구하는 목소리가 높아지고 있습니다."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "운전자의 몇 초를 절약하기 위해 보행자에게 교차로를 위험하게 만들기",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "논쟁은 교차로가 보행자 안전을 우선시해야 하는지 아니면 운전자 효율성을 우선시해야 하는지를 중심으로 진행되며, 일부는 4방향 정지보다 신호등이 있는 교차로와 보행자 전용 신호를 선호합니다.",
      "교통 법규와 인프라 설계에 대한 의견은 다양하며, 무단횡단의 안전성과 적신호에서의 우회전에 관련된 위험에 대한 논의가 이루어지고 있습니다.",
      "일부는 안전과 효율성을 모두 향상시키기 위해 회전 교차로나 네덜란드 교통 공학 기준을 채택하는 것과 같은 대안적 해결책을 지지합니다."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL은 2024년 올해의 데이터베이스 관리 시스템입니다.",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL는 DB-Engines에 의해 2024년 DBMS 올해의 상을 수상했으며, 423개의 다른 데이터베이스 관리 시스템을 제치고 다섯 번째로 이 인정을 받았습니다.",
      "PostgreSQL은 거의 35년에 걸친 역사를 가지고 있으며, 2024년 9월에 출시된 PostgreSQL 17의 최근 개선에서 볼 수 있듯이 계속해서 혁신을 이어가고 있습니다.",
      "스노우플레이크와 마이크로소프트는 각각 2위와 3위를 차지했으며, 스노우플레이크는 클라우드 기반 데이터 웨어하우징과 멀티 클라우드 지원으로 주목받았고, 마이크로소프트는 Azure SQL Database와 SQL Server를 통해 강력한 관리형 관계형 데이터베이스를 제공한다."
    ],
    "commentSummary": [
      "PostgreSQL은 db-engines.com에 의해 2024년 올해의 데이터베이스 관리 시스템으로 선정되었으며, 이는 업계에서의 인지도와 인기가 높아지고 있음을 강조합니다.",
      "사용자들은 높은 라이선스 비용과 자원 제한 때문에 마이그레이션의 잠재적 어려움에도 불구하고 Microsoft SQL Server에서 PostgreSQL로 전환하는 것을 고려하고 있습니다.",
      "PostgreSQL는 강력한 기능과 비용 효율성으로 인해 미래 프로젝트에서 선호되는 선택이며, 일부 사용자는 비용 절감을 위해 Babelfish와 같은 대안을 탐색하기도 합니다."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "Google의 OAuth 로그인은 실패한 스타트업 도메인 구매를 방지하지 않습니다.",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "이 논의는 실패한 스타트업의 도메인이 새로운 소유자에게 인수될 때 Google의 OAuth 로그인 시스템에서 발생할 수 있는 취약점을 강조하며, 이는 잠재적으로 서비스에 대한 무단 접근을 허용할 수 있습니다.",
      "이 문제는 Google이 원래 도메인 소유자와 새로운 도메인 소유자를 구별하지 못할 수 있기 때문에 발생하며, 도메인 기반 인증을 사용하는 모든 시스템에 영향을 미칩니다.",
      "제안된 해결책은 시간이 지나도 변하지 않는 고유 식별자를 사용하는 것이지만, 이 해결책의 구현은 신원 제공자마다 다릅니다."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "코딩 기술을 사용하여 수동 소득 창출하기",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "저자는 CTO 역할에서 솔로프리뉴어로 전환하여 소프트웨어 제품 포트폴리오를 통해 더 많은 수익을 성공적으로 올렸습니다.",
      "주요 전략에는 깊이 있는 작업에 집중하고, 작은 프로젝트로 시작하며, 빠르게 반복하고, 마케팅 노력에 시간을 할애하는 것이 포함됩니다.",
      "이 여정은 불확실성으로 인한 회복력을 강조하지만, 이 경력 경로의 비할 데 없는 자율성과 자유를 강조하며 코딩 기술을 가진 사람들이 이를 수동적 수입을 위한 경로로 고려하도록 권장합니다."
    ],
    "commentSummary": [
      "한 사용자가 만료되는 도메인 이름을 사용하여 SEO 스팸 웹사이트를 통해 수동 소득을 창출하고, 윤리적 우려와 구글의 최종 단속에도 불구하고 연간 약 3만 달러를 벌어들였다고 설명했습니다.",
      "그 게시물은 수동 소득에 대한 논쟁을 불러일으켰으며, 일부 사용자들은 그것이 진정한 수동 수익보다는 사업 운영에 더 가깝다고 주장했습니다.",
      "참가자들은 사이드 프로젝트에서의 경험과 도전 과제를 공유하며, 시간, 회복력, 전략적 계획의 중요성을 강조했습니다."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "스페인, 비EU 거주자가 구매한 주택에 100% 세금 제안",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "스페인은 주택 위기 해결과 투기적 구매 억제를 목표로 비EU 거주자의 부동산 구매에 대해 100% 세금을 고려하고 있습니다.",
      "페드로 산체스 총리의 제안에는 주택 가격과 소득 간의 격차를 해소하기 위해 사회 주택을 확장하고 관광 임대를 규제하는 것이 포함되어 있습니다.",
      "그 제안의 법률로서의 미래는 불확실하며, 일부 분석가들은 이를 확실한 입법 변화라기보다는 외국인 투자자에 대한 억제책으로 보고 있습니다."
    ],
    "commentSummary": [
      "스페인은 주택 가격 문제를 해결하기 위해 비EU 거주자가 구매한 주택에 대해 100% 세금을 부과하는 방안을 고려하고 있습니다. - 비평가들은 외국인 구매자가 높은 주택 가격의 주요 원인이 아니며, 느린 관료주의와 구역법이 더 중요한 요인이라고 지적합니다. - 이 제안은 주택 시장에서 외국인 소유의 역할과 주택 가격 문제 해결의 효과에 대한 논쟁을 불러일으켰습니다."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "애플은 곧 TSMC의 애리조나 공장에서 '미국산' 칩을 받을 예정입니다.",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "애플은 TSMC의 애리조나 시설에서 프로세서를 테스트하고 있으며, 첫 분기까지 대량 생산을 계획하고 있어 TSMC의 미국 내 제조 칩의 첫 번째 고객이 될 가능성이 있습니다. - 이 이니셔티브는 미국의 실리콘 독립성을 강화하고, 지정학적 및 자연적 위험에 취약한 대만에 대한 의존도를 줄이는 것을 목표로 합니다. - TSMC의 애리조나 공장은 첨단 3nm 및 2nm 칩을 생산할 예정이며, 현지 채용 강화 및 미국 대학과의 파트너십을 추진하고 있지만, 포장 작업은 피오리아 시설이 가동될 때까지 초기에는 대만에서 이루어질 것입니다."
    ],
    "commentSummary": [
      "애플은 TSMC의 애리조나 공장에서 칩을 받을 예정이지만, 미국 내 시설이 부족하여 포장을 위해 대만으로 다시 보내야 합니다. - 애리조나 공장의 인력 중 50% 이상이 대만 출신으로, 미국의 STEM(과학, 기술, 공학, 수학) 분야의 격차를 나타냅니다. - 미국 반도체 제조를 강화하기 위한 CHIPS 법안 이니셔티브는 포장 과정이 대만에서 이루어짐에 따라 '미국산' 라벨이 의문시되면서 도전에 직면하고 있으며, 2027년까지 미국 내 포장 역량을 갖출 계획입니다."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "혼잡 통행료가 시행된 후 맨해튼 도로에서 운전자가 43,000명 감소",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "혼잡 통행료가 시행된 후 60번가 이하 맨해튼에 진입하는 운전자가 7.5% 감소하여 매주 평일마다 43,000명의 운전자가 줄어들었습니다.",
      "교통량 감소로 인해 교통 흐름이 개선되고 버스 속도가 증가했으며, 일부 급행 버스는 승객 수가 증가했습니다.",
      "메트로폴리탄 교통국(MTA)은 연간 약 5억 달러로 추산되는 통행료 수익을 교통 개선에 사용하고 있으며, 일부 정치적 반대에도 불구하고 이를 추진하고 있습니다."
    ],
    "commentSummary": [
      "맨해튼에서 혼잡 통행료 제도를 시행한 결과, 운전자가 43,000명 줄어들었으며, 이는 버스 속도 증가와 잠재적으로 더 나은 응급 대응 시간을 초래했습니다.",
      "이 정책은 교통 혼잡을 줄이고 공기 질을 개선하기 위해 설계되었지만, 저소득층에 미치는 영향에 대한 논쟁을 불러일으켰습니다.",
      "지지자들은 혜택으로 더 효율적인 대중교통과 더 깨끗한 공기를 포함한다고 주장하며, 이러한 장점을 운전자의 필요와 균형을 맞추는 논의가 계속되고 있다."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
