[
  {
    "id": 42690473,
    "title": "باحث أمني في Snyk ينشر حزم NPM خبيثة تستهدف cursor.com",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "أصدر باحث أمني من شركة Snyk حزم NPM خبيثة تستهدف موقع Cursor.com، وهي شركة متخصصة في البرمجة بالذكاء الاصطناعي، لجمع بيانات النظام وإرسالها إلى خدمة يتحكم فيها المهاجم.",
      "تم تحديد الحزم المسماة \"cursor-retrieval\"، \"cursor-always-local\"، و\"cursor-shadow-workspace\" بواسطة ماسح تحليل الحزم OpenSSF، مما أدى إلى إصدار التحذيرات MAL-2025-27، MAL-2025-28، وMAL-2025-29.",
      "تسلط هذه الحادثة الضوء على أهمية فحص حزم NPM قبل التثبيت لتجنب التهديدات الأمنية المحتملة."
    ],
    "commentSummary": [
      "أصدر باحث أمني من Snyk حزم NPM (مدير حزم Node) خبيثة تستهدف cursor.com، مما يبرز ثغرات الارتباك في الاعتماديات. - أثار الحادث نقاشًا حول أخلاقيات البحث الأمني، خاصة فيما يتعلق بالكشف العلني عن متغيرات البيئة. - أوضحت cursor.com أنها لم تأذن بهذا الإجراء، واعتذرت Snyk منذ ذلك الحين، مما يبرز التحديات في موازنة البحث الأمني الهجومي مع المعايير الأخلاقية."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "لقد انتقلت إلى فايرفوكس ولم أنظر إلى الوراء أبدًا",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "يُشاد بمتصفح فايرفوكس لإدارته الفائقة للتبويبات وميزة Pocket المدمجة لحفظ الروابط وميزة البريد الإلكتروني التي تركز على الخصوصية، مما يجعله بديلاً قوياً لمتصفح كروم. - ميزات إضافية مثل أداة لقطة الشاشة سهلة الاستخدام، زر ChatGPT، وضع الصورة داخل الصورة، خيارات البحث القابلة للتخصيص، والتمرير السلس تعزز تجربة التصفح. - على الرغم من أن فايرفوكس يفتقر إلى ميزة تطبيقات الويب الخاصة بكروم، إلا أن تصميمه المدروس ومتطلباته المنخفضة للموارد تجعله الخيار المفضل لبعض المستخدمين."
    ],
    "commentSummary": [
      "يواجه مستخدمو فايرفوكس تحديات من منصات مثل يوتيوب، التي قد تقوم عمدًا بتقليل جودة التجربة لمتصفحات غير تابعة لجوجل أو للمستخدمين الذين يستخدمون أدوات حجب الإعلانات. - يثير هذا الاتجاه مخاوف بشأن استقلالية المستخدم، حيث يعاقب أولئك الذين يختارون تجربة ويب خالية من الإعلانات والمراقبة. - يقدم فايرفوكس ميزات فريدة، مثل علامات التبويب الحاوية، التي تعزز الخصوصية وسهولة الاستخدام، مما يجعله خيارًا مفضلًا للمستخدمين الذين يسعون للاستقلال عن المتصفحات التي تسيطر عليها الشركات الكبرى."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "الرئيس التنفيذي لشركة سونوس يتنحى بعد فضيحة تحديث التطبيق",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "استقال الرئيس التنفيذي لشركة سونوس بعد تحديث تطبيق مثير للجدل أجبر المستخدمين على استبدال أنظمة الصوت المكلفة، مما تسبب في استياء العملاء. - قدم التحديث نظامًا قائمًا على السحابة، مبتعدًا عن نظام التوصيل والتشغيل العالمي الموثوق (UPnP)، مما أدى إلى مشاكل في الاتصال وزيادة التعقيد. - يبرز هذا الوضع الصراع بين استراتيجيات الأعمال والحفاظ على ثقة العملاء، حيث ينتقل الرئيس التنفيذي إلى دور استشاري مع حزمة تعويضات."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "في بطن مستر بيست",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تتناول المقالة كيفية تأثير خوارزمية يوتيوب على إنشاء المحتوى، باستخدام MrBeast كدراسة حالة، مسلطة الضوء على التحول نحو المحتوى الذي يحركه التفاعل بدلاً من المحتوى ذو المعنى. - تناقش الآثار الأوسع على محو الأمية الإعلامية والتأثير الثقافي للمنصات مثل يوتيوب وتيك توك، مشيرة إلى اتجاه نحو المحتوى السطحي والتفاعلي. - يتم النظر في وجهات نظر مختلفة حول دور الخوارزميات في تشكيل المحتوى وتأثير المبدعين المشهورين على المعايير الثقافية."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "عمليات Git على GitHub متوقفة",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "واجهت GitHub انقطاعًا في عمليات Git في 13 يناير 2025 بسبب تغيير في التكوين أثر على موازن التحميل الداخلي، واستمر من الساعة 23:35 حتى 00:24 بالتوقيت العالمي. - تم حل المشكلة عن طريق التراجع عن تغيير التكوين، وتعمل GitHub على تحسين عمليات المراقبة والنشر لمنع حوادث مماثلة. - أثر الانقطاع أيضًا على خدمات Actions وPages في GitHub، مما يبرز الطبيعة المترابطة لخدمات منصتهم."
    ],
    "commentSummary": [
      "واجه GitHub انقطاعًا كبيرًا أثر على عمليات git، مما أدى إلى ارتباك بين المطورين الذين اشتبهوا في البداية بوجود مشكلات في مفاتيح SSH الخاصة بهم أو تكويناتهم المحلية. - سلط الحادث الضوء على التحديات المرتبطة بالاعتماد على الخدمات المركزية، مما أثار مناقشات حول مزايا الاستضافة الذاتية والأنظمة اللامركزية. - وعلى الرغم من حل المشكلة، إلا أنها أبرزت المخاوف بشأن موثوقية GitHub والمخاطر المرتبطة بالاعتماد على منصات الطرف الثالث للمهام الأساسية."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "تم إصدار ZFS 2.3 مع توسيع ZFS raidz",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "تم إصدار OpenZFS 2.3.0، حيث تم تقديم ميزات هامة مثل توسيع RAIDZ، وإزالة التكرار السريع، والإدخال/الإخراج المباشر، وإخراج JSON، ودعم الأسماء الطويلة للملفات. - يتضمن الإصدار إصلاحات أساسية للأخطاء وتحسينات في الأداء، وهو متوافق مع نوى لينكس من 4.18 إلى 6.12 وإصدارات FreeBSD من 13.3 إلى 14.0 - 14.2. - التحديث هو جهد تعاوني من 134 مساهمًا، مع توفر وثائق شاملة وسجل تغييرات للمراجعة."
    ],
    "commentSummary": [
      "تم إصدار ZFS 2.3، حيث تم تقديم ميزات مثل توسيع RAIDZ، وإلغاء التكرار السريع، وIO المباشر، وإخراج JSON، ودعم الأسماء الطويلة للملفات. - يُعتبر توسيع RAIDZ ملحوظًا بشكل خاص لأنه يسمح للمستخدمين بإضافة أجهزة جديدة إلى مجموعة RAIDZ موجودة دون توقف، مما يعزز سعة التخزين. - يُعتبر الإصدار تقدمًا كبيرًا لمستخدمي ZFS، حيث يتم مقارنته بأنظمة ملفات أخرى مثل Btrfs وWindows Storage Spaces، على الرغم من بعض القيود مثل عدم القدرة على تقليص المجموعات."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "ويب توب - حاويات ألباين، أوبونتو، فيدورا، وآرتش تحتوي على بيئات سطح مكتب كاملة",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "يوفر Linuxserver/webtop حاويات تعتمد على أنظمة Alpine وUbuntu وFedora وArch مع بيئات سطح مكتب كاملة يمكن الوصول إليها عبر متصفحات الويب، وتدعم كل من معماريات x86-64 وarm64.",
      "يمكن للمستخدمين اختيار بيئات سطح المكتب المختلفة مثل XFCE وKDE وMATE وi3 وOpenbox وIceWM باستخدام علامات الصور المحددة، والوصول إلى Webtop عبر عناوين URL المخصصة.",
      "تشمل ميزات الأمان خيار seccomp في Docker وإعداد المصادقة، مع توفر خيارات التخصيص من خلال متغيرات البيئة، ودعم تسريع GPU باستخدام برامج تشغيل مفتوحة المصدر."
    ],
    "commentSummary": [
      "يوفر Webtop حاويات ببيئات سطح مكتب كاملة لأنظمة Alpine وUbuntu وFedora وArch، وهي مناسبة لإعدادات سريعة خلف VPN.",
      "يشيد المستخدمون بـ Webtop لسرعته وسهولة استخدامه، خاصة عند استخدامه مع حاوية Gluetun للاتصالات الآمنة، لكنهم يحذرون من تعريض الحاويات للإنترنت دون اتخاذ تدابير أمنية بسبب عدم وجود مصادقة افتراضية.",
      "يُقدَّر المشروع لكونه مفتوح المصدر ومرنًا، حيث يشارك المستخدمون التكوينات، وتُلاحظ بدائل مثل Kasm وSelkies لأغراض مشابهة."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "وجدت دراسة أن 1 من كل 5 إعلانات وظائف عبر الإنترنت إما مزيفة أو لم يتم شغلها أبدًا",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة حديثة إلى أن 20% من إعلانات الوظائف عبر الإنترنت إما زائفة أو تبقى شاغرة، مما يزيد من إحباط الباحثين عن عمل. - قد تكون هذه الظاهرة المعروفة بـ\"الوظائف الشبحية\" تكتيكًا تستخدمه الشركات لإظهار صورة عن النمو. - وقد قدمت منصات التوظيف مثل Greenhouse وLinkedIn خدمات تحقق من الوظائف لمساعدة المستخدمين في التعرف على فرص العمل الحقيقية."
    ],
    "commentSummary": [
      "تكشف دراسة أن 20% من إعلانات الوظائف عبر الإنترنت إما زائفة أو تبقى شاغرة، غالبًا بسبب حاجة الشركات للامتثال لسياسات الهجرة الأمريكية. - قد تترك الشركات أيضًا إعلانات الوظائف مفتوحة للعثور على المرشحين المثاليين، أو لتغيير المتطلبات، أو لوجود مرشحين داخليين تم اختيارهم مسبقًا. - سوق العمل صعب بالنسبة للمتقدمين، الذين يواجهون بشكل متكرر التجاهل والرفض الآلي، مما يدفع إلى الدعوة لتدخل تنظيمي."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "جعل التقاطع غير آمن للمشاة لتوفير ثوانٍ للسائقين",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يدور النقاش حول ما إذا كان يجب على التقاطعات أن تعطي الأولوية لسلامة المشاة أو كفاءة السائقين، حيث يفضل البعض التقاطعات التي يتم التحكم فيها بالإشارات الضوئية وعبور المشاة على التوقفات الرباعية.",
      "تختلف الآراء حول قوانين المرور وتصميم البنية التحتية، مع مناقشات حول سلامة عبور المشاة في غير الأماكن المخصصة والمخاطر المرتبطة بالانعطاف إلى اليمين عند الإشارة الحمراء.",
      "يدعو البعض إلى حلول بديلة مثل الدوارات أو تبني معايير الهندسة المرورية الهولندية لتعزيز كل من السلامة والكفاءة."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL هو نظام إدارة قواعد البيانات لعام 2024",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "تم منح PostgreSQL جائزة نظام إدارة قواعد البيانات لعام 2024 من قبل DB-Engines، محققًا هذا الاعتراف للمرة الخامسة، متفوقًا على 423 نظامًا آخر لإدارة قواعد البيانات.",
      "يواصل PostgreSQL الابتكار بعد تاريخ يمتد لأكثر من 35 عامًا، كما يتضح من التحسينات الأخيرة في PostgreSQL 17، الذي تم إصداره في سبتمبر 2024.",
      "احتلت Snowflake وMicrosoft المركزين الثاني والثالث على التوالي، حيث تميزت Snowflake بتخزين البيانات السحابي ودعم السحابة المتعددة، بينما تقدم Microsoft قواعد بيانات علائقية مُدارة قوية من خلال Azure SQL Database وSQL Server."
    ],
    "commentSummary": [
      "تم منح PostgreSQL جائزة نظام إدارة قواعد البيانات لعام 2024 من قبل db-engines.com، مما يبرز شعبيته المتزايدة والاعتراف به في الصناعة.",
      "يفكر المستخدمون في الانتقال من Microsoft SQL Server إلى PostgreSQL بسبب التكاليف العالية للتراخيص والقيود على الموارد، على الرغم من التحديات المحتملة في عملية الانتقال.",
      "يُفضل PostgreSQL لميزاته القوية وفعاليته من حيث التكلفة، مما يجعله خيارًا مفضلاً للمشاريع المستقبلية، على الرغم من أن بعض المستخدمين يستكشفون بدائل مثل Babelfish لتقليل التكاليف."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "تسجيل الدخول باستخدام OAuth من جوجل لا يحمي من شراء نطاق شركة ناشئة فاشلة",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تسلط المناقشة الضوء على ثغرة في نظام تسجيل الدخول OAuth الخاص بجوجل عندما يتم الاستحواذ على نطاق شركة ناشئة فاشلة من قبل مالك جديد، مما قد يسمح بالوصول غير المصرح به إلى الخدمات.",
      "تنشأ هذه المشكلة لأن جوجل قد لا تميز بين المالكين الأصليين والجدد للنطاق، مما يؤثر على أي نظام يستخدم المصادقة المستندة إلى النطاق.",
      "الحل المقترح هو استخدام معرفات فريدة تظل ثابتة مع مرور الوقت، على الرغم من أن تنفيذ هذا الحل يختلف بين مزودي الهوية."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "استخدام مهارات البرمجة لتحقيق دخل سلبي",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "انتقل المؤلف من دور مدير التكنولوجيا التنفيذي إلى العمل كريادي منفرد، ونجح في كسب المزيد من خلال مجموعة من المنتجات البرمجية.",
      "تشمل الاستراتيجيات الرئيسية التركيز على العمل العميق، والبدء بمشاريع صغيرة، والتكرار بسرعة، وتخصيص الوقت للجهود التسويقية.",
      "تؤكد الرحلة على المرونة بسبب عدم اليقين، لكنها تسلط الضوء على الاستقلالية والحرية التي لا مثيل لها في هذا المسار الوظيفي، مما يشجع أولئك الذين يمتلكون مهارات البرمجة على التفكير فيه كمصدر دخل سلبي."
    ],
    "commentSummary": [
      "وصف مستخدم كيفية توليد دخل سلبي من خلال مواقع الويب التي تستخدم البريد العشوائي لتحسين محركات البحث باستخدام أسماء النطاقات المنتهية، حيث يكسب حوالي 30 ألف دولار سنويًا، على الرغم من المخاوف الأخلاقية وحملة جوجل النهائية ضد هذه الممارسات.",
      "أثار المنشور نقاشًا حول الدخل السلبي، حيث جادل بعض المستخدمين بأنه يشبه إدارة الأعمال أكثر من كونه أرباحًا سلبية حقيقية.",
      "شارك المشاركون تجاربهم وتحدياتهم في المشاريع الجانبية، مسلطين الضوء على أهمية الوقت والمرونة والتخطيط الاستراتيجي."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "إسبانيا تقترح ضريبة بنسبة 100% على المنازل التي يشتريها المقيمون من خارج الاتحاد الأوروبي",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "تدرس إسبانيا فرض ضريبة بنسبة 100% على شراء العقارات من قبل المقيمين من خارج الاتحاد الأوروبي، بهدف معالجة أزمة الإسكان والحد من الشراء المضاربي.",
      "تشمل اقتراحات رئيس الوزراء بيدرو سانشيز توسيع الإسكان الاجتماعي وتنظيم الإيجارات السياحية لمعالجة التفاوت بين أسعار المساكن والدخول.",
      "مستقبل الاقتراح كقانون غير مؤكد، حيث يرى بعض المحللين أنه يشكل رادعًا للمستثمرين الأجانب بدلاً من أن يكون تغييرًا تشريعيًا مضمونًا."
    ],
    "commentSummary": [
      "تدرس إسبانيا فرض ضريبة بنسبة 100% على المنازل التي يشتريها المقيمون من خارج الاتحاد الأوروبي لمعالجة مشاكل القدرة على تحمل تكاليف السكن. - يشير النقاد إلى أن المشترين الأجانب ليسوا السبب الرئيسي لارتفاع أسعار المساكن، مشيرين إلى البيروقراطية البطيئة وقوانين تقسيم المناطق كعوامل أكثر أهمية. - أثار الاقتراح نقاشًا حول دور الملكية الأجنبية في أسواق الإسكان وفعاليته في حل قضايا القدرة على تحمل التكاليف."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "ستتلقى شركة آبل قريبًا رقائق 'صُنعت في أمريكا' من مصنع TSMC في أريزونا",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "تختبر شركة آبل معالجات من منشأة TSMC في أريزونا، مع خطط للإنتاج الضخم بحلول الربع الأول، مما قد يجعلها أول عميل لـ TSMC في الولايات المتحدة للرقائق المصنعة محليًا. - تهدف هذه المبادرة إلى تعزيز استقلالية السيليكون في الولايات المتحدة، وتقليل الاعتماد على تايوان، التي تعتبر عرضة للمخاطر الجيوسياسية والطبيعية. - من المقرر أن تنتج منشأة TSMC في أريزونا رقائق متقدمة بحجم 3 نانومتر و2 نانومتر، مع جهود مستمرة لتعزيز التوظيف المحلي والشراكات مع الجامعات الأمريكية، على الرغم من أن التغليف سيتم في البداية في تايوان حتى تصبح منشأة بيوريا جاهزة للعمل."
    ],
    "commentSummary": [
      "ستتلقى شركة آبل رقائق من مصنع TSMC في أريزونا، ولكن يجب إرسالها مرة أخرى إلى تايوان للتغليف بسبب نقص المرافق في الولايات المتحدة. - أكثر من 50% من القوى العاملة في مصنع أريزونا هم من تايوان، مما يشير إلى وجود فجوة في مجال العلوم والتكنولوجيا والهندسة والرياضيات (STEM) في الولايات المتحدة. - تواجه مبادرة قانون الرقائق، التي تهدف إلى تعزيز تصنيع أشباه الموصلات في الولايات المتحدة، تحديات حيث يتم التشكيك في علامة \"صنع في أمريكا\" بسبب عملية التغليف التي تحدث في تايوان، مع خطط لتوفير قدرات تغليف في الولايات المتحدة بحلول عام 2027."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "43 ألف سائق أقل على طرق مانهاتن بعد تفعيل تسعير الازدحام",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "بعد تنفيذ تسعير الازدحام، كان هناك انخفاض بنسبة 7.5% في عدد السائقين الذين يدخلون مانهاتن أسفل الشارع الستين، مما يعادل 43,000 سائق أقل كل يوم من أيام الأسبوع.",
      "أدى تقليل حركة المرور إلى تحسين تدفق الحركة وزيادة سرعات الحافلات، حيث شهدت بعض الحافلات السريعة زيادة في عدد الركاب.",
      "تستخدم هيئة النقل الحضرية (MTA) إيرادات الرسوم، التي تُقدر بحوالي 500 مليون دولار سنويًا، لتحسينات النقل، على الرغم من بعض المعارضة السياسية."
    ],
    "commentSummary": [
      "أدى تنفيذ تسعير الازدحام في مانهاتن إلى تقليل عدد السائقين بمقدار 43,000، مما أدى إلى زيادة سرعات الحافلات وربما تحسين أوقات استجابة الطوارئ.",
      "تم تصميم السياسة لتقليل الازدحام المروري وتحسين جودة الهواء، على الرغم من أنها أثارت جدلاً حول تأثيرها على الأفراد ذوي الدخل المنخفض.",
      "يجادل المؤيدون بأن الفوائد تشمل وسائل نقل عام أكثر كفاءة وهواء أنظف، بينما تستمر المناقشات حول موازنة هذه المزايا مع احتياجات السائقين."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
