[
  {
    "id": 42690473,
    "title": "Snyk-tietoturvatutkija ottaa käyttöön haitallisia NPM-paketteja, jotka kohdistuvat cursor.com-sivustoon.",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "Eräs Snykin tietoturvatutkija julkaisi haitallisia NPM-paketteja, jotka kohdistuivat Cursor.comiin, tekoälykoodausyritykseen, kerätäkseen järjestelmätietoja ja lähettääkseen ne hyökkääjän hallitsemaan palveluun.",
      "Pakettien nimet ovat \"cursor-retrieval\", \"cursor-always-local\" ja \"cursor-shadow-workspace\", ja ne merkittiin OpenSSF-pakettianalyysiskannerin toimesta, mikä johti neuvonantoihin MAL-2025-27, MAL-2025-28 ja MAL-2025-29.",
      "Tämä tapaus korostaa NPM-pakettien tarkastelun tärkeyttä ennen asennusta mahdollisten tietoturvauhkien välttämiseksi."
    ],
    "commentSummary": [
      "Eräs Snykin tietoturvatutkija julkaisi haitallisia NPM (Node Package Manager) -paketteja, jotka kohdistuivat cursor.comiin, tuoden esiin riippuvuuksien sekaantumiseen liittyviä haavoittuvuuksia. - Tapaus on herättänyt keskustelua tietoturvatutkimuksen etiikasta, erityisesti ympäristömuuttujien julkiseen paljastamiseen liittyen. - Cursor.com selvensi, etteivät he olleet valtuuttaneet toimintaa, ja Snyk on sittemmin pyytänyt anteeksi, korostaen hyökkäävän tietoturvatutkimuksen ja eettisten standardien tasapainottamisen haasteita."
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "Vaihdoinkin Firefoxiin enkä ole katsonut taaksepäin",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "Firefoxia kehutaan sen erinomaisesta välilehtien hallinnasta, sisäänrakennetusta Pocket-ominaisuudesta linkkien tallentamiseen ja yksityisyyteen keskittyvästä sähköpostin välityspalvelusta, mikä tekee siitä vahvan vaihtoehdon Chromelle. - Lisäominaisuudet, kuten käyttäjäystävällinen kuvakaappaustyökalu, ChatGPT-painike, Picture-in-Picture, muokattavat hakuvaihtoehdot ja sujuva vieritys parantavat selauskokemusta. - Vaikka Firefoxilta puuttuu Chromen verkkosovellusominaisuus, sen harkittu suunnittelu ja vähäisempi resurssien kulutus tekevät siitä joidenkin käyttäjien suosikin."
    ],
    "commentSummary": [
      "Firefox-käyttäjät kohtaavat haasteita alustoilta, kuten YouTube, jotka saattavat tahallisesti heikentää kokemusta ei-Google-selaimille tai käyttäjille, jotka käyttävät mainostenesto-ohjelmia. - Tämä suuntaus herättää huolta käyttäjien autonomiasta, sillä se rankaisee niitä, jotka valitsevat mainosvapaan ja valvonnasta vapaan verkkokokemuksen. - Firefox tarjoaa ainutlaatuisia ominaisuuksia, kuten konttivälilehtiä, jotka parantavat yksityisyyttä ja käytettävyyttä, tehden siitä suositun valinnan käyttäjille, jotka etsivät riippumattomuutta suurten yritysten hallitsemista selaimista."
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "Sonosin toimitusjohtaja eroaa sovelluspäivityksen epäonnistumisen jälkeen",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Sonosin toimitusjohtaja on eronnut kiistanalaisen sovelluspäivityksen jälkeen, joka vaati käyttäjiä korvaamaan kalliit äänijärjestelmät, aiheuttaen asiakastyytymättömyyttä. - Päivitys toi mukanaan pilvipohjaisen järjestelmän, joka siirtyi pois luotettavasta Universal Plug and Play (UPnP) -järjestelmästä, mikä johti yhteysongelmiin ja lisäsi monimutkaisuutta. - Tämä tilanne korostaa liiketoimintastrategioiden ja asiakassuhteiden ylläpitämisen välistä ristiriitaa, kun toimitusjohtaja siirtyy neuvonantajan rooliin erorahapaketin kanssa."
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "MrBeastin vatsassa",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Essee tutkii, kuinka YouTuben algoritmi vaikuttaa sisällön luomiseen, käyttäen MrBeastia tapaustutkimuksena, ja korostaa siirtymää kohti sitoutumislähtöistä pikemminkin kuin merkityksellistä sisältöä. - Se käsittelee laajempia vaikutuksia medialukutaitoon ja kulttuurista vaikutusta alustoilla kuten YouTube ja TikTok, ehdottaen suuntausta pinnalliseen ja reaktiiviseen sisältöön. - Eri näkökulmia tarkastellaan algoritmien roolista sisällön muokkaamisessa ja suosittujen tekijöiden vaikutuksesta kulttuurisiin normeihin."
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "Gitin GitHub-operaatiot ovat alhaalla",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "GitHub kohtasi Git-toimintojen katkoksen 13. tammikuuta 2025, johtuen kokoonpanomuutoksesta, joka vaikutti sisäiseen kuormantasaajaan, kestäen 23:35:stä 00:24:ään UTC-aikaa. - Ongelma ratkaistiin palauttamalla kokoonpanomuutos, ja GitHub työskentelee parantaakseen valvonta- ja käyttöönottoprosesseja estääkseen vastaavat tapaukset. - Katkos vaikutti myös GitHubin Actions- ja Pages-palveluihin, korostaen niiden alustapalveluiden keskinäistä yhteyttä."
    ],
    "commentSummary": [
      "GitHub kohtasi merkittävän katkoksen, joka vaikutti git-toimintoihin ja aiheutti hämmennystä kehittäjien keskuudessa, jotka aluksi epäilivät ongelmia SSH-avaimissaan tai paikallisissa kokoonpanoissaan. - Tapaus korosti keskitettyihin palveluihin luottamisen haasteita ja herätti keskusteluja itseisännöinnin ja hajautettujen järjestelmien eduista. - Vaikka ongelma ratkaistiin, se toi esiin huolenaiheita GitHubin luotettavuudesta ja kolmannen osapuolen alustojen varaan rakentamisen riskeistä olennaisissa tehtävissä."
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3 julkaistu ZFS raidz -laajennuksella",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0 on julkaistu, ja se tuo mukanaan merkittäviä ominaisuuksia, kuten RAIDZ-laajennuksen, nopean deduplikoinnin, suoran syötteen/ulostulon, JSON-ulostulon ja tuen pitkille tiedostonimille. - Julkaisu sisältää olennaisia virheenkorjauksia ja suorituskyvyn parannuksia, ja se on yhteensopiva Linux-ytimien 4.18 - 6.12 ja FreeBSD-versioiden 13.3, 14.0 - 14.2 kanssa. - Päivitys on 134 avustajan yhteistyön tulos, ja siitä on saatavilla kattava dokumentaatio ja muutosloki tarkasteltavaksi."
    ],
    "commentSummary": [
      "ZFS 2.3 on julkaistu, ja se tuo mukanaan ominaisuuksia kuten RAIDZ-laajennus, nopea deduplikointi, suora IO, JSON-tuloste ja tuki pitkille tiedostonimille. - RAIDZ-laajennus on erityisen merkittävä, sillä se mahdollistaa käyttäjille uusien laitteiden lisäämisen olemassa olevaan RAIDZ-pooliin ilman käyttökatkoa, mikä parantaa tallennuskapasiteettia. - Julkaisua pidetään merkittävänä edistysaskeleena ZFS-käyttäjille, ja sitä verrataan muihin tiedostojärjestelmiin kuten Btrfs ja Windows Storage Spaces, vaikka sillä on joitakin rajoituksia, kuten kyvyttömyys pienentää pooleja."
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "Webtop – Alpine-, Ubuntu-, Fedora- ja Arch-kontit, jotka sisältävät täydet työpöytäympäristöt",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop tarjoaa kontteja, jotka perustuvat Alpineen, Ubuntuun, Fedoraan ja Archiin, ja joissa on täydet työpöytäympäristöt, jotka ovat käytettävissä verkkoselaimien kautta, tukien sekä x86-64 että arm64-arkkitehtuureja.",
      "Kayttäjät voivat valita erilaisista työpöytäympäristöistä, kuten XFCE, KDE, MATE, i3, Openbox ja IceWM, käyttämällä tiettyjä kuvamerkintöjä ja käyttää Webtopia määrättyjen URL-osoitteiden kautta.",
      "Turvaominaisuuksiin kuuluvat Dockerin seccomp-vaihtoehto ja todennuksen asennus, mukautusmahdollisuudet ympäristömuuttujien kautta sekä tuki GPU-kiihdytykselle avoimen lähdekoodin ajureilla."
    ],
    "commentSummary": [
      "Webtop tarjoaa kontteja, joissa on täydet työpöytäympäristöt Alpine-, Ubuntu-, Fedora- ja Arch-järjestelmille, sopien nopeisiin asennuksiin VPN:n taakse.",
      "Webtopin käyttäjät kehuvat sen nopeutta ja helppokäyttöisyyttä, erityisesti kun sitä käytetään Gluetun-kontin kanssa turvallisten yhteyksien luomiseksi, mutta varoittavat konttien altistamisesta internetille ilman turvatoimia oletusautentikoinnin puutteen vuoksi.",
      "Projektia arvostetaan sen avoimen lähdekoodin ja joustavuuden vuoksi, ja käyttäjät jakavat kokoonpanoja. Vaihtoehdot kuten Kasm ja Selkies mainitaan samanlaisiin tarkoituksiin."
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "1 viidestä verkossa julkaistusta työpaikkailmoituksesta on joko väärennös tai niitä ei koskaan täytetä, tutkimus paljastaa",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "Äskettäinen tutkimus osoittaa, että 20 % verkossa olevista työpaikkailmoituksista on joko väärennettyjä tai jää täyttämättä, mikä lisää työnhakijoiden turhautumista. - Tämä \"haamutyöpaikkojen\" trendi saattaa olla yritysten keino luoda kuvaa kasvusta. - Työpaikka-alustat, kuten Greenhouse ja LinkedIn, ovat ottaneet käyttöön työpaikkojen varmennuspalveluita auttaakseen käyttäjiä tunnistamaan aidot työmahdollisuudet."
    ],
    "commentSummary": [
      "Eräs tutkimus paljastaa, että 20 % verkossa olevista työpaikkailmoituksista on joko väärennettyjä tai jää täyttämättä, usein siksi, että yritysten on noudatettava Yhdysvaltojen maahanmuuttopolitiikkaa. - Yritykset voivat myös pitää työpaikkailmoituksia esillä löytääkseen ihanteellisia ehdokkaita, muuttaakseen vaatimuksia tai koska heillä on jo valmiiksi valittuja sisäisiä ehdokkaita. - Työmarkkinat ovat hakijoille vaikeat, ja he kohtaavat usein \"ghostingia\" ja automatisoituja hylkäyksiä, mikä on johtanut vaatimuksiin sääntelytoimista."
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "Tehdä risteyksestä turvaton jalankulkijoille säästääkseen sekunteja autoilijoille",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keskustelu keskittyy siihen, tulisiko risteyksissä asettaa etusijalle jalankulkijoiden turvallisuus vai autoilijoiden tehokkuus, ja jotkut suosivat liikennevalo-ohjattuja risteyksiä ja jalankulkijoiden ylityksiä neljän suunnan pysähdysten sijaan.",
      "Mielipiteet vaihtelevat liikennelakien ja infrastruktuurin suunnittelun suhteen, ja keskusteluja käydään muun muassa kadunylityksen turvallisuudesta ja oikealle kääntymisen riskeistä punaisissa valoissa.",
      "Jotkut kannattavat vaihtoehtoisia ratkaisuja, kuten liikenneympyröitä tai hollantilaisten liikennesuunnittelustandardien omaksumista, parantaakseen sekä turvallisuutta että tehokkuutta."
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "PostgreSQL on vuoden 2024 tietokannan hallintajärjestelmä.",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL on saanut DB-Enginesin myöntämän Vuoden DBMS 2024 -palkinnon, saavuttaen tämän tunnustuksen viidennen kerran, ohittaen 423 muuta tietokannan hallintajärjestelmää.",
      "PostgreSQL, jolla on lähes 35 vuoden historia, jatkaa innovointia, kuten nähdään syyskuussa 2024 julkaistun PostgreSQL 17:n viimeaikaisissa parannuksissa.",
      "Snowflake ja Microsoft saavuttivat toisen ja kolmannen sijan, Snowflaken erottuessa pilvipohjaisesta tietovarastoinnistaan ja monipilvitukensa ansiosta, kun taas Microsoft tarjoaa vankkoja hallittuja relaatiotietokantoja Azure SQL Database- ja SQL Server -palveluiden kautta."
    ],
    "commentSummary": [
      "PostgreSQL on saanut vuoden 2024 tietokannan hallintajärjestelmän palkinnon db-engines.com-sivustolta, mikä korostaa sen kasvavaa suosiota ja tunnustusta alalla.",
      "Käyttäjät harkitsevat siirtymistä Microsoft SQL Serveristä PostgreSQL:ään korkeiden lisensointikustannusten ja resurssirajoitusten vuoksi, huolimatta mahdollisista siirtymähaasteista.",
      "PostgreSQL on suosittu sen vankkojen ominaisuuksien ja kustannustehokkuuden vuoksi, mikä tekee siitä suositun valinnan tuleviin projekteihin, vaikka jotkut käyttäjät tutkivat vaihtoehtoja, kuten Babelfish, kustannusten vähentämiseksi."
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "Googlen OAuth-kirjautuminen ei suojaa epäonnistuneen startup-yrityksen verkkotunnuksen ostamiselta",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keskustelu tuo esiin haavoittuvuuden Googlen OAuth-kirjautumisjärjestelmässä, kun epäonnistuneen startup-yrityksen verkkotunnus hankitaan uuden omistajan toimesta, mikä voi mahdollisesti sallia luvattoman pääsyn palveluihin.",
      "Tämä ongelma syntyy, koska Google ei välttämättä erota alkuperäisiä ja uusia verkkotunnuksen omistajia toisistaan, mikä vaikuttaa kaikkiin järjestelmiin, jotka käyttävät verkkotunnuspohjaista todennusta.",
      "Yksi ehdotettu ratkaisu on käyttää yksilöllisiä tunnisteita, jotka pysyvät muuttumattomina ajan myötä, vaikka tämän ratkaisun toteutus vaihtelee eri identiteetin tarjoajien kesken."
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "Koodausosaamisen hyödyntäminen passiivisen tulon hankkimiseen",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja siirtyi teknologiajohtajan roolista yksinyrittäjäksi ja ansaitsi menestyksekkäästi enemmän ohjelmistotuotteiden portfoliollaan.",
      "Keskeisiin strategioihin kuuluu keskittyminen syvälliseen työskentelyyn, aloittaminen pienistä projekteista, nopea iterointi ja ajan omistaminen markkinointiponnisteluille.",
      "Matka korostaa epävarmuuksien vuoksi resilienssiä, mutta tuo esiin tämän urapolun vertaansa vailla olevan autonomian ja vapauden, kannustaen koodaustaitoisia harkitsemaan sitä passiivisen tulon lähteenä."
    ],
    "commentSummary": [
      "Eräs käyttäjä kuvaili passiivisen tulon hankkimista SEO-spam-sivustojen kautta käyttämällä vanhentuvia verkkotunnuksia, ansaiten noin 30 000 dollaria vuodessa, huolimatta eettisistä huolenaiheista ja Googlen lopulta tapahtuvasta tiukennuksesta.",
      "Julkaisu herätti keskustelua passiivisista tuloista, ja jotkut käyttäjät väittivät, että se muistuttaa enemmän yrityksen pyörittämistä kuin todellisia passiivisia ansioita.",
      "Osallistujat jakoivat kokemuksia ja haasteita sivuprojekteissa, korostaen ajan, sitkeyden ja strategisen suunnittelun merkitystä."
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "Espanja ehdottaa 100 % veroa EU:n ulkopuolisten asukkien ostamille asunnoille",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "Espanja harkitsee 100 % veroa kiinteistöhankinnoille, jotka tehdään EU:n ulkopuolisilta asukkailta, pyrkien ratkaisemaan asuntokriisiä ja hillitsemään spekulatiivista ostamista.",
      "Pääministeri Pedro Sánchezin ehdotus sisältää sosiaalisen asuntotuotannon laajentamisen ja turistivuokrausten sääntelyn, jotta voitaisiin puuttua asuntohintojen ja tulojen väliseen epätasapainoon.",
      "Ehdotuksen tulevaisuus lakina on epävarma, ja jotkut analyytikot pitävät sitä pikemminkin ulkomaisten sijoittajien pelotteena kuin taattuna lainsäädännöllisenä muutoksena."
    ],
    "commentSummary": [
      "Espanja harkitsee 100 % veroa EU:n ulkopuolisten asukkaiden ostamille asunnoille ratkaistakseen asuntojen kohtuuhintaisuuteen liittyviä ongelmia. - Kriitikot väittävät, että ulkomaiset ostajat eivät ole asuntojen korkeiden hintojen ensisijainen syy, vaan hitaat byrokratiaprosessit ja kaavoituslait ovat merkittävämpiä tekijöitä. - Ehdotus on herättänyt keskustelua ulkomaisen omistuksen roolista asuntomarkkinoilla ja sen tehokkuudesta kohtuuhintaisuuskysymysten ratkaisemisessa."
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "Apple saa pian 'made in America' -sirut TSMC:n Arizonan tehtaasta",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "Apple testaa TSMC:n Arizonan laitoksen prosessoreita, suunnitellen massatuotantoa ensimmäiselle vuosineljännekselle, ja saattaa näin tulla TSMC:n ensimmäiseksi Yhdysvaltain asiakkaaksi paikallisesti valmistetuille siruille. - Tämä aloite pyrkii vahvistamaan Yhdysvaltojen piiriomavaraisuutta, vähentäen riippuvuutta Taiwanista, joka on altis geopoliittisille ja luonnonriskeille. - TSMC:n Arizonan tehdas aikoo tuottaa edistyneitä 3nm ja 2nm siruja, ja pyrkii parantamaan paikallista rekrytointia sekä yhteistyötä Yhdysvaltain yliopistojen kanssa, vaikka pakkaaminen tapahtuukin aluksi Taiwanissa, kunnes Peorian laitos on toiminnassa."
    ],
    "commentSummary": [
      "Apple saa siruja TSMC:n Arizonan tehtaalta, mutta ne on lähetettävä takaisin Taiwaniin pakkausta varten Yhdysvaltojen riittämättömien tilojen vuoksi. - Yli 50 % Arizonan tehtaan työvoimasta on Taiwanista, mikä osoittaa puutteen Yhdysvaltojen STEM (tiede, teknologia, insinööritiede ja matematiikka) alalla. - CHIPS Act -aloite, jonka tavoitteena on parantaa Yhdysvaltojen puolijohdevalmistusta, kohtaa haasteita, kun \"Made in America\" -merkintää kyseenalaistetaan pakkausprosessin tapahtuessa Taiwanissa, ja suunnitelmissa on Yhdysvaltojen pakkauskapasiteetin kehittäminen vuoteen 2027 mennessä."
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "43 000 kuljettajaa vähemmän Manhattanin teillä ruuhkamaksujen käyttöönoton jälkeen",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "Ruuhkamaksujen käyttöönoton jälkeen Manhattanille 60. kadun alapuolelle ajavien kuljettajien määrä väheni 7,5 %, mikä tarkoittaa 43 000 vähemmän kuljettajaa joka arkipäivä.",
      "Liikenteen väheneminen on parantanut liikenteen sujuvuutta ja lisännyt bussien nopeuksia, ja joillakin pikabusseilla on ollut enemmän matkustajia.",
      "Metropolitan Transportation Authority (MTA) käyttää tietullituloja, joiden arvioidaan olevan 500 miljoonaa dollaria vuosittain, liikenteen parannuksiin, huolimatta joistakin poliittisista vastustuksista."
    ],
    "commentSummary": [
      "Ruuhkamaksujen käyttöönotto Manhattanilla on johtanut 43 000 kuljettajan vähenemiseen, mikä on lisännyt bussien nopeuksia ja mahdollisesti parantanut hätätilanteisiin vastaamisaikoja.",
      "Politiikan tarkoituksena on vähentää liikenneruuhkia ja parantaa ilmanlaatua, vaikka se onkin herättänyt keskustelua sen vaikutuksista pienituloisiin henkilöihin.",
      "Kannattajat väittävät, että hyödyt sisältävät tehokkaamman joukkoliikenteen ja puhtaamman ilman, kun taas keskustelut jatkuvat näiden etujen tasapainottamisesta autoilijoiden tarpeiden kanssa."
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
