[
  {
    "id": 42690473,
    "title": "स्नाइक सुरक्षा शोधकर्ता ने कर्सर.कॉम को लक्षित करते हुए दुर्भावनापूर्ण एनपीएम पैकेज तैनात किए।",
    "originLink": "https://sourcecodered.com/snyk-malicious-npm-package/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690473",
    "commentBody": "",
    "originSummary": [
      "एक Snyk सुरक्षा शोधकर्ता ने Cursor.com, एक AI कोडिंग कंपनी, को लक्षित करते हुए दुर्भावनापूर्ण NPM पैकेज जारी किए, ताकि सिस्टम डेटा एकत्र किया जा सके और इसे हमलावर-नियंत्रित सेवा पर भेजा जा सके।",
      "पैकेजों को \"कर्सर-रिट्रीवल,\" \"कर्सर-ऑलवेज-लोकल,\" और \"कर्सर-शैडो-वर्कस्पेस\" के रूप में पहचाना गया, जिन्हें OpenSSF पैकेज विश्लेषण स्कैनर द्वारा चिह्नित किया गया, जिसके परिणामस्वरूप परामर्श MAL-2025-27, MAL-2025-28, और MAL-2025-29 जारी किए गए।",
      "यह घटना संभावित सुरक्षा खतरों से बचने के लिए स्थापना से पहले NPM पैकेजों की जांच करने के महत्व को उजागर करती है।"
    ],
    "commentSummary": [
      "एक Snyk सुरक्षा शोधकर्ता ने cursor.com को लक्षित करते हुए हानिकारक NPM (नोड पैकेज मैनेजर) पैकेज जारी किए, जो निर्भरता भ्रम कमजोरियों को उजागर करते हैं। - इस घटना ने सुरक्षा अनुसंधान की नैतिकता पर बहस छेड़ दी है, विशेष रूप से पर्यावरण वेरिएबल्स के सार्वजनिक प्रदर्शन के संबंध में। - Cursor.com ने स्पष्ट किया कि उन्होंने इस कार्रवाई को अधिकृत नहीं किया था, और Snyk ने इसके बाद माफी मांगी है, जो आक्रामक सुरक्षा अनुसंधान को नैतिक मानकों के साथ संतुलित करने की चुनौतियों को रेखांकित करता है।"
    ],
    "points": 540,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1736807907
  },
  {
    "id": 42696081,
    "title": "मैंने फ़ायरफ़ॉक्स पर स्विच किया और फिर कभी पीछे मुड़कर नहीं देखा",
    "originLink": "https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696081",
    "commentBody": "",
    "originSummary": [
      "फायरफॉक्स को इसके उत्कृष्ट टैब प्रबंधन, लिंक सहेजने के लिए अंतर्निहित पॉकेट फीचर, और गोपनीयता-केंद्रित ईमेल रिले के लिए सराहा जाता है, जो इसे क्रोम का एक मजबूत विकल्प बनाता है। - उपयोगकर्ता के अनुकूल स्क्रीनशॉट टूल, एक चैटजीपीटी बटन, पिक्चर-इन-पिक्चर, अनुकूलन योग्य खोज विकल्प, और स्मूथ स्क्रॉलिंग जैसी अतिरिक्त विशेषताएं ब्राउज़िंग अनुभव को बेहतर बनाती हैं। - हालांकि फायरफॉक्स में क्रोम की वेब ऐप सुविधा की कमी है, लेकिन इसका विचारशील डिज़ाइन और कम संसाधन मांग इसे कुछ उपयोगकर्ताओं के लिए पसंदीदा विकल्प बनाते हैं।"
    ],
    "commentSummary": [
      "फायरफॉक्स उपयोगकर्ताओं को यूट्यूब जैसे प्लेटफार्मों से चुनौतियों का सामना करना पड़ता है, जो गैर-गूगल ब्राउज़रों या विज्ञापन अवरोधकों का उपयोग करने वाले उपयोगकर्ताओं के लिए जानबूझकर अनुभव को खराब कर सकते हैं। - यह प्रवृत्ति उपयोगकर्ता स्वायत्तता के बारे में चिंताएं बढ़ाती है, क्योंकि यह उन लोगों को दंडित करती है जो विज्ञापन-मुक्त और निगरानी-मुक्त वेब अनुभव का विकल्प चुनते हैं। - फायरफॉक्स अद्वितीय विशेषताएं प्रदान करता है, जैसे कंटेनर टैब्स, जो गोपनीयता और उपयोगिता को बढ़ाते हैं, इसे प्रमुख कॉर्पोरेट-नियंत्रित ब्राउज़रों से स्वतंत्रता चाहने वाले उपयोगकर्ताओं के लिए एक पसंदीदा विकल्प बनाते हैं।"
    ],
    "points": 480,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1736854678
  },
  {
    "id": 42687932,
    "title": "सोनोस के सीईओ ने ऐप अपडेट विवाद के बाद इस्तीफा दिया",
    "originLink": "https://www.reuters.com/business/retail-consumer/sonos-ceo-patrick-spence-steps-down-after-app-update-debacle-2025-01-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42687932",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "सोनोस के सीईओ ने इस्तीफा दे दिया है, एक विवादास्पद ऐप अपडेट के बाद जिसने उपयोगकर्ताओं को महंगे साउंड सिस्टम को बदलने के लिए मजबूर किया, जिससे ग्राहक असंतोष उत्पन्न हुआ। - इस अपडेट ने एक क्लाउड-आधारित सिस्टम पेश किया, जो विश्वसनीय यूनिवर्सल प्लग एंड प्ले (UPnP) से हटकर था, जिससे कनेक्टिविटी समस्याएं और जटिलता बढ़ गई। - यह स्थिति व्यापारिक रणनीतियों और ग्राहक विश्वास बनाए रखने के बीच के संघर्ष को उजागर करती है, क्योंकि सीईओ एक सलाहकार भूमिका में एक सेवरेंस पैकेज के साथ स्थानांतरित हो रहे हैं।"
    ],
    "points": 409,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1736797368
  },
  {
    "id": 42696691,
    "title": "MrBeast के पेट में",
    "originLink": "https://kevinmunger.substack.com/p/in-the-belly-of-the-mrbeast",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696691",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "निबंध यह जांचता है कि YouTube का एल्गोरिदम सामग्री निर्माण को कैसे प्रभावित करता है, जिसमें MrBeast को एक केस स्टडी के रूप में उपयोग किया गया है, जो यह दर्शाता है कि सामग्री अब अर्थपूर्ण होने के बजाय सगाई-चालित हो रही है। - यह मीडिया साक्षरता के व्यापक प्रभावों और YouTube और TikTok जैसे प्लेटफार्मों के सांस्कृतिक प्रभाव पर चर्चा करता है, यह सुझाव देते हुए कि सामग्री सतही और प्रतिक्रियात्मक हो रही है। - सामग्री को आकार देने में एल्गोरिदम की भूमिका और सांस्कृतिक मानदंडों पर लोकप्रिय निर्माताओं के प्रभाव पर विभिन्न दृष्टिकोणों पर विचार किया गया है।"
    ],
    "points": 369,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736859931
  },
  {
    "id": 42691184,
    "title": "GitHub गिट ऑपरेशन्स डाउन हैं",
    "originLink": "https://www.githubstatus.com/incidents/qd96yfgvmcf9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42691184",
    "commentBody": "",
    "originSummary": [
      "13 जनवरी, 2025 को GitHub को एक Git ऑपरेशन्स आउटेज का सामना करना पड़ा, जो आंतरिक लोड बैलेंसर को प्रभावित करने वाले एक कॉन्फ़िगरेशन परिवर्तन के कारण हुआ, और यह 23:35 से 00:24 UTC तक चला। - इस समस्या को कॉन्फ़िगरेशन परिवर्तन को वापस लेकर हल किया गया, और GitHub समान घटनाओं को रोकने के लिए निगरानी और परिनियोजन प्रक्रियाओं में सुधार करने पर काम कर रहा है। - इस आउटेज ने GitHub के Actions और Pages सेवाओं को भी प्रभावित किया, जो उनके प्लेटफ़ॉर्म सेवाओं की आपस में जुड़ी प्रकृति को उजागर करता है।"
    ],
    "commentSummary": [
      "GitHub को एक बड़ी रुकावट का सामना करना पड़ा, जिसने गिट ऑपरेशन्स को प्रभावित किया, जिससे डेवलपर्स के बीच भ्रम की स्थिति उत्पन्न हो गई, जिन्होंने शुरू में अपने SSH कुंजियों या स्थानीय कॉन्फ़िगरेशन्स में समस्याओं का संदेह किया। - इस घटना ने केंद्रीकृत सेवाओं पर निर्भरता की चुनौतियों को उजागर किया, जिससे स्व-होस्टिंग और विकेंद्रीकृत प्रणालियों के फायदों पर चर्चाएं शुरू हुईं। - हालांकि समस्या का समाधान हो गया, लेकिन इसने GitHub की विश्वसनीयता और आवश्यक कार्यों के लिए तृतीय-पक्ष प्लेटफार्मों पर निर्भरता के जोखिमों के बारे में चिंताओं को उजागर किया।"
    ],
    "points": 324,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1736812051
  },
  {
    "id": 42694596,
    "title": "ZFS 2.3 ज़ेडएफएस रैडज़ विस्तार के साथ जारी किया गया",
    "originLink": "https://github.com/openzfs/zfs/releases/tag/zfs-2.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42694596",
    "commentBody": "",
    "originSummary": [
      "OpenZFS 2.3.0 जारी किया गया है, जिसमें RAIDZ विस्तार, फास्ट डेडुप्लिकेशन, डायरेक्ट इनपुट/आउटपुट, JSON आउटपुट और लंबे फाइल नामों के लिए समर्थन जैसी महत्वपूर्ण विशेषताएं शामिल हैं। - इस रिलीज में आवश्यक बग फिक्स और प्रदर्शन सुधार शामिल हैं, जो Linux कर्नल 4.18 - 6.12 और FreeBSD संस्करण 13.3, 14.0 - 14.2 के साथ संगत हैं। - यह अपडेट 134 योगदानकर्ताओं के सहयोगात्मक प्रयास का परिणाम है, जिसमें व्यापक दस्तावेज़ीकरण और एक परिवर्तन लॉग समीक्षा के लिए उपलब्ध है।"
    ],
    "commentSummary": [
      "ZFS 2.3 जारी किया गया है, जिसमें RAIDZ विस्तार, तेज डुप्लीकेशन, डायरेक्ट IO, JSON आउटपुट, और लंबे फाइल नामों के लिए समर्थन जैसी विशेषताएं शामिल हैं। - RAIDZ विस्तार विशेष रूप से उल्लेखनीय है क्योंकि यह उपयोगकर्ताओं को मौजूदा RAIDZ पूल में नए उपकरण जोड़ने की अनुमति देता है बिना डाउनटाइम के, जिससे भंडारण क्षमता बढ़ती है। - यह रिलीज ZFS उपयोगकर्ताओं के लिए एक महत्वपूर्ण प्रगति मानी जाती है, और इसकी तुलना Btrfs और Windows Storage Spaces जैसे अन्य फाइल सिस्टम्स के साथ की जाती है, हालांकि कुछ सीमाओं जैसे पूल को छोटा करने में असमर्थता के बावजूद।"
    ],
    "points": 302,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1736838539
  },
  {
    "id": 42690983,
    "title": "वेबटॉप – अल्पाइन, उबंटू, फेडोरा, और आर्च कंटेनर जिनमें पूर्ण डेस्कटॉप वातावरण शामिल हैं",
    "originLink": "https://docs.linuxserver.io/images/docker-webtop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690983",
    "commentBody": "",
    "originSummary": [
      "Linuxserver/webtop अल्पाइन, उबंटू, फेडोरा, और आर्च पर आधारित कंटेनर प्रदान करता है, जो वेब ब्राउज़रों के माध्यम से पूर्ण डेस्कटॉप वातावरण तक पहुंच प्रदान करते हैं, और यह x86-64 और arm64 आर्किटेक्चर दोनों का समर्थन करता है।",
      "उपयोगकर्ता विशेष इमेज टैग का उपयोग करके XFCE, KDE, MATE, i3, Openbox, और IceWM जैसे विभिन्न डेस्कटॉप वातावरणों में से चयन कर सकते हैं, और निर्दिष्ट URL के माध्यम से वेबटॉप तक पहुंच सकते हैं।",
      "सुरक्षा विशेषताओं में Docker का seccomp विकल्प और प्रमाणीकरण सेटअप शामिल हैं, जिसमें पर्यावरण वेरिएबल्स के माध्यम से अनुकूलन विकल्प उपलब्ध हैं, और ओपन-सोर्स ड्राइवर्स के साथ GPU त्वरण के लिए समर्थन शामिल है।"
    ],
    "commentSummary": [
      "वेबटॉप अल्पाइन, उबंटू, फेडोरा, और आर्च के लिए पूर्ण डेस्कटॉप वातावरण के साथ कंटेनर प्रदान करता है, जो वीपीएन के पीछे त्वरित सेटअप के लिए उपयुक्त हैं।",
      "उपयोगकर्ता वेबटॉप की गति और उपयोग में आसानी के लिए इसकी प्रशंसा करते हैं, विशेष रूप से ग्लूटन कंटेनर के साथ सुरक्षित कनेक्शनों के लिए उपयोग किए जाने पर, लेकिन डिफ़ॉल्ट प्रमाणीकरण की कमी के कारण सुरक्षा उपायों के बिना कंटेनरों को इंटरनेट पर उजागर करने के खिलाफ चेतावनी देते हैं।",
      "इस परियोजना को ओपन-सोर्स और लचीला होने के लिए महत्व दिया जाता है, जिसमें उपयोगकर्ता कॉन्फ़िगरेशन साझा करते हैं, और कास्म और सेल्की जैसे विकल्प समान उद्देश्यों के लिए उल्लेखनीय हैं।"
    ],
    "points": 297,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1736810708
  },
  {
    "id": 42697783,
    "title": "ऑनलाइन नौकरी पोस्टिंग में से 5 में से 1 या तो नकली होती है या कभी भरी नहीं जाती, अध्ययन में पाया गया।",
    "originLink": "https://gizmodo.com/1-in-5-online-job-postings-are-either-fake-or-never-filled-study-finds-2000549706",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42697783",
    "commentBody": "",
    "originSummary": [
      "हाल ही में एक अध्ययन से पता चलता है कि ऑनलाइन नौकरी पोस्टिंग में से 20% या तो नकली हैं या खाली रह जाती हैं, जिससे नौकरी खोजने वालों की निराशा बढ़ जाती है। - यह \"भूत नौकरी\" प्रवृत्ति कंपनियों के लिए विकास की छवि प्रस्तुत करने की एक रणनीति हो सकती है। - ग्रीनहाउस और लिंक्डइन जैसे नौकरी प्लेटफॉर्म ने उपयोगकर्ताओं को वास्तविक नौकरी के अवसरों की पहचान करने में मदद करने के लिए नौकरी सत्यापन सेवाएं शुरू की हैं।"
    ],
    "commentSummary": [
      "एक अध्ययन से पता चलता है कि 20% ऑनलाइन नौकरी पोस्टिंग या तो नकली होती हैं या भरी नहीं जाती हैं, अक्सर कंपनियों को अमेरिकी आव्रजन नीतियों का पालन करने की आवश्यकता के कारण। - कंपनियां आदर्श उम्मीदवारों को खोजने, आवश्यकताओं को बदलने, या पहले से चयनित आंतरिक उम्मीदवारों के लिए नौकरी पोस्टिंग को बनाए रख सकती हैं। - नौकरी बाजार आवेदकों के लिए कठिन है, जो अक्सर घोस्टिंग और स्वचालित अस्वीकृति का सामना करते हैं, जिससे नियामक हस्तक्षेप की मांग होती है।"
    ],
    "points": 273,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1736865860
  },
  {
    "id": 42698557,
    "title": "चालकों के लिए कुछ सेकंड बचाने के लिए पैदल यात्रियों के लिए चौराहे को असुरक्षित बनाना",
    "originLink": "https://collegetowns.substack.com/p/making-an-intersection-unsafe-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42698557",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "बहस इस बात पर केंद्रित है कि चौराहों को पैदल यात्री सुरक्षा को प्राथमिकता देनी चाहिए या ड्राइवर की दक्षता को, जिसमें कुछ लोग लाइट-नियंत्रित चौराहों और पैदल यात्री स्क्रैम्बल को 4-वे स्टॉप्स पर प्राथमिकता देते हैं।",
      "ट्रैफिक कानूनों और बुनियादी ढांचे के डिजाइन पर राय भिन्न होती है, जिसमें जेवॉकिंग की सुरक्षा और लाल बत्ती पर दाएं मुड़ने से जुड़े जोखिमों पर चर्चा शामिल है।",
      "कुछ लोग सुरक्षा और दक्षता दोनों को बढ़ाने के लिए गोल चक्कर या डच यातायात इंजीनियरिंग मानकों को अपनाने जैसे वैकल्पिक समाधानों की वकालत करते हैं।"
    ],
    "points": 267,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1736869194
  },
  {
    "id": 42696080,
    "title": "पोस्टग्रेएसक्यूएल वर्ष 2024 का डेटाबेस प्रबंधन प्रणाली है।",
    "originLink": "https://db-engines.com/en/blog_post/109",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696080",
    "commentBody": "",
    "originSummary": [
      "पोस्टग्रेएसक्यूएल को DB-इंजिन्स द्वारा वर्ष 2024 का DBMS ऑफ द ईयर पुरस्कार दिया गया है, यह सम्मान पांचवीं बार प्राप्त करते हुए, 423 अन्य डेटाबेस प्रबंधन प्रणालियों को पीछे छोड़ दिया है।",
      "पोस्टग्रेएसक्यूएल, जिसकी इतिहास लगभग 35 वर्षों का है, नवाचार करना जारी रखता है, जैसा कि सितंबर 2024 में जारी किए गए पोस्टग्रेएसक्यूएल 17 के हालिया सुधारों में देखा जा सकता है।",
      "स्नोफ्लेक और माइक्रोसॉफ्ट ने क्रमशः दूसरे और तीसरे स्थान पर कब्जा किया, जिसमें स्नोफ्लेक को इसके क्लाउड-आधारित डेटा वेयरहाउसिंग और मल्टी-क्लाउड समर्थन के लिए जाना जाता है, जबकि माइक्रोसॉफ्ट Azure SQL डेटाबेस और SQL सर्वर के माध्यम से मजबूत प्रबंधित रिलेशनल डेटाबेस प्रदान करता है।"
    ],
    "commentSummary": [
      "पोस्टग्रेएसक्यूएल को db-engines.com द्वारा वर्ष 2024 का डेटाबेस प्रबंधन प्रणाली पुरस्कार दिया गया है, जो उद्योग में इसकी बढ़ती लोकप्रियता और मान्यता को दर्शाता है।",
      "उपयोगकर्ता माइक्रोसॉफ्ट SQL सर्वर से PostgreSQL में स्विच करने पर विचार कर रहे हैं, उच्च लाइसेंसिंग लागत और संसाधन सीमाओं के कारण, हालांकि संभावित माइग्रेशन चुनौतियाँ हो सकती हैं।",
      "PostgreSQL अपनी मजबूत विशेषताओं और लागत-प्रभावशीलता के लिए पसंद किया जाता है, जिससे यह भविष्य की परियोजनाओं के लिए एक पसंदीदा विकल्प बन जाता है, हालांकि कुछ उपयोगकर्ता लागत को कम करने के लिए Babelfish जैसे विकल्पों का पता लगाते हैं।"
    ],
    "points": 239,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1736854677
  },
  {
    "id": 42699099,
    "title": "Google का OAuth लॉगिन एक असफल स्टार्टअप डोमेन की खरीद के खिलाफ सुरक्षा नहीं करता है।",
    "originLink": "https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699099",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "चर्चा में यह उजागर किया गया है कि जब एक असफल स्टार्टअप के डोमेन को नया मालिक अधिग्रहित करता है, तो गूगल के OAuth लॉगिन सिस्टम में एक कमजोरी होती है, जो संभावित रूप से सेवाओं तक अनधिकृत पहुंच की अनुमति दे सकती है।",
      "यह समस्या इसलिए उत्पन्न होती है क्योंकि Google मूल और नए डोमेन मालिकों के बीच अंतर नहीं कर सकता है, जिससे किसी भी प्रणाली पर प्रभाव पड़ता है जो डोमेन-आधारित प्रमाणीकरण का उपयोग करती है।",
      "एक प्रस्तावित समाधान यह है कि अद्वितीय पहचानकर्ताओं का उपयोग किया जाए जो समय के साथ स्थिर रहें, हालांकि इस समाधान का कार्यान्वयन विभिन्न पहचान प्रदाताओं के बीच भिन्न होता है।"
    ],
    "points": 200,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1736871241
  },
  {
    "id": 42696822,
    "title": "कोडिंग कौशल का उपयोग करके निष्क्रिय आय अर्जित करना",
    "originLink": "https://www.coryzue.com/writing/solopreneur/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42696822",
    "commentBody": "",
    "originSummary": [
      "लेखक ने एक सीटीओ की भूमिका से एकल उद्यमी के रूप में परिवर्तन किया, और सॉफ्टवेयर उत्पादों के पोर्टफोलियो के माध्यम से अधिक कमाई करने में सफल रहे।",
      "मुख्य रणनीतियों में गहन कार्य पर ध्यान केंद्रित करना, छोटे प्रोजेक्ट्स से शुरुआत करना, तेजी से पुनरावृत्ति करना, और विपणन प्रयासों के लिए समय समर्पित करना शामिल है।",
      "यात्रा अनिश्चितताओं के कारण सहनशीलता पर जोर देती है, लेकिन इस करियर पथ की बेजोड़ स्वायत्तता और स्वतंत्रता को उजागर करती है, जिससे कोडिंग कौशल वाले लोगों को इसे निष्क्रिय आय के लिए विचार करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने बताया कि उन्होंने समाप्त हो रहे डोमेन नामों का उपयोग करके एसईओ स्पैम वेबसाइटों के माध्यम से निष्क्रिय आय उत्पन्न की, जिससे वे लगभग $30,000 वार्षिक कमा रहे थे, हालांकि नैतिक चिंताओं और गूगल की अंततः कार्रवाई के बावजूद।",
      "इस पोस्ट ने निष्क्रिय आय पर बहस छेड़ दी, जिसमें कुछ उपयोगकर्ताओं का तर्क था कि यह वास्तव में निष्क्रिय कमाई की तुलना में एक व्यवसाय चलाने के अधिक समान है।",
      "प्रतिभागियों ने साइड प्रोजेक्ट्स में अनुभवों और चुनौतियों को साझा किया, जिसमें समय, धैर्य और रणनीतिक योजना की महत्ता को उजागर किया गया।"
    ],
    "points": 167,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1736860888
  },
  {
    "id": 42690781,
    "title": "स्पेन ने गैर-ईयू निवासियों द्वारा खरीदे गए घरों पर 100% कर लगाने का प्रस्ताव दिया है",
    "originLink": "https://www.theguardian.com/world/2025/jan/13/spain-proposes-100-tax-on-homes-bought-by-non-eu-residents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42690781",
    "commentBody": "",
    "originSummary": [
      "स्पेन गैर-ईयू निवासियों द्वारा रियल एस्टेट खरीद पर 100% कर लगाने पर विचार कर रहा है, जिसका उद्देश्य आवास संकट को संबोधित करना और सट्टा खरीद को रोकना है।",
      "प्रधानमंत्री पेड्रो सांचेज़ का प्रस्ताव सामाजिक आवास का विस्तार करने और पर्यटक किराए को विनियमित करने को शामिल करता है ताकि आवास की कीमतों और आय के बीच असमानता को दूर किया जा सके।",
      "प्रस्ताव का भविष्य कानून के रूप में अनिश्चित है, कुछ विश्लेषकों का मानना है कि यह विदेशी निवेशकों के लिए एक निवारक के रूप में कार्य कर सकता है बजाय इसके कि यह एक सुनिश्चित विधायी परिवर्तन हो।"
    ],
    "commentSummary": [
      "स्पेन गैर-ईयू निवासियों द्वारा खरीदे गए घरों पर 100% कर लगाने पर विचार कर रहा है ताकि आवास की वहनीयता की समस्याओं का समाधान किया जा सके। - आलोचकों का सुझाव है कि विदेशी खरीदार उच्च आवास कीमतों का मुख्य कारण नहीं हैं, बल्कि धीमी नौकरशाही और ज़ोनिंग कानून अधिक महत्वपूर्ण कारक हैं। - इस प्रस्ताव ने आवास बाजारों में विदेशी स्वामित्व की भूमिका और वहनीयता मुद्दों को हल करने में इसकी प्रभावशीलता पर बहस छेड़ दी है।"
    ],
    "points": 162,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1736809603
  },
  {
    "id": 42699977,
    "title": "एप्पल को जल्द ही टीएसएमसी के एरिज़ोना फैब से 'मेड इन अमेरिका' चिप्स प्राप्त होंगे",
    "originLink": "https://www.tomshardware.com/tech-industry/apple-will-soon-receive-made-in-america-chips-from-tsmcs-arizona-fab-company-in-final-stages-of-quality-verification",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42699977",
    "commentBody": "",
    "originSummary": [
      "एप्पल TSMC की एरिज़ोना सुविधा से प्रोसेसर का परीक्षण कर रहा है, और पहले तिमाही तक बड़े पैमाने पर उत्पादन की योजना बना रहा है, जिससे यह TSMC का पहला अमेरिकी ग्राहक बन सकता है जो स्थानीय रूप से निर्मित चिप्स का उपयोग करेगा। - इस पहल का उद्देश्य अमेरिकी सिलिकॉन स्वतंत्रता को बढ़ावा देना है, जिससे ताइवान पर निर्भरता कम हो सके, जो भू-राजनीतिक और प्राकृतिक जोखिमों के प्रति संवेदनशील है। - TSMC की एरिज़ोना फैब उन्नत 3nm और 2nm चिप्स का उत्पादन करने के लिए तैयार है, स्थानीय भर्ती को बढ़ावा देने और अमेरिकी विश्वविद्यालयों के साथ साझेदारी के प्रयास जारी हैं, हालांकि पैकेजिंग शुरू में ताइवान में होगी जब तक कि पियोरिया सुविधा चालू नहीं हो जाती।"
    ],
    "commentSummary": [
      "एप्पल को TSMC के एरिज़ोना प्लांट से चिप्स मिलेंगे, लेकिन उन्हें पैकेजिंग के लिए ताइवान वापस भेजना होगा क्योंकि अमेरिका में पर्याप्त सुविधाएं नहीं हैं। - एरिज़ोना प्लांट में 50% से अधिक कार्यबल ताइवान से है, जो अमेरिका के STEM (विज्ञान, प्रौद्योगिकी, इंजीनियरिंग, और गणित) क्षेत्र में एक अंतर को दर्शाता है। - CHIPS एक्ट पहल, जिसका उद्देश्य अमेरिका में सेमीकंडक्टर निर्माण को बढ़ावा देना है, चुनौतियों का सामना कर रही है क्योंकि \"मेड इन अमेरिका\" लेबल पर सवाल उठाए जा रहे हैं, क्योंकि पैकेजिंग प्रक्रिया ताइवान में हो रही है, और 2027 तक अमेरिका में पैकेजिंग क्षमताओं की योजना है।"
    ],
    "points": 160,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1736873807
  },
  {
    "id": 42692730,
    "title": "भीड़भाड़ मूल्य निर्धारण चालू होने के बाद मैनहट्टन की सड़कों पर 43 हजार कम ड्राइवर हैं।",
    "originLink": "https://gothamist.com/news/43k-fewer-drivers-on-manhattan-roads-after-congestion-pricing-turned-on-mta-says",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42692730",
    "commentBody": "",
    "originSummary": [
      "भीड़भाड़ मूल्य निर्धारण लागू होने के बाद, 60वीं स्ट्रीट के नीचे मैनहट्टन में प्रवेश करने वाले ड्राइवरों में 7.5% की कमी आई, जो प्रत्येक सप्ताह के दिन 43,000 कम ड्राइवरों के बराबर है।",
      "यातायात में कमी ने यातायात प्रवाह में सुधार किया है और बसों की गति बढ़ाई है, जिससे कुछ एक्सप्रेस बसों में अधिक यात्री संख्या देखी गई है।",
      "मेट्रोपॉलिटन ट्रांसपोर्टेशन अथॉरिटी (एमटीए) कुछ राजनीतिक विरोध के बावजूद, ट्रांजिट सुधारों के लिए टोल राजस्व का उपयोग करती है, जिसकी वार्षिक अनुमानित राशि $500 मिलियन है।"
    ],
    "commentSummary": [
      "मैनहट्टन में भीड़भाड़ मूल्य निर्धारण के कार्यान्वयन के परिणामस्वरूप 43,000 कम ड्राइवर हो गए हैं, जिससे बस की गति में वृद्धि हुई है और संभावित रूप से आपातकालीन प्रतिक्रिया समय में सुधार हुआ है।",
      "यह नीति यातायात जाम को कम करने और वायु गुणवत्ता में सुधार करने के लिए बनाई गई है, हालांकि इसने निम्न-आय वाले व्यक्तियों पर इसके प्रभाव को लेकर बहस छेड़ दी है।",
      "समर्थकों का तर्क है कि लाभों में अधिक कुशल सार्वजनिक परिवहन और स्वच्छ हवा शामिल हैं, जबकि इन फायदों को ड्राइवरों की आवश्यकताओं के साथ संतुलित करने पर चर्चाएं जारी हैं।"
    ],
    "points": 154,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1736821606
  }
]
