[
  {
    "id": 42268580,
    "title": "Takdir ettiğiniz birine resmi bir 'Devam Et ve Israr Et' Mektubu gönderin",
    "originLink": "https://ContinueAndPersist.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268580",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1219,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732828615
  },
  {
    "id": 42269227,
    "title": "Mühendisler, defterler oluştururken başlangıç hataları yapma lüksüne sahip değildirler.",
    "originLink": "https://news.alvaroduran.com/p/engineers-do-not-get-to-make-startup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269227",
    "commentBody": "",
    "originSummary": [
      "Ödemeler Mühendisi El Kitabı, fintech girişimlerinde doğru defterlerin kritik rolünü vurgulamakta ve çift girişli muhasebe sistemlerinin ihmal edilmesinin tehlikelerine dikkat çekmektedir.",
      "Alvaro Duran, çift girişli bir sistemin yokluğunun finansal tutarsızlıklara ve müşteri memnuniyetsizliğine yol açtığı girişim deneyiminden bir uyarı hikayesi paylaşıyor.",
      "Duran, ölçeklenebilir ve geleceğe yönelik sağlam defterler oluşturma konusunda bir kitap yazmayı düşünüyor ve bunun potansiyel ilgisi hakkında geri bildirim arıyor."
    ],
    "commentSummary": [
      "Mühendisler, Synapse örneğinde görüldüğü gibi, finansal sistemlerde hatalardan kaçınmalıdır; burada defterleri, gerçek fonlardan daha fazla müşteri bakiyesi göstererek milyonlarca kayba neden olmuştur. - Fintech şirketleri genellikle FDIC sigortası vaat eder, ancak bu yalnızca banka iflas ederse geçerlidir, fintech fonları yanlış yönetirse değil, bu da doğru finansal takibin önemini vurgular. - Çift girişli muhasebe, her işlemin dengeli ve izlenebilir olmasını sağlayarak finansal sistemlerde hataları ve potansiyel dolandırıcılığı önlemeye yardımcı olması açısından doğruluk için hayati öneme sahiptir."
    ],
    "points": 373,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1732835027
  },
  {
    "id": 42273505,
    "title": "Kaydırma ile Uğraşma",
    "originLink": "https://dontfuckwithscroll.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42273505",
    "commentBody": "",
    "originSummary": [
      "Momentum kaydırma eklentileri, kullanılabilirlik, erişilebilirlik ve performansı düşürerek doğal web tarama deneyimini bozmakla eleştirilmektedir. - Ana sorunlar arasında kullanıcı beklentilerini ihlal etme, hareket hastalığına neden olma, erişilebilirliği azaltma ve özellikle eski cihazlarda tutarsız performans yer almaktadır. - Bu eklentiler ayrıca sayfa yükleme sürelerini artırır, yerel tarayıcı özelliklerini bozar ve bakım yükünü artırarak kullanıcı hayal kırıklığına ve karmaşıklığa yol açar."
    ],
    "commentSummary": [
      "Bu tartışma, Tek Sayfa Uygulamalarının (SPA'lar) web gezinmesini etkileyen, özellikle URL'ler, tarayıcı gezinmesi ve geri düğmesi ile ilgili hayal kırıklıklarını vurguluyor. Eleştirmenler, yanlış uygulanan SPA'ların yer imi oluşturma ve gezinme gibi webin temel unsurlarını tehlikeye attığını, performansı kullanıcı deneyiminin önüne koyduğunu savunuyor. Konuşma ayrıca standart tarayıcı işlevlerinin ele geçirilmesi gibi sorunlara ve web tasarımında kullanıcı özerkliğine saygı gösterilmesinin önemine değinerek, geleneksel web işlevselliklerinin korunmasını savunuyor."
    ],
    "points": 306,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1732884771
  },
  {
    "id": 42268475,
    "title": "Hertzner, bant genişliğini önemli ölçüde düşürürken fiyatları artırıyor (ABD)",
    "originLink": "https://adriano.fyi/posts/hetzner-raises-prices-while-significantly-lowering-bandwidth-in-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268475",
    "commentBody": "",
    "originSummary": [
      "Hetzner, CPX21 sunucuları için ABD'de fiyatları %27,52'ye kadar artırırken, bant genişliğini ortalama %88,19 oranında azaltıyor. Şükran Günü'nde duyurulan değişiklikler, daha hafif kullanıcıların daha ağır kullanıcıları sübvanse etmesi nedeniyle maliyetleri kaynak kullanımıyla uyumlu hale getirmeyi amaçlıyor. Yeni fiyatlandırma ve bant genişliği sınırları, yeni sunucular için Aralık 2024'ten ve mevcut olanlar için Şubat 2025'ten itibaren geçerli olacak ve Hetzner, en iyi fiyat-performans oranını sunduğunu iddia ediyor."
    ],
    "commentSummary": [
      "Hetzner, bir web barındırma şirketi, Amerika Birleşik Devletleri'nde fiyatlarını artırdı ve bant genişliği tekliflerini azalttı.",
      "Bu konu, popüler bir teknoloji haber platformu olan Hacker News'de birden fazla kopya gönderiye yol açarak önemli tartışmalara neden oldu."
    ],
    "points": 296,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1732827365
  },
  {
    "id": 42269925,
    "title": "Araba lastikleri, çevredeki tüm mikroplastiklerin dörtte birini yayar.",
    "originLink": "https://phys.org/news/2024-11-car-quarter-microplastics-environment-urgent.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269925",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Araba lastikleri, çevredeki tüm mikroplastiklerin dörtte birine katkıda bulunan önemli bir mikroplastik kirlilik kaynağıdır. Kirliliği ele almak için lastiklerin bileşenlerine göre vergilendirilmesi gerektiği konusunda bir tartışma vardır, bu da araçların ağırlığına göre vergilendirilmesine bir alternatiftir. Tartışma, ağırlık ve sürülen mesafeye göre vergilendirmenin gizlilik ve pratiklik endişelerini içermekte olup, Birleşik Krallık ve Hollanda'dan farklı uygulama yöntemleri düşünen örnekler bulunmaktadır."
    ],
    "points": 266,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1732842573
  },
  {
    "id": 42268310,
    "title": "2020'de Ninja'nın başarısı ve başarısızlığı",
    "originLink": "https://neugierig.org/software/blog/2020/05/ninja.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268310",
    "commentBody": "",
    "originSummary": [
      "Ninja, bir yan proje olarak oluşturulan bir derleme sistemi, önemli bir popülerlik kazanmış ve şimdi Chrome, Android ve Meson gibi büyük projeler tarafından kullanılmaktadır.",
      "Sistem, daha iyi bir yapı yapısı için iki parçalı bir grafik kullanarak hız ve verimlilik için tasarlanmıştır ve hızlı artımlı yapılar üzerine odaklanmaktadır.",
      "Yaratıcı, Ninja'nın başarısına rağmen açık kaynak bakımcısı olmanın zorluklarını, yüksek talepleri ve sınırlı minnettarlığı vurguluyor."
    ],
    "commentSummary": [
      "Ninja derleme sisteminin Android'in AOSP'sindeki (Android Açık Kaynak Projesi) rolü ve makefile'lardan Ninja'ya geçişin karmaşıklıkları üzerine odaklanılan tartışma.",
      "Kullanıcılar, mimari, sosyal sorunlar ve yineleme süresinin programcı memnuniyeti üzerindeki etkisini göz önünde bulundurarak Ninja'nın Makefile'lara göre avantajlarını tartışıyor.",
      "Konuşma ayrıca Samurai gibi diğer derleme sistemlerinden ve el yapımı derleme sistemlerini sürdürmenin zorluklarından bahsediyor, teknoloji ortamlarındaki sosyal dinamiklerin rolünü vurguluyor."
    ],
    "points": 256,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1732825274
  },
  {
    "id": 42270378,
    "title": "2024'te 1 milyon eşzamanlı görevi çalıştırmak için ne kadar belleğe ihtiyacınız var?",
    "originLink": "https://hez2010.github.io/async-runtimes-benchmarks-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270378",
    "commentBody": "",
    "originSummary": [
      "2024 yılında yapılan bir kıyaslama testi, Rust, C#, Go ve Java gibi çeşitli programlama dillerinde korotinler kullanarak 1 milyon eşzamanlı görevin çalıştırılması sırasında bellek tüketimini test etti. C# NativeAOT ile en iyi bellek verimliliğini göstererek diğer dilleri geride bıraktı, Go ise beklenenden daha fazla bellek tüketti, hatta GraalVM ile Java'dan bile fazla. Çalışma, .NET NativeAOT ve Java'nın GraalVM gibi bazı dillerin ölçeklenebilirliğini geliştirdiğini, Go'nun goroutinlerinin ise daha az verimli olduğunu ve Rust'ın bellek kullanımının görev yönetimini ayarlayarak optimize edildiğini vurguluyor."
    ],
    "commentSummary": [
      "2024 yılında, 1 milyon eşzamanlı görevi çalıştırmak için gereken bellek, programlama dili ve eşzamanlılık modeline göre değişiklik göstermektedir. Rust ve C# dilleri görev başına yaklaşık 0.12 KiB bellek kullanırken, Go dili görev başına yaklaşık 2.64 KiB bellek kullanmaktadır.",
      "Node.js, vaatlerle verimli görünmesine rağmen, görevleri paralel olarak yürütmez, bu da diller arasında eşzamanlılık yönetimindeki farklılıkları vurgular.",
      "Ölçüt, gerçek dünya uygulamalarının basit görevlerden daha karmaşık işlemler içerdiğini, bunun da bellek kullanımı ve performansı etkilediğini vurgular."
    ],
    "points": 245,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1732848659
  },
  {
    "id": 42268819,
    "title": "Elveda, Rust. Başarılar dilerim ama C++'a geri döndüm (üzgünüm, bu bir sitemdir)",
    "originLink": "https://old.reddit.com/r/rust/comments/1h15md8/goodbye_rust_i_wish_you_success_but_im_back_to_c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268819",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bir Reddit kullanıcısı, Rust'ı karmaşıklığı ve sınırlı iş fırsatları nedeniyle eleştirerek, teknik olarak üstün olmalarına rağmen yaygın olarak benimsenmeyen Betamax ve Esperanto ile karşılaştırdı.",
      "Bazı kullanıcılar Rust'ın katılığı ve güvenlik özelliklerini takdir ederken, diğerleri Go gibi dillere kıyasla daha yavaş benimsenme oranına dikkat çekiyor.",
      "Bu zorluklara rağmen, Rust, AWS ve Microsoft gibi büyük şirketlerde ivme kazanıyor ve bazıları tarafından C++'ın potansiyel gelecekteki bir yedeği olarak görülüyor."
    ],
    "points": 242,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1732831332
  },
  {
    "id": 42272927,
    "title": "GIMP 3.0 yolda",
    "originLink": "https://lwn.net/SubscriberLink/998793/6c8d00bd1b2a7948/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42272927",
    "commentBody": "",
    "originSummary": [
      "GIMP 3.0'ın yakında piyasaya sürülmesi bekleniyor ve 2018'den bu yana ilk büyük güncellemeyi işaret ediyor. Bu güncelleme, modernize edilmiş bir GTK 3 arayüzü ve geliştirilmiş performans sunuyor. Ana güncellemeler arasında yıkıcı olmayan düzenleme, geliştirilmiş renk yönetimi, iyileştirilmiş katman iş akışları ve daha kolay eklenti yönetimi için yeni bir uzantı sistemi bulunuyor. Kesin çıkış tarihi bilinmemekle birlikte, geliştirme sürümleri mevcut ve bu, açık kaynaklı görüntü düzenleyici için önemli bir ilerlemeyi gösteriyor. Gelecekte daha sık güncellemeler bekleniyor."
    ],
    "commentSummary": [
      "GIMP 3.0, baskı ve yayıncılık için önemli olan CMYK ve CIELAB gibi sRGB'nin ötesindeki renk paletleri için destek ekleyerek geliştirilmektedir.",
      "Güncelleme, yalnızca gerektiğinde diğer renk alanlarına dönüştürerek veri kaybını en aza indirerek renk doğruluğunu artırmayı amaçlıyor.",
      "Yıkıcı olmayan düzenleme gibi gelişmelere rağmen, bazı kullanıcılar GIMP'in kullanıcı arayüzü ve işlevselliği konusunda Photoshop ile karşılaştırıldığında endişe duyuyorlar ve küçük bir gönüllü ekip nedeniyle yavaş gelişim gösterdiğini belirtiyorlar."
    ],
    "points": 230,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732877433
  },
  {
    "id": 42270389,
    "title": "Vince – Google Analytics'e kendi kendine barındırılan bir alternatif",
    "originLink": "https://github.com/vinceanalytics/vince",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270389",
    "commentBody": "",
    "originSummary": [
      "Vince, Plausible Analytics panosunun Golang tabanlı bir portudur ve birden fazla web sitesi için tek bir ikili dosya, tek kullanıcı sistemi olarak tasarlanmıştır, çalışma zamanı bağımlılıkları olmadan.- Otomatik TLS (Taşıma Katmanı Güvenliği), dış bağlantı izleme, dosya indirme izleme, 404 sayfa izleme ve özel etkinlik izleme gibi özellikler içerir, bu da onu neredeyse Plausible panosuna eşdeğer kılar.- Vince, Plausible panosunu kişisel web siteleri için bir yedek olarak kendi kendine barındırmayı erişilebilir hale getirmeyi amaçlar ve 6 dolarlık bir Vultr örneğinde bir demo mevcuttur."
    ],
    "commentSummary": [
      "Vince, Google Analytics'e kendi kendine barındırılan bir alternatif olarak, Plausible Analytics panosunun Golang portu olarak geliştirilmiş olup, pano ile ilgili özelliklere odaklanmaktadır.",
      "TLS (Taşıma Katmanı Güvenliği), giden bağlantı izleme ve özel etkinlik izleme gibi özellikler sunar ve çalışma zamanı bağımlılıkları olmadığından kişisel web siteleri için uygundur.",
      "Vince, GDPR (Genel Veri Koruma Yönetmeliği) uyumludur, veri depolama için Pebble kullanır ve GitHub'da açık kaynaklı bir proje olarak mevcuttur, Plausible'ın kurulum karmaşıklığı olmadan erişilebilir bir kendi kendine barındırma seçeneği sunar."
    ],
    "points": 188,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732848840
  },
  {
    "id": 42270966,
    "title": "Avustralya Parlamentosu, 16 yaş altı için sosyal medyayı yasakladı",
    "originLink": "https://apnews.com/article/australia-social-media-children-ban-safeguarding-harm-accounts-d0cde2603bdbc7167801da1d00ecd056",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270966",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Avustralya, 16 yaşın altındaki bireyler için sosyal medya kullanımına yasak getirdi ve bu durum çocuk koruma ile ebeveyn hakları arasında tartışmalara yol açtı.- Yasa, yaş doğrulamasını zorunlu kılıyor ve bu durum gizlilik endişelerini ve artan gözetim korkularını gündeme getirdi.- Yasama süreci, kamuoyunun minimum katılımıyla hızlandırıldı ve bu da yasaların etkinliği ve uygulanabilirliği konusunda soru işaretleri bıraktı."
    ],
    "points": 184,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1732856517
  },
  {
    "id": 42269897,
    "title": "Tarayıcıda Ekran Paylaşımı",
    "originLink": "https://github.com/tonghohin/screen-sharing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269897",
    "commentBody": "",
    "originSummary": [
      "Bolt.new, kullanıcıların hızlı bir şekilde web uygulamaları oluşturmasına olanak tanıyan bir araçtır ve sadece 30 dakikada bir ekran paylaşım uygulaması oluşturarak bunu göstermektedir.- Uygulama, bir oda için benzersiz bir kod üreterek çalışır, bu kodu diğerleri kullanarak katılabilir ve paylaşılan ekranı görüntüleyebilir.- Proje, Cursor kullanılarak daha da geliştirilmiş ve GitHub'da görüntülenebilir, canlı bir demo ise Vercel'de barındırılmaktadır."
    ],
    "commentSummary": [
      "Tarayıcı tabanlı bir ekran paylaşım uygulaması, Bolt.new kullanılarak sadece 30 dakikada geliştirildi ve kullanıcıların ekran paylaşımı için benzersiz kodlarla odalar oluşturup katılmalarına olanak tanıyor.- Uygulama GitHub'da mevcut olup, bir demo sağlanmış ve ekran paylaşımının durması sorunları ve mobil uyumluluk hakkında geri bildirim almıştır.- Uygulama, genellikle doğrudan eşler arası bağlantılar başarısız olduğunda WebRTC uygulamalarında medya aktarmak için kullanılan bir TURN sunucusu kullanmamaktadır."
    ],
    "points": 168,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1732842261
  },
  {
    "id": 42274660,
    "title": "Prometheus 3.0",
    "originLink": "https://prometheus.io/blog/2024/11/14/prometheus-3-0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42274660",
    "commentBody": "",
    "originSummary": [
      "Prometheus 3.0, 7 yıl içindeki ilk büyük sürüm olarak, modernize edilmiş bir kullanıcı arayüzü, Remote Write 2.0, UTF-8 desteği, OTLP desteği ve yerel histogramlar sunuyor. - Ana özellikler arasında Remote Write 2.0 ile geliştirilmiş protokol verimliliği, OTLP alımı yoluyla OpenTelemetry ile artırılmış birlikte çalışabilirlik ve yerel histogramlarla daha verimli metrikler bulunuyor. - Kullanıcılar bazı uyumsuz değişikliklerin farkında olmalı ve geçiş kılavuzuna başvurmalıdır, ancak sürüm geriye dönük uyumluluğu korur ve kullanıcı geri bildirimlerini teşvik eder."
    ],
    "commentSummary": [
      "Prometheus 3.0, azaltılmış bellek kullanımı ve OTLP (OpenTelemetry Protokolü) alım desteği gibi özellikler sunarak piyasaya sürüldü.- Bu sürüm, Mimir, Victoria ve Cortex gibi alternatiflerle karşılaştırıldığında ölçeklenebilirliği hakkında tartışmalara yol açtı ve bazı kullanıcılar, geliştirilmiş performans için bu çözümleri tercih ediyor.- Sürüm notlarının netliği konusunda endişeler var ve bu durum, geliştiricilerden daha iyi bir iletişim ihtiyacını gösteriyor."
    ],
    "points": 151,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1732895564
  }
]
