[
  {
    "id": 42268580,
    "title": "Envía a alguien que aprecies una carta oficial de 'Continúa y Persiste'",
    "originLink": "https://ContinueAndPersist.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268580",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1219,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732828615
  },
  {
    "id": 42269227,
    "title": "Los ingenieros no pueden permitirse cometer errores de inicio cuando construyen libros de contabilidad.",
    "originLink": "https://news.alvaroduran.com/p/engineers-do-not-get-to-make-startup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269227",
    "commentBody": "",
    "originSummary": [
      "La guía del ingeniero de pagos subraya el papel crítico de los libros contables precisos en las startups fintech, destacando los peligros de descuidar los sistemas de contabilidad de doble entrada.",
      "Alvaro Duran comparte una advertencia de su experiencia en una startup, donde la ausencia de un sistema de doble entrada condujo a discrepancias financieras y a la insatisfacción de los clientes.",
      "Duran está contemplando la posibilidad de escribir un libro sobre la creación de registros escalables y a prueba de futuro, buscando comentarios sobre su posible interés."
    ],
    "commentSummary": [
      "Los ingenieros en sistemas financieros deben evitar errores, como se vio en el caso de Synapse, donde su libro mayor mostraba incorrectamente más saldos de clientes que fondos reales, resultando en millones faltantes. Las empresas fintech a menudo prometen seguro FDIC, pero solo se aplica si el banco falla, no si la fintech gestiona mal los fondos, lo que resalta la importancia de un seguimiento financiero preciso. La contabilidad de doble entrada es vital para la precisión, asegurando que cada transacción esté equilibrada y sea rastreable, lo que ayuda a prevenir errores y posibles fraudes en los sistemas financieros."
    ],
    "points": 373,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1732835027
  },
  {
    "id": 42273505,
    "title": "No te metas con Scroll",
    "originLink": "https://dontfuckwithscroll.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42273505",
    "commentBody": "",
    "originSummary": [
      "Los complementos de desplazamiento por inercia son criticados por interrumpir la experiencia natural de navegación web al degradar la usabilidad, accesibilidad y rendimiento. Los problemas clave incluyen violar las expectativas del usuario, causar mareos por movimiento, reducir la accesibilidad y un rendimiento inconsistente, especialmente en dispositivos más antiguos. Estos complementos también aumentan los tiempos de carga de la página, rompen las funciones nativas del navegador y añaden una carga de mantenimiento, lo que lleva a la frustración del usuario y a una mayor complejidad."
    ],
    "commentSummary": [
      "La discusión enfatiza las frustraciones con las Aplicaciones de Página Única (SPAs) que afectan la navegación web, particularmente en lo que respecta a las URLs, la navegación del navegador y el botón de retroceso. Los críticos argumentan que las SPAs mal implementadas comprometen fundamentos web como la capacidad de marcar páginas y la navegación, priorizando el rendimiento sobre la experiencia del usuario. La conversación también aborda problemas como el secuestro de funciones estándar del navegador y la importancia de respetar la autonomía del usuario en el diseño web, abogando por mantener las funcionalidades web tradicionales."
    ],
    "points": 306,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1732884771
  },
  {
    "id": 42268475,
    "title": "Hetzner aumenta los precios mientras reduce significativamente el ancho de banda (EE. UU.)",
    "originLink": "https://adriano.fyi/posts/hetzner-raises-prices-while-significantly-lowering-bandwidth-in-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268475",
    "commentBody": "",
    "originSummary": [
      "Hetzner está aumentando los precios en los EE. UU. hasta un 27.52% para los servidores CPX21 mientras reduce el ancho de banda en un promedio de 88.19%. Los cambios, anunciados en el Día de Acción de Gracias, están destinados a alinear los costos con el uso de recursos, ya que los usuarios más ligeros estaban subsidiando a los usuarios más pesados. Los nuevos precios y límites de ancho de banda entrarán en vigor a partir de diciembre de 2024 para nuevos servidores y febrero de 2025 para los existentes, con Hetzner manteniendo que ofrece la mejor relación calidad-precio."
    ],
    "commentSummary": [
      "Hetzner, una empresa de alojamiento web, ha aumentado sus precios y reducido las ofertas de ancho de banda en los Estados Unidos.",
      "La temática ha generado un debate significativo, lo que ha llevado a múltiples publicaciones duplicadas en Hacker News, una popular plataforma de noticias tecnológicas."
    ],
    "points": 296,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1732827365
  },
  {
    "id": 42269925,
    "title": "Los neumáticos de los automóviles desprenden una cuarta parte de todos los microplásticos en el medio ambiente",
    "originLink": "https://phys.org/news/2024-11-car-quarter-microplastics-environment-urgent.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269925",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Los neumáticos de los automóviles son una fuente importante de contaminación por microplásticos, contribuyendo a una cuarta parte de todos los microplásticos en el medio ambiente. Existe un debate sobre si se deben gravar los neumáticos en función de sus compuestos para abordar la contaminación, en lugar de gravar los vehículos por peso. La discusión incluye preocupaciones sobre la privacidad y la practicidad respecto a gravar en función del peso y la distancia recorrida, con ejemplos del Reino Unido y los Países Bajos que consideran diferentes métodos para su implementación."
    ],
    "points": 266,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1732842573
  },
  {
    "id": 42268310,
    "title": "La éxito y el fracaso de Ninja (2020)",
    "originLink": "https://neugierig.org/software/blog/2020/05/ninja.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268310",
    "commentBody": "",
    "originSummary": [
      "Ninja, un sistema de construcción creado como un proyecto paralelo, ha ganado una popularidad significativa y ahora es utilizado por proyectos importantes como Chrome, Android y Meson.",
      "La arquitectura del sistema está diseñada para la velocidad y la eficiencia, utilizando un grafo bipartito para una mejor estructura de construcción y enfocándose en construcciones incrementales rápidas.",
      "El creador reflexiona sobre los desafíos de ser un mantenedor de código abierto, señalando las altas demandas y la gratitud limitada a pesar del éxito de Ninja."
    ],
    "commentSummary": [
      "La discusión se centra en el papel del sistema de construcción Ninja en el AOSP (Proyecto de Código Abierto de Android) de Android y las complejidades de la transición de makefiles a Ninja.",
      "Los usuarios debaten las ventajas de Ninja sobre Makefiles, considerando la arquitectura, los problemas sociales y el impacto del tiempo de iteración en la satisfacción del programador.",
      "La conversación también menciona otros sistemas de construcción como Samurai y los desafíos de mantener sistemas de construcción hechos a mano, destacando el papel de las dinámicas sociales en los entornos tecnológicos."
    ],
    "points": 256,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1732825274
  },
  {
    "id": 42270378,
    "title": "¿Cuánta memoria necesitas en 2024 para ejecutar 1M de tareas concurrentes?",
    "originLink": "https://hez2010.github.io/async-runtimes-benchmarks-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270378",
    "commentBody": "",
    "originSummary": [
      "Una prueba de referencia de 2024 evaluó el consumo de memoria para ejecutar 1 millón de tareas concurrentes utilizando corrutinas en varios lenguajes de programación, incluidos Rust, C#, Go y Java. C# con NativeAOT demostró la mejor eficiencia de memoria, superando a otros lenguajes, mientras que Go consumió más memoria de lo anticipado, incluso más que Java con GraalVM. El estudio destaca que algunos lenguajes, como .NET con NativeAOT y GraalVM de Java, han mejorado la escalabilidad, mientras que las goroutines de Go fueron menos eficientes, y el uso de memoria de Rust se optimizó ajustando el manejo de tareas."
    ],
    "commentSummary": [
      "En 2024, la memoria requerida para ejecutar 1 millón de tareas concurrentes varía según el lenguaje de programación y el modelo de concurrencia, con Rust y C# utilizando alrededor de 0.12 KiB por tarea, mientras que Go utiliza aproximadamente 2.64 KiB por tarea.",
      "Node.js, a pesar de parecer eficiente con las promesas, no ejecuta tareas en paralelo, lo que resalta las diferencias en el manejo de la concurrencia entre los lenguajes.",
      "La referencia subraya que las aplicaciones del mundo real implican operaciones más complejas que las tareas simples, lo que afecta el uso de la memoria y el rendimiento."
    ],
    "points": 245,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1732848659
  },
  {
    "id": 42268819,
    "title": "Adiós, Rust. Te deseo éxito, pero he vuelto a C++ (lo siento, es una queja)",
    "originLink": "https://old.reddit.com/r/rust/comments/1h15md8/goodbye_rust_i_wish_you_success_but_im_back_to_c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268819",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Un usuario de Reddit criticó a Rust por su complejidad y las limitadas oportunidades laborales, comparándolo con Betamax y Esperanto, que son técnicamente superiores pero no ampliamente adoptados.",
      "Si bien algunos usuarios aprecian la estricta seguridad de Rust, otros señalan su tasa de adopción más lenta en comparación con lenguajes como Go.",
      "A pesar de estos desafíos, Rust está ganando terreno en grandes empresas como AWS y Microsoft, y algunos lo ven como un posible reemplazo futuro de C++."
    ],
    "points": 242,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1732831332
  },
  {
    "id": 42272927,
    "title": "GIMP 3.0 está en camino",
    "originLink": "https://lwn.net/SubscriberLink/998793/6c8d00bd1b2a7948/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42272927",
    "commentBody": "",
    "originSummary": [
      "GIMP 3.0 se anticipa que se lanzará pronto, marcando la primera actualización importante desde 2018, con una interfaz modernizada de GTK 3 y un rendimiento mejorado. Las actualizaciones clave incluyen edición no destructiva, gestión de color mejorada, flujos de trabajo de capas mejorados y un nuevo sistema de extensiones para una gestión de plugins más sencilla. Aunque la fecha exacta de lanzamiento es desconocida, las versiones de desarrollo están disponibles, lo que indica un avance significativo para el editor de imágenes de código abierto con actualizaciones futuras más frecuentes esperadas."
    ],
    "commentSummary": [
      "GIMP 3.0 está en desarrollo, añadiendo soporte para paletas de colores más allá de sRGB, como CMYK y CIELAB, que son importantes para la impresión y publicación.",
      "La actualización busca mejorar la precisión del color convirtiendo a otros espacios de color solo cuando sea necesario, minimizando la pérdida de datos.",
      "A pesar de los avances como la edición no destructiva, algunos usuarios están preocupados por la interfaz de usuario y la funcionalidad de GIMP en comparación con Photoshop, citando un desarrollo lento debido a un pequeño equipo de voluntarios."
    ],
    "points": 230,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732877433
  },
  {
    "id": 42270389,
    "title": "Vince: una alternativa autoalojada a Google Analytics",
    "originLink": "https://github.com/vinceanalytics/vince",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270389",
    "commentBody": "",
    "originSummary": [
      "Vince es un puerto basado en Golang del panel de Plausible Analytics, diseñado como un sistema de un solo binario y un solo usuario para múltiples sitios web sin dependencias en tiempo de ejecución. Incluye características como TLS automático (Seguridad de la Capa de Transporte), seguimiento de enlaces salientes, seguimiento de descargas de archivos, seguimiento de páginas 404 y seguimiento de eventos personalizados, lo que lo hace casi equivalente al panel de Plausible. Vince tiene como objetivo hacer que el panel de Plausible sea accesible para el autoalojamiento, sirviendo como un reemplazo directo para sitios web personales, con una demostración disponible en una instancia de $6 de Vultr."
    ],
    "commentSummary": [
      "Vince es una alternativa autoalojada a Google Analytics, desarrollada como un puerto en Golang del panel de Plausible Analytics, centrada en características relacionadas con el panel.",
      "Ofrece características como TLS (Seguridad de la Capa de Transporte) automático, seguimiento de enlaces salientes y seguimiento de eventos personalizados, sin dependencias de tiempo de ejecución, lo que lo hace adecuado para sitios web personales.",
      "Vince cumple con el RGPD (Reglamento General de Protección de Datos), utiliza Pebble para el almacenamiento de datos y está disponible como un proyecto de código abierto en GitHub, ofreciendo una opción accesible de autoalojamiento sin la complejidad de configuración de Plausible."
    ],
    "points": 188,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732848840
  },
  {
    "id": 42270966,
    "title": "El Parlamento australiano prohíbe las redes sociales para menores de 16 años",
    "originLink": "https://apnews.com/article/australia-social-media-children-ban-safeguarding-harm-accounts-d0cde2603bdbc7167801da1d00ecd056",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270966",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Australia ha implementado una prohibición del uso de redes sociales para individuos menores de 16 años, lo que ha generado debates sobre la protección infantil frente a los derechos parentales.- La ley exige verificación de edad, lo que ha suscitado preocupaciones sobre la privacidad y temores de un aumento en la vigilancia.- La legislación se aceleró con una mínima participación pública, dejando en duda su efectividad y aplicabilidad."
    ],
    "points": 184,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1732856517
  },
  {
    "id": 42269897,
    "title": "Pantalla compartida en el navegador",
    "originLink": "https://github.com/tonghohin/screen-sharing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269897",
    "commentBody": "",
    "originSummary": [
      "Bolt.new es una herramienta que permite a los usuarios crear rápidamente aplicaciones web, demostrado al construir una aplicación para compartir pantalla en solo 30 minutos. La aplicación funciona generando un código único para una sala, que otros pueden usar para unirse y ver la pantalla que se está compartiendo. El proyecto se desarrolló aún más utilizando Cursor y está disponible para ver en GitHub, con una demostración en vivo alojada en Vercel."
    ],
    "commentSummary": [
      "Una aplicación de compartición de pantalla basada en navegador fue desarrollada usando Bolt.new en solo 30 minutos, permitiendo a los usuarios crear y unirse a salas con códigos únicos para compartir pantalla. La aplicación está disponible en GitHub, con una demostración proporcionada, y ha recibido comentarios sobre problemas de detención de compartición de pantalla y compatibilidad móvil. La aplicación no utiliza un servidor TURN, que normalmente se usa para retransmitir medios en aplicaciones WebRTC cuando las conexiones directas de igual a igual fallan."
    ],
    "points": 168,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1732842261
  },
  {
    "id": 42274660,
    "title": "Prometheus 3.0",
    "originLink": "https://prometheus.io/blog/2024/11/14/prometheus-3-0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42274660",
    "commentBody": "",
    "originSummary": [
      "Prometheus 3.0, la primera versión importante en 7 años, introduce una interfaz de usuario modernizada, Remote Write 2.0, soporte UTF-8, soporte OTLP y histogramas nativos. - Las características clave incluyen una mayor eficiencia del protocolo con Remote Write 2.0, una mejor interoperabilidad con OpenTelemetry a través de la ingesta OTLP y métricas más eficientes con histogramas nativos. - Los usuarios deben estar al tanto de algunos cambios importantes y consultar la guía de migración, pero la versión mantiene la compatibilidad hacia atrás y fomenta los comentarios de los usuarios."
    ],
    "commentSummary": [
      "Prometheus 3.0 ha sido lanzado, introduciendo características como el uso reducido de memoria y soporte para la ingesta de OTLP (Protocolo OpenTelemetry). El lanzamiento ha generado discusiones sobre su escalabilidad en comparación con alternativas como Mimir, Victoria y Cortex, con algunos usuarios optando por estas soluciones para un rendimiento mejorado. Existen preocupaciones sobre la claridad de las notas de la versión, lo que indica la necesidad de una mejor comunicación por parte de los desarrolladores."
    ],
    "points": 151,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1732895564
  }
]
