[
  {
    "id": 42268580,
    "title": "„Pošlite niekomu, koho si vážite, oficiálny list 'Pokračuj a vytrvaj'“",
    "originLink": "https://ContinueAndPersist.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268580",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1219,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732828615
  },
  {
    "id": 42269227,
    "title": "„Inžinieri si nemôžu dovoliť robiť chyby pri zakladaní startupov, keď vytvárajú účtovné knihy“",
    "originLink": "https://news.alvaroduran.com/p/engineers-do-not-get-to-make-startup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269227",
    "commentBody": "",
    "originSummary": [
      "„Príručka pre platobných inžinierov zdôrazňuje kľúčovú úlohu presných účtovných kníh vo fintech startupoch, pričom poukazuje na úskalia zanedbávania systémov podvojného účtovníctva.“",
      "„Alvaro Duran zdieľa varovný príbeh zo svojej startupovej skúsenosti, kde absencia systému podvojného účtovníctva viedla k finančným nezrovnalostiam a nespokojnosti zákazníkov.“",
      "„Duran uvažuje o napísaní knihy o vytváraní škálovateľných a budúcnosti odolných účtovných kníh a hľadá spätnú väzbu o jej potenciálnom záujme.“"
    ],
    "commentSummary": [
      "„Inžinieri vo finančných systémoch musia predchádzať chybám, ako to bolo vidieť v prípade Synapse, kde ich účtovná kniha nesprávne ukazovala viac zostatkov zákazníkov, než bolo skutočných prostriedkov, čo viedlo k chýbajúcim miliónom. Fintech spoločnosti často sľubujú poistenie FDIC, ale to platí len v prípade, že banka zlyhá, nie ak fintech nesprávne spravuje prostriedky, čo zdôrazňuje dôležitosť presného finančného sledovania. Dvojité účtovníctvo je nevyhnutné pre presnosť, zabezpečuje, že každá transakcia je vyvážená a sledovateľná, čo pomáha predchádzať chybám a potenciálnym podvodom vo finančných systémoch.“"
    ],
    "points": 373,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1732835027
  },
  {
    "id": 42273505,
    "title": "„Neser sa so Scrollom“",
    "originLink": "https://dontfuckwithscroll.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42273505",
    "commentBody": "",
    "originSummary": [
      "„Pluginy na plynulé posúvanie sú kritizované za narúšanie prirodzeného zážitku z prehliadania webu tým, že zhoršujú použiteľnosť, prístupnosť a výkon. Kľúčové problémy zahŕňajú porušovanie očakávaní používateľov, spôsobovanie nevoľnosti z pohybu, znižovanie prístupnosti a nekonzistentný výkon, najmä na starších zariadeniach. Tieto pluginy tiež zvyšujú časy načítania stránok, narúšajú natívne funkcie prehliadača a pridávajú údržbovú záťaž, čo vedie k frustrácii používateľov a zložitosti.“"
    ],
    "commentSummary": [
      "„Diskusia zdôrazňuje frustrácie so Single Page Applications (SPAs), ktoré ovplyvňujú webovú navigáciu, najmä pokiaľ ide o URL adresy, navigáciu v prehliadači a tlačidlo späť. Kritici tvrdia, že nesprávne implementované SPAs kompromitujú základné webové funkcie ako možnosť záložkovania a navigácie, pričom uprednostňujú výkon pred používateľskou skúsenosťou. Rozhovor sa tiež zaoberá problémami, ako je unášanie štandardných funkcií prehliadača a dôležitosť rešpektovania používateľskej autonómie v dizajne webu, pričom sa zasadzujú za zachovanie tradičných webových funkcií.“"
    ],
    "points": 306,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1732884771
  },
  {
    "id": 42268475,
    "title": "„Hetzner zvyšuje ceny, pričom výrazne znižuje šírku pásma (USA)“",
    "originLink": "https://adriano.fyi/posts/hetzner-raises-prices-while-significantly-lowering-bandwidth-in-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268475",
    "commentBody": "",
    "originSummary": [
      "„Hetzner zvyšuje ceny v USA až o 27,52 % pre servery CPX21, pričom znižuje šírku pásma v priemere o 88,19 %. Zmeny, oznámené na Deň vďakyvzdania, majú za cieľ zosúladiť náklady s využívaním zdrojov, pretože ľahší používatelia dotovali ťažších používateľov. Nové ceny a limity šírky pásma nadobudnú účinnosť od decembra 2024 pre nové servery a od februára 2025 pre existujúce, pričom Hetzner tvrdí, že ponúka najlepší pomer cena-výkon.“"
    ],
    "commentSummary": [
      "„Hetzner, webhostingová spoločnosť, zvýšila svoje ceny a znížila ponuky šírky pásma v Spojených štátoch.“",
      "„Táto téma vyvolala značnú diskusiu, čo viedlo k viacerým duplicitným príspevkom na Hacker News, populárnej platforme pre technologické novinky.“"
    ],
    "points": 296,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1732827365
  },
  {
    "id": 42269925,
    "title": "„Pneumatiky automobilov uvoľňujú štvrtinu všetkých mikroplastov v prostredí“",
    "originLink": "https://phys.org/news/2024-11-car-quarter-microplastics-environment-urgent.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269925",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Pneumatiky áut sú hlavným zdrojom znečistenia mikroplastmi, pričom prispievajú štvrtinou všetkých mikroplastov v prostredí. Diskutuje sa o tom, či by sa mali pneumatiky zdaňovať na základe ich zloženia na riešenie znečistenia, namiesto zdaňovania vozidiel podľa hmotnosti. Diskusia zahŕňa obavy o súkromie a praktickosť týkajúce sa zdaňovania na základe hmotnosti a prejdenej vzdialenosti, pričom príklady z Veľkej Británie a Holandska zvažujú rôzne metódy implementácie.“"
    ],
    "points": 266,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1732842573
  },
  {
    "id": 42268310,
    "title": "„Úspech a neúspech Ninja (2020)“",
    "originLink": "https://neugierig.org/software/blog/2020/05/ninja.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268310",
    "commentBody": "",
    "originSummary": [
      "„Ninja, systém na zostavovanie vytvorený ako vedľajší projekt, získal značnú popularitu a teraz ho používajú veľké projekty ako Chrome, Android a Meson.“",
      "„Systém je navrhnutý pre rýchlosť a efektívnosť, využíva bipartitný graf pre lepšiu štruktúru zostavenia a zameriava sa na rýchle inkrementálne zostavenia.“",
      "„Tvorca uvažuje o výzvach, ktorým čelí ako správca open-source projektu, pričom si všíma vysoké nároky a obmedzenú vďačnosť napriek úspechu Ninja.“"
    ],
    "commentSummary": [
      "„Diskusia sa zameriava na úlohu build systému Ninja v AOSP (Android Open Source Project) a na zložitosť prechodu z makefile súborov na Ninja.“",
      "„Používatelia diskutujú o výhodách Ninja oproti Makefiles, zohľadňujúc architektúru, sociálne otázky a vplyv času iterácie na spokojnosť programátorov.“",
      "„Konverzácia tiež spomína iné systémy zostavovania, ako je Samurai, a výzvy spojené s udržiavaním ručne vytvorených systémov zostavovania, pričom zdôrazňuje úlohu sociálnej dynamiky v technologických prostrediach.“"
    ],
    "points": 256,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1732825274
  },
  {
    "id": 42270378,
    "title": "„Koľko pamäte potrebujete v roku 2024 na spustenie 1M súbežných úloh?“",
    "originLink": "https://hez2010.github.io/async-runtimes-benchmarks-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270378",
    "commentBody": "",
    "originSummary": [
      "„Referenčný test z roku 2024 testoval spotrebu pamäte pri spustení 1 milióna súbežných úloh pomocou korutín v rôznych programovacích jazykoch, vrátane Rust, C#, Go a Java. C# s NativeAOT preukázal najlepšiu efektivitu pamäte, prekonávajúc ostatné jazyky, zatiaľ čo Go spotreboval viac pamäte, než sa očakávalo, dokonca viac ako Java s GraalVM. Štúdia zdôrazňuje, že niektoré jazyky, ako .NET s NativeAOT a Java s GraalVM, zlepšili škálovateľnosť, zatiaľ čo gorutiny v Go boli menej efektívne a spotreba pamäte v Rust bola optimalizovaná úpravou spracovania úloh.“"
    ],
    "commentSummary": [
      "„V roku 2024 sa pamäť potrebná na spustenie 1 milióna súbežných úloh líši podľa programovacieho jazyka a modelu súbežnosti, pričom Rust a C# používajú približne 0,12 KiB na úlohu, zatiaľ čo Go používa približne 2,64 KiB na úlohu.“",
      "„Node.js, napriek tomu, že sa zdá byť efektívny s prísľubmi, nevykonáva úlohy paralelne, čo poukazuje na rozdiely v spracovaní súbežnosti medzi jazykmi.“",
      "„Referenčná hodnota zdôrazňuje, že aplikácie v reálnom svete zahŕňajú zložitejšie operácie ako jednoduché úlohy, čo ovplyvňuje využitie pamäte a výkon.“"
    ],
    "points": 245,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1732848659
  },
  {
    "id": 42268819,
    "title": "„Zbohom, Rust. Prajem ti úspech, ale vraciam sa k C++ (prepáč, je to výlev)“",
    "originLink": "https://old.reddit.com/r/rust/comments/1h15md8/goodbye_rust_i_wish_you_success_but_im_back_to_c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268819",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Používateľ Redditu kritizoval Rust za jeho zložitosť a obmedzené pracovné príležitosti, pričom ho porovnal k Betamaxu a Esperantu, ktoré sú technicky lepšie, ale nie sú široko prijaté.“",
      "„Zatiaľ čo niektorí používatelia oceňujú prísnosť a bezpečnostné funkcie jazyka Rust, iní si všímajú jeho pomalšiu mieru prijatia v porovnaní s jazykmi ako Go.“",
      "„Napriek týmto výzvam si Rust získava popularitu vo veľkých spoločnostiach ako AWS a Microsoft, pričom niektorí ho považujú za potenciálnu budúcu náhradu za C++.“"
    ],
    "points": 242,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1732831332
  },
  {
    "id": 42272927,
    "title": "„GIMP 3.0 je na ceste“",
    "originLink": "https://lwn.net/SubscriberLink/998793/6c8d00bd1b2a7948/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42272927",
    "commentBody": "",
    "originSummary": [
      "„Očakáva sa, že GIMP 3.0 bude čoskoro vydaný, čo bude prvá veľká aktualizácia od roku 2018, s modernizovaným rozhraním GTK 3 a vylepšeným výkonom. Kľúčové aktualizácie zahŕňajú nedestruktívne úpravy, vylepšenú správu farieb, zlepšené pracovné postupy s vrstvami a nový systém rozšírení pre jednoduchšiu správu pluginov. Aj keď presný dátum vydania nie je známy, dostupné sú vývojové verzie, čo naznačuje významný pokrok pre tento open-source editor obrázkov s očakávanými častejšími budúcimi aktualizáciami.“"
    ],
    "commentSummary": [
      "„GIMP 3.0 je vo vývoji a pridáva podporu pre farebné palety nad rámec sRGB, ako sú CMYK a CIELAB, ktoré sú dôležité pre tlač a publikovanie.“",
      "„Aktualizácia sa snaží zlepšiť presnosť farieb tým, že konvertuje do iných farebných priestorov len vtedy, keď je to nevyhnutné, čím minimalizuje stratu dát.“",
      "„Napriek pokrokom, ako je nedestruktívne úpravy, niektorí používatelia majú obavy z používateľského rozhrania a funkčnosti GIMPu v porovnaní s Photoshopom, pričom uvádzajú pomalý vývoj kvôli malej dobrovoľníckej skupine.“"
    ],
    "points": 230,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732877433
  },
  {
    "id": 42270389,
    "title": "„Vince – alternatíva k Google Analytics s vlastným hosťovaním“",
    "originLink": "https://github.com/vinceanalytics/vince",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270389",
    "commentBody": "",
    "originSummary": [
      "„Vince je port Plausible Analytics dashboardu založený na Golangu, navrhnutý ako jednoužívateľský systém pre viacero webových stránok bez runtime závislostí. Zahŕňa funkcie ako automatický TLS (Transport Layer Security), sledovanie odkazov smerujúcich von, sledovanie sťahovania súborov, sledovanie stránok 404 a sledovanie vlastných udalostí, čím sa takmer vyrovná Plausible dashboardu. Vince si kladie za cieľ sprístupniť Plausible dashboard pre samohostovanie, slúži ako náhrada pre osobné webové stránky, s ukážkou dostupnou na $6 Vultr inštancii.“"
    ],
    "commentSummary": [
      "„Vince je samohostovaná alternatíva k Google Analytics, vyvinutá ako Golang port dashboardu Plausible Analytics, zameriavajúca sa na funkcie súvisiace s dashboardom.“",
      "„Ponúka funkcie ako automatické TLS (Transport Layer Security), sledovanie odchádzajúcich odkazov a sledovanie vlastných udalostí, bez závislostí na runtime, čo ho robí vhodným pre osobné webové stránky.“",
      "„Vince je v súlade s GDPR (Všeobecné nariadenie o ochrane údajov), používa Pebble na ukladanie údajov a je dostupný ako open-source projekt na GitHube, čo poskytuje prístupnú možnosť samostatného hostingu bez zložitosti nastavenia Plausible.“"
    ],
    "points": 188,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732848840
  },
  {
    "id": 42270966,
    "title": "„Austrálsky parlament zakazuje sociálne médiá pre osoby mladšie ako 16 rokov“",
    "originLink": "https://apnews.com/article/australia-social-media-children-ban-safeguarding-harm-accounts-d0cde2603bdbc7167801da1d00ecd056",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270966",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Austrália zaviedla zákaz používania sociálnych médií pre osoby mladšie ako 16 rokov, čo vyvolalo diskusie o ochrane detí verzus rodičovské práva. Zákon vyžaduje overenie veku, čo vyvolalo obavy o súkromie a strach z zvýšeného dohľadu. Legislatíva bola urýchlená s minimálnym verejným vstupom, čo ponecháva otázky o jej účinnosti a vynútiteľnosti.“"
    ],
    "points": 184,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1732856517
  },
  {
    "id": 42269897,
    "title": "„Zdieľanie obrazovky v prehliadači“",
    "originLink": "https://github.com/tonghohin/screen-sharing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269897",
    "commentBody": "",
    "originSummary": [
      "„Bolt.new je nástroj, ktorý umožňuje používateľom rýchlo vytvárať webové aplikácie, čo je demonštrované vytvorením aplikácie na zdieľanie obrazovky len za 30 minút. Aplikácia funguje tak, že generuje jedinečný kód pre miestnosť, ktorý môžu ostatní použiť na pripojenie a zobrazenie zdieľanej obrazovky. Projekt bol ďalej vyvíjaný pomocou Cursor a je dostupný na prezeranie na GitHub, s živou ukážkou hostovanou na Vercel.“"
    ],
    "commentSummary": [
      "„Aplikácia na zdieľanie obrazovky založená na prehliadači bola vyvinutá pomocou Bolt.new len za 30 minút, čo umožňuje používateľom vytvárať a pripojiť sa k miestnostiam s jedinečnými kódmi na zdieľanie obrazovky. Aplikácia je dostupná na GitHub, s poskytnutou ukážkou, a dostala spätnú väzbu týkajúcu sa problémov so zastavením zdieľania obrazovky a kompatibilitou s mobilnými zariadeniami. Aplikácia nepoužíva TURN server, ktorý sa zvyčajne používa na prenos médií v aplikáciách WebRTC, keď priame peer-to-peer pripojenia zlyhajú.“"
    ],
    "points": 168,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1732842261
  },
  {
    "id": 42274660,
    "title": "„Prometheus 3.0“",
    "originLink": "https://prometheus.io/blog/2024/11/14/prometheus-3-0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42274660",
    "commentBody": "",
    "originSummary": [
      "„Prometheus 3.0, prvé veľké vydanie za 7 rokov, prináša modernizované používateľské rozhranie, Remote Write 2.0, podporu UTF-8, podporu OTLP a natívne histogramy. - Kľúčové funkcie zahŕňajú zlepšenú efektivitu protokolu s Remote Write 2.0, vylepšenú interoperabilitu s OpenTelemetry prostredníctvom OTLP príjmu a efektívnejšie metriky s natívnymi histogramami. - Používatelia by si mali byť vedomí niektorých zlomových zmien a konzultovať migračnú príručku, ale vydanie si zachováva spätnú kompatibilitu a povzbudzuje spätnú väzbu od používateľov.“"
    ],
    "commentSummary": [
      "„Prometheus 3.0 bol vydaný, prinášajúc funkcie ako znížené využitie pamäte a podporu pre OTLP (OpenTelemetry Protocol) príjem. - Vydanie vyvolalo diskusie o jeho škálovateľnosti v porovnaní s alternatívami ako Mimir, Victoria a Cortex, pričom niektorí používatelia sa rozhodli pre tieto riešenia kvôli zvýšenému výkonu. - Existujú obavy o jasnosť poznámok k vydaniu, čo naznačuje potrebu zlepšenej komunikácie od vývojárov.“"
    ],
    "points": 151,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1732895564
  }
]
