[
  {
    "id": 42268580,
    "title": "நீங்கள் மதிக்கும் ஒருவருக்கு ஒரு அதிகாரப்பூர்வ 'தொடர்ந்து முயற்சி செய்யுங்கள்' கடிதத்தை அனுப்புங்கள்",
    "originLink": "https://ContinueAndPersist.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268580",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1219,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732828615
  },
  {
    "id": 42269227,
    "title": "பொறியாளர்கள் கணக்குப் புத்தகங்களை உருவாக்கும் போது தொடக்கத் தவறுகளைச் செய்ய முடியாது",
    "originLink": "https://news.alvaroduran.com/p/engineers-do-not-get-to-make-startup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269227",
    "commentBody": "",
    "originSummary": [
      "\"பணம் செலுத்தும் பொறியாளர் விளையாட்டு புத்தகம்\" என்பது நிதி தொழில்நுட்ப தொடக்க நிறுவனங்களில் துல்லியமான கணக்குப் புத்தகங்களின் முக்கிய பங்கைக் குறிப்பிடுகிறது, இரட்டை நுழைவு கணக்கியல் முறைகளை புறக்கணிக்கும் போது ஏற்படும் சிக்கல்களை வெளிப்படுத்துகிறது.",
      "அல்வாரோ டூரான் தனது தொடக்க நிறுவன அனுபவத்திலிருந்து ஒரு எச்சரிக்கை கதையை பகிர்ந்துள்ளார், அங்கு இரட்டை நுழைவு முறைமையின் இல்லாமை நிதி முரண்பாடுகள் மற்றும் வாடிக்கையாளர் அதிருப்திக்கு வழிவகுத்தது.",
      "துரான், அளவுகோல்படுத்தக்கூடிய மற்றும் எதிர்காலத்திற்கேற்ப பாதுகாக்கக்கூடிய லெட்ஜர்களை உருவாக்குவது பற்றிய ஒரு புத்தகத்தை எழுதுவதைக் குறித்து யோசிக்கிறார், அதன் சாத்தியமான ஆர்வத்தைப் பற்றிய கருத்துக்களை எதிர்பார்க்கிறார்."
    ],
    "commentSummary": [
      "பொருளாதார அமைப்புகளில் பொறியாளர்கள் பிழைகளை தவிர்க்க வேண்டும், சைனாப்ஸ் நிறுவனத்தின் நிகழ்வில் காணப்பட்டதைப் போல, அவர்கள் கணக்கில் உண்மையான நிதிகளை விட அதிகமான வாடிக்கையாளர் இருப்புகளை தவறாகக் காட்டியது, இதனால் கோடிக்கணக்கான நிதிகள் காணாமல் போனது.- ஃபின்டெக் நிறுவனங்கள் பெரும்பாலும் FDIC காப்பீட்டை வாக்குறுதி அளிக்கின்றன, ஆனால் அது வங்கியால் தோல்வியடைந்தால் மட்டுமே பொருந்தும், ஃபின்டெக் நிறுவனங்கள் நிதிகளை தவறாக நிர்வகித்தால் அல்ல, இது துல்லியமான நிதி கண்காணிப்பின் முக்கியத்துவத்தை வெளிப்படுத்துகிறது.- இரட்டை நுழைவு கணக்கியல் துல்லியத்திற்கு முக்கியமானது, ஒவ்வொரு பரிவர்த்தனையும் சமநிலையுடன் மற்றும் கண்காணிக்கக்கூடியதாக இருப்பதை உறுதிசெய்கிறது, இது பொருளாதார அமைப்புகளில் பிழைகள் மற்றும் சாத்தியமான மோசடிகளைத் தவிர்க்க உதவுகிறது."
    ],
    "points": 373,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1732835027
  },
  {
    "id": 42273505,
    "title": "ஸ்க்ரோல் உடன் கெட்ட வார்த்தை பேசாதே",
    "originLink": "https://dontfuckwithscroll.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42273505",
    "commentBody": "",
    "originSummary": [
      "மோமென்டம் ஸ்க்ரோலிங் பிளகின்கள் இயல்பான வலை உலாவல் அனுபவத்தை பாதிக்கின்றன என்று விமர்சிக்கப்படுகின்றன, ஏனெனில் அவை பயன்பாட்டை, அணுகல்தன்மையை மற்றும் செயல்திறனை குறைக்கின்றன.- முக்கிய பிரச்சினைகள் பயனர் எதிர்பார்ப்புகளை மீறுவது, இயக்க மயக்கத்தை ஏற்படுத்துவது, அணுகல்தன்மையை குறைப்பது மற்றும் குறிப்பாக பழைய சாதனங்களில் சீரற்ற செயல்திறனை ஏற்படுத்துவது ஆகியவற்றை உள்ளடக்கியவை.- இந்த பிளகின்கள் பக்க ஏற்ற நேரங்களை அதிகரிக்கின்றன, சொந்த உலாவி அம்சங்களை உடைக்கின்றன மற்றும் பராமரிப்பு சுமையை அதிகரிக்கின்றன, இது பயனர் விரக்தி மற்றும் சிக்கல்களை ஏற்படுத்துகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் ஒற்றை பக்கம் பயன்பாடுகள் (SPAs) வலை வழிசெலுத்தலுக்கு ஏற்படுத்தும் சிரமங்களை, குறிப்பாக URLகள், உலாவி வழிசெலுத்தல் மற்றும் பின்செலுத்தல் பொத்தானை பற்றிய சிக்கல்களை வலியுறுத்துகிறது. - விமர்சகர்கள் தவறாக செயல்படுத்தப்பட்ட SPAs வலை அடிப்படைகளைப் பாதிக்கின்றன என்று வாதிடுகின்றனர், குறிப்பாக புத்தகக்குறியிடுதல் மற்றும் வழிசெலுத்தலை, செயல்திறனை பயனர் அனுபவத்திற்கு மேல் முன்னுரிமை கொடுக்கின்றன. - இந்த உரையாடல் நிலையான உலாவி செயல்பாடுகளை கைப்பற்றுதல் போன்ற பிரச்சினைகளை மற்றும் வலை வடிவமைப்பில் பயனர் சுயாதீனத்தை மதிப்பதன் முக்கியத்துவத்தை, பாரம்பரிய வலை செயல்பாடுகளை பராமரிக்க வலியுறுத்துகிறது."
    ],
    "points": 306,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1732884771
  },
  {
    "id": 42268475,
    "title": "ஹெட்ஸ்னர் விலைகளை உயர்த்தி, அதேசமயம் பரவலான வலையமைப்பை (US) குறிப்பிடத்தக்க அளவில் குறைக்கிறது",
    "originLink": "https://adriano.fyi/posts/hetzner-raises-prices-while-significantly-lowering-bandwidth-in-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268475",
    "commentBody": "",
    "originSummary": [
      "ஹெட்ஸ்னர் CPX21 சர்வர்களுக்கான விலைகளை அமெரிக்காவில் 27.52% வரை அதிகரிக்கிறது, அதே நேரத்தில் வலையமைப்பை சராசரியாக 88.19% குறைக்கிறது. - நன்றி தெரிவிக்கும் நாளில் அறிவிக்கப்பட்ட இந்த மாற்றங்கள், குறைந்த அளவில் பயன்படுத்துபவர்கள் அதிக அளவில் பயன்படுத்துபவர்களுக்கு மானியமாக இருந்ததை சரிசெய்யும் நோக்கத்துடன் செலவுகளை வளங்களின் பயன்பாட்டுடன் ஒத்திசைக்கின்றன. - புதிய விலை மற்றும் வலையமைப்பு வரம்புகள் டிசம்பர் 2024 முதல் புதிய சர்வர்களுக்கும், பிப்ரவரி 2025 முதல் உள்ள சர்வர்களுக்கும் அமலுக்கு வரும், ஹெட்ஸ்னர் சிறந்த விலை-செயல்திறன் விகிதத்தை வழங்குவதாகக் கூறுகிறது."
    ],
    "commentSummary": [
      "Hetzner, ஒரு வலை ஹோஸ்டிங் நிறுவனம், அதன் விலைகளை உயர்த்தி, அமெரிக்காவில் வலையமைப்பு வழங்கல்களை குறைத்துள்ளது.",
      "இந்த தலைப்பு முக்கியமான விவாதத்தை உருவாக்கியுள்ளது, இது பல முறைபிரதி பதிவுகளை ஹாக்கர் நியூஸ், ஒரு பிரபலமான தொழில்நுட்ப செய்தி தளத்தில் உருவாக்கியுள்ளது."
    ],
    "points": 296,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1732827365
  },
  {
    "id": 42269925,
    "title": "கார் டயர்கள் சுற்றுச்சூழலில் உள்ள மைக்ரோபிளாஸ்டிக்ஸின் நான்கில் ஒரு பங்கை களைவதாகும்",
    "originLink": "https://phys.org/news/2024-11-car-quarter-microplastics-environment-urgent.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269925",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "கார் டயர்கள் சூட்சும பிளாஸ்டிக் மாசுபாட்டின் முக்கிய மூலமாக உள்ளன, சூட்சும பிளாஸ்டிக்கின் நான்கில் ஒரு பங்கிற்கு பங்களிக்கின்றன.- மாசுபாட்டை சமாளிக்க டயர்களின் சேர்மங்களின் அடிப்படையில் வரி விதிக்கலாமா என்ற விவாதம் உள்ளது, வாகனங்களின் எடையின் அடிப்படையில் வரி விதிப்பதற்கு பதிலாக.- எடையும் பயணித்த தூரமும் அடிப்படையாகக் கொண்டு வரி விதிப்பது தொடர்பான தனியுரிமை மற்றும் நடைமுறை சிக்கல்கள் குறித்து விவாதம் நடைபெறுகிறது, இங்கிலாந்து மற்றும் நெதர்லாந்து போன்ற நாடுகள் செயல்படுத்துவதற்கான முறைமைகளை பரிசீலிக்கின்றன."
    ],
    "points": 266,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1732842573
  },
  {
    "id": 42268310,
    "title": "நிஞ்ஜா (2020) திரைப்படத்தின் வெற்றியும் தோல்வியும்",
    "originLink": "https://neugierig.org/software/blog/2020/05/ninja.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268310",
    "commentBody": "",
    "originSummary": [
      "நிஞ்சா, ஒரு பக்க திட்டமாக உருவாக்கப்பட்ட கட்டமைப்பு அமைப்பு, முக்கியமான பிரபலத்தைப் பெற்றுள்ளது மற்றும் இப்போது குரோம், ஆண்ட்ராய்டு, மற்றும் மேசான் போன்ற முக்கியமான திட்டங்களில் பயன்படுத்தப்படுகிறது.",
      "அந்த அமைப்பு வேகம் மற்றும் திறமையை கருத்தில் கொண்டு வடிவமைக்கப்பட்டுள்ளது, சிறந்த கட்டமைப்பு அமைப்பிற்காக இருபகுதி வரைபடத்தை பயன்படுத்தி, வேகமான குறுக்கீட்டு கட்டமைப்புகளை மையமாகக் கொண்டு செயல்படுகிறது.",
      "உருவாக்குநர் ஓப்பன்-சோர்ஸ் பராமரிப்பாளராக இருப்பதன் சவால்களைப் பற்றி சிந்திக்கிறார், நிஞ்சாவின் வெற்றியைத் தவிர, அதிகமான கோரிக்கைகள் மற்றும் குறைந்த நன்றி இருப்பதை குறிப்பிடுகிறார்."
    ],
    "commentSummary": [
      "இந்த விவாதம், Android இன் AOSP (Android Open Source Project) இல் Ninja கட்டமைப்பு அமைப்பின் பங்கையும், makefiles இல் இருந்து Ninja க்கு மாற்றத்தின் சிக்கல்களையும் மையமாகக் கொண்டுள்ளது.",
      "பயனர்கள் நிஞ்சாவின் நன்மைகளை மேக்ஃபைல்களுடன் ஒப்பிட்டு விவாதிக்கின்றனர், கட்டமைப்பு, சமூக பிரச்சினைகள் மற்றும் புரோகிராமர் திருப்தியில் மீளுருவாக்க நேரத்தின் தாக்கத்தை கருத்தில் கொண்டு.",
      "உரையாடல் சமுராய் போன்ற பிற கட்டமைப்பு அமைப்புகள் மற்றும் கைவினைமுறையாக உருவாக்கப்பட்ட கட்டமைப்பு அமைப்புகளை பராமரிக்கும் சவால்களைப் பற்றியும் குறிப்பிடுகிறது, தொழில்நுட்ப சூழல்களில் சமூக இயக்கவியல் முக்கியத்துவத்தை வெளிப்படுத்துகிறது."
    ],
    "points": 256,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1732825274
  },
  {
    "id": 42270378,
    "title": "2024 இல் 1 மில்லியன் ஒரே நேரத்தில் செயல்களை இயக்க எவ்வளவு நினைவகம் தேவைப்படும்?",
    "originLink": "https://hez2010.github.io/async-runtimes-benchmarks-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270378",
    "commentBody": "",
    "originSummary": [
      "2024 முத்திரை சோதனை பல்வேறு நிரல்மொழிகளில், குறிப்பாக ரஸ்ட், C#, கோ, மற்றும் ஜாவா ஆகியவற்றில் கோரூட்டின்களைப் பயன்படுத்தி 1 மில்லியன் ஒரே நேரத்தில் செயல்படும் பணிகளை இயக்குவதற்கான நினைவக நுகர்வை சோதித்தது.- C# NativeAOT உடன் சிறந்த நினைவக திறனை வெளிப்படுத்தியது, மற்ற மொழிகளை விட மேம்பட்டது, அதே சமயம் கோ எதிர்பார்த்ததை விட அதிக நினைவகத்தை நுகர்ந்தது, ஜாவாவின் GraalVM உடன் கூட.- இந்த ஆய்வு சில மொழிகள், .NET NativeAOT மற்றும் ஜாவாவின் GraalVM போன்றவை, மேம்பட்ட அளவீட்டைக் கொண்டுள்ளன என்பதை வலியுறுத்துகிறது, ஆனால் கோவின் கோரூட்டின்கள் குறைவான திறனுடன் இருந்தன, மற்றும் ரஸ்டின் நினைவக பயன்பாடு பணிகளை கையாள்வதை சரிசெய்து மேம்படுத்தப்பட்டது."
    ],
    "commentSummary": [
      "2024 ஆம் ஆண்டில், 1 மில்லியன் ஒரே நேரத்தில் நடைபெறும் பணிகளை இயக்க தேவையான நினைவகம், நிரலாக்க மொழி மற்றும் ஒரே நேர செயல்பாட்டு மாதிரியின்படி மாறுபடுகிறது, Rust மற்றும் C# மொழிகள் ஒவ்வொரு பணிக்கும் சுமார் 0.12 KiB பயன்படுத்துகின்றன, அதே நேரத்தில் Go மொழி ஒவ்வொரு பணிக்கும் சுமார் 2.64 KiB பயன்படுத்துகிறது.",
      "Node.js, வாக்குறுதிகளுடன் திறமையாக தோன்றினாலும், பணிகளை ஒரே நேரத்தில் செயல்படுத்தாது, மொழிகளுக்கிடையிலான ஒருங்கிணைப்பு கையாளலில் உள்ள வேறுபாடுகளை வெளிப்படுத்துகிறது.",
      "மாதிரியாக்கம் உண்மையான உலக பயன்பாடுகள் எளிய பணிகளைக் காட்டிலும் சிக்கலான செயல்பாடுகளை உள்ளடக்கியவை என்பதை வலியுறுத்துகிறது, இது நினைவக பயன்பாடு மற்றும் செயல்திறனை பாதிக்கிறது."
    ],
    "points": 245,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1732848659
  },
  {
    "id": 42268819,
    "title": "குட்பை, ரஸ்ட். உங்களுக்கு வெற்றி கிடைக்க வாழ்த்துகிறேன், ஆனால் நான் மீண்டும் C++ க்கு திரும்புகிறேன் (மன்னிக்கவும், இது ஒரு புலம்பல்)",
    "originLink": "https://old.reddit.com/r/rust/comments/1h15md8/goodbye_rust_i_wish_you_success_but_im_back_to_c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268819",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஒரு ரெடிட் பயனர் ரஸ்ட் மொழியை அதன் சிக்கலான தன்மை மற்றும் குறைந்த வேலை வாய்ப்புகளுக்காக விமர்சித்தார், அதை பெட்டாமாக்ஸ் மற்றும் எஸ்பராண்டோவுடன் ஒப்பிட்டு, அவை தொழில்நுட்ப ரீதியாக மேம்பட்டவை ஆனால் பரவலாக ஏற்றுக்கொள்ளப்படவில்லை என்று கூறினார்.",
      "சில பயனர்கள் ரஸ்ட் மொழியின் கடுமை மற்றும் பாதுகாப்பு அம்சங்களை பாராட்டினாலும், மற்றவர்கள் கோ போன்ற மொழிகளுடன் ஒப்பிடும்போது அதன் மந்தமான ஏற்றுக்கொள்ளும் விகிதத்தை குறிப்பிடுகின்றனர்.",
      "இந்த சவால்களை எதிர்கொண்டாலும், Rust போன்ற மொழி AWS மற்றும் Microsoft போன்ற முக்கிய நிறுவனங்களில் முன்னேற்றம் காண்கிறது, சிலர் இதை C++க்கு எதிர்கால மாற்றாகக் கருதுகின்றனர்."
    ],
    "points": 242,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1732831332
  },
  {
    "id": 42272927,
    "title": "கிம்ப் 3.0 வருவதாக உள்ளது",
    "originLink": "https://lwn.net/SubscriberLink/998793/6c8d00bd1b2a7948/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42272927",
    "commentBody": "",
    "originSummary": [
      "ஜிஐஎம்ப் 3.0 விரைவில் வெளியிடப்படும் என்று எதிர்பார்க்கப்படுகிறது, இது 2018 முதல் முதல் முக்கிய புதுப்பிப்பு ஆகும், இது நவீனமயமாக்கப்பட்ட GTK 3 இடைமுகம் மற்றும் மேம்பட்ட செயல்திறனை கொண்டுள்ளது.- முக்கிய புதுப்பிப்புகளில் அழிக்காத திருத்தம், மேம்பட்ட நிற மேலாண்மை, மேம்பட்ட அடுக்கு வேலைப்பாடுகள் மற்றும் எளிதான பிளகின் மேலாண்மைக்கான புதிய நீட்டிப்பு அமைப்பு அடங்கும்.- துல்லியமான வெளியீட்டு தேதி தெரியாதபோதிலும், மேம்பாட்டு கட்டமைப்புகள் கிடைக்கின்றன, இது திறந்த மூல படத் திருத்தி மற்றும் எதிர்காலத்தில் அதிகமாக வெளியீடுகள் எதிர்பார்க்கப்படுகின்றன என்பதற்கான முக்கிய முன்னேற்றத்தை குறிக்கிறது."
    ],
    "commentSummary": [
      "GIMP 3.0 உருவாக்கத்தில் உள்ளது, அச்சு மற்றும் பதிப்புரிமைக்கு முக்கியமான CMYK மற்றும் CIELAB போன்ற sRGBக்கு அப்பாற்பட்ட நிறத் தட்டுகளுக்கான ஆதரவைச் சேர்க்கிறது.",
      "புதுப்பிப்பு, தரவிழப்பை குறைத்து, தேவையான போது மட்டுமே பிற நிற இடங்களுக்கு மாற்றுவதன் மூலம் நிற துல்லியத்தை மேம்படுத்த முயல்கிறது.",
      "சில பயனர்கள், GIMP இன் பயனர் இடைமுகம் மற்றும் செயல்பாடுகள் குறித்து கவலைப்படுகின்றனர், குறிப்பாக Photoshop உடன் ஒப்பிடும்போது, சிறிய தன்னார்வ குழுவின் காரணமாக மெதுவாக வளர்ச்சி அடைவதாக குறிப்பிடுகின்றனர், அதேசமயம் அழிக்காத திருத்தம் போன்ற முன்னேற்றங்கள் இருந்தாலும்."
    ],
    "points": 230,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732877433
  },
  {
    "id": 42270389,
    "title": "வின்ஸ் – கூகுள் அனலிட்டிக்ஸ்க்கு ஒரு சுயமாக ஹோஸ்ட் செய்யக்கூடிய மாற்று",
    "originLink": "https://github.com/vinceanalytics/vince",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270389",
    "commentBody": "",
    "originSummary": [
      "வின்ஸ் என்பது பிளாசிபிள் அனலிட்டிக்ஸ் டாஷ்போர்டின் கோலாங் அடிப்படையிலான போர்ட் ஆகும், இது பல வலைத்தளங்களுக்கு ஓர் ஒற்றை பைனரி, ஒற்றை பயனர் அமைப்பாக வடிவமைக்கப்பட்டுள்ளது, இயக்க நேர சார்புகள் இல்லாமல்.- இது தானியங்கி TLS (டிரான்ஸ்போர்ட் லேயர் பாதுகாப்பு), வெளிப்புற இணைப்பு கண்காணிப்பு, கோப்பு பதிவிறக்கம் கண்காணிப்பு, 404 பக்கம் கண்காணிப்பு மற்றும் தனிப்பயன் நிகழ்வு கண்காணிப்பு போன்ற அம்சங்களை உள்ளடக்கியது, இதனால் இது பிளாசிபிள் டாஷ்போர்டுக்கு நிகராக nearly உள்ளது.- வின்ஸ் பிளாசிபிள் டாஷ்போர்டை சுய-ஹோஸ்டிங்கிற்கு அணுகக்கூடியதாக மாற்றுவதை நோக்கமாகக் கொண்டுள்ளது, தனிப்பட்ட வலைத்தளங்களுக்கு ஒரு மாற்று தீர்வாக செயல்படுகிறது, $6 வல்ட்ர் உதாரணத்தில் ஒரு டெமோ கிடைக்கிறது."
    ],
    "commentSummary": [
      "வின்ஸ் என்பது கூகுள் அனலிட்டிக்ஸ்க்கு ஒரு சுய-ஹோஸ்டட் மாற்று ஆகும், இது பிளாசிபிள் அனலிட்டிக்ஸ் டாஷ்போர்டின் கோலாங் போர்ட்டாக உருவாக்கப்பட்டுள்ளது, டாஷ்போர்டு தொடர்பான அம்சங்களை மையமாகக் கொண்டு செயல்படுகிறது.",
      "தமிழில் எழுத வேண்டும்: இது தானியங்கி TLS (போக்குவரத்து அடுக்கு பாதுகாப்பு), வெளியே செல்லும் இணைப்பு கண்காணிப்பு மற்றும் தனிப்பயன் நிகழ்வு கண்காணிப்பு போன்ற அம்சங்களை வழங்குகிறது, எந்த ரன்டைம் சார்புகளும் இல்லாமல், இதை தனிப்பட்ட வலைத்தளங்களுக்கு ஏற்றதாக ஆக்குகிறது.",
      "வின்ஸ் GDPR (பொது தரவுப் பாதுகாப்பு ஒழுங்குமுறை) உடன் இணக்கமானது, தரவுகளை சேமிக்க பிபிளை பயன்படுத்துகிறது, மேலும் GitHub இல் ஒரு திறந்த மூல திட்டமாக கிடைக்கிறது, பிளாசிபிளின் அமைப்பு சிக்கலினின்று எளிதாக தானாக ஹோஸ்ட் செய்யும் விருப்பத்தை வழங்குகிறது."
    ],
    "points": 188,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732848840
  },
  {
    "id": 42270966,
    "title": "ஆஸ்திரேலிய பாராளுமன்றம் 16 வயதுக்குட்பட்டவர்களுக்கு சமூக ஊடகங்களைத் தடை செய்கிறது",
    "originLink": "https://apnews.com/article/australia-social-media-children-ban-safeguarding-harm-accounts-d0cde2603bdbc7167801da1d00ecd056",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270966",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஆஸ்திரேலியா 16 வயதுக்குட்பட்டவர்களுக்கு சமூக ஊடக பயன்பாட்டில் தடை விதித்துள்ளது, இது குழந்தைகள் பாதுகாப்பு மற்றும் பெற்றோர் உரிமைகள் குறித்து விவாதங்களை ஏற்படுத்தியுள்ளது.- இந்த சட்டம் வயது சரிபார்ப்பை கட்டாயமாக்குகிறது, இது தனியுரிமை குறித்த கவலைகளையும் கண்காணிப்பு அதிகரிக்கும் அச்சத்தையும் எழுப்பியுள்ளது.- குறைந்த அளவிலான பொது கருத்துக்களுடன் இந்த சட்டம் விரைவாக நிறைவேற்றப்பட்டது, இதன் செயல்திறன் மற்றும் அமலாக்கம் கேள்விக்குறியாக உள்ளது."
    ],
    "points": 184,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1732856517
  },
  {
    "id": 42269897,
    "title": "உலாவியில் திரை பகிர்வு",
    "originLink": "https://github.com/tonghohin/screen-sharing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269897",
    "commentBody": "",
    "originSummary": [
      "போல்ட்.நியூ என்பது பயனர்களுக்கு விரைவாக வலை பயன்பாடுகளை உருவாக்க அனுமதிக்கும் ஒரு கருவி ஆகும், 30 நிமிடங்களில் ஒரு திரை பகிர்வு பயன்பாட்டை உருவாக்குவதன் மூலம் இது நிரூபிக்கப்பட்டது.- இந்த பயன்பாடு ஒரு அறைக்கு தனித்துவமான குறியீட்டை உருவாக்குவதன் மூலம் செயல்படுகிறது, இதை மற்றவர்கள் இணைந்து பகிரப்படும் திரையை காண பயன்படுத்தலாம்.- இந்த திட்டம் கர்சர் பயன்படுத்தி மேலும் மேம்படுத்தப்பட்டது மற்றும் கிட்ட்ஹப் இல் பார்வைக்கு கிடைக்கிறது, மேலும் வெர்செல் இல் நேரடி டெமோ வழங்கப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "A browser-based screen-sharing app was developed using Bolt.new in just 30 minutes, allowing users to create and join rooms with unique codes for screen sharing.- The app is available on GitHub, with a demo provided, and has received feedback regarding screen sharing stoppage issues and mobile compatibility.- The app does not utilize a TURN server, which is typically used to relay media in WebRTC applications when direct peer-to-peer connections fail."
    ],
    "points": 168,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1732842261
  },
  {
    "id": 42274660,
    "title": "ப்ரொமிதியஸ் 3.0",
    "originLink": "https://prometheus.io/blog/2024/11/14/prometheus-3-0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42274660",
    "commentBody": "",
    "originSummary": [
      "ப்ரொமிதியஸ் 3.0, 7 ஆண்டுகளில் முதல் முக்கிய வெளியீடாக, நவீனமயமாக்கப்பட்ட UI, ரிமோட் ரைட் 2.0, UTF-8 ஆதரவு, OTLP ஆதரவு மற்றும் சொந்த ஹிஸ்டோகிராம்களை அறிமுகப்படுத்துகிறது. - முக்கிய அம்சங்களில் ரிமோட் ரைட் 2.0 மூலம் மேம்பட்ட நெறிமுறை திறன், OTLP உட்கொள்கை மூலம் ஓபன் டெலிமெட்ரியுடன் மேம்பட்ட இடையின்மை, மற்றும் சொந்த ஹிஸ்டோகிராம்களுடன் மேலும் திறமையான அளவுகோல்கள் அடங்கும். - பயனர்கள் சில உடைந்த மாற்றங்களை கவனிக்க வேண்டும் மற்றும் இடமாற்ற வழிகாட்டியை அணுக வேண்டும், ஆனால் வெளியீடு பின்தொடர்பை பராமரிக்கிறது மற்றும் பயனர் கருத்துக்களை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "ப்ரோமிதியஸ் 3.0 வெளியிடப்பட்டுள்ளது, குறைந்த நினைவக பயன்பாடு மற்றும் OTLP (ஓபன் டெலிமெட்ரி நெறிமுறை) உட்கருத்து ஆதரவு போன்ற அம்சங்களை அறிமுகப்படுத்துகிறது. - இந்த வெளியீடு, மிமிர், விக்டோரியா மற்றும் கோர்டெக்ஸ் போன்ற மாற்று தீர்வுகளுடன் ஒப்பிடும்போது அதன் அளவீட்டு திறனைப் பற்றிய விவாதங்களைத் தூண்டியுள்ளது, சில பயனர்கள் மேம்பட்ட செயல்திறனைப் பெற இந்த தீர்வுகளைத் தேர்ந்தெடுக்கின்றனர். - வெளியீட்டு குறிப்புகளின் தெளிவைப் பற்றிய கவலைகள் உள்ளன, இது டெவலப்பர்களிடமிருந்து மேம்பட்ட தொடர்பு தேவை என்பதை குறிக்கிறது."
    ],
    "points": 151,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1732895564
  }
]
