[
  {
    "id": 42268580,
    "title": "„Küldjön valakinek, akit értékel, egy hivatalos 'Folytasd és Kitarts' levelet”",
    "originLink": "https://ContinueAndPersist.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268580",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1219,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732828615
  },
  {
    "id": 42269227,
    "title": "„A mérnökök nem engedhetik meg maguknak, hogy kezdő hibákat kövessenek el, amikor főkönyveket építenek.”",
    "originLink": "https://news.alvaroduran.com/p/engineers-do-not-get-to-make-startup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269227",
    "commentBody": "",
    "originSummary": [
      "„A Payments Engineer Playbook kiemeli a pontos főkönyvek kritikus szerepét a fintech startupokban, rávilágítva a kettős könyvelési rendszerek elhanyagolásának buktatóira.”",
      "„Alvaro Duran megoszt egy figyelmeztető történetet a startup tapasztalataiból, ahol a kettős könyvelési rendszer hiánya pénzügyi eltérésekhez és ügyfél elégedetlenséghez vezetett.”",
      "„Duran azon gondolkodik, hogy könyvet írjon a skálázható és jövőbiztos főkönyvek létrehozásáról, és visszajelzést kér annak lehetséges érdeklődéséről.”"
    ],
    "commentSummary": [
      "„A pénzügyi rendszerek mérnökeinek el kell kerülniük a hibákat, ahogy azt a Synapse esetében is láthattuk, ahol a főkönyvük pontatlanul több ügyfél-egyenleget mutatott, mint a valós pénzeszközök, ami hiányzó milliókhoz vezetett. - A fintech cégek gyakran ígérnek FDIC biztosítást, de ez csak akkor érvényes, ha a bank csődbe megy, nem pedig akkor, ha a fintech rosszul kezeli a pénzeszközöket, ami kiemeli a pontos pénzügyi nyomon követés fontosságát. - A kettős könyvelés elengedhetetlen a pontosság érdekében, biztosítva, hogy minden tranzakció kiegyensúlyozott és nyomon követhető legyen, ami segít megelőzni a hibákat és a potenciális csalásokat a pénzügyi rendszerekben.”"
    ],
    "points": 373,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1732835027
  },
  {
    "id": 42273505,
    "title": "„Ne szórakozz a Scroll-lal”",
    "originLink": "https://dontfuckwithscroll.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42273505",
    "commentBody": "",
    "originSummary": [
      "„A momentum görgetési bővítményeket kritizálják, mert megzavarják a természetes webes böngészési élményt azáltal, hogy rontják a használhatóságot, az akadálymentességet és a teljesítményt. - A fő problémák közé tartozik a felhasználói elvárások megsértése, mozgásbetegség okozása, az akadálymentesség csökkentése és a teljesítmény következetlensége, különösen régebbi eszközökön. - Ezek a bővítmények növelik az oldal betöltési idejét, megszakítják a natív böngészőfunkciókat, és karbantartási terhet adnak hozzá, ami felhasználói frusztrációhoz és bonyolultsághoz vezet.”"
    ],
    "commentSummary": [
      "„A vita hangsúlyozza a frusztrációkat az egyoldalas alkalmazásokkal (SPA-k) kapcsolatban, amelyek befolyásolják a webes navigációt, különösen az URL-eket, a böngésző navigációját és a vissza gombot. A kritikusok azt állítják, hogy a nem megfelelően megvalósított SPA-k veszélyeztetik a web alapvető funkcióit, mint például a könyvjelzőkészítést és a navigációt, a teljesítményt a felhasználói élmény elé helyezve. A beszélgetés kitér olyan problémákra is, mint a szabványos böngészőfunkciók eltérítése és a felhasználói autonómia tiszteletben tartásának fontossága a webdizájnban, szorgalmazva a hagyományos webes funkciók megőrzését.”"
    ],
    "points": 306,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1732884771
  },
  {
    "id": 42268475,
    "title": "„A Hetzner árat emel, miközben jelentősen csökkenti a sávszélességet (USA)”",
    "originLink": "https://adriano.fyi/posts/hetzner-raises-prices-while-significantly-lowering-bandwidth-in-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268475",
    "commentBody": "",
    "originSummary": [
      "„A Hetzner akár 27,52%-kal emeli az árakat az Egyesült Államokban a CPX21 szerverek esetében, miközben az átlagos sávszélességet 88,19%-kal csökkenti. - A hálaadás napján bejelentett változtatások célja, hogy a költségeket összhangba hozzák az erőforrás-felhasználással, mivel a könnyebb felhasználók támogatták a nehezebb felhasználókat. - Az új árképzés és sávszélesség-korlátok 2024 decemberétől lépnek életbe az új szerverek esetében, és 2025 februárjától a meglévő szervereknél, miközben a Hetzner fenntartja, hogy a legjobb ár-érték arányt kínálja.”"
    ],
    "commentSummary": [
      "„A Hetzner, egy webtárhely-szolgáltató cég, megemelte árait és csökkentette a sávszélesség kínálatát az Egyesült Államokban.”",
      "„A téma jelentős vitát váltott ki, ami több ismétlődő bejegyzéshez vezetett a Hacker News-on, egy népszerű technológiai híroldalon.”"
    ],
    "points": 296,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1732827365
  },
  {
    "id": 42269925,
    "title": "„Az autógumik az összes környezeti mikroműanyag negyedét bocsátják ki.”",
    "originLink": "https://phys.org/news/2024-11-car-quarter-microplastics-environment-urgent.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269925",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Az autógumik jelentős forrásai a mikroműanyag-szennyezésnek, az összes mikroműanyag egynegyedét adják a környezetben. Vita folyik arról, hogy a gumik összetevői alapján adóztassák-e azokat a szennyezés kezelésére, szemben a járművek súly szerinti adóztatásával. A megbeszélés során felmerülnek a súly és a megtett távolság alapján történő adóztatás adatvédelmi és gyakorlati aggályai, példákkal az Egyesült Királyságból és Hollandiából, ahol különböző módszereket fontolgatnak a megvalósításra.”"
    ],
    "points": 266,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1732842573
  },
  {
    "id": 42268310,
    "title": "„A Ninja (2020) sikere és kudarca”",
    "originLink": "https://neugierig.org/software/blog/2020/05/ninja.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268310",
    "commentBody": "",
    "originSummary": [
      "„A Ninja, egy mellékprojektként létrehozott build rendszer, jelentős népszerűségre tett szert, és ma már olyan nagy projektek használják, mint a Chrome, az Android és a Meson.”",
      "„A rendszer sebességre és hatékonyságra lett tervezve, egy bipartit gráfot használva a jobb felépítési struktúra érdekében, és a gyors, inkrementális építésekre összpontosítva.”",
      "„A készítő elgondolkodik az open-source karbantartóként való létezés kihívásain, megjegyezve a magas elvárásokat és a korlátozott hálát, annak ellenére, hogy a Ninja sikeres.”"
    ],
    "commentSummary": [
      "„A vita a Ninja build rendszer szerepére összpontosít az Android AOSP (Android Open Source Project) keretében, valamint a makefile-okról Ninja-ra való átállás bonyolultságaira.”",
      "„A felhasználók vitatják a Ninja előnyeit a Makefile-okkal szemben, figyelembe véve az architektúrát, a társadalmi kérdéseket és az iterációs idő hatását a programozók elégedettségére.”",
      "„A beszélgetés említ más build rendszereket is, mint például a Samurai, valamint a kézzel készített build rendszerek fenntartásának kihívásait, kiemelve a társadalmi dinamikák szerepét a technológiai környezetekben.”"
    ],
    "points": 256,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1732825274
  },
  {
    "id": 42270378,
    "title": "„Mennyi memóriára van szüksége 2024-ben 1 millió egyidejű feladat futtatásához?”",
    "originLink": "https://hez2010.github.io/async-runtimes-benchmarks-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270378",
    "commentBody": "",
    "originSummary": [
      "„A 2024-es benchmark tesztelte az 1 millió egyidejű feladat futtatásához szükséges memóriafogyasztást korutinok használatával különböző programozási nyelveken, beleértve a Rustot, a C#-ot, a Go-t és a Java-t. A C# a NativeAOT-val mutatta a legjobb memóriahatékonyságot, felülmúlva a többi nyelvet, míg a Go a vártnál több memóriát fogyasztott, még a Java GraalVM-mel is. A tanulmány hangsúlyozza, hogy néhány nyelv, mint például a .NET a NativeAOT-val és a Java GraalVM-je, javított skálázhatósággal rendelkezik, míg a Go gorutinjai kevésbé voltak hatékonyak, és a Rust memóriahasználatát a feladatkezelés módosításával optimalizálták.”"
    ],
    "commentSummary": [
      "„2024-ben az 1 millió egyidejű feladat futtatásához szükséges memória a programozási nyelvtől és a párhuzamossági modelltől függően változik, a Rust és a C# körülbelül 0,12 KiB memóriát használ fel feladatonként, míg a Go körülbelül 2,64 KiB-ot.”",
      "„A Node.js, annak ellenére, hogy ígéretekkel hatékonynak tűnik, nem hajt végre feladatokat párhuzamosan, ami kiemeli a különbségeket a nyelvek közötti konkurencia kezelésében.”",
      "„A mérföldkő hangsúlyozza, hogy a valós alkalmazások összetettebb műveleteket foglalnak magukban, mint az egyszerű feladatok, ami hatással van a memóriahasználatra és a teljesítményre.”"
    ],
    "points": 245,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1732848659
  },
  {
    "id": 42268819,
    "title": "„Viszlát, Rust. Sok sikert kívánok, de visszatérek a C++-hoz (bocsánat, ez egy kifakadás).”",
    "originLink": "https://old.reddit.com/r/rust/comments/1h15md8/goodbye_rust_i_wish_you_success_but_im_back_to_c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268819",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Egy Reddit felhasználó kritizálta a Rustot annak összetettsége és korlátozott munkalehetőségei miatt, összehasonlítva azt a Betamaxszal és az Esperantóval, amelyek technikailag fejlettebbek, de nem széles körben elterjedtek.”",
      "„Míg egyes felhasználók értékelik a Rust szigorúságát és biztonsági funkcióit, mások megjegyzik, hogy lassabban terjed, mint például a Go nyelv.”",
      "„Ezek ellenére a Rust egyre nagyobb teret hódít olyan nagyvállalatoknál, mint az AWS és a Microsoft, és néhányan úgy tekintenek rá, mint a C++ lehetséges jövőbeli helyettesítőjére.”"
    ],
    "points": 242,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1732831332
  },
  {
    "id": 42272927,
    "title": "„A GIMP 3.0 úton van”",
    "originLink": "https://lwn.net/SubscriberLink/998793/6c8d00bd1b2a7948/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42272927",
    "commentBody": "",
    "originSummary": [
      "„A GIMP 3.0 várhatóan hamarosan megjelenik, ami az első jelentős frissítés lesz 2018 óta, modernizált GTK 3 felülettel és jobb teljesítménnyel. - A főbb frissítések közé tartozik a nem romboló szerkesztés, a továbbfejlesztett színkezelés, a javított rétegkezelési munkafolyamatok, valamint egy új kiterjesztési rendszer a könnyebb bővítménykezelés érdekében. - Bár a pontos megjelenési dátum ismeretlen, fejlesztési verziók már elérhetők, ami jelentős előrelépést jelez a nyílt forráskódú képszerkesztő számára, és a jövőben gyakoribb frissítések várhatók.”"
    ],
    "commentSummary": [
      "„A GIMP 3.0 fejlesztés alatt áll, és támogatást ad az sRGB-n túli színpalettákhoz, mint például a CMYK és a CIELAB, amelyek fontosak a nyomtatás és a kiadás szempontjából.”",
      "„A frissítés célja a színpontosság javítása azáltal, hogy csak szükség esetén konvertál más színtérbe, minimalizálva az adatvesztést.”",
      "„Annak ellenére, hogy vannak olyan fejlesztések, mint a nem romboló szerkesztés, néhány felhasználó aggódik a GIMP felhasználói felülete és funkcionalitása miatt a Photoshophoz képest, lassú fejlesztést említve a kis önkéntes csapat miatt.”"
    ],
    "points": 230,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732877433
  },
  {
    "id": 42270389,
    "title": "„Vince – Egy saját üzemeltetésű alternatíva a Google Analytics-hez”",
    "originLink": "https://github.com/vinceanalytics/vince",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270389",
    "commentBody": "",
    "originSummary": [
      "„A Vince egy Golang-alapú portja a Plausible Analytics irányítópultnak, amelyet egyetlen bináris, egyfelhasználós rendszerként terveztek több weboldal számára futásidejű függőségek nélkül. Olyan funkciókat tartalmaz, mint az automatikus TLS (Transport Layer Security), a kimenő linkek követése, a fájlletöltések követése, a 404-es oldalak követése és az egyedi események követése, így szinte egyenértékű a Plausible irányítópulttal. A Vince célja, hogy a Plausible irányítópultot elérhetővé tegye önálló hosztolásra, személyes weboldalak számára cserélhető megoldásként szolgálva, egy demó pedig elérhető egy 6 dolláros Vultr példányon.”"
    ],
    "commentSummary": [
      "„A Vince egy saját üzemeltetésű alternatíva a Google Analytics számára, amely a Plausible Analytics irányítópultjának Golang portjaként lett kifejlesztve, és az irányítópulttal kapcsolatos funkciókra összpontosít.”",
      "„Olyan funkciókat kínál, mint az automatikus TLS (Transport Layer Security), a kimenő linkek nyomon követése és az egyedi események követése, futásidejű függőségek nélkül, ami alkalmassá teszi személyes weboldalak számára.”",
      "„Vince megfelel a GDPR (Általános Adatvédelmi Rendelet) előírásainak, a Pebble-t használja adat tárolására, és elérhető nyílt forráskódú projektként a GitHubon, így egy könnyen hozzáférhető önálló hosztolási lehetőséget kínál Plausible bonyolult beállításai nélkül.”"
    ],
    "points": 188,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732848840
  },
  {
    "id": 42270966,
    "title": "„Az ausztrál parlament megtiltja a közösségi média használatát 16 éven aluliak számára”",
    "originLink": "https://apnews.com/article/australia-social-media-children-ban-safeguarding-harm-accounts-d0cde2603bdbc7167801da1d00ecd056",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270966",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Ausztrália betiltotta a közösségi média használatát 16 év alattiak számára, ami vitákat váltott ki a gyermekvédelem és a szülői jogok között. - A törvény életkor-ellenőrzést ír elő, ami adatvédelmi aggályokat és a fokozott megfigyelés miatti félelmeket vetett fel. - A jogszabályt minimális nyilvános hozzájárulással sietve fogadták el, ami kérdéseket vet fel annak hatékonyságával és végrehajthatóságával kapcsolatban.”"
    ],
    "points": 184,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1732856517
  },
  {
    "id": 42269897,
    "title": "„Képernyőmegosztás a böngészőben”",
    "originLink": "https://github.com/tonghohin/screen-sharing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269897",
    "commentBody": "",
    "originSummary": [
      "„A Bolt.new egy eszköz, amely lehetővé teszi a felhasználók számára, hogy gyorsan hozzanak létre webalkalmazásokat, amit egy képernyőmegosztó alkalmazás 30 perc alatti megépítésével demonstráltak. Az alkalmazás egyedi kódot generál egy szobához, amelyet mások használhatnak a csatlakozáshoz és a megosztott képernyő megtekintéséhez. A projektet továbbfejlesztették a Cursor segítségével, és megtekinthető a GitHubon, élő demója pedig a Vercel-en van elérhető.”"
    ],
    "commentSummary": [
      "„Egy böngészőalapú képernyőmegosztó alkalmazást fejlesztettek ki a Bolt.new segítségével mindössze 30 perc alatt, amely lehetővé teszi a felhasználók számára, hogy egyedi kódokkal rendelkező szobákat hozzanak létre és csatlakozzanak azokhoz a képernyőmegosztás érdekében. Az alkalmazás elérhető a GitHubon, demóval együtt, és visszajelzéseket kapott a képernyőmegosztás megszakadásával és a mobil kompatibilitással kapcsolatban. Az alkalmazás nem használ TURN szervert, amelyet általában a média továbbítására használnak WebRTC alkalmazásokban, amikor a közvetlen peer-to-peer kapcsolatok nem sikerülnek.”"
    ],
    "points": 168,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1732842261
  },
  {
    "id": 42274660,
    "title": "„Prometheus 3.0”",
    "originLink": "https://prometheus.io/blog/2024/11/14/prometheus-3-0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42274660",
    "commentBody": "",
    "originSummary": [
      "„A Prometheus 3.0, az első jelentős kiadás 7 év után, modernizált felhasználói felületet, Remote Write 2.0-t, UTF-8 támogatást, OTLP támogatást és natív hisztogramokat vezet be. - A főbb jellemzők közé tartozik a protokoll hatékonyságának javítása a Remote Write 2.0-val, a fokozott interoperabilitás az OpenTelemetry-vel az OTLP beolvasás révén, valamint a hatékonyabb metrikák a natív hisztogramokkal. - A felhasználóknak tisztában kell lenniük néhány jelentős változással, és konzultálniuk kell a migrációs útmutatóval, de a kiadás fenntartja a visszamenőleges kompatibilitást, és ösztönzi a felhasználói visszajelzéseket.”"
    ],
    "commentSummary": [
      "„A Prometheus 3.0 megjelent, és olyan funkciókat vezetett be, mint a csökkentett memóriahasználat és az OTLP (OpenTelemetry Protocol) bevitel támogatása. A kiadás vitákat váltott ki a skálázhatóságáról az olyan alternatívákhoz képest, mint a Mimir, Victoria és Cortex, mivel néhány felhasználó ezeket a megoldásokat választja a jobb teljesítmény érdekében. Aggodalmak merültek fel a kiadási jegyzetek egyértelműségével kapcsolatban, ami a fejlesztők részéről javított kommunikáció szükségességét jelzi.”"
    ],
    "points": 151,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1732895564
  }
]
