[
  {
    "id": 42268580,
    "title": "당신이 감사하는 사람에게 공식적인 '계속하고 지속하라' 편지를 보내세요.",
    "originLink": "https://ContinueAndPersist.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268580",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1219,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1732828615
  },
  {
    "id": 42269227,
    "title": "엔지니어들은 원장을 구축할 때 스타트업 실수를 할 수 없습니다.",
    "originLink": "https://news.alvaroduran.com/p/engineers-do-not-get-to-make-startup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269227",
    "commentBody": "",
    "originSummary": [
      "결제 엔지니어 플레이북은 핀테크 스타트업에서 정확한 원장의 중요한 역할을 강조하며, 복식부기 시스템을 소홀히 할 때의 함정을 부각시킵니다.",
      "알바로 두란은 자신의 스타트업 경험에서 이중 입력 시스템의 부재가 재정적 불일치와 고객 불만족으로 이어졌던 경고성 이야기를 공유합니다.",
      "Duran은 확장 가능하고 미래에 대비할 수 있는 원장을 만드는 것에 대한 책을 저술하는 것을 고려하고 있으며, 그 잠재적인 관심에 대한 피드백을 구하고 있습니다."
    ],
    "commentSummary": [
      "금융 시스템의 엔지니어들은 오류를 피해야 하며, 이는 Synapse의 사례에서 볼 수 있듯이 그들의 원장이 실제 자금보다 더 많은 고객 잔액을 부정확하게 보여주어 수백만 달러가 사라지는 결과를 초래했습니다. 핀테크 회사들은 종종 FDIC 보험을 약속하지만, 이는 은행이 파산할 경우에만 적용되며 핀테크가 자금을 잘못 관리할 경우에는 적용되지 않으므로 정확한 금융 추적의 중요성을 강조합니다. 복식부기는 정확성을 위해 필수적이며, 모든 거래가 균형을 이루고 추적 가능하도록 보장하여 금융 시스템에서 오류와 잠재적 사기를 방지하는 데 도움을 줍니다."
    ],
    "points": 373,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1732835027
  },
  {
    "id": 42273505,
    "title": "스크롤을 건드리지 마",
    "originLink": "https://dontfuckwithscroll.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42273505",
    "commentBody": "",
    "originSummary": [
      "모멘텀 스크롤링 플러그인은 사용성, 접근성 및 성능을 저하시켜 자연스러운 웹 브라우징 경험을 방해한다는 비판을 받고 있습니다. 주요 문제로는 사용자 기대를 저버리고, 멀미를 유발하며, 접근성을 감소시키고, 특히 오래된 기기에서 일관되지 않은 성능을 보이는 것이 포함됩니다. 이러한 플러그인은 또한 페이지 로드 시간을 증가시키고, 브라우저의 기본 기능을 손상시키며, 유지보수 부담을 추가하여 사용자 불만과 복잡성을 초래합니다."
    ],
    "commentSummary": [
      "이 논의는 웹 탐색에 영향을 미치는 단일 페이지 애플리케이션(SPA)에 대한 불만을 강조하며, 특히 URL, 브라우저 탐색 및 뒤로 가기 버튼과 관련이 있습니다. 비평가들은 잘못 구현된 SPA가 북마크 가능성과 탐색과 같은 웹의 기본 요소를 손상시키고 성능을 사용자 경험보다 우선시한다고 주장합니다. 대화는 또한 표준 브라우저 기능을 가로채는 문제와 웹 디자인에서 사용자 자율성을 존중하는 것의 중요성을 다루며, 전통적인 웹 기능을 유지할 것을 옹호합니다."
    ],
    "points": 306,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1732884771
  },
  {
    "id": 42268475,
    "title": "Hetzner는 대역폭을 크게 줄이면서 가격을 인상합니다 (미국)",
    "originLink": "https://adriano.fyi/posts/hetzner-raises-prices-while-significantly-lowering-bandwidth-in-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268475",
    "commentBody": "",
    "originSummary": [
      "Hetzner는 CPX21 서버에 대해 미국에서 최대 27.52% 가격 인상을 하면서 대역폭을 평균 88.19% 줄이고 있습니다. - 이러한 변경 사항은 추수감사절에 발표되었으며, 경량 사용자가 중량 사용자를 보조하는 상황을 해결하기 위해 비용을 자원 사용량에 맞추려는 의도입니다. - 새로운 가격 및 대역폭 제한은 2024년 12월부터 신규 서버에, 2025년 2월부터 기존 서버에 적용되며, Hetzner는 여전히 최고의 가격 대비 성능 비율을 제공한다고 주장하고 있습니다."
    ],
    "commentSummary": [
      "웹 호스팅 회사인 Hetzner는 미국에서 가격을 인상하고 대역폭 제공을 줄였습니다.",
      "이 주제는 상당한 논의를 불러일으켜 인기 있는 기술 뉴스 플랫폼인 해커 뉴스에 여러 중복 게시물이 올라오게 되었습니다."
    ],
    "points": 296,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1732827365
  },
  {
    "id": 42269925,
    "title": "자동차 타이어는 환경에 있는 모든 미세 플라스틱의 4분의 1을 배출합니다.",
    "originLink": "https://phys.org/news/2024-11-car-quarter-microplastics-environment-urgent.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269925",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "자동차 타이어는 미세 플라스틱 오염의 주요 원인으로, 환경 내 모든 미세 플라스틱의 4분의 1을 차지합니다. 오염 문제를 해결하기 위해 타이어의 화합물에 따라 세금을 부과할지, 차량의 무게에 따라 세금을 부과할지에 대한 논쟁이 있습니다. 이 논의에는 무게와 주행 거리에 따라 세금을 부과하는 것에 대한 사생활 및 실용성 문제도 포함되며, 영국과 네덜란드의 다양한 시행 방법에 대한 예시가 고려되고 있습니다."
    ],
    "points": 266,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1732842573
  },
  {
    "id": 42268310,
    "title": "닌자 (2020)의 성공과 실패",
    "originLink": "https://neugierig.org/software/blog/2020/05/ninja.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268310",
    "commentBody": "",
    "originSummary": [
      "사이드 프로젝트로 만들어진 빌드 시스템인 Ninja는 상당한 인기를 얻었으며 현재 Chrome, Android, Meson과 같은 주요 프로젝트에서 사용되고 있습니다.",
      "이 시스템은 속도와 효율성을 위해 설계되었으며, 더 나은 빌드 구조를 위해 이분 그래프를 활용하고 빠른 증분 빌드에 중점을 두고 있습니다.",
      "창작자는 Ninja의 성공에도 불구하고 높은 요구와 제한된 감사 속에서 오픈 소스 유지 관리자로서의 어려움을 되돌아봅니다."
    ],
    "commentSummary": [
      "논의는 안드로이드 AOSP(안드로이드 오픈 소스 프로젝트)에서 Ninja 빌드 시스템의 역할과 메이크파일에서 Ninja로의 전환 복잡성에 중점을 둡니다.",
      "사용자들은 아키텍처, 사회적 문제, 그리고 반복 시간의 프로그래머 만족도에 미치는 영향을 고려하여 Ninja의 Makefile에 대한 장점에 대해 토론합니다.",
      "대화에서는 또한 Samurai와 같은 다른 빌드 시스템과 수작업으로 제작된 빌드 시스템을 유지하는 데 따른 어려움을 언급하며, 기술 환경에서의 사회적 역학의 역할을 강조합니다."
    ],
    "points": 256,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1732825274
  },
  {
    "id": 42270378,
    "title": "2024년에 100만 개의 동시 작업을 실행하려면 얼마나 많은 메모리가 필요합니까?",
    "originLink": "https://hez2010.github.io/async-runtimes-benchmarks-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270378",
    "commentBody": "",
    "originSummary": [
      "2024년 벤치마크는 Rust, C#, Go, Java를 포함한 다양한 프로그래밍 언어에서 코루틴을 사용하여 100만 개의 동시 작업을 실행할 때의 메모리 소비를 테스트했습니다. C#의 NativeAOT는 다른 언어보다 뛰어난 메모리 효율성을 보여주었으며, Go는 예상보다 더 많은 메모리를 소비하여 GraalVM을 사용하는 Java보다도 더 많은 메모리를 사용했습니다. 이 연구는 .NET의 NativeAOT와 Java의 GraalVM과 같은 일부 언어가 확장성이 개선되었음을 강조하며, Go의 고루틴은 덜 효율적이었고, Rust는 작업 처리 조정을 통해 메모리 사용이 최적화되었음을 보여줍니다."
    ],
    "commentSummary": [
      "2024년에는 100만 개의 동시 작업을 실행하는 데 필요한 메모리가 프로그래밍 언어와 동시성 모델에 따라 다르며, Rust와 C#은 작업당 약 0.12 KiB를 사용하는 반면, Go는 작업당 약 2.64 KiB를 사용합니다.",
      "Node.js는 약속(promise)을 사용하여 효율적으로 보일지라도, 작업을 병렬로 실행하지 않으며, 이는 언어 간의 동시성 처리 차이를 강조합니다.",
      "이 벤치마크는 실제 응용 프로그램이 단순한 작업보다 더 복잡한 작업을 포함하며, 이는 메모리 사용량과 성능에 영향을 미친다는 점을 강조합니다."
    ],
    "points": 245,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1732848659
  },
  {
    "id": 42268819,
    "title": "안녕, Rust. 성공을 기원하지만 나는 다시 C++로 돌아갑니다 (미안, 이건 불평입니다)",
    "originLink": "https://old.reddit.com/r/rust/comments/1h15md8/goodbye_rust_i_wish_you_success_but_im_back_to_c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42268819",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "한 Reddit 사용자가 Rust의 복잡성과 제한된 취업 기회를 비판하며, 기술적으로 우수하지만 널리 채택되지 않은 Betamax와 에스페란토에 비유했다.",
      "일부 사용자는 Rust의 엄격함과 안전 기능을 높이 평가하는 반면, 다른 사람들은 Go와 같은 언어에 비해 채택 속도가 느리다는 점을 지적합니다.",
      "이러한 도전에도 불구하고, Rust는 AWS와 Microsoft와 같은 주요 기업에서 주목을 받고 있으며, 일부는 이를 C++의 잠재적인 미래 대체재로 보고 있습니다."
    ],
    "points": 242,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1732831332
  },
  {
    "id": 42272927,
    "title": "GIMP 3.0이 곧 출시됩니다",
    "originLink": "https://lwn.net/SubscriberLink/998793/6c8d00bd1b2a7948/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42272927",
    "commentBody": "",
    "originSummary": [
      "GIMP 3.0은 곧 출시될 것으로 예상되며, 2018년 이후 첫 번째 주요 업데이트로, 현대화된 GTK 3 인터페이스와 향상된 성능을 특징으로 합니다. 주요 업데이트에는 비파괴 편집, 향상된 색상 관리, 개선된 레이어 워크플로우, 그리고 플러그인 관리를 용이하게 하는 새로운 확장 시스템이 포함됩니다. 정확한 출시일은 알려지지 않았지만, 개발 빌드가 제공되고 있어 오픈 소스 이미지 편집기의 중요한 발전을 나타내며, 앞으로 더 빈번한 업데이트가 기대됩니다."
    ],
    "commentSummary": [
      "GIMP 3.0은 개발 중에 있으며, 인쇄 및 출판에 중요한 CMYK 및 CIELAB과 같은 sRGB를 넘어서는 색상 팔레트 지원을 추가하고 있습니다.",
      "업데이트는 데이터 손실을 최소화하면서 필요한 경우에만 다른 색상 공간으로 변환하여 색상 정확도를 향상시키고자 합니다.",
      "비파괴 편집과 같은 발전에도 불구하고, 일부 사용자는 GIMP의 사용자 인터페이스와 기능이 포토샵에 비해 뒤떨어진다고 우려하고 있으며, 이는 소규모 자원봉사 팀으로 인한 느린 개발 속도 때문이라고 지적하고 있습니다."
    ],
    "points": 230,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732877433
  },
  {
    "id": 42270389,
    "title": "Vince – Google Analytics의 자체 호스팅 대안",
    "originLink": "https://github.com/vinceanalytics/vince",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270389",
    "commentBody": "",
    "originSummary": [
      "Vince는 Golang 기반의 Plausible Analytics 대시보드 포트로, 런타임 종속성 없이 여러 웹사이트를 위한 단일 바이너리, 단일 사용자 시스템으로 설계되었습니다. 자동 TLS(전송 계층 보안), 아웃바운드 링크 추적, 파일 다운로드 추적, 404 페이지 추적, 사용자 정의 이벤트 추적과 같은 기능을 포함하여 Plausible 대시보드와 거의 동등한 기능을 제공합니다. Vince는 Plausible 대시보드를 셀프 호스팅할 수 있도록 하여 개인 웹사이트를 위한 대체품으로 사용될 수 있으며, $6의 Vultr 인스턴스에서 데모를 사용할 수 있습니다."
    ],
    "commentSummary": [
      "Vince는 Plausible Analytics 대시보드의 Golang 포트로 개발된 Google Analytics의 자체 호스팅 대안으로, 대시보드 관련 기능에 중점을 두고 있습니다.",
      "자동 TLS(전송 계층 보안), 아웃바운드 링크 추적 및 사용자 지정 이벤트 추적과 같은 기능을 제공하며, 런타임 종속성이 없어 개인 웹사이트에 적합합니다.",
      "Vince는 GDPR(일반 데이터 보호 규정)을 준수하며, 데이터 저장을 위해 Pebble을 사용하고, GitHub에서 오픈 소스 프로젝트로 제공되어 Plausible의 복잡한 설정 없이도 접근 가능한 셀프 호스팅 옵션을 제공합니다."
    ],
    "points": 188,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1732848840
  },
  {
    "id": 42270966,
    "title": "호주 의회, 16세 미만 소셜 미디어 금지",
    "originLink": "https://apnews.com/article/australia-social-media-children-ban-safeguarding-harm-accounts-d0cde2603bdbc7167801da1d00ecd056",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42270966",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "호주는 16세 미만 개인의 소셜 미디어 사용을 금지하는 법을 시행하여 아동 보호 대 부모의 권리에 대한 논의를 촉발했습니다. 이 법은 연령 확인을 의무화하고 있으며, 이는 사생활 침해 우려와 감시 증가에 대한 두려움을 불러일으켰습니다. 이 법안은 최소한의 공공 의견 수렴으로 신속히 처리되어 그 효과성과 집행 가능성에 의문이 제기되고 있습니다."
    ],
    "points": 184,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1732856517
  },
  {
    "id": 42269897,
    "title": "브라우저에서 화면 공유",
    "originLink": "https://github.com/tonghohin/screen-sharing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42269897",
    "commentBody": "",
    "originSummary": [
      "Bolt.new는 사용자가 웹 애플리케이션을 신속하게 생성할 수 있도록 하는 도구로, 단 30분 만에 화면 공유 앱을 구축하여 그 기능을 입증합니다. 이 앱은 방에 대한 고유 코드를 생성하여 다른 사람들이 이를 사용해 참여하고 공유되는 화면을 볼 수 있도록 작동합니다. 이 프로젝트는 Cursor를 사용하여 추가 개발되었으며, GitHub에서 확인할 수 있으며 Vercel에서 라이브 데모가 호스팅됩니다."
    ],
    "commentSummary": [
      "브라우저 기반 화면 공유 앱이 Bolt.new를 사용하여 단 30분 만에 개발되었으며, 사용자는 고유 코드를 통해 화면 공유를 위한 방을 생성하고 참여할 수 있습니다. 이 앱은 GitHub에서 제공되며, 데모도 제공됩니다. 화면 공유 중단 문제와 모바일 호환성에 대한 피드백을 받았습니다. 이 앱은 WebRTC 애플리케이션에서 직접적인 피어 투 피어 연결이 실패할 때 미디어를 중계하는 데 일반적으로 사용되는 TURN 서버를 사용하지 않습니다."
    ],
    "points": 168,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1732842261
  },
  {
    "id": 42274660,
    "title": "프로메테우스 3.0",
    "originLink": "https://prometheus.io/blog/2024/11/14/prometheus-3-0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42274660",
    "commentBody": "",
    "originSummary": [
      "Prometheus 3.0은 7년 만에 처음으로 주요 릴리스된 버전으로, 현대화된 UI, Remote Write 2.0, UTF-8 지원, OTLP 지원 및 네이티브 히스토그램을 도입합니다. 주요 기능으로는 Remote Write 2.0을 통한 프로토콜 효율성 향상, OTLP 수집을 통한 OpenTelemetry와의 상호 운용성 강화, 네이티브 히스토그램을 통한 더 효율적인 메트릭이 포함됩니다. 사용자는 몇 가지 호환성 깨짐 문제를 인지하고 마이그레이션 가이드를 참조해야 하지만, 이번 릴리스는 하위 호환성을 유지하며 사용자 피드백을 장려합니다."
    ],
    "commentSummary": [
      "Prometheus 3.0이 출시되어 메모리 사용량 감소 및 OTLP(OpenTelemetry Protocol) 수집 지원과 같은 기능이 도입되었습니다. 이번 출시로 인해 Mimir, Victoria, Cortex와 같은 대안과 비교하여 확장성에 대한 논의가 촉발되었으며, 일부 사용자는 성능 향상을 위해 이러한 솔루션을 선택하고 있습니다. 릴리스 노트의 명확성에 대한 우려가 있으며, 개발자들의 의사소통 개선이 필요하다는 지적이 있습니다."
    ],
    "points": 151,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1732895564
  }
]
