[
  {
    "id": 42763095,
    "title": "Bilgisayarı tekrar kişisel hale getirme zamanı geldi",
    "originLink": "https://www.vintagecomputing.com/index.php/archives/3292/the-pc-is-dead-its-time-to-make-computing-personal-again",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42763095",
    "commentBody": "",
    "originSummary": [
      "Makale, gözetim kapitalizmi ve Dijital Haklar Yönetimi (DRM) nedeniyle kişisel bilgisayar özgürlüğünün azalmasına dikkat çekiyor; bu durum, kontrolü kullanıcılardan şirketlere aktarmıştır.",
      "Geçmişte daha fazla kullanıcı özgürlüğü sunan kişisel bilgisayar çağını, gizliliği aşındıran iş modellerinin hakim olduğu günümüz teknoloji ortamıyla karşılaştırıyor.",
      "Yazar, kişisel bilişim değerlerini geri kazanmak için açık kaynak projelerini destekleyerek, gizlilik yasalarını zorlayarak ve DRM yasalarını reforme ederek dijital özerkliği geri kazanmayı savunuyor."
    ],
    "commentSummary": [
      "Makale, teknoloji endüstrisinde kurumsal etkinin yarattığı memnuniyetsizliği dile getirerek kişisel bilgisayarlara geri dönme gereğini vurguluyor. iOS ve Android gibi belirli yazılım ekosistemlerine kullanıcıları kilitleyen ağ etkilerinin olduğu topluluk bilişiminin zorluklarını öne çıkarıyor. Linux ve açık kaynaklı yazılımlar gibi alternatifler tartışılıyor, kullanıcı kontrolüne odaklanılıyor ve bunu kurumsal egemen bir ortamda başarmanın zorlukları ele alınıyor."
    ],
    "points": 661,
    "commentCount": 318,
    "retryCount": 0,
    "time": 1737328282
  },
  {
    "id": 42768072,
    "title": "DeepSeek-R1",
    "originLink": "https://github.com/deepseek-ai/DeepSeek-R1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42768072",
    "commentBody": "",
    "originSummary": [
      "DeepSeek-R1 ve DeepSeek-R1-Zero, birinci nesil akıl yürütme modelleridir. DeepSeek-R1, DeepSeek-R1-Zero'da görülen tekrar ve dil karışımı gibi sorunları ele almaktadır.",
      "Altı damıtılmış versiyon da dahil olmak üzere modeller açık kaynaklıdır ve DeepSeek-R1-Distill-Qwen-32B, akıl yürütme, kod ve matematik görevlerinde en son teknoloji sonuçlar elde etmektedir.",
      "Bu modeller HuggingFace üzerinden indirilebilir ve kullanıcılar, bir sohbet web sitesi veya OpenAI-Uyumlu bir API aracılığıyla onlarla etkileşimde bulunabilir, yerel dağıtım için talimatlar sağlanmıştır."
    ],
    "commentSummary": [
      "DeepSeek-R1, pekiştirmeli öğrenmeden önce soğuk başlangıç verilerini kullanarak tekrar ve dil karışımı gibi sorunları geliştiren gelişmiş bir akıl yürütme modelidir. Deneylerde QwQ modelinden daha iyi performans göstererek daha iyi bir kullanıcı deneyimi ve daha çeşitli cevap stratejileri sunar ve geniş değerlendirme için MIT lisansı altında açık kaynaklıdır. Model, mevcut modellere akıl yürütme ve insan tercihleriyle uyum öğretmek için bir süreç sunar ve ince ayar yapılmış Llama ve Qwen modelleri de açık kaynaklıdır, potansiyel olarak OpenAI'nin teklifleriyle rekabet edebilir, ancak veri kullanımı ve sansürle ilgili endişeler devam etmektedir."
    ],
    "points": 656,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1737376678
  },
  {
    "id": 42763386,
    "title": "Birleşik Krallık'ın donanım yeteneği boşa harcanıyor",
    "originLink": "https://josef.cn/blog/uk-talent",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42763386",
    "commentBody": "",
    "originSummary": [
      "Birleşik Krallık, prestijli üniversitelerden mezun olan üst düzey mühendislik mezunlarının, Silikon Vadisi'ne kıyasla daha düşük maaşlarla karşılaşması nedeniyle yetenek kaybı yaşıyor ve bu durum birçok mezunun danışmanlık veya finans gibi daha yüksek maaşlı alanlara geçmesine neden oluyor. Bu yetenek yanlış tahsisi, coğrafi kısıtlamalar, donanım için risk sermayesi eksikliği ve durağan geleneksel mühendislik firmaları gibi sorunlarla birlikte yenilikçiliği ve ekonomik büyümeyi engelliyor. Birleşik Krallık, en iyi yeteneklerini denizaşırı pazarlara kaptırma ve teknoloji devleri yaratma fırsatını kaçırma riskiyle karşı karşıya ve araştırma kurumlarını ve mühendislik yeteneklerini bir donanım devrimi için kullanmak üzere şimdi harekete geçmelidir."
    ],
    "commentSummary": [
      "Birçok mühendis, donanım girişimleriyle ilgili daha yüksek engeller ve maliyetler nedeniyle yazılım veya finans sektörüne geçtiği için Birleşik Krallık'taki donanım yeteneği yeterince kullanılmıyor. Bu zorluk sadece Birleşik Krallık'a özgü değil; dünya genelinde donanım girişimleri, yavaş iterasyon döngüleri ve yüksek maliyetlerle karşı karşıya kalarak, yazılıma kıyasla yatırımcılar için daha az çekici hale geliyor. Birleşik Krallık'taki planlama yasaları ve ekonomik politikalar, donanım büyümesini daha da engelleyerek yeteneğin diğer sektörlere veya ülkelere kaymasına neden oluyor ve teknoloji endüstrisi genellikle donanım yenilik potansiyelini göz ardı ediyor."
    ],
    "points": 507,
    "commentCount": 874,
    "retryCount": 0,
    "time": 1737330733
  },
  {
    "id": 42764602,
    "title": "Reverse Engineering Bambu Connect",
    "originLink": "https://wiki.rossmanngroup.com/wiki/Reverse_Engineering_Bambu_Connect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42764602",
    "commentBody": "",
    "originSummary": [
      "Kılavuz, bilinen güvenlik açıklarına sahip bir Electron uygulaması olan Bambu Connect uygulamasından özel bir anahtarın nasıl çıkarılacağını tartışıyor. Kullanıcılara, kılavuzun eksik veya güncel olmayabileceği ve kendi sorumlulukları altında takip edilmesi gerektiği konusunda uyarıda bulunuluyor. Süreç, gizlenmiş özel anahtar ve sertifikaları bulmak ve şifresini çözmek için Ghidra ve asarfix gibi araçların kullanılmasını içeriyor ve çıkarma işlemi için bir Python betiği sağlanıyor."
    ],
    "commentSummary": [
      "Bambu Lab, 3D yazıcılarında kendi yazılımlarını ve Dijital Haklar Yönetimi (DRM) sistemini kullanmayı zorunlu kılarak kısıtlamalar getirdiği için eleştiri altında.",
      "Kullanıcılar, Bambu tarafından güvenlik önlemleri olarak gerekçelendirilen bu değişikliklerin, yazıcıların açıklığını ve hacklenebilirliğini azaltarak abonelik modellerine veya ek sınırlamalara yol açabileceğinden endişe duyuyor.",
      "Buna karşılık, Bambu Lab, gelişmiş kullanıcılar için ağ güvenliği üzerinde daha fazla kontrol sağlayan bir \"Geliştirici Modu\" tanıttı, ancak satıcıya bağımlılık ve üçüncü taraf entegrasyonlar üzerindeki etkilerle ilgili endişeler devam ediyor."
    ],
    "points": 453,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1737342529
  },
  {
    "id": 42763231,
    "title": "FrontierMath, OpenAI tarafından finanse edildi.",
    "originLink": "https://www.lesswrong.com/posts/cu2E8wgmbdZbqeWqb/meemi-s-shortform",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42763231",
    "commentBody": "",
    "originSummary": [
      "Yazı, OpenAI ve FrontierMath arasındaki iş birliğinde şeffaflık eksikliğine dikkat çekiyor, finansman detaylarının ancak bir gecikmeden sonra açıklanması, katkıda bulunanlar arasında kafa karışıklığına neden oluyor.",
      "OpenAI'nin veri kümesine erişimi ve bu veriyi eğitim için kullanma potansiyeli hakkında, sözlü anlaşmalar aksini öne sürse de, yazılı anlaşmaların gerekliliğini vurgulayan endişeler dile getirilmektedir.",
      "Bu tartışma, özellikle yapay zeka yeteneklerini içeren iş birliklerinde, şeffaflık ve güvenin önemini vurgulamakta ve gelecekteki projelerde şeffaflığı artırma taahhütlerini içermektedir."
    ],
    "commentSummary": [
      "OpenAI tarafından finanse edilen FrontierMath, ölçütlerindeki potansiyel veri kontaminasyonu nedeniyle inceleme altına alındı ve bu durum, sonuçlarının bütünlüğü hakkında endişelere yol açtı. Eleştirmenler, ölçütlerin manipüle edilmesini önlemek için eğitim ve test verilerinin şeffaflığı ve uygun şekilde ayrılmasının önemini vurguluyor. Bu durum, yapay zekada güvenilirliği korumak için bağımsız ve şeffaf değerlendirmelerin gerekliliğini ortaya koyuyor."
    ],
    "points": 444,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1737329279
  },
  {
    "id": 42760620,
    "title": "Git Otomatik Düzeltme neden Formula 1 sürücüleri için çok hızlı?",
    "originLink": "https://blog.gitbutler.com/why-is-git-autocorrect-too-fast-for-formula-one-drivers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42760620",
    "commentBody": "",
    "originSummary": [
      "Git'in otomatik düzeltme özelliği, yanlış yazılmış bir komutu varsayılan olarak 0.1 saniyelik bir gecikmeden sonra çalıştırır, bu da kullanıcıların iptal etmesi için genellikle çok hızlıdır. 2008 yılında tanıtılan bu özellik, amaçlanan komutu tahmin etmek için değiştirilmiş bir Levenshtein mesafesi algoritması kullanır, ancak yanlış yazıldığında varsayılan olarak hiçbir komut çalıştırmaz. Önerilen bir yama, kullanılabilirliği artırmak için \"1\" ayarını \"hemen\" olarak yorumlamayı önerir, böylece kullanıcıların gecikmeyi yapılandırmasına veya onay istemesine olanak tanır."
    ],
    "commentSummary": [
      "Git'in otomatik düzeltme özelliği, varsayılan olarak 100 milisaniyelik bir gecikmeye sahiptir, bu da kullanıcıların yanlış yazılmış bir komutu iptal etmeleri için genellikle çok hızlıdır. Başlangıçta bir boolean değeri yorumlamak için tasarlanan bu özellik, şimdi kullanıcılar arasında bazı karışıklıklara neden olan bir zaman gecikmesini desisaniye cinsinden kabul etmektedir. Bu durum, net yapılandırma ayarlarına duyulan ihtiyacı ve mevcut işlevselliği bozmadan yazılım özelliklerini güncellemenin zorluklarını vurgulamaktadır."
    ],
    "points": 391,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1737314423
  },
  {
    "id": 42767507,
    "title": "Bir Kere Paul Graham ile Tanıştım",
    "originLink": "http://okayfail.com/2025/i-met-pg-once.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42767507",
    "commentBody": "",
    "originSummary": [
      "Yazar, 2015 yılında Y Combinator'a katıldı ve burada Paul Graham ile tanışarak daha sonra GitHub tarafından satın alınan girişimleri Appcanary hakkında tavsiyeler aldı.",
      "Yazar, şu anda bir trans kadın olarak, Paul Graham'ın \"Wokeness\" üzerine yazdığı son makalesi hakkında endişelerini dile getiriyor ve bunun teknoloji endüstrisinde kapsayıcılığın reddedilmesini yansıttığını düşünüyor.",
      "Yazar, teknoloji endüstrisinde artan hoşgörüsüzlük ve potansiyel ayrımcılıktan endişe duyuyor ancak saygı ve nezaketle yaşamaya bağlı kalıyor."
    ],
    "commentSummary": [
      "Metin, Paul Graham'ın etkisi ve teknoloji endüstrisindeki değerlerde algılanan değişim üzerine odaklanıyor, bir zamanlar vizyoner olarak görülen teknoloji liderlerine karşı hayal kırıklığını vurguluyor.",
      "Kimlik politikalarının karmaşıklıklarını, \"uyanıklık\" kavramının etkisini ve teknoloji sektöründe marjinalleşmiş grupların karşılaştığı zorlukları ele alıyor.",
      "Metin, sosyal adalet çabalarının performatif yönlerini ve kişisel kimliği profesyonel rollerle dengelemenin zorluğunu eleştiriyor, ilerleme ve ayrıcalık üzerine daha geniş bir kültürel tartışmayı yansıtıyor."
    ],
    "points": 336,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1737372002
  },
  {
    "id": 42761219,
    "title": "RSS beslemeleri ile duvarlı bahçeden ve algoritma kara kutularından kaçın",
    "originLink": "https://www.johnwalker.nl/posts/escape-the-walled-garden-with-rss",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42761219",
    "commentBody": "",
    "originSummary": [
      "RSS (Gerçekten Basit Dağıtım) ve Atom, kullanıcıların içerik tüketimlerini kontrol etmelerine olanak tanıyarak merkezi sosyal medyaya merkezi olmayan alternatifler sunar. Miniflux, NetNewsWire ve Newsboat gibi besleme okuyucuları, YouTube kanalları, podcast'ler ve bloglar dahil olmak üzere çeşitli içerik kaynaklarına abonelikleri mümkün kılar. PolitePol gibi araçlar, beslemesi olmayan web siteleri için beslemeler oluşturabilir, medya tüketiminde kullanıcı özerkliğini teşvik eder."
    ],
    "commentSummary": [
      "RSS beslemeleri, kullanıcıların ilgili blogları bir araya getiren \"gezegenler\" aracılığıyla belirli konulara abone olmalarına olanak tanıyarak algoritma odaklı içerikten kaçmanın bir yolunu sunar.",
      "Feedly ve Feedbin gibi RSS okuyucuları bu beslemeleri yönetmeye yardımcı olurken, bazı kullanıcılar bunları karmaşık buluyor ve bu da içeriği doğrudan gelen kutularına teslim eden Feedmail gibi alternatiflere yönelmelerine neden oluyor.",
      "RSS, niş bir çekiciliğe sahip olmasına rağmen, özelleştirilebilir ve kullanıcı kontrollü içerik deneyimi sunması nedeniyle teknoloji meraklıları arasında popülerliğini koruyor. Mastodon ve Bluesky gibi platformlar RSS beslemelerini desteklemektedir."
    ],
    "points": 283,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1737317243
  },
  {
    "id": 42762054,
    "title": "Lütfen karanlık modu zorlamayın",
    "originLink": "https://iamvishnu.com/posts/please-dont-force-dark-mode",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42762054",
    "commentBody": "",
    "originSummary": [
      "Web sitesi tasarımcılarına, kullanıcılar üzerinde karanlık modu zorlamamaları tavsiye edilir, çünkü bu, özellikle siyah arka plan üzerinde beyaz metin gibi yüksek kontrast ayarlarında göz yorgunluğuna neden olabilir. Web İçeriği Erişilebilirlik Yönergeleri (WCAG) şu anda minimum kontrast oranı önermekte, ancak maksimum kontrastı ele almamaktadır, bu da rahatsızlığa yol açabilir; bu durum, yaklaşan WCAG 3.0'da ele alınabilir. Karanlık mod, OLED ekranlarda karanlık ortamlarda okuma veya rahat kontrast ayarları sunan Entegre Geliştirme Ortamları (IDE'ler) ile kodlama gibi belirli senaryolarda faydalıdır."
    ],
    "commentSummary": [
      "Devam eden karanlık mod ve aydınlık mod tartışması, kullanıcı konforu etrafında dönüyor; bazıları karanlık modu yorucu bulurken, diğerleri aydınlık modu çok sert buluyor.",
      "Web sitelerinin, bireysel kullanıcı tercihlerini dikkate alarak hem karanlık hem de aydınlık mod seçenekleri sunması gerektiği konusunda genel bir anlaşma vardır.",
      "Bu tartışma, çeşitli kullanıcı ihtiyaçlarına ve ortamlarına hitap etmek için özelleştirilebilir ayarların önemini vurgulamaktadır."
    ],
    "points": 262,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1737322073
  }
]
