[
  {
    "id": 42763095,
    "title": "حان الوقت لجعل الحوسبة شخصية مرة أخرى",
    "originLink": "https://www.vintagecomputing.com/index.php/archives/3292/the-pc-is-dead-its-time-to-make-computing-personal-again",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42763095",
    "commentBody": "",
    "originSummary": [
      "تسلط المقالة الضوء على تراجع حرية الحوسبة الشخصية بسبب رأسمالية المراقبة وإدارة الحقوق الرقمية (DRM)، التي نقلت السيطرة من المستخدمين إلى الشركات.",
      "إنه يقارن بين عصر الحوسبة الشخصية في الماضي، الذي كان يوفر حرية أكبر للمستخدم، وبين بيئة التكنولوجيا اليوم التي تهيمن عليها نماذج الأعمال التي تقوض الخصوصية.",
      "يدعو المؤلف إلى استعادة الاستقلالية الرقمية من خلال دعم المشاريع مفتوحة المصدر، والدفع نحو تشريعات لحماية الخصوصية، وإصلاح قوانين إدارة الحقوق الرقمية لاستعادة قيم الحوسبة الشخصية."
    ],
    "commentSummary": [
      "تؤكد المقالة على الحاجة إلى العودة إلى الحوسبة الشخصية، معبرة عن عدم الرضا عن التأثيرات الشركاتية في صناعة التكنولوجيا. تسلط الضوء على تحدي الحوسبة المجتمعية، حيث تؤدي تأثيرات الشبكة إلى حصر المستخدمين في نظم برمجيات محددة، مثل iOS وAndroid. يتم مناقشة بدائل مثل لينكس والبرمجيات مفتوحة المصدر، مع التركيز على سيطرة المستخدم والصعوبات في تحقيق ذلك في بيئة تهيمن عليها الشركات."
    ],
    "points": 661,
    "commentCount": 318,
    "retryCount": 0,
    "time": 1737328282
  },
  {
    "id": 42768072,
    "title": "ديب سيك-R1",
    "originLink": "https://github.com/deepseek-ai/DeepSeek-R1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42768072",
    "commentBody": "",
    "originSummary": [
      "DeepSeek-R1 و DeepSeek-R1-Zero هما نماذج استدلال من الجيل الأول، حيث يعالج DeepSeek-R1 مشكلات مثل التكرار وخلط اللغات التي شوهدت في DeepSeek-R1-Zero.",
      "النماذج، بما في ذلك ستة إصدارات مكررة، مفتوحة المصدر، حيث حقق DeepSeek-R1-Distill-Qwen-32B نتائج متقدمة في مهام التفكير، والبرمجة، والرياضيات.",
      "هذه النماذج متاحة للتنزيل على HuggingFace، ويمكن للمستخدمين التفاعل معها عبر موقع دردشة أو واجهة برمجة تطبيقات متوافقة مع OpenAI، مع توفير تعليمات للنشر المحلي."
    ],
    "commentSummary": [
      "DeepSeek-R1 هو نموذج استدلال متقدم يحسن من مشكلات مثل التكرار وخلط اللغات باستخدام بيانات البداية الباردة قبل التعلم المعزز. يتفوق على نموذج QwQ في التجارب، مما يوفر تجربة مستخدم أفضل واستراتيجيات إجابة أكثر تنوعًا، وهو مفتوح المصدر بموجب ترخيص MIT للتقييم الواسع. يقدم النموذج خط أنابيب لتعليم النماذج الحالية الاستدلال والتوافق مع تفضيلات البشر، مع نماذج Llama وQwen المحسنة أيضًا مفتوحة المصدر، مما قد ينافس عروض OpenAI، رغم استمرار المخاوف بشأن استخدام البيانات والرقابة."
    ],
    "points": 656,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1737376678
  },
  {
    "id": 42763386,
    "title": "يتم إهدار المواهب في مجال الأجهزة في المملكة المتحدة",
    "originLink": "https://josef.cn/blog/uk-talent",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42763386",
    "commentBody": "",
    "originSummary": [
      "المملكة المتحدة تشهد نزيفًا في المواهب حيث يواجه خريجو الهندسة المتميزون من الجامعات المرموقة رواتب أقل مقارنة بوادي السيليكون، مما يدفع الكثيرين للتحول إلى مجالات ذات رواتب أعلى مثل الاستشارات أو التمويل. هذا التوزيع الخاطئ للمواهب يعيق الابتكار والنمو الاقتصادي، مع وجود مشكلات مثل القيود الجغرافية، ونقص رأس المال الاستثماري للأجهزة، وجمود الشركات الهندسية التقليدية التي تسهم في المشكلة. المملكة المتحدة تخاطر بفقدان أفضل مواهبها للأسواق الخارجية، مما يفوت عليها فرصة إنشاء عمالقة تكنولوجية، ويجب أن تتحرك الآن للاستفادة من مؤسساتها البحثية ومواهبها الهندسية لثورة في مجال الأجهزة."
    ],
    "commentSummary": [
      "يتم استغلال المواهب في مجال الأجهزة في المملكة المتحدة بشكل غير كافٍ حيث ينتقل العديد من المهندسين إلى البرمجيات أو التمويل بسبب الحواجز والتكاليف العالية المرتبطة بالشركات الناشئة في مجال الأجهزة. هذه التحديات ليست حصرية للمملكة المتحدة؛ على الصعيد العالمي، تواجه الشركات الناشئة في مجال الأجهزة دورات تكرار بطيئة وتكاليف عالية، مما يجعلها أقل جاذبية للمستثمرين مقارنة بالبرمجيات. تعيق قوانين التخطيط والسياسات الاقتصادية في المملكة المتحدة نمو الأجهزة، مما يتسبب في انتقال المواهب إلى قطاعات أو دول أخرى، بينما غالبًا ما يتغاضى قطاع التكنولوجيا عن إمكانات الابتكار في مجال الأجهزة."
    ],
    "points": 507,
    "commentCount": 874,
    "retryCount": 0,
    "time": 1737330733
  },
  {
    "id": 42764602,
    "title": "الهندسة العكسية لـ Bambu Connect",
    "originLink": "https://wiki.rossmanngroup.com/wiki/Reverse_Engineering_Bambu_Connect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42764602",
    "commentBody": "",
    "originSummary": [
      "يناقش الدليل استخراج مفتاح خاص من تطبيق Bambu Connect، وهو تطبيق Electron معروف بوجود ثغرات أمنية. يتم تحذير المستخدمين من أن الدليل قد يكون غير مكتمل أو قديم ويجب اتباعه على مسؤوليتهم الخاصة. تتضمن العملية استخدام أدوات مثل Ghidra و asarfix لتحديد وفك تشفير المفتاح الخاص والشهادات المشفرة، مع توفير سكريبت بايثون للاستخراج."
    ],
    "commentSummary": [
      "تتعرض شركة بامبو لاب لانتقادات بسبب فرضها قيودًا على طابعاتها ثلاثية الأبعاد، مما يلزم المستخدمين باستخدام برنامجها ونظام إدارة الحقوق الرقمية (DRM) الخاص بها.",
      "يشعر المستخدمون بالقلق من أن هذه التغييرات، التي تبررها شركة بامبو كإجراءات أمنية، قد تؤدي إلى نماذج اشتراك أو قيود إضافية، مما يقلل من انفتاح الطابعات وقابليتها للاختراق.",
      "رداً على ذلك، قدمت شركة بامبو لاب وضع \"المطور\" للمستخدمين المتقدمين، مما يوفر مزيدًا من التحكم في أمان الشبكة، لكن المخاوف بشأن الاحتكار من قبل البائع وتأثيرات ذلك على تكامل الأطراف الثالثة لا تزال قائمة."
    ],
    "points": 453,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1737342529
  },
  {
    "id": 42763231,
    "title": "تم تمويل FrontierMath من قبل OpenAI",
    "originLink": "https://www.lesswrong.com/posts/cu2E8wgmbdZbqeWqb/meemi-s-shortform",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42763231",
    "commentBody": "",
    "originSummary": [
      "تسلط المشاركة الضوء على نقص الشفافية في التعاون بين OpenAI وFrontierMath، حيث تم الكشف عن تفاصيل التمويل فقط بعد تأخير، مما تسبب في ارتباك بين المساهمين.",
      "تُثار مخاوف بشأن إمكانية وصول OpenAI إلى مجموعة البيانات واستخدامها للتدريب، على الرغم من الاتفاقات الشفهية التي تشير إلى عكس ذلك، مما يؤكد الحاجة إلى اتفاقيات مكتوبة.",
      "تؤكد المناقشة على أهمية الشفافية والثقة في التعاونات، خاصة تلك التي تتضمن قدرات الذكاء الاصطناعي، مع التزامات بتحسين الشفافية في المشاريع المستقبلية."
    ],
    "commentSummary": [
      "تواجه FrontierMath، الممولة من OpenAI، تدقيقًا بسبب احتمال تلوث البيانات في معاييرها، مما يثير القلق بشأن نزاهة نتائجها. يشدد النقاد على أهمية الشفافية والفصل الصحيح بين بيانات التدريب والاختبار لمنع التلاعب بالمعايير. تؤكد هذه الحالة على ضرورة إجراء تقييمات مستقلة وشفافة في مجال الذكاء الاصطناعي للحفاظ على المصداقية."
    ],
    "points": 444,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1737329279
  },
  {
    "id": 42760620,
    "title": "لماذا يعتبر التصحيح التلقائي في Git سريعًا جدًا بالنسبة لسائقي الفورمولا واحد؟",
    "originLink": "https://blog.gitbutler.com/why-is-git-autocorrect-too-fast-for-formula-one-drivers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42760620",
    "commentBody": "",
    "originSummary": [
      "تقوم ميزة التصحيح التلقائي في Git بتنفيذ الأوامر التي تم كتابتها بشكل خاطئ بعد تأخير افتراضي قدره 0.1 ثانية، وهو ما يكون غالبًا سريعًا جدًا بحيث لا يمكن للمستخدمين إلغاؤه. تم تقديم هذه الميزة في عام 2008، وتستخدم خوارزمية معدلة لمسافة Levenshtein لتخمين الأمر المقصود، ولكنها تفترض عدم تشغيل أي أمر إذا كان مكتوبًا بشكل خاطئ. يقترح تصحيح مقترح تفسير إعداد \"1\" على أنه \"فورًا\" لتحسين سهولة الاستخدام، مما يسمح للمستخدمين بتكوين التأخير أو طلب التأكيد."
    ],
    "commentSummary": [
      "تحتوي ميزة التصحيح التلقائي في Git على تأخير افتراضي قدره 100 مللي ثانية، وهو غالبًا ما يكون سريعًا جدًا بالنسبة للمستخدمين لإلغاء أمر مكتوب بشكل خاطئ. كانت الميزة في الأصل مصممة لتفسير قيمة منطقية، لكنها الآن تقبل تأخيرًا زمنيًا بوحدة الديسي ثانية، مما يسبب بعض الارتباك بين المستخدمين. يبرز هذا الوضع الحاجة إلى إعدادات تكوين واضحة والصعوبات في تحديث ميزات البرامج دون تعطيل الوظائف الحالية."
    ],
    "points": 391,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1737314423
  },
  {
    "id": 42767507,
    "title": "قابلت بول غراهام مرة واحدة",
    "originLink": "http://okayfail.com/2025/i-met-pg-once.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42767507",
    "commentBody": "",
    "originSummary": [
      "حضر المؤلف برنامج Y Combinator في عام 2015، حيث التقى بول غراهام وتلقى نصائح حول شركته الناشئة، Appcanary، التي تم الاستحواذ عليها لاحقًا من قبل GitHub.",
      "تشعر الكاتبة، التي أصبحت الآن امرأة متحولة جنسياً، بالقلق إزاء المقالة الأخيرة لبول غراهام حول \"اليقظة\"، حيث ترى أنها تعكس رفضاً للشمولية في صناعة التكنولوجيا.",
      "يشعر المؤلف بالقلق إزاء تزايد عدم التسامح والتمييز المحتمل في صناعة التكنولوجيا، لكنه يظل ملتزمًا بالعيش باحترام ولطف."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول تأثير بول غراهام والتحول الملحوظ في القيم داخل صناعة التكنولوجيا، مما يبرز خيبة الأمل من قادة التكنولوجيا الذين كانوا يُنظر إليهم سابقًا كرواد رؤى.",
      "يتناول تعقيدات سياسات الهوية، وتأثير \"اليقظة\"، والتحديات التي تواجهها الفئات المهمشة في قطاع التكنولوجيا.",
      "ينتقد النص الجوانب الاستعراضية لجهود العدالة الاجتماعية وصعوبة التوازن بين الهوية الشخصية والأدوار المهنية، مما يعكس نقاشًا ثقافيًا أوسع حول التقدم والامتياز."
    ],
    "points": 336,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1737372002
  },
  {
    "id": 42761219,
    "title": "اهرب من الحديقة المسورة وصناديق الخوارزميات السوداء باستخدام خلاصات RSS",
    "originLink": "https://www.johnwalker.nl/posts/escape-the-walled-garden-with-rss",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42761219",
    "commentBody": "",
    "originSummary": [
      "توفر RSS (التغذية البسيطة حقًا) وAtom بدائل لامركزية لوسائل التواصل الاجتماعي المركزية، مما يسمح للمستخدمين بالتحكم في استهلاكهم للمحتوى. تُمكّن قارئات الخلاصات مثل Miniflux وNetNewsWire وNewsboat من الاشتراك في مصادر محتوى متنوعة، بما في ذلك قنوات يوتيوب والبودكاست والمدونات. تتيح أدوات مثل PolitePol إنشاء خلاصات للمواقع التي تفتقر إليها، مما يعزز استقلالية المستخدم في استهلاك الوسائط."
    ],
    "commentSummary": [
      "توفر خلاصات RSS وسيلة للهروب من المحتوى الذي تقوده الخوارزميات من خلال السماح للمستخدمين بالاشتراك في مواضيع محددة عبر \"الكواكب\"، التي تجمع المدونات ذات الصلة.",
      "بينما تساعد قارئات RSS مثل Feedly وFeedbin في إدارة هذه الخلاصات، يجد بعض المستخدمين أنها معقدة، مما يؤدي إلى بدائل مثل Feedmail التي توصل المحتوى مباشرة إلى صناديق البريد الوارد.",
      "على الرغم من جاذبيته المحدودة، يظل RSS شائعًا بين عشاق التكنولوجيا لتجربته القابلة للتخصيص والتحكم من قبل المستخدم، مع دعم منصات مثل Mastodon وBluesky لخلاصات RSS."
    ],
    "points": 283,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1737317243
  },
  {
    "id": 42762054,
    "title": "من فضلك لا تفرض الوضع الداكن",
    "originLink": "https://iamvishnu.com/posts/please-dont-force-dark-mode",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42762054",
    "commentBody": "",
    "originSummary": [
      "يُنصح مصممو المواقع بعدم فرض الوضع الداكن على المستخدمين، حيث يمكن أن يسبب إجهادًا للعين، خاصة مع إعدادات التباين العالي مثل النص الأبيض على خلفية سوداء. توصي إرشادات إمكانية الوصول لمحتوى الويب (WCAG) حاليًا بنسبة تباين دنيا ولكنها لا تتناول التباين الأقصى، مما قد يؤدي إلى عدم الراحة؛ قد يتم معالجة هذا في WCAG 3.0 القادمة. الوضع الداكن مفيد في سيناريوهات محددة، مثل القراءة على شاشات OLED في البيئات المظلمة أو البرمجة باستخدام بيئات التطوير المتكاملة (IDEs) التي تقدم إعدادات تباين مريحة."
    ],
    "commentSummary": [
      "يدور النقاش المستمر بين الوضع الداكن والوضع الفاتح حول راحة المستخدم، حيث يجد البعض أن الوضع الداكن مرهق بينما يعتبر آخرون أن الوضع الفاتح قاسٍ للغاية.",
      "هناك اتفاق عام على أن المواقع الإلكترونية يجب أن توفر خيارات الوضع الداكن والفاتح، احترامًا لتفضيلات المستخدم الفردية.",
      "تؤكد هذه المناقشة على أهمية الإعدادات القابلة للتخصيص لتلبية احتياجات المستخدمين المتنوعة والبيئات المختلفة."
    ],
    "points": 262,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1737322073
  }
]
