[
  {
    "id": 42627227,
    "title": "الأخطاء التي يرتكبها المهندسون في قواعد الشيفرة الكبيرة والمستقرة",
    "originLink": "https://www.seangoedecke.com/large-established-codebases/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42627227",
    "commentBody": "",
    "originSummary": [
      "العمل في قواعد الشيفرة الكبيرة والمستقرة، التي غالبًا ما تحتوي على ملايين الأسطر من الشيفرة وتشارك فيها مئات المهندسين، يمثل تحديات كبيرة لمهندسي البرمجيات. - خطأ شائع هو عدم الاتساق، حيث يتجاهل المهندسون الأنماط الموجودة في الشيفرة ويقومون بتنفيذ الميزات بشكل منفصل، مما يمكن أن يؤدي إلى مشاكل في الصيانة ويعيق التحسينات المستقبلية. - للعمل بفعالية داخل قواعد الشيفرة الكبيرة، يجب على المهندسين البحث عن الأنماط الموجودة، وفهم تأثير القاعدة الشيفرية على الإنتاج، وتوخي الحذر مع التبعيات، وإزالة الشيفرة غير الضرورية بعناية للحفاظ على الجودة والقيمة."
    ],
    "commentSummary": [
      "غالبًا ما يواجه المهندسون في قواعد الشيفرة الكبيرة والمستقرة تحديات تتعلق بعدم الاتساق والممارسات غير الموثقة، مما يستلزم التركيز على جودة الشيفرة الشخصية والتوثيق. - يعد تحقيق التوازن بين التحسينات والحفاظ على الاتساق المحلي أمرًا أساسيًا، خاصة عندما تكون قاعدة الشيفرة الحالية غير متسقة، بينما يمكن أن يساعد التفاعل مع الفريق الأوسع في توحيد الممارسات. - الهدف النهائي هو تعزيز وظائف قاعدة الشيفرة وقابليتها للصيانة، مما يتطلب الواقعية والتكيف مع الأنماط الحالية."
    ],
    "points": 683,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1736282675
  },
  {
    "id": 42627453,
    "title": "روابط البريد الإلكتروني السحرية/المأساوية: لا تجعلها الخيار الوحيد",
    "originLink": "https://recyclebin.zip/posts/annoyinglinks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42627453",
    "commentBody": "",
    "originSummary": [
      "توفر الروابط السحرية طريقة تسجيل دخول بدون كلمة مرور عبر روابط البريد الإلكتروني، مما يوفر أمانًا معززًا ولكنه قد يكون غير مريح بسبب تأخيرات البريد الإلكتروني واستخدام الأجهزة المتعددة.",
      "قد تشكل مخاطر أمنية من خلال تشجيع المستخدمين على الوصول إلى البريد الإلكتروني الشخصي على أجهزة العمل، مما يبرز الحاجة إلى بدائل مثل كلمات المرور المؤقتة (OTPs).",
      "لتحسين تجربة المستخدم، خاصة للمستخدمين المتمرسين في التكنولوجيا، يُوصى باستخدام مفاتيح المرور كخيار أكثر مرونة وأمانًا."
    ],
    "commentSummary": [
      "الروابط السحرية، المستخدمة في المصادقة، تواجه مشاكل في الموثوقية بسبب مشاكل البريد الإلكتروني ويمكن أن تدفع المستخدمين نحو القياسات الحيوية، التي قد يتم إجبارها قانونيًا على عكس كلمات المرور. - يتم اقتراح مفاتيح المرور كبديل أكثر أمانًا وسهولة في الاستخدام للروابط السحرية، لكن اعتمادها لا يزال جاريًا، حيث لم تقم العديد من الخدمات بتنفيذها بعد. - لا تزال المناقشة حول تحقيق التوازن بين الأمان وسهولة الاستخدام في طرق المصادقة نشطة، مما يبرز التحديات في العثور على حل مثالي."
    ],
    "points": 653,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1736283984
  },
  {
    "id": 42631873,
    "title": "نظام التشغيل في 1,000 سطر – مقدمة",
    "originLink": "https://operating-system-in-1000-lines.vercel.app/en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42631873",
    "commentBody": "",
    "originSummary": [
      "يرشد الكتاب القراء إلى بناء نظام تشغيل صغير من الصفر، ويغطي الوظائف الأساسية مثل تبديل السياق، وتقسيم الذاكرة، وعمليات الملفات بلغة C، وكل ذلك في حوالي 1,000 سطر من الشيفرة.",
      "يؤكد على تعلم تقنيات تصحيح الأخطاء الجديدة، خاصة للتحديات مثل عملية الإقلاع والصفحات، ويوفر أمثلة قابلة للتنزيل على GitHub.",
      "الكتاب مرخص تحت CC BY 4.0، مع ترخيص الكود تحت رخصة MIT، ويتطلب معرفة مسبقة بلغة C وبيئة شبيهة بـ UNIX كمتطلبات أساسية."
    ],
    "commentSummary": [
      "\"نظام التشغيل في 1000 سطر\" هو كتاب يوجه القراء في إنشاء نظام تشغيل من الصفر باستخدام أي لغة برمجة، وليس مقتصرًا على لغة C.",
      "يؤكد الكتاب على المكونات الأساسية لنظام التشغيل، متجنبًا الهيكل التقليدي المشابه لنظام UNIX، ويهدف إلى أن يكون مشروعًا ممتعًا وإبداعيًا.",
      "يدعو إلى المساهمات والتعليقات، ويقدم المحتوى بتنسيق Markdown، ويعمل كمورد قيم للتعلم والتجريب في تطوير أنظمة التشغيل."
    ],
    "points": 602,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1736320730
  },
  {
    "id": 42633501,
    "title": "كسر مفتاح DKIM بطول 512 بت بأقل من 8 دولارات في السحابة",
    "originLink": "https://dmarcchecker.app/articles/crack-512-bit-dkim-rsa-key",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42633501",
    "commentBody": "",
    "originSummary": [
      "كشفت دراسة لسجلات SPF (إطار سياسة المرسل)، وDKIM (البريد المعرف بمفاتيح النطاق)، وDMARC (المصادقة على الرسائل المستندة إلى النطاق، والإبلاغ، والتوافق) لأفضل مليون موقع على الإنترنت عن وجود أكثر من 1,700 مفتاح DKIM عام أقصر من 1,024 بت، والتي تعتبر غير آمنة. - تمكن الباحثون من كسر مفتاح DKIM بطول 512 بت من موقع redfin.com باستخدام بايثون وCADO-NFS بأقل من 8 دولارات على خادم سحابي، مما يوضح ضعف المفاتيح القصيرة. - تؤكد الدراسة على ضرورة رفض مزودي البريد الإلكتروني لتوقيعات DKIM التي تحتوي على مفاتيح أقصر من 1,024 بت، حيث قبلت بعض المزودات مثل Yahoo Mail وMailfence وTuta التوقيع المخترق."
    ],
    "commentSummary": [
      "أصبح كسر مفتاح DKIM (البريد المعرف بمفاتيح النطاق) بطول 512 بت الآن ميسور التكلفة، حيث يكلف أقل من 8 دولارات باستخدام خدمات السحابة، مما يبرز ضعف طرق التشفير القديمة.",
      "تؤكد المناقشة على ضرورة تعزيز مفاتيح DKIM وأهمية التوازن بين الأمان وسهولة الاستخدام، حيث لا تزال العديد من الأنظمة تعتمد على مفاتيح قديمة، مما يشكل مخاطر أمنية كبيرة.",
      "تؤكد المحادثة على الآثار الأوسع لأمن البريد الإلكتروني والحاجة الملحة إلى تحديث المعايير لحماية ضد التهديدات المتطورة."
    ],
    "points": 422,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1736339554
  },
  {
    "id": 42626431,
    "title": "مايكروسوفت تخفي بينغ كجوجل لخداع الباحثين غير المنتبهين",
    "originLink": "https://www.pcworld.com/article/2568916/microsoft-disguises-bing-as-google-to-fool-inattentive-searchers.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42626431",
    "commentBody": "",
    "originSummary": [
      "تُفيد التقارير بأن مايكروسوفت تقوم بتغيير مظهر محرك البحث بينغ ليشبه واجهة جوجل، مما قد يضلل المستخدمين لاستخدام بينغ دون قصد. - تُبرز هذه الاستراتيجية التحديات التي تواجهها مايكروسوفت في منافسة الحصة السوقية الكبيرة لجوجل في صناعة محركات البحث. - ويقترح النقاد أن هذه الخطوة قد تُعطي الأولوية لأهداف مايكروسوفت التجارية على حساب توفير تجربة مستخدم حقيقية."
    ],
    "commentSummary": [
      "تقوم مايكروسوفت بتغيير مظهر محرك البحث بينغ ليشبه جوجل عندما يبحث المستخدمون عن \"جوجل\" على بينغ، مستفيدة من شهرة علامة جوجل التجارية.",
      "هذه الاستراتيجية مثيرة للجدل، حيث يراها البعض خادعة بينما يعتبرها آخرون خطوة استراتيجية للاحتفاظ بالمستخدمين الذين قد لا يلاحظون الفرق.",
      "يشير الخبراء القانونيون إلى أنه على الرغم من أن جوجل قد تتمكن من رفع دعوى، إلا أن إثبات الخداع دون وجود انتهاك واضح للعلامة التجارية سيكون صعبًا، مما يبرز استراتيجية مايكروسوفت التنافسية في سوق محركات البحث."
    ],
    "points": 284,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1736278653
  },
  {
    "id": 42627567,
    "title": "تم تسريحي لأول مرة في مسيرتي المهنية، ومرتين في عام واحد",
    "originLink": "https://dillonshook.com/laid-off/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42627567",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف تجربته في التعرض للفصل من العمل مرتين في عام واحد، مشددًا على أهمية الحفاظ على علاقات جيدة مع أصحاب العمل السابقين والاستعداد للبحث عن وظائف جديدة. - تشمل العلامات الرئيسية لاحتمال الفصل من العمل نقص رؤية الشركة، والانشغالات، وانخفاض استخدام المنتج، والاجتماعات المفاجئة للشركة، مما يشير إلى ضرورة بقاء الموظفين يقظين. - تتضمن النصائح لأولئك الذين تم فصلهم تحديث السير الذاتية، التقديم للحصول على إعانات البطالة، الاستفادة من LinkedIn والشبكات، فهم نماذج الأعمال، والحفاظ على تقدير الذات بعيدًا عن العمل."
    ],
    "commentSummary": [
      "يشدد المؤلف، الذي تعرض لتسريحين من العمل في عام واحد، على أهمية استخدام تنسيق سيرة ذاتية بسيط وخطي لتحسين معدلات الاستجابة من أنظمة تتبع المتقدمين (ATS). - غالبًا ما تسيء أنظمة ATS تفسير تنسيقات السيرة الذاتية الحديثة، مما يمكن أن يؤثر سلبًا على نتائج طلبات التوظيف؛ يمكن لتبسيط السير الذاتية والتركيز على مسؤوليات الدور أن يخفف من هذه المشكلة. - يُعتبر التواصل، والحفاظ على علاقات جيدة، وبناء مجموعة مهارات متنوعة استراتيجيات حاسمة لتحقيق الاستقرار والأمان الوظيفي في سوق عمل مليء بالتحديات."
    ],
    "points": 260,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1736284464
  },
  {
    "id": 42634624,
    "title": "لعبة تململ",
    "originLink": "https://www.mattkeeter.com/projects/fidget/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42634624",
    "commentBody": "",
    "originSummary": [
      "Fidget هي مكتبة مبنية على لغة Rust مصممة للتعامل مع التعبيرات الرياضية واسعة النطاق، خاصة للأسطح الضمنية، التي تكون مضغوطة وتدعم عمليات مثل الاتحاد والتقاطع. - تتكون المكتبة من ثلاث طبقات: الواجهة الأمامية (تحول السكربتات إلى بايت كود)، والواجهة الخلفية (تقييم التعبيرات بكفاءة)، والعروض التوضيحية، مع دعم لـ SIMD (تعليمات واحدة، بيانات متعددة) والتفاضل التلقائي. - Fidget متاحة الآن للجمهور على GitHub تحت رخصة MPL 2.0، مع خطط مستقبلية لتكامل GPU وتحسين التشكيل، مما يشجع المستخدمين على الاستكشاف والتطوير."
    ],
    "commentSummary": [
      "Fidget، مشروع من قبل مات كيتير، يستكشف مجالات متنوعة في علوم الحاسوب، بما في ذلك هياكل البيانات والخوارزميات والمترجمات والرسوميات، مما يثير الاهتمام بإمكانياته في تطبيقات مثل الطباعة ثلاثية الأبعاد والتصميم بمساعدة الحاسوب (CAD).",
      "على الرغم من أنه لا يدعم تصدير STEP (المعيار لتبادل بيانات نموذج المنتج) بسبب اختلاف تمثيلات البيانات، فإن Fidget يقدم وظائف أخرى ويتضمن روابط للغة البرمجة Rhai، وهي لغة برمجة نصية لـ Rust.",
      "ألهم المشروع مبادرات البرمجة الإبداعية والمناقشات، مما يبرز تنوعه وإمكانياته الابتكارية في مجتمع التكنولوجيا."
    ],
    "points": 240,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1736346658
  },
  {
    "id": 42628414,
    "title": "إحياء سيرفو: 2023-2024",
    "originLink": "https://blogs.igalia.com/mrego/servo-revival-2023-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42628414",
    "commentBody": "",
    "originSummary": [
      "أحيت شركة Igalia مشروع Servo، وهو محرك متصفح تجريبي أنشأته في الأصل شركة Mozilla، من خلال تولي صيانته في يناير 2023. - تشمل التقدمات الكبيرة ترقية التبعيات، وتعزيز التكامل المستمر (CI) والأدوات، وتوسيع دعم المجتمع، وإضافة دعم لنظامي Android وOpenHarmony. - جمع المشروع أكثر من 24,500 دولار من التبرعات، مع أهداف مستقبلية ليصبح محرك الويب الافتراضي لتطبيقات Rust وتطوير متصفح ويب كامل الميزات، على الرغم من التحديات مثل المنافسة والتمويل."
    ],
    "commentSummary": [
      "محرك المتصفح سيرفو يشهد انتعاشًا مع التحديثات وهو الآن يقبل التبرعات من خلال Open Collective ورعاة GitHub. - إغاليا، مساهم كبير في سيرفو، تشارك أيضًا في تطوير كروميوم، مما يبرز أهمية تنوع محركات المتصفح. - على الرغم من النكسات السابقة، مثل توقف موزيلا عن تطويره، يظل سيرفو نشطًا، مع مناقشات حول فوائد إعادة كتابته بلغة Rust وآمال في تمويل مستقبلي."
    ],
    "points": 238,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1736288712
  },
  {
    "id": 42629163,
    "title": "يوم في حياة طاقم احتيال صوتي نشط",
    "originLink": "https://krebsonsecurity.com/2025/01/a-day-in-the-life-of-a-prolific-voice-phishing-crew/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42629163",
    "commentBody": "",
    "originSummary": [
      "أصدرت شركتا آبل وجوجل تحذيرات بشأن عمليات الاحتيال عبر الهاتف، ومع ذلك، تستغل مجموعة تُدعى \"كريبتو كاميليون\" خدماتهما لتنفيذ هجمات تصيد احتيالي، مما يؤدي إلى خسائر مالية كبيرة للضحايا مثل مستثمر العملات المشفرة توني، الذي خسر 4.7 مليون دولار.",
      "تستخدم عصابة التصيد الاحتيالي طرقًا متطورة، بما في ذلك مجموعات تصيد تحاكي صفحات المصادقة ومكالمات دعم أبل المزيفة، مع أدوار مثل المتصل، والمشغل، والمصرف، والمالك لتنفيذ عمليات الاحتيال الخاصة بهم.",
      "على الرغم من الخيانات الداخلية، تواصل هذه المجموعات الإجرامية الإلكترونية الازدهار على منصات مثل تيليجرام وديسكورد، مع التركيز على استهداف الأفراد الأثرياء، وخاصة أولئك الذين يمتلكون أصولاً في العملات المشفرة."
    ],
    "commentSummary": [
      "تعرضت محطة وقود ريفية في أوهايو لعملية احتيال صوتي، حيث قام المحتالون بانتحال شخصية المحطة لطلب مدفوعات ببطاقات الائتمان عبر الهاتف باستخدام هوية متصل مزيفة. - يبرز الحادث إمكانية زيادة مثل هذه العمليات الاحتيالية مع استخدام أدوات الأتمتة، مما يؤكد الحاجة إلى تحسين تدابير الأمان. - واجه الصحفي المتخصص في الأمن السيبراني، بريان كريبس، المعروف بكشفه عن عمليات الاحتيال عبر الإنترنت، صعوبات عندما توقفت شركة أكاماي عن توفير حماية DDoS لموقعه، مما دفع جوجل لتقديم الدعم، مما يبرز التحديات المستمرة في مجال الأمن السيبراني."
    ],
    "points": 237,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1736293903
  },
  {
    "id": 42626964,
    "title": "شوارع GL - خريطة الشوارع المفتوحة ثلاثية الأبعاد",
    "originLink": "https://streets.gl/#47.35245,8.50958,21.25,42.00,459.10",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42626964",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Streets GL هو مشروع OpenStreetMap ثلاثي الأبعاد يتيح للمستخدمين استكشاف خرائط ثلاثية الأبعاد مفصلة، على الرغم من أن بعض المستخدمين لاحظوا أن بيانات OSM قديمة وأن هناك مشكلات في بعض الميزات مثل الجسور.",
      "اقترح المستخدمون تحسينات، بما في ذلك استخدام Cloudflare لتحميل أسرع، وتحديث بيانات المباني، ودمج بيانات الارتفاع لتعزيز التجربة البصرية.",
      "يدعم المشروع تحميل ملفات GPX وFIT لمسارات GPS، مما يتيح التفاعل مع الخريطة عبر أدوات التحكم في لوحة المفاتيح والفأرة."
    ],
    "points": 212,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1736281201
  },
  {
    "id": 42633269,
    "title": "وداعًا لألعاب ويندوز؟ نظام SteamOS يتوسع رسميًا ليشمل ما بعد جهاز Steam Deck",
    "originLink": "https://arstechnica.com/gaming/2025/01/bye-bye-windows-gaming-steamos-officially-expands-past-the-steam-deck/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42633269",
    "commentBody": "",
    "originSummary": [
      "سيكون جهاز Legion Go S من لينوفو أول جهاز غير تابع لشركة Valve يتم تشغيله رسميًا بنظام \"SteamOS\"، مما يشير إلى تحول كبير عن نظام Windows لأجهزة الكمبيوتر المخصصة للألعاب.",
      "ستكون نسخة SteamOS من الجهاز أكثر تكلفة، حيث تبدأ من 500 دولار، مقارنة بنسخة Windows التي يبلغ سعرها 730 دولارًا.",
      "خطة شركة فالف لإصدار نسخة تجريبية من نظام SteamOS للتثبيت الشخصي قد تتحدى هيمنة نظام ويندوز في ألعاب الكمبيوتر الشخصي، مما يعزز التحول الأوسع نحو الألعاب المعتمدة على نظام لينكس."
    ],
    "commentSummary": [
      "نظام SteamOS يوسع نطاقه ليشمل ما هو أبعد من جهاز Steam Deck، مقدماً نفسه كبديل موثوق لنظام Windows لعشاق الألعاب.",
      "يتيح استخدام Proton، وهي طبقة توافق، تشغيل معظم الألعاب بكفاءة على نظام Linux، على الرغم من أن بعض الألعاب متعددة اللاعبين التي تحتوي على أنظمة مكافحة الغش على مستوى النواة قد تواجه مشكلات.",
      "مع أدوات مثل Heroic وLutris التي تبسط الوصول إلى الألعاب من منصات مختلفة، تقدم SteamOS تجربة مبسطة تشبه تجربة الأجهزة المنزلية، مما قد يشكل تحديًا لهيمنة نظام Windows في قطاع الألعاب مع تبني المزيد من الأجهزة له."
    ],
    "points": 194,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1736337370
  }
]
