[
  {
    "id": 42627227,
    "title": "Büyük ve yerleşik kod tabanlarında mühendislerin yaptığı hatalar",
    "originLink": "https://www.seangoedecke.com/large-established-codebases/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42627227",
    "commentBody": "",
    "originSummary": [
      "Büyük, yerleşik kod tabanlarında çalışmak, genellikle milyonlarca satır kod ve yüzlerce mühendisin dahil olduğu projelerde, yazılım mühendisleri için önemli zorluklar sunar. - Yaygın bir hata, mühendislerin mevcut kod kalıplarını görmezden gelerek özellikleri izole bir şekilde uygulamalarıdır; bu, bakım sorunlarına yol açabilir ve gelecekteki iyileştirmeleri engelleyebilir. - Büyük kod tabanlarında etkili bir şekilde çalışmak için mühendisler, mevcut kalıpları araştırmalı, kod tabanının üretim etkisini anlamalı, bağımlılıklar konusunda dikkatli olmalı ve kalite ve değeri korumak için gereksiz kodu dikkatlice kaldırmalıdır."
    ],
    "commentSummary": [
      "Mühendisler, büyük ve yerleşik kod tabanlarında genellikle tutarsızlıklar ve belgelenmemiş uygulamalarla karşılaşır, bu da kişisel kod kalitesine ve belgelendirmeye odaklanmayı gerektirir. - İyileştirmeleri yerel tutarlılığı koruyarak dengelemek, özellikle mevcut kod tabanı tutarsız olduğunda önemlidir, daha geniş ekiple etkileşim kurmak ise uygulamaların uyumlu hale getirilmesine yardımcı olabilir. - Nihai hedef, kod tabanının işlevselliğini ve sürdürülebilirliğini artırmaktır, bu da mevcut kalıplara uyum sağlamak ve pragmatik olmak gerektirir."
    ],
    "points": 683,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1736282675
  },
  {
    "id": 42627453,
    "title": "Magic/tragic e-posta bağlantıları: onları tek seçenek yapmayın",
    "originLink": "https://recyclebin.zip/posts/annoyinglinks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42627453",
    "commentBody": "",
    "originSummary": [
      "Magic Linkler, e-posta bağlantıları aracılığıyla şifresiz bir giriş yöntemi sunar, bu da gelişmiş güvenlik sağlar ancak e-posta gecikmeleri ve çoklu cihaz kullanımı nedeniyle rahatsız edici olabilir.",
      "Kullanıcıları iş cihazlarında kişisel e-postalara erişmeye teşvik ederek güvenlik riskleri oluşturabilirler, bu da Tek Kullanımlık Şifreler (OTP'ler) gibi alternatiflere olan ihtiyacı vurgular.",
      "Özellikle teknoloji meraklısı kullanıcılar için daha iyi bir kullanıcı deneyimi sağlamak amacıyla, geçiş anahtarları daha esnek ve güvenli bir seçenek olarak önerilmektedir."
    ],
    "commentSummary": [
      "Kimlik doğrulama için kullanılan sihirli bağlantılar, e-posta sorunları nedeniyle güvenilirlik sorunlarıyla karşılaşabilir ve kullanıcıları, parolaların aksine yasal olarak zorlanabilecek biyometrik yöntemlere yönlendirebilir. - Sihirli bağlantılara daha güvenli ve kullanıcı dostu bir alternatif olarak önerilen geçiş anahtarlarının benimsenmesi hala devam etmektedir ve birçok hizmet henüz bunları uygulamamıştır. - Kimlik doğrulama yöntemlerinde güvenlik ve kullanılabilirlik dengesini sağlama konusundaki tartışmalar aktif olarak devam etmekte olup, optimal bir çözüm bulmanın zorluklarını vurgulamaktadır."
    ],
    "points": 653,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1736283984
  },
  {
    "id": 42631873,
    "title": "1,000 Satırda İşletim Sistemi – Giriş",
    "originLink": "https://operating-system-in-1000-lines.vercel.app/en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42631873",
    "commentBody": "",
    "originSummary": [
      "Kitap, okuyucuları sıfırdan küçük bir işletim sistemi oluşturmaya yönlendirir ve tümü yaklaşık 1.000 satır kod içinde olmak üzere, C dilinde bağlam değiştirme, sayfalama ve dosya işlemleri gibi temel işlevleri kapsar.",
      "Özellikle önyükleme süreci ve sayfalama gibi zorluklar için yeni hata ayıklama tekniklerini öğrenmeyi vurgular ve GitHub'da indirilebilir örnekler sunar.",
      "Kitap, CC BY 4.0 lisansı altında, kod ise MIT lisansı altında lisanslanmıştır ve ön koşul olarak C ve UNIX benzeri bir ortam bilgisi gerektirir."
    ],
    "commentSummary": [
      "1,000 Satırda İşletim Sistemi\" kitabı, okuyuculara C ile sınırlı kalmadan herhangi bir programlama dili kullanarak sıfırdan bir işletim sistemi oluşturma konusunda rehberlik eder.",
      "Kitap, geleneksel bir UNIX benzeri yapıdan uzak durarak bir işletim sisteminin temel bileşenlerini vurgulamakta ve ilgi çekici ve yaratıcı bir proje olmayı hedeflemektedir.",
      "Katkıları ve geri bildirimleri davet eder, içeriği Markdown formatında sunar ve işletim sistemi geliştirme konusunda öğrenme ve denemeler için değerli bir kaynak olarak hizmet eder."
    ],
    "points": 602,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1736320730
  },
  {
    "id": 42633501,
    "title": "Bulutta 8 dolardan daha az bir maliyetle 512 bitlik bir DKIM anahtarını kırmak",
    "originLink": "https://dmarcchecker.app/articles/crack-512-bit-dkim-rsa-key",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42633501",
    "commentBody": "",
    "originSummary": [
      "En iyi 1 milyon web sitesinin SPF (Gönderen Politika Çerçevesi), DKIM (DomainKeys Tanımlı Posta) ve DMARC (Alan Tabanlı Mesaj Kimlik Doğrulama, Raporlama ve Uygunluk) kayıtlarının incelenmesi, 1.024 bitten daha kısa olan 1.700'den fazla kamuya açık DKIM anahtarını ortaya çıkardı, bu anahtarlar güvensiz olarak kabul ediliyor. - Araştırmacılar, kısa anahtarların güvenlik açığını göstererek, redfin.com'dan 512 bitlik bir DKIM anahtarını Python ve CADO-NFS kullanarak bir bulut sunucusunda 8 dolardan daha düşük bir maliyetle kırmayı başardılar. - Çalışma, Yahoo Mail, Mailfence ve Tuta gibi bazı sağlayıcıların tehlikeye atılmış imzayı kabul etmesi nedeniyle, e-posta sağlayıcılarının 1.024 bitten daha kısa anahtarlara sahip DKIM imzalarını reddetmesi gerektiğini vurguluyor."
    ],
    "commentSummary": [
      "512 bitlik bir DKIM (DomainKeys Identified Mail) anahtarını kırmak artık uygun maliyetli hale geldi, bulut hizmetlerini kullanarak 8 dolardan daha az bir maliyetle yapılabiliyor, bu da eski şifreleme yöntemlerinin savunmasızlığını vurguluyor.",
      "Bu tartışma, daha güçlü DKIM anahtarlarının gerekliliğini ve güvenlik ile kullanılabilirlik arasında denge kurmanın zorluklarını vurguluyor, çünkü birçok sistem hala güncel olmayan anahtarlara dayanıyor ve bu da önemli güvenlik riskleri oluşturuyor.",
      "Konuşma, e-posta güvenliği için daha geniş kapsamlı sonuçları ve gelişen tehditlere karşı korunmak için güncellenmiş standartlara duyulan acil ihtiyacı vurguluyor."
    ],
    "points": 422,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1736339554
  },
  {
    "id": 42626431,
    "title": "Microsoft, dikkatsiz arayıcıları kandırmak için Bing'i Google gibi gösteriyor.",
    "originLink": "https://www.pcworld.com/article/2568916/microsoft-disguises-bing-as-google-to-fool-inattentive-searchers.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42626431",
    "commentBody": "",
    "originSummary": [
      "Microsoft'un, kullanıcıları istemeden Bing'i kullanmaya yönlendirebilecek şekilde Bing'in görünümünü Google'ın arayüzüne benzetmek için değişiklikler yaptığı bildiriliyor. - Bu strateji, Microsoft'un arama motoru endüstrisinde Google'ın önemli pazar payıyla rekabet etme konusundaki zorluklarını vurguluyor. - Eleştirmenler, bu taktiğin Microsoft'un iş hedeflerini gerçek bir kullanıcı deneyimi sağlamanın önüne koyabileceğini öne sürüyor."
    ],
    "commentSummary": [
      "Microsoft, kullanıcılar Bing'de \"Google\" aradığında, Google'ın marka tanınırlığından yararlanarak Bing'in görünümünü Google'a benzer hale getiriyor.",
      "Bu taktik tartışmalıdır; bazıları bunu aldatıcı olarak görürken, diğerleri farkı fark etmeyebilecek kullanıcıları elde tutmak için stratejik bir hamle olarak görmektedir.",
      "Yasal uzmanlar, Google'ın potansiyel olarak dava açabileceğini belirtirken, açık bir marka ihlali olmadan aldatmayı kanıtlamanın zor olacağını ve Microsoft'un arama motoru pazarındaki rekabetçi stratejisini vurguladığını belirtiyor."
    ],
    "points": 284,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1736278653
  },
  {
    "id": 42627567,
    "title": "İlk kez kariyerimde işten çıkarıldım ve bir yıl içinde iki kez",
    "originLink": "https://dillonshook.com/laid-off/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42627567",
    "commentBody": "",
    "originSummary": [
      "Yazar, bir yıl içinde iki kez işten çıkarılma deneyimini paylaşarak eski işverenlerle iyi ilişkiler sürdürmenin ve iş aramalarına hazırlıklı olmanın önemini vurguluyor. - Potansiyel işten çıkarmaların ana işaretleri arasında şirket vizyonunun eksikliği, dikkat dağıtıcı unsurlar, düşük ürün kullanımı ve ani şirket toplantıları yer alıyor, bu da çalışanların dikkatli olmaları gerektiğini öneriyor. - İşten çıkarılanlar için tavsiyeler arasında özgeçmişleri güncellemek, işsizlik başvurusunda bulunmak, LinkedIn ve ağ oluşturmayı kullanmak, iş modellerini anlamak ve istihdamın ötesinde öz değerini korumak yer alıyor."
    ],
    "commentSummary": [
      "Yazar, bir yıl içinde iki kez işten çıkarılma deneyimi yaşamış biri olarak, Başvuru Takip Sistemlerinden (ATS) yanıt oranlarını artırmak için basit, doğrusal bir özgeçmiş formatı kullanmanın önemini vurguluyor. - ATS, modern özgeçmiş formatlarını sıklıkla yanlış yorumlayarak iş başvurusu sonuçlarını olumsuz etkileyebilir; özgeçmişleri basitleştirmek ve rol sorumluluklarına odaklanmak bu sorunu hafifletebilir. - Ağ kurma, iyi ilişkiler sürdürme ve çeşitli bir beceri seti oluşturma, zorlu bir iş piyasasında kariyer istikrarı ve güvenliği için kritik stratejilerdir."
    ],
    "points": 260,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1736284464
  },
  {
    "id": 42634624,
    "title": "El oyalayıcı",
    "originLink": "https://www.mattkeeter.com/projects/fidget/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42634624",
    "commentBody": "",
    "originSummary": [
      "Fidget, özellikle birleşim ve kesişim gibi işlemleri destekleyen kompakt yapılı örtük yüzeyler için büyük ölçekli matematiksel ifadeleri ele almak üzere tasarlanmış Rust tabanlı bir kütüphanedir. - Kütüphane üç katmana ayrılmıştır: ön yüz (betikleri bayt koduna dönüştürür), arka uç (ifadeleri verimli bir şekilde değerlendirir) ve demolar, SIMD (Tek Komut, Çoklu Veri) ve otomatik türev alma desteği ile. - Fidget, MPL 2.0 lisansı altında GitHub'da artık herkese açık olarak mevcuttur ve kullanıcıların keşif ve geliştirmelerini teşvik eden GPU entegrasyonu ve geliştirilmiş ağ oluşturma için gelecekteki planlar bulunmaktadır."
    ],
    "commentSummary": [
      "Matt Keeter tarafından geliştirilen bir proje olan Fidget, bilgisayar biliminin veri yapıları, algoritmalar, derleyiciler ve grafikler gibi çeşitli alanlarını araştırarak, 3D baskı ve CAD (Bilgisayar Destekli Tasarım) gibi alanlardaki potansiyel uygulamalarıyla ilgi uyandırmaktadır.",
      "Farklı veri temsilleri nedeniyle STEP (Ürün model verilerinin değişimi standardı) ihracatını desteklemese de, Fidget diğer işlevsellikler sunar ve Rust için bir betik dili olan Rhai için bağlamalar içerir.",
      "Proje, teknoloji topluluğunda çok yönlülüğünü ve yenilikçi potansiyelini vurgulayarak yaratıcı kodlama girişimlerine ve tartışmalara ilham verdi."
    ],
    "points": 240,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1736346658
  },
  {
    "id": 42628414,
    "title": "Servo Canlanması: 2023-2024",
    "originLink": "https://blogs.igalia.com/mrego/servo-revival-2023-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42628414",
    "commentBody": "",
    "originSummary": [
      "Igalia, Ocak 2023'te Mozilla tarafından başlangıçta oluşturulan deneysel bir tarayıcı motoru olan Servo projesinin bakımını devralarak projeyi canlandırdı. - Önemli ilerlemeler arasında bağımlılıkların yükseltilmesi, sürekli entegrasyon (CI) ve araçların geliştirilmesi, topluluk desteğinin genişletilmesi ve Android ve OpenHarmony desteğinin eklenmesi yer alıyor. - Proje, 24.500 dolardan fazla bağış topladı ve gelecekteki hedefleri arasında Rust uygulamaları için varsayılan bir web motoru haline gelmek ve tam özellikli bir web tarayıcısı geliştirmek bulunuyor, rekabet ve finansman gibi zorluklara rağmen."
    ],
    "commentSummary": [
      "Servo, bir tarayıcı motoru, güncellemelerle yeniden canlanıyor ve artık Open Collective ve GitHub sponsorları aracılığıyla bağış kabul ediyor. - Servo'nun önemli bir katkıcısı olan Igalia, aynı zamanda Chromium geliştirmesiyle de ilgileniyor ve çeşitli tarayıcı motorlarının önemini vurguluyor. - Mozilla'nın geliştirmesini durdurması gibi önceki aksiliklere rağmen, Servo aktif kalmaya devam ediyor, Rust ile yeniden yazmanın faydaları üzerine tartışmalar ve gelecekteki finansman umutları sürüyor."
    ],
    "points": 238,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1736288712
  },
  {
    "id": 42629163,
    "title": "Üretken bir sesli kimlik avı ekibinin hayatında bir gün",
    "originLink": "https://krebsonsecurity.com/2025/01/a-day-in-the-life-of-a-prolific-voice-phishing-crew/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42629163",
    "commentBody": "",
    "originSummary": [
      "Apple ve Google, telefon dolandırıcılıkları hakkında uyarılar yayınladı, ancak \"Crypto Chameleon\" adlı bir grup, kimlik avı saldırıları gerçekleştirmek için bu hizmetleri kullanarak, kripto para yatırımcısı Tony gibi mağdurların 4,7 milyon dolar kaybetmesine neden olan önemli mali kayıplara yol açıyor.",
      "Kimlik avı çetesi, kimlik doğrulama sayfalarını taklit eden kimlik avı kitleri ve sahte Apple destek çağrıları gibi sofistike yöntemler kullanarak, Dolandırıcı, Operatör, Boşaltıcı ve Sahip gibi rolleri içeren dolandırıcılıklarını gerçekleştiriyor.",
      "İçsel ihanetlere rağmen, bu siber suç grupları Telegram ve Discord gibi platformlarda gelişmeye devam ediyor ve özellikle kripto para varlıklarına sahip zengin bireyleri hedef alıyorlar."
    ],
    "commentSummary": [
      "Kırsal bir Ohio benzin istasyonu, dolandırıcıların sahte arayan kimliği kullanarak telefon üzerinden kredi kartı ödemeleri talep etmek için istasyonu taklit ettiği bir sesli kimlik avı dolandırıcılığının kurbanı oldu. - Olay, otomasyon araçlarının kullanımıyla bu tür dolandırıcılıkların potansiyel artışını vurgularken, geliştirilmiş güvenlik önlemlerine duyulan ihtiyacı da öne çıkarıyor. - Çevrimiçi dolandırıcılıkları ortaya çıkarmasıyla tanınan siber güvenlik gazetecisi Brian Krebs, Akamai'nin sitesine DDoS korumasını sonlandırmasıyla zorluklar yaşadı ve bu durum Google'ın destek sağlamasına neden oldu, bu da devam eden siber güvenlik zorluklarını gözler önüne seriyor."
    ],
    "points": 237,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1736293903
  },
  {
    "id": 42626964,
    "title": "Streets GL – 3D OpenStreetMap",
    "originLink": "https://streets.gl/#47.35245,8.50958,21.25,42.00,459.10",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42626964",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Streets GL, kullanıcıların ayrıntılı 3D haritaları keşfetmelerini sağlayan bir 3D OpenStreetMap projesidir, ancak bazı kullanıcılar OSM verilerinin güncel olmadığını ve köprüler gibi bazı özelliklerin sorunlu olduğunu belirtmiştir.",
      "Kullanıcılar, daha hızlı yükleme için Cloudflare kullanılması, bina verilerinin güncellenmesi ve görsel deneyimi geliştirmek için yükseklik verilerinin entegre edilmesi gibi iyileştirmeler önermiştir.",
      "Proje, GPS izleri için GPX ve FIT dosya yüklemelerini destekler ve harita ile klavye ve fare kontrolleri aracılığıyla etkileşim sağlar."
    ],
    "points": 212,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1736281201
  },
  {
    "id": 42633269,
    "title": "Hoşça kal Windows oyunları? SteamOS resmi olarak Steam Deck'in ötesine genişliyor",
    "originLink": "https://arstechnica.com/gaming/2025/01/bye-bye-windows-gaming-steamos-officially-expands-past-the-steam-deck/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42633269",
    "commentBody": "",
    "originSummary": [
      "Lenovo'nun Legion Go S, oyun bilgisayarları için Windows'tan önemli bir değişimi gösteren, resmi olarak \"SteamOS ile Güçlendirilmiş\" ilk Valve dışı cihaz olacak.",
      "SteamOS sürümüne sahip cihaz, Windows sürümüne kıyasla daha uygun fiyatlı olacak ve 500 dolardan başlayacak, Windows sürümü ise 730 dolar olarak fiyatlandırılmış.",
      "Valve'in, kişisel kurulumlar için SteamOS'un beta sürümünü yayınlama planı, PC oyunlarında Windows'un hakimiyetine meydan okuyabilir ve Linux tabanlı oyunlara yönelik daha geniş bir geçişi teşvik edebilir."
    ],
    "commentSummary": [
      "SteamOS, Steam Deck'in ötesine geçerek, oyun meraklıları için Windows'a karşı güvenilir bir alternatif olarak kendini sunuyor.",
      "Proton adlı uyumluluk katmanının kullanılması, çoğu oyunun Linux üzerinde verimli bir şekilde çalışmasını sağlar, ancak çekirdek seviyesinde hile önleme sistemlerine sahip bazı çok oyunculu oyunlar sorun yaşayabilir.",
      "Heroic ve Lutris gibi araçlar, farklı platformlardan oyunlara erişimi kolaylaştırırken, SteamOS, daha fazla cihazın benimsemesiyle birlikte, oyun sektöründe Windows'un hakimiyetine meydan okuyabilecek, konsol benzeri bir deneyim sunuyor."
    ],
    "points": 194,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1736337370
  }
]
