[
  {
    "id": 42599189,
    "title": "صمم الباحثون تقنية قابلة للارتداء يمكنها قياس مستويات الجلوكوز بدقة أكبر",
    "originLink": "https://uwaterloo.ca/news/media/no-more-needles-tracking-blood-sugar-your-wrist",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599189",
    "commentBody": "",
    "originSummary": [
      "قام باحثون في جامعة واترلو بابتكار جهاز يمكن ارتداؤه يستخدم تقنية الرادار لمراقبة مستويات الجلوكوز بشكل غير جراحي، مما يلغي الحاجة إلى الإبر.",
      "يشتمل الجهاز، الذي يقوده الدكتور جورج شاكر، على شريحة رادار وسطح ميتا لتحسين دقة الإشارة وخوارزميات الذكاء الاصطناعي لقراءات دقيقة لمستوى الجلوكوز.",
      "حاليًا يعمل الجهاز بالطاقة عبر USB، ويهدف إلى أن يصبح يعمل بالبطارية لتحسين قابلية الحمل وقد يراقب في النهاية مقاييس صحية إضافية، مع جهود جارية لتسويق التكنولوجيا."
    ],
    "commentSummary": [
      "قام الباحثون بتطوير تقنية قابلة للارتداء لمراقبة الجلوكوز بشكل غير جراحي، مما يوفر بديلاً لوخز الأصابع وأجهزة مراقبة الجلوكوز المستمرة (CGMs).",
      "تهدف التكنولوجيا إلى توفير قراءات دقيقة لمستوى الجلوكوز دون الاتصال المباشر بمجرى الدم، مما قد يكون له أهمية كبيرة في التطبيقات السريرية.",
      "بينما يبدو واعدًا، هناك شكوك حول دقته مقارنة بأجهزة مراقبة الجلوكوز المستمرة الحالية، وهناك حاجة إلى مزيد من البيانات والتجارب السريرية لتأكيد فعاليته."
    ],
    "points": 324,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1736043133
  },
  {
    "id": 42601847,
    "title": "اليوم الذي علمت فيه الذكاء الاصطناعي قراءة الشيفرة مثل مطور برمجيات كبير",
    "originLink": "https://nmn.gl/blog/ai-senior-developer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42601847",
    "commentBody": "",
    "originSummary": [
      "تم تحدي الذكاء الاصطناعي في البداية بتحليل قواعد بيانات كود React، حيث تعامل معها كمطور مبتدئ. - من خلال محاكاة استراتيجيات المطورين الكبار، مثل التركيز على الملفات الأساسية وتجميع التغييرات حسب الميزة، تحسنت قدرة الذكاء الاصطناعي على تحليل الكود بشكل كبير. - يتركز الاهتمام على تحسين فهم الكود بدلاً من توليده، مع خطط مستقبلية لتحديد الديون التقنية وفهم تقاليد الفريق."
    ],
    "commentSummary": [
      "تستكشف المقالة التحديات المتعلقة بتدريب الذكاء الاصطناعي على قراءة وتحليل الشفرات البرمجية بكفاءة مطور برمجيات متمرس، مشيرة إلى الصعوبة في تحقيق نتائج متسقة ودقيقة.",
      "يؤكد على أهمية توفير السياق وهيكلة المدخلات لتحسين أداء الذكاء الاصطناعي في تحليل الشفرات، مع الاعتراف بالتشكيك في القدرات الحالية للذكاء الاصطناعي.",
      "تسلط المناقشة الضوء على الحاجة إلى مزيد من التجريب والتقييم للتحقق من أداء الذكاء الاصطناعي وتدرس الآثار الأوسع والتطورات المحتملة للذكاء الاصطناعي في تطوير البرمجيات."
    ],
    "points": 293,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1736086519
  },
  {
    "id": 42599102,
    "title": "إزعاجات صفحات الويب التي لا أفرضها عليك هنا",
    "originLink": "http://rachelbythebay.com/w/2025/01/04/cruft/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599102",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يتجنب المؤلف استخدام ميزات ويب معينة مثل الأشرطة اللاصقة، وفرض SSL/TLS، والنوافذ المنبثقة، والتتبع غير الضروري لتحسين تجربة المستخدم.",
      "هناك نقاش مستمر حول ضرورة استخدام HTTPS للأمان مقابل مشكلات التوافق التي يواجهها مع المتصفحات القديمة.",
      "تسلط المناقشة الضوء على تحدي تحقيق التوازن بين تجربة المستخدم والممارسات الحديثة للويب."
    ],
    "points": 248,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1736042093
  },
  {
    "id": 42600846,
    "title": "كيف يعمل اجتياز NAT (2020)",
    "originLink": "https://tailscale.com/blog/how-nat-traversal-works",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42600846",
    "commentBody": "",
    "originSummary": [
      "تمكن تقنية تجاوز NAT من إنشاء اتصالات مباشرة بين الأجهزة على الرغم من وجود مترجمي عناوين الشبكة (NATs) والجدران النارية، وذلك باستخدام بروتوكولات تعتمد على UDP والتحكم المباشر في المقابس.",
      "تساعد تقنيات مثل STUN (أدوات اجتياز الجلسات لـ NAT) في اكتشاف عناوين IP العامة، بينما تُستخدم وسائل النقل مثل TURN (الاجتياز باستخدام وسائل النقل حول NAT) أو DERP من Tailscale للتعامل مع NATs الأكثر تحديًا.",
      "يقوم بروتوكول ICE (تأسيس الاتصال التفاعلي) بتحسين مسارات الاتصال من خلال تقييم جميع الخيارات الممكنة واختيار الأكثر كفاءة، مما يضمن تجاوز NAT بشكل قوي مع التشفير والمصادقة من الطرف إلى الطرف."
    ],
    "commentSummary": [
      "يستكشف المقال تجاوز NAT (ترجمة عناوين الشبكة)، مع التركيز على الفروق بين ثقب TCP (بروتوكول التحكم في الإرسال) وUDP (بروتوكول بيانات المستخدم)، مشيرًا إلى أن TCP يتميز بتعقيد أعلى قليلاً.",
      "يتحدى الفكرة السائدة عن NAT كميزة أمان ويناقش طريقة Tailscale لاجتياز NAT، مما يثير القلق بشأن الاعتماد فقط على قوائم التحكم في الوصول البرمجية (ACLs) للأمان.",
      "تسلط المناقشة الضوء على أهمية النقاط النهائية الآمنة وتنتقد قيود استراتيجيات الأمان الشبكي التقليدية في سياق تجاوز NAT."
    ],
    "points": 233,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1736072158
  },
  {
    "id": 42599599,
    "title": "جوتن: طابعة صحف صغيرة",
    "originLink": "https://amanvir.com/guten",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599599",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "جوتن هو مشروع طباعة صحف صغير مصمم لتقليل وقت الشاشة من خلال تقديم الأخبار في شكل مطبوع. - تشمل المناقشات حول المشروع مخاوف بشأن محتوى BPA في الورق الحراري واقتراحات لاستخدام بدائل خالية من BPA أو تقنيات طباعة مختلفة مثل الطابعات الضاغطة أو النقطية. - تُجرى مقارنات مع الطابعة الصغيرة المتوقفة، مع توصيات لتعزيز ملاءمة جوتن للمطورين وخيارات التخصيص، إلى جانب مراعاة التأثيرات البيئية والصحية للورق الحراري."
    ],
    "points": 227,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1736048832
  }
]
