[
  {
    "id": 42599189,
    "title": "Araştırmacılar, glikoz seviyelerini daha doğru bir şekilde algılayabilen giyilebilir teknoloji tasarladı",
    "originLink": "https://uwaterloo.ca/news/media/no-more-needles-tracking-blood-sugar-your-wrist",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599189",
    "commentBody": "",
    "originSummary": [
      "Waterloo Üniversitesi'ndeki araştırmacılar, iğne gereksinimini ortadan kaldırarak glikoz seviyelerini invaziv olmayan bir şekilde izlemek için radar teknolojisini kullanan giyilebilir bir cihaz geliştirdiler.",
      "Dr. George Shaker tarafından yönetilen cihaz, bir radar çipi, sinyal doğruluğunu artırmak için bir meta-yüzey ve hassas glikoz okumaları için AI algoritmaları içermektedir.",
      "Şu anda USB ile çalışan cihaz, taşınabilirliği artırmak için pille çalışır hale gelmeyi hedefliyor ve nihayetinde ek sağlık ölçümlerini izleyebilir, teknoloji ticarileştirilme çabaları devam ediyor."
    ],
    "commentSummary": [
      "Araştırmacılar, parmak delme ve Sürekli Glikoz Monitörlerine (CGM'ler) alternatif sunan, invaziv olmayan glikoz izleme için giyilebilir teknoloji geliştirdiler.",
      "Teknoloji, klinik uygulamalar için önemli olabilecek, kan dolaşımıyla doğrudan temas olmadan doğru glikoz okumaları sağlamayı amaçlamaktadır.",
      "Umut verici olsa da, mevcut CGM'lerle karşılaştırıldığında doğruluğu konusunda şüpheler var ve etkinliğini doğrulamak için daha fazla veri ve klinik denemelere ihtiyaç duyuluyor."
    ],
    "points": 324,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1736043133
  },
  {
    "id": 42601847,
    "title": "Yapay zekaya kodu Kıdemli Bir Geliştirici gibi okumayı öğrettiğim gün",
    "originLink": "https://nmn.gl/blog/ai-senior-developer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42601847",
    "commentBody": "",
    "originSummary": [
      "Yapay zeka başlangıçta React kod tabanlarını analiz etmekte zorlandı ve bunlara yeni bir geliştirici gibi yaklaştı. - Kıdemli geliştiricilerin stratejilerini taklit ederek, örneğin temel dosyalara odaklanarak ve değişiklikleri özelliklere göre gruplayarak, yapay zekanın kod analizi önemli ölçüde iyileşti. - Odak noktası, kod üretiminden ziyade kod anlayışını geliştirmek olup, gelecekte teknik borcu tanımlamak ve ekip geleneklerini anlamak planlanmaktadır."
    ],
    "commentSummary": [
      "Makale, bir kıdemli geliştiricinin yetkinliğiyle kod okumak ve analiz etmek için yapay zekayı eğitmenin zorluklarını araştırıyor ve tutarlı ve doğru sonuçlar elde etmenin zorluğuna dikkat çekiyor.",
      "Bu, kod analizinde yapay zeka performansını artırmak için bağlam sağlamanın ve girdileri yapılandırmanın önemini vurgularken, yapay zekanın mevcut yetenekleri hakkındaki şüpheciliği kabul etmektedir.",
      "Bu tartışma, yapay zekanın performansını doğrulamak için daha fazla deney ve değerlendirme yapılması gerekliliğini vurgulamakta ve yazılım geliştirmede yapay zekanın daha geniş etkilerini ve potansiyel ilerlemelerini ele almaktadır."
    ],
    "points": 293,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1736086519
  },
  {
    "id": 42599102,
    "title": "Burada size yük olmadığım web sayfası rahatsızlıkları",
    "originLink": "http://rachelbythebay.com/w/2025/01/04/cruft/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599102",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yazar, kullanıcı deneyimini geliştirmek için yapışkan çubuklar, zorunlu SSL/TLS, açılır pencereler ve gereksiz izleme gibi belirli web özelliklerini kullanmaktan kaçınır.",
      "HTTPS'in güvenlik için gerekliliği ile eski tarayıcılarla uyumluluk sorunları arasındaki tartışma devam ediyor.",
      "Bu tartışma, kullanıcı deneyimini modern web uygulamalarıyla dengeleme zorluğunu vurgulamaktadır."
    ],
    "points": 248,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1736042093
  },
  {
    "id": 42600846,
    "title": "Nat Geçişi Nasıl Çalışır (2020)",
    "originLink": "https://tailscale.com/blog/how-nat-traversal-works",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42600846",
    "commentBody": "",
    "originSummary": [
      "NAT geçişi, UDP tabanlı protokoller ve doğrudan soket kontrolü kullanarak Ağ Adresi Çeviricileri (NAT'ler) ve güvenlik duvarlarının varlığına rağmen doğrudan cihaz bağlantılarını mümkün kılar.",
      "STUN (Oturum Geçiş Araçları için NAT) gibi teknikler, genel IP adreslerini keşfetmeye yardımcı olurken, TURN (NAT etrafında Röleler Kullanarak Geçiş) veya Tailscale'in DERP'si gibi röleler daha zorlu NAT'lar için kullanılır.",
      "ICE (Etkileşimli Bağlantı Kurulumu) protokolü, tüm olası seçenekleri değerlendirerek ve en verimli olanı seçerek bağlantı yollarını optimize eder, uçtan uca şifreleme ve kimlik doğrulama ile sağlam NAT geçişi sağlar."
    ],
    "commentSummary": [
      "Makale, TCP'nin (İletim Kontrol Protokolü) biraz daha yüksek karmaşıklığını belirterek, TCP (İletim Kontrol Protokolü) ve UDP (Kullanıcı Datagram Protokolü) delik delme arasındaki farklara vurgu yaparak NAT (Ağ Adresi Çevirisi) geçişini inceliyor.",
      "NAT'ın bir güvenlik özelliği olarak algılanmasını sorguluyor ve Tailscale'in NAT geçişi yöntemini tartışarak, güvenlik için yalnızca yazılım ACL'lerine (Erişim Kontrol Listeleri) güvenmenin endişelerini gündeme getiriyor.",
      "Metin, güvenli uç noktaların önemini vurgulamakta ve NAT geçişi bağlamında geleneksel ağ güvenlik stratejilerinin sınırlamalarını eleştirmektedir."
    ],
    "points": 233,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1736072158
  },
  {
    "id": 42599599,
    "title": "Guten: Küçük Bir Gazete Yazıcısı",
    "originLink": "https://amanvir.com/guten",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599599",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Guten, haberleri basılı formda sunarak ekran süresini en aza indirmeyi amaçlayan küçük ölçekli bir gazete yazıcı projesidir. - Proje etrafındaki tartışmalar, termal kağıttaki BPA içeriği hakkındaki endişeleri ve BPA içermeyen alternatiflerin veya darbe ya da nokta vuruşlu yazıcılar gibi farklı baskı teknolojilerinin kullanılmasına yönelik önerileri içermektedir. - Durdurulan Little Printer ile karşılaştırmalar yapılmakta ve Guten'in geliştirici dostu olmasının ve özelleştirme seçeneklerinin artırılması için önerilerde bulunulmakta, termal kağıdın çevresel ve sağlık üzerindeki etkileri de göz önünde bulundurulmaktadır."
    ],
    "points": 227,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1736048832
  }
]
