[
  {
    "id": 42599189,
    "title": "शोधकर्ताओं ने पहनने योग्य तकनीक डिजाइन की है जो ग्लूकोज स्तर को अधिक सटीकता से माप सकती है।",
    "originLink": "https://uwaterloo.ca/news/media/no-more-needles-tracking-blood-sugar-your-wrist",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599189",
    "commentBody": "",
    "originSummary": [
      "वाटरलू विश्वविद्यालय के शोधकर्ताओं ने एक पहनने योग्य उपकरण बनाया है जो रडार तकनीक का उपयोग करके बिना किसी सुई के ग्लूकोज स्तर की निगरानी करता है।",
      "डॉ. जॉर्ज शैकर के नेतृत्व में यह उपकरण एक रडार चिप, सिग्नल की सटीकता बढ़ाने के लिए एक मेटा-सतह, और सटीक ग्लूकोज रीडिंग के लिए एआई एल्गोरिदम को शामिल करता है।",
      "वर्तमान में यूएसबी-पावर्ड, यह उपकरण बेहतर पोर्टेबिलिटी के लिए बैटरी-ऑपरेटेड बनने का लक्ष्य रखता है और अंततः अतिरिक्त स्वास्थ्य मेट्रिक्स की निगरानी कर सकता है, जिसमें प्रौद्योगिकी को व्यावसायिक बनाने के प्रयास जारी हैं।"
    ],
    "commentSummary": [
      "शोधकर्ताओं ने गैर-आक्रामक ग्लूकोज निगरानी के लिए पहनने योग्य तकनीक विकसित की है, जो उंगली चुभाने और निरंतर ग्लूकोज मॉनिटर (CGMs) का एक विकल्प प्रदान करती है।",
      "यह तकनीक रक्तप्रवाह के सीधे संपर्क के बिना सटीक ग्लूकोज रीडिंग प्रदान करने का लक्ष्य रखती है, जो नैदानिक अनुप्रयोगों के लिए महत्वपूर्ण हो सकती है।",
      "हालांकि यह आशाजनक है, लेकिन इसकी सटीकता को लेकर मौजूदा सीजीएम की तुलना में संदेह है, और इसकी प्रभावशीलता की पुष्टि के लिए और अधिक डेटा और नैदानिक परीक्षणों की आवश्यकता है।"
    ],
    "points": 324,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1736043133
  },
  {
    "id": 42601847,
    "title": "जिस दिन मैंने एआई को एक वरिष्ठ डेवलपर की तरह कोड पढ़ना सिखाया",
    "originLink": "https://nmn.gl/blog/ai-senior-developer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42601847",
    "commentBody": "",
    "originSummary": [
      "एआई को शुरू में React कोडबेस का विश्लेषण करने में चुनौती दी गई थी, जैसे कि एक नौसिखिया डेवलपर। - वरिष्ठ डेवलपर्स की रणनीतियों की नकल करके, जैसे कि मुख्य फाइलों पर ध्यान केंद्रित करना और परिवर्तनों को फीचर के अनुसार समूहित करना, एआई के कोड विश्लेषण में काफी सुधार हुआ। - ध्यान कोड की समझ को बढ़ाने पर है न कि निर्माण पर, भविष्य की योजनाओं में तकनीकी ऋण की पहचान करना और टीम की परंपराओं को समझना शामिल है।"
    ],
    "commentSummary": [
      "लेख में एक वरिष्ठ डेवलपर की दक्षता के साथ कोड पढ़ने और विश्लेषण करने के लिए एआई को प्रशिक्षित करने की चुनौतियों का पता लगाया गया है, जिसमें लगातार और सटीक परिणाम प्राप्त करने में कठिनाई का उल्लेख किया गया है।",
      "यह कोड विश्लेषण में एआई के प्रदर्शन को बढ़ाने के लिए संदर्भ प्रदान करने और इनपुट को संरचित करने के महत्व पर जोर देता है, जबकि एआई की वर्तमान क्षमताओं के बारे में संदेह को स्वीकार करता है।",
      "चर्चा में एआई के प्रदर्शन को मान्य करने के लिए आगे के प्रयोग और मूल्यांकन की आवश्यकता पर जोर दिया गया है और सॉफ्टवेयर विकास में एआई के व्यापक प्रभाव और संभावित प्रगति पर विचार किया गया है।"
    ],
    "points": 293,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1736086519
  },
  {
    "id": 42599102,
    "title": "वेब पेज की परेशानियाँ जो मैं यहाँ आप पर नहीं थोपता",
    "originLink": "http://rachelbythebay.com/w/2025/01/04/cruft/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599102",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "लेखक उपयोगकर्ता अनुभव को बेहतर बनाने के लिए कुछ वेब सुविधाओं जैसे स्टिकी बार, फोर्स्ड SSL/TLS, पॉप-अप्स, और अनावश्यक ट्रैकिंग का उपयोग करने से बचते हैं।",
      "सुरक्षा के लिए HTTPS की आवश्यकता बनाम पुराने ब्राउज़रों के साथ इसकी संगतता समस्याओं के बारे में एक चल रही बहस है।",
      "चर्चा उपयोगकर्ता अनुभव को आधुनिक वेब प्रथाओं के साथ संतुलित करने की चुनौती को उजागर करती है।"
    ],
    "points": 248,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1736042093
  },
  {
    "id": 42600846,
    "title": "कैसे नैट ट्रैवर्सल काम करता है (2020)",
    "originLink": "https://tailscale.com/blog/how-nat-traversal-works",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42600846",
    "commentBody": "",
    "originSummary": [
      "एनएटी ट्रैवर्सल नेटवर्क एड्रेस ट्रांसलेटर्स (एनएटी) और फायरवॉल की उपस्थिति के बावजूद, यूडीपी-आधारित प्रोटोकॉल और डायरेक्ट सॉकेट नियंत्रण का उपयोग करके सीधे डिवाइस कनेक्शन को सक्षम बनाता है।",
      "STUN (सेशन ट्रैवर्सल यूटिलिटीज फॉर NAT) जैसी तकनीकें सार्वजनिक IP पतों की खोज में मदद करती हैं, जबकि TURN (ट्रैवर्सल यूज़िंग रिले अराउंड NAT) या Tailscale का DERP जैसी रिले अधिक चुनौतीपूर्ण NATs के लिए उपयोग की जाती हैं।",
      "आईसीई (इंटरएक्टिव कनेक्टिविटी एस्टैब्लिशमेंट) प्रोटोकॉल सभी संभावित विकल्पों का मूल्यांकन करके और सबसे कुशल विकल्प का चयन करके कनेक्शन पथों को अनुकूलित करता है, जिससे एंड-टू-एंड एन्क्रिप्शन और प्रमाणीकरण के साथ मजबूत एनएटी ट्रैवर्सल सुनिश्चित होता है।"
    ],
    "commentSummary": [
      "लेख NAT (नेटवर्क एड्रेस ट्रांसलेशन) ट्रैवर्सल की जांच करता है, TCP (ट्रांसमिशन कंट्रोल प्रोटोकॉल) और UDP (यूजर डेटाग्राम प्रोटोकॉल) होल पंचिंग के बीच के अंतर पर जोर देते हुए, TCP की थोड़ी अधिक जटिलता को नोट करता है।",
      "यह NAT को एक सुरक्षा सुविधा के रूप में देखने की धारणा को चुनौती देता है और NAT ट्रैवर्सल के लिए Tailscale की विधि पर चर्चा करता है, जो सुरक्षा के लिए केवल सॉफ़्टवेयर ACLs (एक्सेस कंट्रोल लिस्ट) पर निर्भर रहने के बारे में चिंताएँ उठाता है।",
      "चर्चा सुरक्षित एंडपॉइंट्स के महत्व को उजागर करती है और NAT ट्रैवर्सल के संदर्भ में पारंपरिक नेटवर्क सुरक्षा रणनीतियों की सीमाओं की आलोचना करती है।"
    ],
    "points": 233,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1736072158
  },
  {
    "id": 42599599,
    "title": "गुटेन: एक छोटा समाचार पत्र प्रिंटर",
    "originLink": "https://amanvir.com/guten",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42599599",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "गुटेन एक छोटे पैमाने का समाचार पत्र प्रिंटर प्रोजेक्ट है, जिसे मुद्रित रूप में समाचार प्रदान करके स्क्रीन समय को कम करने के लिए डिज़ाइन किया गया है। - परियोजना के चारों ओर चर्चाओं में थर्मल पेपर में बीपीए सामग्री के बारे में चिंताएं शामिल हैं और बीपीए-मुक्त विकल्पों या प्रभाव या डॉट-मैट्रिक्स प्रिंटर जैसी विभिन्न मुद्रण तकनीकों का उपयोग करने के सुझाव दिए गए हैं। - बंद किए गए लिटिल प्रिंटर की तुलना की जाती है, जिसमें गुटेन की डेवलपर-मित्रता और अनुकूलन विकल्पों को बढ़ाने के लिए सिफारिशें दी जाती हैं, साथ ही थर्मल पेपर के पर्यावरणीय और स्वास्थ्य प्रभावों पर विचार किया जाता है।"
    ],
    "points": 227,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1736048832
  }
]
