[
  {
    "id": 42753396,
    "title": "TikTok menjadi gelap di AS",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "",
    "originSummary": [
      "TikTok mengalami penutupan sementara di AS karena larangan federal, tetapi layanan mulai dipulihkan pada siang hari Minggu.",
      "Tindakan pelarangan tersebut didorong oleh kekhawatiran terhadap potensi pengawasan oleh China, dengan dukungan bipartisan untuk mewajibkan ByteDance, pemilik TikTok, menjual aplikasi tersebut.",
      "Presiden terpilih Donald Trump menyarankan untuk menunda larangan tersebut dan mengusulkan usaha patungan dengan kepemilikan AS sebagai solusi potensial, sementara aplikasi alternatif semakin populer selama larangan tersebut."
    ],
    "commentSummary": [
      "TikTok dilarang di AS telah memicu diskusi tentang privasi data dan pengaruh geopolitik, dengan kekhawatiran yang berpusat pada kepemilikan Tiongkok. Larangan ini dianggap oleh beberapa orang sebagai langkah keamanan nasional, sementara yang lain melihatnya sebagai pembatasan kebebasan berbicara dan potensi keuntungan bagi perusahaan teknologi Amerika. Situasi ini telah mendorong perdebatan tentang menyeimbangkan keamanan dengan kebebasan dan dampak entitas asing pada media domestik."
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "Tutorial Filter Kalman",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "",
    "originSummary": [
      "KalmanFilter.NET menyediakan tutorial tentang Kalman Filter, sebuah alat matematika untuk memperkirakan dan memprediksi keadaan sistem dalam kondisi yang tidak pasti, yang umumnya digunakan dalam pelacakan dan navigasi.",
      "Tutorial ini, yang dimulai pada tahun 2017, mencakup contoh numerik dan penjelasan intuitif, meliputi Kalman Filter univariat dan multivariat, dan telah berkembang ke topik lanjutan seperti Kalman Filter non-linear.",
      "Sebuat buku berdasarkan tutorial ini menawarkan panduan komprehensif dari dasar hingga topik lanjutan, dengan contoh ilustratif dan aplikasi praktis, membuat Filter Kalman dapat diakses dan dipahami, dengan beberapa bagian tersedia secara gratis."
    ],
    "commentSummary": [
      "Untuk memahami Kalman Filter, ada baiknya mempelajari terlebih dahulu Least Squares, recursive Least Squares, dan Information Filter, karena Kalman Filter adalah reformulasi yang efisien dari recursive Least Squares.",
      "Filter Kalman adalah alat yang kuat untuk estimasi keadaan dalam sistem dengan kebisingan dan perubahan dinamis, dan dapat dipahami dari perspektif prosedural maupun Bayesian.",
      "Walaupun ketelitian matematis sangat penting untuk pemahaman yang mendalam, mereka yang tidak memiliki latar belakang matematika yang kuat masih dapat menjelajahi konsep-konsep tersebut melalui cara intuitif, didukung oleh berbagai sumber seperti PDF dan tutorial online."
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "Forgejo: Sebuah perangkat lunak forge ringan yang di-host sendiri",
    "originLink": "https://forgejo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "",
    "originSummary": [
      "Forgejo adalah perangkat lunak forge yang di-host sendiri yang menekankan keamanan, skalabilitas, federasi, dan privasi, dikembangkan oleh komunitas di bawah Codeberg e.V.",
      "Itu berfungsi sebagai alternatif Perangkat Lunak Bebas untuk GitHub, menawarkan proses instalasi yang mudah dan perawatan rendah untuk manajemen proyek yang efisien.",
      "Forgejo dirancang untuk efisien dalam penggunaan sumber daya, mendorong kolaborasi dan produktivitas, serta mendukung inovasi dalam pengembangan perangkat lunak terdesentralisasi."
    ],
    "commentSummary": [
      "Forgejo adalah perangkat lunak forge yang di-host sendiri dan ringan, berfungsi sebagai alternatif untuk GitHub, dan dikelola oleh organisasi nirlaba tanpa penjualan premium. Forgejo berasal dari fork Gitea, setelah Gitea beralih ke komersialisasi, dan menekankan lisensi bebas serta didorong oleh komunitas. Forgejo dikenal karena penggunaan sumber daya yang rendah, kemudahan pembaruan, dan pengembangan fitur federasi, menjadikannya ideal untuk hosting pribadi atau skala kecil."
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
