[
  {
    "id": 42753396,
    "title": "تيك توك يظلم في الولايات المتحدة",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "",
    "originSummary": [
      "تعرض تطبيق تيك توك لإغلاق مؤقت في الولايات المتحدة بسبب حظر فدرالي، لكن الخدمة بدأت في العودة بحلول ظهر يوم الأحد.",
      "تم حظر التطبيق بسبب مخاوف من احتمال وجود مراقبة صينية، مع دعم من الحزبين لطلب بيع التطبيق من قبل شركة ByteDance، مالكة تيك توك.",
      "اقترح الرئيس المنتخب دونالد ترامب تأجيل الحظر وقدم اقتراحًا بمشروع مشترك مع ملكية أمريكية كحل محتمل، بينما اكتسبت التطبيقات البديلة شعبية خلال فترة الحظر."
    ],
    "commentSummary": [
      "أثار حظر تطبيق تيك توك في الولايات المتحدة نقاشات حول خصوصية البيانات والنفوذ الجيوسياسي، مع تركز المخاوف حول ملكيته الصينية. يُنظر إلى الحظر من قبل البعض كإجراء للأمن القومي، بينما يراه آخرون كقيد على حرية التعبير وميزة محتملة لشركات التكنولوجيا الأمريكية. وقد دفعت هذه الحالة إلى مناقشات حول تحقيق التوازن بين الأمن والحرية وتأثير الكيانات الأجنبية على وسائل الإعلام المحلية."
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "دليل مرشح كالمان",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "",
    "originSummary": [
      "يوفر KalmanFilter.NET درسًا تعليميًا حول مرشح كالمان، وهو أداة رياضية لتقدير وتوقع حالات النظام في ظروف غير مؤكدة، ويستخدم بشكل شائع في التتبع والملاحة.",
      "تم بدء البرنامج التعليمي في عام 2017، ويشمل أمثلة رقمية وتفسيرات توضيحية، تغطي كل من مرشحات كالمان أحادية المتغير ومتعددة المتغيرات، وقد توسع ليشمل مواضيع متقدمة مثل مرشحات كالمان غير الخطية.",
      "يقدم كتاب يعتمد على الدليل التعليمي دليلاً شاملاً من الأساسيات إلى المواضيع المتقدمة، مع أمثلة توضيحية وتطبيقات عملية، مما يجعل مرشح كالمان متاحًا ومفهومًا، مع توفر بعض الأجزاء مجانًا."
    ],
    "commentSummary": [
      "لفهم مرشح كالمان، من المفيد أولاً دراسة المربعات الصغرى، المربعات الصغرى التكرارية، ومرشح المعلومات، حيث إن مرشح كالمان هو إعادة صياغة فعالة للمربعات الصغرى التكرارية.",
      "يُعتبر مرشح كالمان أداة قوية لتقدير الحالة في الأنظمة التي تحتوي على ضوضاء وتغيرات ديناميكية، ويمكن فهمه من منظورين: الإجرائي والبايزي.",
      "بينما يُعتبر الدقة الرياضية أمرًا حاسمًا لفهم عميق، يمكن لأولئك الذين ليس لديهم خلفية قوية في الرياضيات استكشاف المفاهيم بوسائل استدلالية، مدعومة بموارد متنوعة مثل ملفات PDF والدروس التعليمية عبر الإنترنت."
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "Forgejo: منصة برمجيات خفيفة الوزن مستضافة ذاتيًا",
    "originLink": "https://forgejo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "",
    "originSummary": [
      "Forgejo هو منصة برمجية مستضافة ذاتيًا تركز على الأمان، القابلية للتوسع، الاتحاد، والخصوصية، تم تطويرها من قبل المجتمع تحت إشراف Codeberg e.V.",
      "يعمل كبديل للبرمجيات الحرة لـ GitHub، حيث يوفر عملية تثبيت سهلة وصيانة منخفضة لإدارة المشاريع بكفاءة.",
      "تم تصميم Forgejo ليكون فعالًا في استخدام الموارد، مما يعزز التعاون والإنتاجية، ويدعم الابتكار في تطوير البرمجيات اللامركزية."
    ],
    "commentSummary": [
      "Forgejo هو منصة برمجية خفيفة الوزن تُستضاف ذاتيًا، وتعمل كبديل لـ GitHub، وتُدار من قبل منظمة غير ربحية دون عروض ترويجية مدفوعة. نشأت كفرع من Gitea، بعد تحول Gitea نحو التجارية، وتؤكد على كونها مرخصة بحرية ومدفوعة من قبل المجتمع. يُلاحظ أن Forgejo يتميز بانخفاض استخدام الموارد، وسهولة التحديثات، وتطوير ميزات الاتحاد، مما يجعله مثاليًا للاستضافة الشخصية أو الصغيرة النطاق."
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
