[
  {
    "id": 42753396,
    "title": "टिकटॉक अमेरिका में बंद हो गया",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "",
    "originSummary": [
      "टिकटॉक को अमेरिका में एक संघीय प्रतिबंध के कारण अस्थायी रूप से बंद कर दिया गया था, लेकिन रविवार दोपहर तक सेवा बहाल होने लगी।",
      "प्रतिबंध चीनी निगरानी की संभावनाओं को लेकर चिंताओं से प्रेरित था, जिसमें बाइटडांस, टिकटॉक के मालिक, को ऐप बेचने की आवश्यकता के लिए द्विदलीय समर्थन था।",
      "राष्ट्रपति-निर्वाचित डोनाल्ड ट्रंप ने प्रतिबंध को टालने का सुझाव दिया और अमेरिकी स्वामित्व के साथ एक संयुक्त उद्यम को एक संभावित समाधान के रूप में प्रस्तावित किया, जबकि प्रतिबंध के दौरान वैकल्पिक ऐप्स की लोकप्रियता बढ़ी।"
    ],
    "commentSummary": [
      "अमेरिका में TikTok पर प्रतिबंध ने डेटा गोपनीयता और भू-राजनीतिक प्रभाव पर चर्चाओं को प्रज्वलित कर दिया है, जिसमें इसके चीनी स्वामित्व के इर्द-गिर्द चिंताएं केंद्रित हैं। कुछ लोगों द्वारा इस प्रतिबंध को राष्ट्रीय सुरक्षा उपाय के रूप में देखा जा रहा है, जबकि अन्य इसे अभिव्यक्ति की स्वतंत्रता पर एक सीमा और अमेरिकी तकनीकी कंपनियों के लिए संभावित लाभ के रूप में देखते हैं। इस स्थिति ने सुरक्षा और स्वतंत्रता के संतुलन और घरेलू मीडिया पर विदेशी संस्थाओं के प्रभाव पर बहस को प्रेरित किया है।"
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "कलमैन फिल्टर ट्यूटोरियल",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "",
    "originSummary": [
      "KalmanFilter.NET कलमैन फिल्टर पर एक ट्यूटोरियल प्रदान करता है, जो अनिश्चित परिस्थितियों में सिस्टम की अवस्थाओं का अनुमान लगाने और भविष्यवाणी करने के लिए एक गणितीय उपकरण है, जिसे आमतौर पर ट्रैकिंग और नेविगेशन में उपयोग किया जाता है।",
      "2017 में शुरू की गई इस ट्यूटोरियल में संख्यात्मक उदाहरण और सहज व्याख्याएँ शामिल हैं, जो एकविवरणीय और बहुविवरणीय कालमैन फिल्टर दोनों को कवर करती हैं, और अब यह गैर-रेखीय कालमैन फिल्टर जैसे उन्नत विषयों तक विस्तारित हो गई है।",
      "ट्यूटोरियल पर आधारित एक पुस्तक बुनियादी से लेकर उन्नत विषयों तक एक व्यापक मार्गदर्शिका प्रदान करती है, जिसमें चित्रात्मक उदाहरण और व्यावहारिक अनुप्रयोग शामिल हैं, जिससे कलमैन फ़िल्टर को सुलभ और समझने योग्य बनाया गया है, और कुछ भाग मुफ्त में उपलब्ध हैं।"
    ],
    "commentSummary": [
      "कलमैन फिल्टर को समझने के लिए, पहले लीस्ट स्क्वेयर्स, रिकर्सिव लीस्ट स्क्वेयर्स, और इंफॉर्मेशन फिल्टर का अध्ययन करना लाभकारी होता है, क्योंकि कलमैन फिल्टर रिकर्सिव लीस्ट स्क्वेयर्स का एक कुशल पुनर्गठन है।",
      "कलमैन फिल्टर शोर और गतिशील परिवर्तनों वाले प्रणालियों में स्थिति अनुमान के लिए एक शक्तिशाली उपकरण है, और इसे प्रक्रियात्मक और बेयesian दृष्टिकोण दोनों से समझा जा सकता है।",
      "जबकि गहन समझ के लिए गणितीय कठोरता महत्वपूर्ण है, जो लोग मजबूत गणितीय पृष्ठभूमि नहीं रखते हैं, वे अभी भी विभिन्न संसाधनों जैसे पीडीएफ और ऑनलाइन ट्यूटोरियल के माध्यम से सहज तरीकों से अवधारणाओं का अन्वेषण कर सकते हैं।"
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "फॉरजो: एक स्व-होस्टेड हल्का सॉफ्टवेयर फोर्ज",
    "originLink": "https://forgejo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "",
    "originSummary": [
      "फॉरजो एक स्व-होस्टेड सॉफ़्टवेयर फोर्ज है जो सुरक्षा, स्केलेबिलिटी, संघीयता, और गोपनीयता पर जोर देता है, जिसे कोडबर्ग ई.वी. के तहत समुदाय द्वारा विकसित किया गया है।",
      "यह GitHub के लिए एक मुक्त सॉफ़्टवेयर विकल्प के रूप में कार्य करता है, जो कुशल परियोजना प्रबंधन के लिए आसान स्थापना प्रक्रिया और कम रखरखाव प्रदान करता है।",
      "फॉरजो को संसाधन-कुशलता के लिए डिज़ाइन किया गया है, जो सहयोग और उत्पादकता को बढ़ावा देता है, और विकेंद्रीकृत सॉफ़्टवेयर विकास में नवाचार का समर्थन करता है।"
    ],
    "commentSummary": [
      "फॉरजो एक स्व-होस्टेड, हल्का सॉफ्टवेयर फोर्ज है, जो गिटहब के विकल्प के रूप में कार्य करता है, और इसे एक गैर-लाभकारी संगठन द्वारा प्रबंधित किया जाता है जिसमें कोई प्रीमियम अपसेल नहीं होता। यह गिटिया के एक फोर्क के रूप में उत्पन्न हुआ, जब गिटिया ने व्यावसायीकरण की ओर रुख किया, और यह स्वतंत्र रूप से लाइसेंस प्राप्त और समुदाय-चालित होने पर जोर देता है। फॉरजो को इसके कम संसाधन उपयोग, अपडेट की आसानी, और फेडरेशन फीचर्स के विकास के लिए जाना जाता है, जो इसे व्यक्तिगत या छोटे पैमाने पर होस्टिंग के लिए आदर्श बनाता है।"
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
