[
  {
    "id": 42753396,
    "title": "TikTok goes dark in the US",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "TikTok went dark in the U.S. on Saturday night as a result of a federal law that bans the popular short-form video app for millions of Americans. However, the company began restoring service by midday Sunday. TikTok users began receiving a message about the ban around 10:30 p.m. Eastern on Saturday evening, and the app also disappeared from the Apple and Google Play app stores. As of Sunday morning, some users in the U.S. could still access TikTok via the web. “Sorry, TikTok isn’t available right now,” the company’s message reads. “A law banning TikTok has been enacted in the U.S. Unfortunately, that means you can’t use TikTok for now.” The message also suggested this might only be a temporary disappearance. TikTok credited President-elect Donald Trump for indicating “he will work with us on a solution to reinstate TikTok once he takes office,” with users urged to “stay tuned!” The company warned earlier this week the app’s disappearance was imminent, saying Friday that it would “go dark” unless President Joe Biden’s administration made a “definitive statement” that it wouldn’t enforce the ban. Bipartisan majorities in the House and Senate passed a law last April requiring TikTok’s owner ByteDance to either sell the app or see it banned in the United States due to concerns over potential Chinese surveillance and propaganda, with Biden quickly signing the bill. And while efforts to force ByteDance to divest go back to Trump’s first administration, he has taken a different tone recently. Trump asked the Supreme Court to delay the ban and said he would “most likely” give the company a 90-day extension. The Supreme Court issued a ruling upholding the law Friday; and the Biden administration seemed inclined to leave the app’s fate in the hands of the next president. White House Press Secretary Karine Jean-Pierre noted that with the law taking effect right before Trump’s inauguration on Monday, “actions to implement the law simply must fall to the next Administration.” Deputy Attorney General Lisa Monaco issued a similar statement that “the next phase of this effort — implementing and ensuring compliance with the law after it goes into effect on January 19 — will be a process that plays out over time.” TikTok, however, suggested this was not enough assurance for “critical service providers” to continue listing or hosting the app in the United States unless the Biden administration made the aforementioned “definitive statement.” Jean-Pierre called TikTok’s response “a stunt” and claimed there’s “no reason for TikTok or other companies to take actions in the next few days before the Trump administration takes office on Monday.” As for the app’s long-term prospects, Trump has said he plans to “negotiate a resolution” that would presumably involve a sale or other concessions from ByteDance, which has repeatedly said it’s not interested in selling yet seems optimistic about its prospects under Trump. Trump reiterated to NBC News on Saturday that he will “most likely” give TikTok a 90-day reprieve from the ban once he takes office Monday. “I think that would be, certainly, an option that we look at. The 90-day extension is something that will be most likely done, because it’s appropriate. You know, it’s appropriate. We have to look at it carefully. It’s a very big situation,” Trump told the outlet. On Sunday morning, he posted that he would issue an executive order Monday delaying the ban, and he also expressed interest in a “a joint venture between the current owners and/or new owners whereby the U.S. gets a 50% ownership.” Many potential buyers have thrown their hats in the ring, hoping for a shot at TikTok’s 170 million users, from billionaire Frank McCourt making a “people’s bid” to Perplexity AI proposing a merger. There was even a report suggesting that the Chinese government was considering a sale to Elon Musk as part of a broader deal with the Trump administration. A TikTok spokesperson called that report “pure fiction.” In the meantime, alternative Chinese-owned apps like RedNote and Lemon8 have received a boost as TikTok users search for alternatives. However, Lemon8 — which is also owned by ByteDance — is among the other apps that are now blocked. This post has been updated to reflect that TikTok is restoring service. It was previously updated to reflect Trump’s statements Sunday morning, as well as the additional apps that have been blocked by the law. Topics App, Apps, ban, bytedance, Government & Policy, Social, social media, TikTok, TikTok Ban Kyle Wiggers Senior Reporter, Enterprise Kyle Wiggers is a senior reporter at TechCrunch with a special interest in artificial intelligence. His writing has appeared in VentureBeat and Digital Trends, as well as a range of gadget blogs including Android Police, Android Authority, Droid-Life, and XDA-Developers. He lives in Brooklyn with his partner, a piano educator, and dabbles in piano himself. occasionally — if mostly unsuccessfully. View Bio Anthony Ha Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. View Bio Most Popular TikTok is restoring service in the US Anthony Ha Apple lists all apps it removed alongside TikTok in the U.S. Ivan Mehta Perplexity AI submits bid to merge with TikTok Anthony Ha DOJ confirms arrested US Army soldier is linked to AT&T and Verizon hacks Zack Whittaker As TikTok faces a US shutdown, here are some alternative apps to check out Aisha Malik Google begins requiring JavaScript for Google Search Kyle Wiggers How to delete Facebook, Instagram, and Threads Rebecca Bellan Newsletters See More Subscribe for the industry’s biggest tech news TechCrunch Daily News Every weekday and Sunday, you can get the best of TechCrunch’s coverage. Add TechCrunch Daily News to your subscription choices TechCrunch AI TechCrunch's AI experts cover the latest news in the fast-moving field. Add TechCrunch AI to your subscription choices TechCrunch Space Every Monday, gets you up to speed on the latest advances in aerospace. Add TechCrunch Space to your subscription choices Startups Weekly Startups are the core of TechCrunch, so get our best coverage delivered weekly. Add Startups Weekly to your subscription choices No newsletters selected. Subscribe By submitting your email, you agree to our Terms and Privacy Notice. Related Breaking TikTok is restoring service in the US Anthony Ha 55 minutes ago Government & Policy Trump says he will delay TikTok ban, suggests a joint venture with US ownership Anthony Ha 2 hours ago Apps Apple lists all apps it removed alongside TikTok in the U.S. Ivan Mehta 11 hours ago Latest in Social See More Breaking TikTok is restoring service in the US Anthony Ha 55 minutes ago Social TikTok goes dark in the US Kyle Wiggers Anthony Ha 2 hours ago Government & Policy Trump says he will delay TikTok ban, suggests a joint venture with US ownership Anthony Ha 2 hours ago",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "TikTok goes dark in the US (techcrunch.com)1132 points by mfiguiere 15 hours agohidepastfavorite2259 comments dang 50 minutes agoNext thread in the sequence: TikTok says it is restoring service for U.S. users after Trump comments https://news.ycombinator.com/item?id=42759336 Jan 2025 (22 comments) reply AirMax98 14 hours agoprevIt's a shame that it's come to this. I feel that all arguments that TikTok is unhealthy or spyware and bad for our general public are valid, but the same arguments also apply to Instagram/Twitter/Whatever. Rather than have some sort of further regulation for what data any application can collect and present to Americans, we've just brought the hammer down on the millions of people that use this application for their livelihood. This serves only to enrich our American tech monopolies — companies which have proven to us that they have bad intentions towards our country's people. Truly bleak. reply wilg 13 hours agoparentNone of those arguments are the salient one, which is that a geopolitical adversary has control over a major influence vector on US public opinion. They could simply have divested. reply t0bia_s 12 hours agorootparent\"...there is now a widespread tendency to argue that one can only defend democracy by totalitarian methods. If one loves democracy, the argument runs, one must crush its enemies by no matter what means. And who are its enemies? It always appears that they are not only those who attack it openly and consciously, but those who ‘objectively’ endanger it by spreading mistaken doctrines. In other words, defending democracy involves destroying all independence of thought.\" Geroge Orwell Proposed preface to Animal Farm, first published in the Times Literary Supplement on 15 September 1972 https://www.orwellfoundation.com/the-orwell-foundation/orwel... reply low_tech_love 10 hours agorootparentSo the alternative is to defend democracy by letting a foreign authoritarian entity take over your country in the name of (their) freedom? I don’t get how can Americans be so insecure about themselves and have such fragile trust in what they can achieve as a country. This idea that foreign authoritarian regimes should be respected as much as their own people and system is just baffling. reply jfengel 1 hour agorootparentRemember that Americans are already at each other's throats. Half the country is literally terrified about what will happen tomorrow. The other half of the country is ecstatic. For at least some of them, they are looking forward to doing exactly what the other half fears. The rest are relieved that they will not have to undergo the terrors and tribulations of the last four years. The country is constantly on a knife edge. It takes only a tiny shift to cause a radical change in the power structure, and good reason to think that power structure will be used against you. It is indeed remarkable that the country has achieved anything at all when it spends so much time cowering. Nor is that new, but modern media seem to give it more immediacy. reply jumpman500 1 hour agorootparentThere was only 64% election turnout in 2024. People are not as politically radicalized and polarized as media companies say to increase engagement. Some people are, but the problem is being exaggerated for clicks and views. reply cpursley 56 minutes agorootparentprevI'm guessing that you live on one of the coasts and mostly associate with certain classes of people? In the real world, people are not at each others throats. They're mostly interested in talking about their kids, the price of milk, sportsball and debating the best way to prepare briquet. Take a deep breath, we're all gonna be okay. reply woooooo 1 hour agorootparentprevI'm struck by the complete lack of confidence in statements like this. We've got the whole world wearing blue jeans and listening to our music, mostly communicating on our tech platforms. English is the default language for international business. One Chinese social media company and its game over? Have some faith in your culture. reply t0bia_s 8 hours agorootparentprev\"an eye for an eye, a tooth for a tooth\" is solution to you? Respect doesn't mean that you have to agree. If you believe that something is wrong, use arguments, educate, inform... It's hard to implement pathological behaviour in well informed and educated society. Fragile society, however, is easier to be manipulated with and lead to hate, violence and wars. reply herval 4 hours agorootparent“Tit for that” is a solution for the USA on a great deal of topics, from reciprocal taxes to reciprocal visa requirements for travel. Why not reciprocate social media site access too? It’s just another product after all? reply r33b33 5 hours agorootparentprev> \"an eye for an eye, a tooth for a tooth\" is solution to you? What's wrong with this solution? reply Barracoon 1 hour agorootparentIt makes the whole world blind reply cocacola1 12 minutes agorootparentNo, there'd be one person left with an eye. They could just dodge the last blind person. mattxxx 4 hours agorootparentprevagreeing with the point the question makes here; the game theory of global politics does not work with the same morals that we prescribe individual people reply swat535 4 hours agorootparentprevI agree, a \"well informed\" society would be wonderful but we have a long way to get there and even then, highly educated people are not immune to misinformation and propaganda. Not everything is black and white, there are always shades of grey and these are difficult to navigate. I think imposing certain limits on various freedoms, including speech is required for a functioning democracy. I also believe that there are deeper issues if the populace of a nation no longer respect the decisions made by its highest court of law. reply bgun 49 minutes agorootparentprev“Fragile” trust? That trust has been beaten out of us at every turn for an entire generation. There is nothing fragile about American exceptionalism or the dream of achievement; we’ve just been shown repeatedly that we are becoming the third-world bully regime in the eyes of the world and, increasingly, in our own. Every bad thing we’ve been taught to believe about China or Russia, it turns out we do too and often worse. So what loyalty should we have? What has democracy and capitalism done for us but bankrupt our seniors with medical debt and addict our children to iPads and amphetamines? I’d love to be able to trust my government and the American ideal again, but don’t tell me I’m weak for second-guessing the whole con game this century is turning into. reply wilg 46 minutes agorootparentthe problem is basically your whole worldview is wrong reply bgun 13 minutes agorootparentThis feels like a shallow dismissal, and I’d love to understand what you’re trying to communicate in more depth. reply WhaleClub 9 hours agorootparentprevThe UK and Australia are much more insecure https://x.com/ausvstheagenda/status/1880136652678656311 https://x.com/PlanetOfMemes/status/1865399407220306313 reply ruszki 7 hours agorootparentSince the general positive sum game is breaking down all around the world, everybody should feel insecure, and you will be insecure, if you are not already. reply cpursley 54 minutes agorootparentprevThose aren't free countries (as in bill of rights levels of personal guarantees). reply undersuit 58 minutes agorootparentprevThere must be other options than banning Tiktok or losing to \"the enemy\". reply sneak 6 hours agorootparentprevAllowing free publishing isn’t allowing anyone to take over anything. reply wonnage 56 minutes agorootparentprevYou gotta get off Facebook and touch grass man reply ein0p 1 hour agorootparentprevDo you realize that the same exact logic can apply to any US company abroad? Not just social networking, _any_ company. We are everyone else's \"geopolitical adversary\" too. Or is it \"different\" and I \"don't understand\"? reply TiredOfLife 8 hours agorootparentprev> why? Years of TikTok usage reply DiogenesKynikos 9 hours agorootparentprevThis ban was precipitated by TikTok refusing to bow to pressure to censor (pro-Palestinian) content that American politicians don't like. The politics of this are exactly the opposite of that you're saying. This is about restricting democratic rights. reply boringg 5 hours agorootparentCould be the amount of online commentary when that war broke out was all encompassing. Almost like it was a highly volatile combination of an rightfully angry/scared population and paid information campaign by US foreign adversaries. reply greenie_beans 5 hours agorootparenthave you been on twitter? reply infecto 6 hours agorootparentprevDo you have evidence of this compared to what is known, that ByteDance China has in-office seats for the CCP? These conspiracies and what-aboutism make no sense to me. reply DiogenesKynikos 6 hours agorootparentMany American politicians, including the people leading the charge for the ban, have openly said that this is the reason. Senator Mitt Romney put it very bluntly [0]: > \"Some wonder why there was such overwhelming support for us to shut down potentially TikTok or other entities of that nature. If you look at the postings on TikTok and the number of mentions of Palestinians, relative to other social media sites it's overwhelmingly so among TikTok broadcasts.\" Or maybe Mitt Romney is just another conspiracy theorist? 0. https://www.axios.com/local/salt-lake-city/2024/05/06/senato... reply infecto 6 hours agorootparentNone of those 1A arguments held up and the SC decision did not use \"count of Palestinians\" AFAIK. I am sure some of the initial support was drummed up for reasons like what you mentioned but ultimately that is not why its being banned. But going back to your point, mentioning democratic rights for a CCP app is hilarious. reply DiogenesKynikos 5 hours agorootparentThat's why Mitt Romney thinks it was banned. The people who formulated the ban failed a few times previously, both because they couldn't gain enough political support to push it through and because it was legally shaky. The Gaza issue was what led to overwhelming support for a ban in the US Congress and Senate (as Romney says), and the ban was intentionally formulated in such a way as to try to legally sidestep the First Amendment question (in a highly dubious manner, but the SC isn't going to overrule Congress here). > mentioning democratic rights for a CCP app is hilarious. It's the most popular app in the United States. Calling it a \"CCP app\" is just braindead. Of course banning the most popular means of expression in a country because the people are expressing themselves in ways that political leaders disapprove of is anti-democratic. reply infecto 5 hours agorootparentAll major corporations in mainland China have direct ties to the CCP. To think otherwise is foolish, their business and government are intertwined. At the end of the day all ByteDance china had to do was divest their ownership in the company. I sympathize with you and agree the initial support definitely utilized the conflict in Gaza but it goes beyond the conflict and centers itself around the ability for the CCP to influence how the algorithm works. To not understand how much control the CCP has over mainland entities is surprising. reply DiogenesKynikos 4 hours agorootparent> their business and government are intertwined This completely depends on the company. There's no evidence that TikTok has been used as a Chinese propaganda vehicle, and the issue that led to TikTok being banned in the US was TikTok's refusal to bow to pressure to toe the line on Palestine/Israel. Unlike Facebook, TikTok did not suppress pro-Palestinian content, and that led to broad Congressional support for a ban. reply infecto 3 hours agorootparentSo have you done business in China or are you just guessing? I have and in China and other single party communist countries and absolutely all business, especially at large size have direct lines to the party. I am not sure how you can be so confidently incorrect. You can be some small time manufacturer and you are still beholden to your local governing party members with at the very least annual kickback gifts. You keep latching on this idea of Palestinian content. You do realize this is much larger than that conflict? reply Maxatar 50 minutes agorootparentI don't have much of a horse in this race, and I wouldn't consider myself pro or anti-China but I do a significant amount of business in China just shy of 9 figures annually in terms of revenue and I have never once dealt with their government in any way shape or form. I have absolutely no direct line to them, never given them any kickbacks, and I visit the country once or twice a year. I have no doubt that there are businesses that do have significant dealings with the CCP, I would never believe otherwise, but the idea that every company has to have a direct line to them is objectively untrue. I know many other people who also do business with China and its mostly the same story, none of us deal with the government and frankly I would be very uncomfortable if ever I had to. reply DiogenesKynikos 1 hour agorootparentprevI've spent plenty of time in China and know how things work there, in general. The idea that everything is run through the Communist Party is just a lazy, scaremongering generalization that's become increasingly popular in the US since 2016. There is such a thing as \"Trump Derangement Syndrome,\" and it's the anti-China derangement that has become the bipartisan consensus since Trump took office in 2016. The people pushing the ban say it's about Israel. Other Senators and Congresspeople say that's why they and their colleagues supported a ban. There were always some people who wanted to ban TikTok, but they were never able to get majority support in Congress until the issue of Israel came into play. Banning the most popular social media platform in the United States, a platform that more than half of Americans use, is a big deal. reply infecto 1 hour agorootparentSo you do business in China or you have visited China? You totally skirt the topic but it’s clear you lack knowledge of how business is done in China. reply luckylion 4 hours agorootparentprevYou can also read that as an example of his opinion that TikTok is selectively amplifying anti-Western sentiment. You _can_ go for \"it's all about Israel\", but you really don't have to. reply aprilthird2021 1 hour agorootparentOr you could just read the statements of various politicians of our government: Sen. Marsha Blackburn, R-Tenn: \"It would not be surprising that the Chinese-owned TikTok is pushing pro-Hamas content\" Sen. Marco Rubio, R-Fla.: \"We’ve seen TikTok used to downplay the Uyghur genocide, the status of Taiwan, and now Hamas terrorism\" And of course, Romney's explicit statement as well, when in context, it's actually far worse because it seems he is very concerned about lax fact checking on TikTok (which American social media platforms announced they are doing away with): https://xcancel.com/ggreenwald/status/1880979821901332773#m I fundamentally disagree with all of these representatives. Americans are allowed to view all sides of every geopolitical issue and make up their own minds and vote according to their own beliefs. We should never ever be \"shielded\" from propaganda because we are smart enough to vote for and lead democracy, so we should be trusted as smart enough to ingest any geopolitical information existing in the world. reply foobazgt 43 minutes agorootparentIt's one thing to be exposed to varying viewpoints, it's another thing to have a nation state wage propaganda campaigns against you on your home turf. If 999/1000 tiktoks you see are of one particular viewpoint, you don't think the audience is going to draw specific conclusions? Our species now has mis-information tools that we couldn't have possibly imagined even just a decade ago. We're in the midst of a real struggle to work out how your average person can identify it. It's disheartening how little progress has been made in this area. reply infecto 37 minutes agorootparentprevIs it not so much the exact topics but the control of a recommendation engine that’s at the hands of a government that is a general adversary to the West? reply llm_trw 6 hours agorootparentprevIf your democracy is so rotten that a few teens dancing can bring it down I have bad news. reply yoz-y 6 hours agorootparentTikTok is much more than “a few teens dancing”, for a huge swath of population it’s how they get their news and how they find stuff. reply stevenAthompson 58 minutes agorootparentIf you get news primarly from Tiktok you are ill-informed and should reconsider your information diet. reply t0bia_s 5 hours agorootparentprevI though TikTok algorithm won't let you choose what to find. reply llm_trw 6 hours agorootparentprevAnd if their lives weren't a end stage capitalist hell scape those news would have as much effect as Radio Moscow did during the cold war. It is only when a system is failing that it becomes susceptible to destruction by indifference. reply adrianN 5 hours agorootparentAnother plausible theory is that the literal billions that have been invested into optimizing content for hyper attention have led to improvements in propaganda methods since Radio Moscow. reply low_tech_love 2 hours agorootparentprevSo, in summary, you believe that since the USA is on its way down, it should not bother fighting back anymore? You might have a point, though. With the new administration and its explicit focus on short term populism, it’s hard to stand up for anything. reply llm_trw 24 minutes agorootparentIn summary the Us government should spend its time improving the lives of Americans, and not find better ways to lie them about the quality of their lives. reply wilg 44 minutes agorootparentprevor you just think it’s a hellscape because you’re bored and on your phone where people make money by telling you it’s a hellscape reply pxLplt 5 hours agorootparentprevTwo fantastic comments (yours and GP[lim_trw]) accurate summing of the state of affairs. reply ironyman 5 hours agorootparentprevThere was a classified briefing on Tiktok presented to Congress last year about why it is a threat to national security. No doubt the Intelligence Community had a good look inside Tiktok/Bytedance's network and determined it is not something we should allow to operate in this country. Similar story with Huawei. reply latentcall 1 hour agorootparentYes I also trust the federal government unequivocally and without question. They didn’t tell me any details but I don’t need any, their word is good enough. In fact I will tell others so they are aware of the new gospel. reply rayiner 52 minutes agorootparentYes, especially the same people who said Iraq had WMDs. Trust them implicitly. reply throwaway199956 1 hour agorootparentprevWhy only to the Congress, does not the American people have a right to know? Why be tight-lipped about it, certainly it's not some military or nuclear technology matter. reply llm_trw 5 hours agorootparentprevThere was one about Iraq too. Mushroom clouds in 45 minutes I believe was the highlight. reply Yiin 4 hours agorootparentThat's strawman that has nothing to do with this topic. If you follow this line of thought, everything that is discussed in classified briefings is being done in bad faith, which I agree is easy to argue for, because we tend to pick and remember only bad examples, lack of trust in the system probably doesn't help much either. So even if you're right about trusting Gov in general, your argument is still wrong. reply dambi0 2 hours agorootparentIf you follow your line of thought we could never point out that processes have made mistakes in the past. Yours is the only strawman. reply bdangubic 4 hours agorootparentprevany classified briefings on X/Twitter being controlled by an immigrant? :) reply op00to 5 hours agorootparentprevAre you really so dense as to not understand how social media is used to influence elections, and how that is significantly different from any media format that has previously existed? reply boringg 5 hours agorootparentprevYou don't believe that. So don't try and use that as justification. Alternatively if you do believe that you don't understand how power on media platforms works. reply vulcan1964 8 hours agorootparentprevAll \"governments\" are authoritarian. The USA was founded by authoritarian white slaveowners. So yes, Gen Z and TikTok users will definitely baffle all those who accept US imperialism above all else. Let's be honest: \"Democracy\" in the USA is and always has been a game for the rich, especially since the 1908s when Reagan and Thatcher decided that China should be the top dog in the world order. People just want to live happily. Simple as that. TikTok gives a lot of people a feeling, a snippet, of a little bit of freedom and connection with others. All US media makes people fearful FOX \"news\" is literally just fearmongering for boomers and their children who can't afford homes of their own. CNN and MSNBC is just fear mongering against boomers who watch FOX \"news\". Facebook/Meta/IG/WhatsApp is an extension of these fears into the virtual world and TikTok offers something better. Jokes on the USA though. RedNOTE is gonna close the cultural divide between America and China and Americans will realize just how far the boomer generation and those who have been elected to uphold boomer beliefs really left younger/current generations behind. China has won technologically and now begins the cultural victory. I can foresee, sadly, that there will be an unnecessary loss of lives in the short term however for both the USA and BRICS nations. Hopefully I wind up being wrong. reply infecto 7 hours agorootparentLots of hyperbole and feelings but not much evidence. TikTok is not some bastion of freedom, they did win with critical mass and a vastly superior algorithm. All media makes people fearful, you speak so highly of China but have you consumed mainland Chinese media before? It is like Fox on steroids, packed full with stories that paint China as the victor and America as a dangerous and silly country. Calling a victory in technology is laughable, mainland manufacturing is incredible, one of the best in the world. Products in China have caught up and in some spaces exceeded western brands. China is still missing out on innovation in high-tech, thats why they have been caught so frequently trying to steal corporate secrets. RedNOTE is not going to prove anything to americans except the disdain the Chinese have for Americans joining their social network and the level of censorship that exists in a mainland app. It is like you are a propaganda machine and ironic enough it reads just like a mainland Chinese news article. If there was a conflict everyone would lose out. I am surprised anyone would foreshadow it. China unlike Russia seems to still think through the lens of economic interests, I suspect nobody in the current regime would want any type of conflict. While they may have a military its entirely untested both equipment and men. reply latentcall 1 hour agorootparentBut America IS a dangerous and silly country. Source: I live here. reply infecto 36 minutes agorootparentI can already tell by your hyperbole and lack of critical discussion. It shows. reply jdasdf 2 hours agorootparentprev>So the alternative is to defend democracy by letting a foreign authoritarian entity take over your country in the name of (their) freedom? People being convinced to change their countries geopolitical policies seems to me a perfectly legitimate thing to do in a democracy. If the american people would like closer relations to china and vote accordingly that seems to me to be the whole point of democracy. China engaging and supporting that is also a perfectly legitimate means of achieving its goals, no? Or would you prefer that instead of convincing the american people of that, they should instead bribe or coerce their politicians behind closed fdoors? reply surfaceofthesun 10 hours agorootparentprevThe US government forcing spinoffs is a core tenant of antitrust enforcement. We’ve seen similar enforcement applied to other applications like Grindr [1]. The fundamental issue is ByteDance ownership. Forced divestiture due to legitimate concern for potential abuses is perfectly acceptable whether by a financial or national security rationale. ——— 1 https://www.axios.com/2024/04/27/biden-tiktok-sale-grindr reply t0bia_s 8 hours agorootparentCan you imagine implementing regulations that are not for your safety? All data that they collect are given by user voluntary, by agreeing with their terms of use. Instead of banning, educate about how data harvesting works and why it matters. No one is learning from censorship. reply braiamp 4 hours agorootparentThe average consumer doesn't understand nor care to understand about the implications of what they are agreeing. That's why consumer protection laws exists. Because, humans are, by a large, very stupid about most things. reply lcnPylGDnU4H9OF 4 hours agorootparentprev> In other words, defending democracy involves destroying all independence of thought. Lots of respect for this guy and his writings but it’s naive to believe people are thinking independently because they can watch TikTok. It just becomes a different propaganda vehicle; the thoughts will still be dependent on the messages they see. reply diggan 4 hours agorootparent> the thoughts will still be dependent on the messages they see. Sure, but even you would agree that if you have even less venues to discover said messages, it'll get more and more heterogeneous? Maybe TikTok isn't \"The last standing beacon for Freedom of Thoughts\" exactly, but banning it certainly doesn't get you closer to plurality of opinions. reply lcnPylGDnU4H9OF 3 hours agorootparent> but banning it certainly doesn't get you closer to plurality of opinions I think keeping it around is worse. While we’re at it, we need to go after American social media, including entertainment news. People should commune in person and get their opinions from interacting with their community. reply moshun 12 hours agorootparentprevAmazing that we don’t hear this book quoted more often along with 1984, we seem to be living funhouse versions of both. reply tsimionescu 11 hours agorootparentNote that this preface was not allowed to be published together with the book, it was censored last minute by the publishers. The public narrative about Animal Farm is almost exclusively that it is an allegory for the USSR, an attack on the false equality that they professed. The preface explaining that it's very much intended to attack the UK and more generally European and US governments' tendencies is even today not included in the vast majority of printings of Animal Farm. reply K0nserv 8 hours agorootparentI wasn't aware of this proposed preface[0]. It's a great read and is, interestingly, somewhat applicable to the TikTok situation. However, you are incorrect, the preface does not say the book is intended as an attack on the UK, European, or US governments. What it does discuss, is how, primarily, the British intelligentsia resisted the criticism of the USSR in the book because of the wartime alliance between the UK and the USSR. The preface makes it quite clear that Animal Farm is in fact an attack on the USSR specifically. 0: https://www.orwellfoundation.com/the-orwell-foundation/orwel... reply K0nserv 6 hours agorootparentActually, I'm not sure if this is the preface the OP was talking about, in fact it's not clear to me who the author of it is. There's another preface[0], from the Uranian edition of Animal Farm, that they might have been referring to. While it does contain some criticism of the the UK, quite expected as Orwell was a socialist, it also doesn't claim that Animal Farm was really about UK, European, or US governments. EDIT: I found the primary source[1] of the unpublished preface, it does list Orwell as its author. 0: https://www.orwellfoundation.com/the-orwell-foundation/orwel... 1: https://archive.org/details/TheTimesLiterarySupplement1972UK... reply UniverseHacker 11 hours agorootparentprevThose publishers must have been tragically born without a sense of irony. reply ImHereToVote 10 hours agorootparentThey are just practicing Oligarchical Collectivism. reply goatlover 9 hours agorootparentprevIt's obviously a criticism of both, the farmers and the pigs. Orwell was not fond of the USSR either. reply tsimionescu 8 hours agorootparentRight, I should have been more clear, my comment does come off as suggesting it's not about the USSR at all, which is obviously false. reply yoz-y 6 hours agorootparentprevThe book gets quoted quite enough. But quotes are really bad arguments. Here’s one that flies in the face of the Orwell’s: Unlimited tolerance must lead to the disappearance of tolerance. If we extend unlimited tolerance even to those who are intolerant, if we are not prepared to defend a tolerant society against the onslaught of the intolerant, then the tolerant will be destroyed, and tolerance with them. [...] We should therefore claim, in the name of tolerance, the right not to tolerate the intolerant. Karl R. Popper In practice we’ve seen both ways play out badly. So clearly we can’t just hope that full freedom is good, and good guys will win. reply portaouflop 5 hours agorootparentprevTo me it feels more like living in a William Gibson novel crossed with Idiocracy reply poszlem 25 minutes agorootparentprevWe will fight for peace until the last bullet reply sirisaysgpt 11 hours agorootparentprev\"And TikTok has special characteristics—a foreign adversary's ability to leverage its control over the platform to collect vast amounts of personal data from 170 million U. S. users—that justify this differential treatment. [S]peaker distinctions of this nature are not presumed in valid under the First Amendment.\" Unanimous decision to ban TikTok from a divided Supreme Court, 2025. reply tzs 4 hours agorootparent> Unanimous decision to ban TikTok from a divided Supreme Court, 2025 Nope. Unanimous decision that the First Amendment does not prohibit banning TikTok. reply ImHereToVote 10 hours agorootparentprevChina can buy private data from Metastasis just like anyone else. This argument is bunk. reply ThrowawayTestr 10 hours agorootparentBuying aggregated data is in no way comparable to owning the collection method itself. reply t0bia_s 8 hours agorootparentWhy? In both ways, users do it voluntarily, by agreeing with terms of use. You don't have to use those platforms. reply gorbachev 7 hours agorootparentprevDespite the downvotes, this is entirely accurate. The privacy / data protection angle on TikTok is a red herring. There are other ways China, or anyone else, including any one of us, can get their hands on vast amounts of personal data about anybody. It just costs more than operating a profitable social media platform. All you need to do is flash a few bucks and talk nicely to a data broker, or Meta (remember Cambridge Analytica?) and there's nothing the US Government or you can do about it, because it's entirely legal. The minimal barriers that are in place to protect the data going into \"wrong\" hands are trivial to bypass. And if that doesn't work, the next level up in difficulty is hack the same organizations. China has made an industry out of that. reply falleng0d 4 hours agorootparentthis is not really the main concern. the real danger posed by TikTok is the ability to easily influence on a large scale. reply diggan 4 hours agorootparentI feel like it's important to include \"the ability for China to easily [...]\" since that's probably the top reason TikTok is affected by this and not others who are identically able to \"easily influence on a large scale\". reply gorbachev 1 hour agorootparentprevYes, so you're agreeing with me. reply imiric 3 hours agorootparentprevI don't get how more people don't realize this. Yes, all domestic media has also been corrupted by various agencies that wish to psychologically manipulate the masses. Some of this manipulation is to get you to buy things, while other wants to get you to think, act or vote a certain way. The difference is that when a foreign adversary has the ability to do the same, it becomes a matter of national security. Allowing that adversary to also control the platform itself is beyond unsafe. The tricky thing is that the US built these tools, and opened them up for everyone to use. This libertarian position is what will ultimately be its downfall. They can't just go and block access to these tools for everyone outside the US, or heavily regulate them, as it will cause an internal uproar, but that is what they must do in order to survive this war. China is in a much better position in this conflict since the government has total control over the media its citizens consume (barring the rampant use of VPNs, which they can shut down at any point). They have no external but massive internal influence. I feel like everyone should watch this 1985 interview of an ex-KGB agent[1]. It's more relevant today than ever before, and explains the sociopolitical state of not just the US, but of many western countries as well. [1]: https://www.youtube.com/watch?v=pOmXiapfCs8 reply quotemstr 3 hours agorootparent> The difference is that when a foreign adversary has the ability to do the same, it becomes a matter of national security. Can you understand how others might disagree with this assertion? It doesn't matter if a foreign adversary has the ability to say words. They're just words. Democracies run on words. If our society is going to fall apart because the Chinese say words, it's going to fall apart anyway. Can you understand that many of us see state steering of narratives on the Internet as a fundamentally illegitimate activity for a government to be undertaking? reply imiric 2 hours agorootparent> Can you understand how others might disagree with this assertion? I can understand it, but it doesn't make it any less true. > It doesn't matter if a foreign adversary has the ability to say words. It matters when those words cause internal social division to the point where it starts destabilizing the nation. This is what we've been seeing in the past decade+, particularly in the US. One of the effects of information warfare is confusion in the victim, where they're not even certain if they're under attack, let alone by whom. > They're just words. Words are never \"just\" words. They're powerful and in the Information Age they can be weaponized at a massive scale thanks to the global platforms the US pioneered. > Democracies run on words. If our society is going to fall apart because the Chinese say words, it's going to fall apart anyway. Perhaps. But not at the rate it's falling apart as the subject of these attacks. > Can you understand that many of us see state steering of narratives on the Internet as a fundamentally illegitimate activity for a government to be undertaking? You can think of this however you want. But the fact of the matter is that those same freedoms you enjoy and require from your government have put you in a worse position geopolitically than countries that don't have them. Maybe it's time to rethink your priorities as a nation and sacrifice some of those personal freedoms for the greater good. Is watching silly videos really worth witnessing your country tear itself apart from the inside out? I'm not taking sides in this matter, BTW. The US has been the perpetrator of many atrocities around the world, some of which have impacted me personally, but I think the world would be in a far worse position if other countries were policing it. I'm just pointing out that from this outsider's perspective... you're screwed. reply quotemstr 2 hours agorootparentThere are no information weapons only narratives inconvenient for this faction or that faction. We can converge on the truth only through unrestrained discourse. The lesson of the past ten years isn't that information is dangerous. It isn't, except to censors. The lesson is that trying to centrally control information flow is misguided and wrong > sacrifice some of those personal freedoms for the greater good No. That's not what this country has been about and it will never be what it's about. reply imiric 40 minutes agorootparent> We can converge on the truth only through unrestrained discourse. Really? How has that approach worked for us so far on the open internet? Do you feel that societies have been able to converge on the truth? We can't even agree on what that means. When everyone has the ability to spew their version of \"the truth\" with equal reach, what you get is a cacophony of signals that makes it impossible to separate the signal from the noise. And if that wasn't enough, we're in the process of adding generative AI to this mix. Insanity... But I digress. I'm not arguing for censorship, mind you. I'm with you in spirit in this argument, even though I don't really know what the solution might be. What I'm saying is that the utopia of an open and connected world that the internet, web, and, later, social media companies have promised us is clearly not working. Instead, it has allowed interested parties to propagate their agenda for personal, financial, political, etc. gain, playing the masses as pieces on a game board, which has only served to further drive us apart. It might be time for people to realize this, and actively reject this form of manipulation, but I'm not holding my breath for that to happen anytime soon. It just seems silly to me to fight for the freedom to consume digital content on specific platforms, without even considering the global picture of what might be at stake. > There are no information weapons only narratives inconvenient for this faction or that faction. That's a very naive perspective. If inconvenient narratives can't be censored, then counter-narratives can be just as—if not more—effective. With the ability to reach millions of eyeballs via influencers or by just running ad campaigns, anyone with enough interest and resources can shape public opinion however they want. We know how powerful this is because we know that advertising and propaganda are very effective, and we've seen how democratic processes can be corrupted by companies like Cambridge Analytica. So, yes, information can indeed be weaponized. Information warfare is nothing new and has existed long before the web and the internet. The internet has simply become its primary delivery method, and is the most powerful weapon of its kind we've ever invented. I urge you to read up on the history and some of its modern campaigns. Wikipedia is a good start. > No. That's not what this country has been about and it will never be what it's about. Great. Enjoy it while it lasts. :) reply Vegenoid 10 hours agorootparentprevWhat is Metastasis? reply junto 8 hours agorootparentPlay on words I assume. Meta Facebook et al Stasi (an abbreviation of Staatssicherheit), was the state security service and secret police of East Germany from 1950 to 1990. It was one of the most repressive police organisations in the world, infiltrating almost every aspect of life in East Germany, using torture, intimidation and a vast network of informants to crush dissent reply amanaplanacanal 7 hours agorootparentI doubt Meta is going to sell their most valuable asset to a competitor. reply user_of_the_wek 9 hours agorootparentprevIt‘s spreading cancer. reply westmeal 9 hours agorootparentprevMeta. reply saalweachter 4 hours agorootparentprevCompletely unrelated, in the passage of the New Testament where The Devil Quotes Scripture, the aforementioned Devil quotes a Psalm to Jesus, a Psalm that Jesus presumably believed in, a Psalm perfectly applicable to his current situation, in an attempt to trick him into making the wrong decision. It's weird to me that that idea could be such an important part of culture as to become a common saying yet have so little impact on actual discourse. reply wqaatwt 10 hours agorootparentprev> destroying all independence of thought.\" Not all of it. Just some of it. No need to see everything in such a black and white way. Also Orwell was obviously not talking about major entities run by other countries. Do you think he would have opposed stopping newspapers directly run by Nazi Germany or the Soviet Union from operating inside Britain? reply ImHereToVote 10 hours agorootparentInstead of censoring. Just teach the populace critical thinking to question the validity of all propagated information. Have public debates on what is correct about what the enemy is saying and what is wrong. Also teach the populace to have the same scrutiny about their own governments lies, like WMDs and such. reply wqaatwt 10 hours agorootparent> Just teach the populace critical thinking Let’s JUST invent practical nuclear fusion and sentient AI while we’re at it. Both would be probably significantly easier to achieve.. reply ImHereToVote 7 hours agorootparentNobody has ever tried. For obvious reasons. How are you supposed to manufacture consent if it works? reply yoz-y 5 hours agorootparentThat’s patently false. There are many schools and teaching methods that teach critical thinking. Attending higher education usually does the trick IF the student is actually motivated in the slightest. Massive part of YouTube is about teaching critical thinking for those who can’t attend for many reasons. Still doesn’t work because of the many roadblocks and mostly laziness in general. reply ImHereToVote 5 hours agorootparentThis won't do. If we were to go 400 years into the past to Western Europe, you would see that about 15 percent of the population knew how to read. And I suspect that if you asked someone who did know how to read, say a member of the clergy, 'What percentage of the population do you think is even capable of reading?' They might say, 'Well, with a great education system, maybe 20 or 30 percent.' But if you fast forward to today, we know that that prediction would have been wildly pessimistic, that pretty close to 100 percent of the population is capable of reading. reply wqaatwt 4 hours agorootparentLiteracy is a rather straight and easy to measure concept. Critical thinking is somewhat more subjective and harder to evaluate (i.e. I wouldn’t give a passing mark for your comment). reply wqaatwt 4 hours agorootparentprev> For obvious reasons. For starters me and you (let alone other people) probably have a very different of what “critical thinking” even means besides the very basic stuff. It’s like “world peace”… reply ImHereToVote 3 hours agorootparentI'm not gonna put a dissertation in a HN comment. I wouldn't have to if more people practiced steelmanning. reply selimthegrim 11 hours agorootparentprevWow I did not read this preface in high school when we did Animal Farm. Say it ain’t so Mr Kramer. reply ImHereToVote 10 hours agorootparentIt was censored in your version. reply selimthegrim 9 hours agorootparentI will point out one of Orwell’s points doesn’t hold up Mihailovich did collaborate with the Germans towards the end of the war. reply wilg 11 hours agorootparentprevyes very brave and original to quote 1984 but actually its not totalitarian in any way. the means here are extremely reasonable and there's no free speech issue. reply t0bia_s 8 hours agorootparentIt's not a quote from 1984. reply wilg 42 minutes agorootparentok then you are very brave and right reply quitit 5 hours agorootparentprevThere are a very large number of posts which follow the format of the parent post, each clearly aiming to make TikTok appear equivalent to US-owned social media platforms, while ignoring the actual issue that TikTok is an active propaganda arm of the CCP. TikTok's manipulation of the feed has been proven through extensive public studies: https://www.noahpinion.blog/p/tiktok-is-just-the-beginning The pressing need to ban it on security grounds likely extends further into non-public knowledge Let us not forget that in the current political landscape it's pretty hard to get both major parties to agree on anything, then to actually also vote that way: but that's what happened with regard to TikTok. reply _dark_matter_ 5 hours agorootparentThank you! I can't believe how much defense I see of TikTok on here. Is this website being specifically targeted for astroturfing, or has TikTok been that effective in spreading its propaganda? (And which one is scarier?) reply handity 4 hours agorootparentIt is not defense of TikTok to point out that all platforms are practically identical: centralized, closed source networks that collect ridiculously detailed data about millions of people, and are in a position to process that data for all kinds of fun stuff like surveilling people's physical movement, creating recommendation algorithms, performing sentiment analysis, and using those tools to try to manipulate populations, influence public thought, and sway elections. There is no behavior that TikTok exhibits that isn't equally applicable to every major social media. I don't particularly care whether right now, the CCP happens to use that manipulative potential for its own ends more than the US does. It shouldn't be hard to take a principled stand against dystopian surveillance. I don't understand people who correctly point out that TikTok is a \"vector for influence of public opinion\", but somehow think that's only a bad thing if it's controlled by a \"geopolitical adversary\". reply _dark_matter_ 1 hour agorootparentBaby steps! Let's do both. Let's rid ourselves of a foreign adversaries influence, then let's ALSO get more competition and reduce big techs influence. Why not both? reply cscurmudgeon 4 hours agorootparentprev> I don't understand people who correctly point out that TikTok is a \"vector for influence of public opinion\", but somehow think that's only a bad thing if it's controlled by a \"geopolitical adversary\". By your implied logic, the US should allow Chinese police to function on US soil as the US already had US police on US soil. reply ninkendo 1 hour agorootparentAs I read more and more comments like GP’s In this thread, I keep getting this vision of a man in France in 1940 welcoming nazi tanks to his town because “well, we have a military too, how is this any different, they’re just a geopolitical adversary” and “well, we had a corrupt politician once last year so our government is just as bad”. reply BeFlatXIII 4 hours agorootparentprevTo be fair, you're the astroturf for domestic Big Tech. reply _dark_matter_ 1 hour agorootparentMaybe! Hard to tell. Personally I don't think big tech should own this space, I'd love to see a variety of companies and lots of startups. I'll leave it to the reader to decide if I'm astroturfing. reply robswc 1 hour agorootparentprevI've seen this TikTok thing turn staunch leftists into libertarians overnight. I think a lot of normal and applicable arguments aren't entirely valid when the company in question is more or less an entity of a political adversary. reply coldpie 4 hours agorootparentprevI'm a US citizen, not being paid by China, and I've never used TikTok, but I think this ban is bad. I believe Mark Zuckerberg and Elon Musk are bigger threats to the people that live in the US than China is. This ban gives them more power by eliminating one of their largest competitors. That's bad. reply breadwinner 3 hours agorootparentThe solution is not to allow TikTok but to reduce the influence of social media in the first place. As exposed by whistleblower Frances Haugen, Facebook's algorithms favored content that generated anger and division, which in turn increased user engagement. Facebook now wants to return to that algorithm. reply coldpie 3 hours agorootparentAgreed. I would be all in favor of a law that applied to Tiktok, Facebook, X, and all others equally. Singling out Tiktok is just a transparent handout to the US's tech oligarchs, which is worse than doing nothing. reply 2OEH8eoCRo0 5 hours agorootparentprev> Is this website being specifically targeted for astroturfing Of course reply protimewaster 4 hours agorootparentprevWhen is manipulating the feed sufficient reason to shut down a service, though? It's also known that Twitter selectively amplifies speech based on owner whims, and it's not guaranteed that this amplification is not to the detriment of the USA / enrichment of foreign governments. The idea that we should trust an American owner to manipulate vs. a foreign government seems...well, just stupid. It seems like the manipulation should be disallowed across the board. reply crazygringo 3 hours agorootparentBecause the US can investigate and regulate a domestic social network as needed. They can't do that with offices that are parties offshore, owned by non-Americans. reply protimewaster 1 hour agorootparentI'm not convinced this accurately reflects the capabilities of law enforcement or the enforcement of laws on international entities. GDPR, for example, is a regulation that applies to non-EU companies when they operate in the EU. I don't believe it's accurate, then, to say that it's impossible for a country to apply regulation to foreign entities running web services. Additionally, I'm not convinced that the US is actively investigating such things, at least formally, on domestic social networks anyway. Twitter's algorithm at some point was tweaked to amplify Musk's posts. Was there a formal investigation or certification process, or were any controls put in place, to ensure that nothing Musk Tweeted would ever be subject to foreign influence, and thus enable amplification of foreign propaganda or ideology? I quite doubt it. I didn't think Twitter was even required to inform the government that his Tweets were being boosted. Researchers discovered it. (And I think there were some leaks from Twitter developers, via journalists.) It just seems weird that we seem to put very minimal effort into verifying that domestic networks aren't pushing foreign propaganda, but then our logic was excluding foreign social networks is that they might push propaganda. We don't even know that the American ones aren't, and we don't even seem to care very much. reply thlamz 1 hour agorootparentprevSerious question, why not? Going off recent examples, Brazil seems to haven o trouble doing so. reply japanification 5 hours agorootparentprevExactly! The China and Russia supporters are crying and trying all sorts of deflection and false equivalence. never mind that 1.) It's pointless, TikTok is officially banned in US. Even if trump decides to find a US buyer for it, it will go under strict ownership investigation. So there's no way Chinese government has any influence anymore. 2.) This means that any future Chinese apps that get popular will get banned, and no need to go through any court challenges since there's precedent and law 3.) The traffic from the original TikTok will just keep getting split and syphoned, until the magnificent seven claims most of it reply 6P58r3MXJSLi 5 hours agorootparent> The China and Russia supporters are crying except this is not what's happening, the opposite is true: the \"manga\" (make american nato...) supporters are screaming that China and Russia are finally defeated in the propaganda war, while China and Russia do not care about the tik tok ban. It's already a victory when the enemy castrate itself and goes against the sentiment of their population, especially the young ones, out of fear that something might happen, but there's no evidence it has happened yet not that it is going to happen anytime soon. When you think that tik tok is so dangerous that your democracy could fall because of it, well, you got bigger problems on your hands. reply Stephen_0xFF 3 hours agorootparentI see Russia not caring, but to say China doesn’t care in the slightest doesn’t make sense. Especially with a company at that scale. There wouldn’t be a push to the Red Book if that was the case. > goes against the sentiment of their population If you read this thread you’ll see that it’s pretty divided. I for one don’t care that it’s gone and even welcome the ban. I dislike that China has a firewall for American companies, but will gladly enter our market. reply 6P58r3MXJSLi 2 hours agorootparent> There wouldn’t be a push to the Red Book if that was the case. Isn't Red Book pushed by angry titk tok users, just like blue sky was the reaction to Musk buying Twitter? > I dislike that China has a firewall for American companies, but will gladly enter our market. China was invited by the USA in the USA market. In exchange for their cheap and educated labor force and growing market. Ask Apple if it was good or bad for them to exploit the Chinese market and labor. It's the USA that pushed to invite them in the WTO. Is it too much to ask to the USA to reflect a little before acting? reply IAmGraydon 3 hours agorootparentprevIt's amazing to me that people don't recognize the influence that this kind of platform has. I know it goes against the prevailing idea that American corporations are evil, but American companies are interested in making money while China is interested in the disruption of western society. They are not the same level of risk. reply osrec 3 hours agorootparentI'm not sure about that. The US and China sort of need each other, at least from an economic perspective. If one faces disruption, the effect on the other is guaranteed. I'm not saying they like each other, but the relationship is symbiotic in many ways. reply rsanek 2 hours agorootparentUS is way less dependent on imports than China is dependent on exports reply airstrike 2 hours agorootparentprevAnything that tips the scale in favor of one tips it against the other. Why are Americans arguing for the US to have less leverage in this relationship? It's downright illogical. reply aqme28 7 hours agorootparentprevTwitter is owned by a South African who is making overt attempts to control our government and our public opinion. reply mint2 2 hours agorootparentPersonally I think Twitter is a great example of why tik tok should be banned. It’s a clear example of how leadership can skew the algorithm to try to influence things. Now, in twitters case they are wildly obvious about it and everyone is starting to think they’re a joke. Tik tok isn’t run by a buffoon so anything they do would be far more subtle Twitter is also showing why these type of companies need far more regulation applied. But that doesn’t mean it’s bad to take other actions in the meantime. reply kasey_junk 5 hours agorootparentprevElon Musk has had US citizenship for over 20 years. reply aqme28 4 hours agorootparentI guess that means his interests align with the average American's reply kasey_junk 3 hours agorootparentNo. It means he's an American. And in the context of the TikTok ban that matters. reply aqme28 2 hours agorootparentWhy does it matter? Why should the machinations of China scare me more than the those of an oligarch? reply kasey_junk 1 hour agorootparentBecause that’s the way the law is written? And you were the one that added the South African qualifier? I’m not making a point about the usefulness of the law, only the _definition_ of it. In the context of the ban Musks American-ness is more important than his South African-ness and both are more important than his wealth. reply bdangubic 4 hours agorootparentprevso he’s a fucking immigrant, eh? reply rufus_foreman 4 hours agorootparentYes, he has 12 children. reply bdangubic 3 hours agorootparentbirthright citizenship, eh? reply ewild 13 hours agorootparentprevto me this is the only important one. Not only can they subtely influence the entire us culture, if they were to get in trouble for it, then what? the US doesnt have any influence over them we would just ban them and at that point its too late. realistically it already is too late. a huge point imo aswell is we ARENT at war right now, but if we are at war the amount of information china can both push and obtain through tiktok would be large enough to change the tides of a war reply hypeatei 13 hours agorootparent> Not only can they subtely influence the entire us culture Not the entire U.S. population is on TikTok. Even if a significant percentage are, your argument is that they cannot think for themselves? It is widely known that TT is Chinese owned/controlled yet Americans still used it. Even a regulation requiring disclosure of that fact each time you open it would be fine. But an outright ban on the app itself? This is a huge \"feel good\" moment which will not improve any aspects of the social media environment in the U.S. reply wilg 13 hours agorootparentthey didn't ban the app. they said china couldn't own it. but china would rather not sell it. we don't let any foreign citizens work on missiles and stuff (ITAR), we shouldn't let adversarial countries own and control communications infrastructure reply sterlind 12 hours agorootparent> they didn't ban the app. they said china couldn't own it. but china would rather not sell it. this doesn't get enough attention. ByteDance could have easily partitioned off the US environment and made bank selling it. but the influence potential was too juicy for CCP to let ByteDance sell it. even if the CCP wasn't manipulating the algorithm to sway US public opinion I don't know whether they were or not having that option open was far too valuable to part with it. and I think they were playing a game of chicken, honestly. they bargained for the US government being too dysfunctional and TikTok too popular for the ban to happen. reply SilasX 11 hours agorootparent>this doesn't get enough attention. ByteDance could have easily partitioned off the US environment and made bank selling it. but the influence potential was too juicy for CCP to let ByteDance sell it. I think that's kind of trivializing the position they were in. Would you take the same tone if it were an American startup that were forced to sell a big chunk of itself pre-IPO? Would you roll your eyes at them for \"being greedy\" at any indication of pushback against such a requirement? I don't think the law is necessarily bad, considering the national security implications, but it's a cop-out to dismiss the burden of being forced to sell a major part of an enterprise as no big deal and the owner as just stubborn. reply sterlind 11 hours agorootparent> Would you take the same tone if it were an American startup that were forced to sell a big chunk of itself pre-IPO? Would you roll your eyes at them for \"being greedy\" at any indication of pushback against such a requirement? to be clear, I don't think ByteDance was greedy. I suspect ByteDance would have been happy to cash out. but it wasn't up to them, they needed approval from the CCP. if a US social media startup somehow got extremely popular in China, I'd understand and even empathize with China requiring it be sold. they'd be right to mistrust us. reply creato 11 hours agorootparent> if a US social media startup somehow got extremely popular in China China avoided this problem by ensuring that never happened in the first place. reply AnthonyMouse 11 hours agorootparentNo, we've seen this happen before in China, where some US company becomes popular, e.g. millions of people in China have bought iPhones. Then China requires the company's operations in China to be more than 50% owned by China. The TikTok thing is very much \"what's good for the goose\", but it's also the US acting more like China the authoritarian country. reply portaouflop 5 hours agorootparentApple China (if such a thing exists?) is owned >50% by the Chinese state? I couldn’t figure out if that is actually true reply AnthonyMouse 1 hour agorootparentChina had a longstanding requirement that companies operating there under certain conditions had to have majority domestic ownership. It appears they've relaxed it somewhat in recent years and now I'm not sure if it applied to Apple China or not. But the distinction is somewhat redundant with their government structure anyway. If they want to force you to do something there, how much does it matter if they say \"you have to because we have majority control of this company\" or \"you have to because we have a one-party system and control the law\"? If the US government e.g. orders a US company to censor criticism of the US, the company can sue them and plausibly win. If you can't do the same in China, you don't control that company, they do. reply creato 10 hours agorootparentprev> US social media startup reply AnthonyMouse 10 hours agorootparentThat also happened, e.g. YouTube (Google) operated in China prior to 2009, but Google US didn't much like censoring things on behalf of China. reply SilasX 11 hours agorootparentprevThe question was whether you would roll your eyes at the startup and have no sympathy for that startup because of the \"big chunk of change\" they could have gotten selling it. You can both believe that the requirement is justified and that it comes at a big cost for the org that would have to sell. They aren't mutually exclusive. reply hypeatei 13 hours agorootparentprevYes, I know the law doesn't name TikTok/ByteDance specifically to be banned outright, that is just the effect. > let adversarial countries own and control communications infrastructure This is an exaggeration that a social media platform for short form content is communications infrastructure, akin to a cell tower or fiber optic line. I'd the say the same for your mention of ITAR in a thread about, again, a social media platform. If we were serious, there would be regulations for all social media, not just forcing of U.S. ownership then saying \"all good, this can't be bad since Americans own it\" reply stratocumulus0 12 hours agorootparentAt the same time, foreign companies are only allowed to operate in China through partnerships with Chinese companies. Why should we play fair if they don't? reply tsimionescu 11 hours agorootparentBy this logic, the US should start imprisoning people who aren't vocal enough about being anti-China, right? Why should the US play fair if China isn't? reply ascorbic 11 hours agorootparentprevChina is a totalitarian dictatorship with complete surveillance over the domestic internet. Not really comparable. reply Lordarminius 8 hours agorootparentAnd you think America is not ? reply chenster 1 hour agorootparentThe difference is communists spying on Americans vs Americans spying on Americans. reply wilg 11 hours agorootparentprevyeah and we don't want them having a surveillance tool over a huge part of our domestic internet reply DiogenesKynikos 8 hours agorootparentprevThat's not actually true. JV requirements are limited to a small (and constantly shrinking) number of economic sectors. Many, many large US companies own their own operations in China. reply wilg 13 hours agorootparentprevit is not an exaggeration at all. it's a different layer of infrastructure, but it's still infrastructure. the mention of ITAR is an analogy, which I know you understand. if \"we were serious\" about what? the issue of foreign control is not relevant to domestic companies. we could have some other regulations too, sure, but this one is reasonable. reply hypeatei 12 hours agorootparentSerious, meaning we wouldn't play whack-a-mole and instead place rules on all of them then let the free market decide. I'll repeat, disclosures could be added for foreign controlled apps. I take issue with the fact that we're making a Chinese app the boogeyman but foreign influence campaigns can happen on any platform as seen in recent U.S. elections on Facebook et. al I think people should be able to decide which social media apps they want to use. They're not even close to reaching the levels of the \"infrastructure\" box you're forcing them into to justify this decision. reply wilg 12 hours agorootparenti dont want to argue about the definition of infrastructure. concretely, tiktok crosses the threshold of influence and risk where it is reasonable to require them to divest or close. no brainer. reply leptons 12 hours agorootparentprev>it's a different layer of infrastructure, but it's still infrastructure. TikTok isn't \"infrastructure\", TikTok is software. TikTok exploits the infrastructure of the internet across the world, it is not infrastructure itself. The servers TikTok runs on is technically \"infrastrucutre\", but those same servers could run anything else, the hardware is not \"TikTok\". I could run \"TikTok\" the software on any hardware, even if it isn't connected to the public internet, and that would not qualify it as \"infrastructure\", at least not in the sense that it's servicing any population. reply yobid20 10 hours agorootparentprevActually they are specifically named in the law lol, i wasnt expecting that but it very clearly up front states it. reply 6P58r3MXJSLi 5 hours agorootparentprev> but china would rather not sell it. why should China obey to an US request? Of course they are against selling it, like the US government of course is against Google selling to the Chinese. But that speaks volumes on the sad state of our democracies, they are so brittle that students protesting against the slaughter of Palestinian kids can trigger a cold war and the revanche of the authoritarian doctrines of a not so distant past. reply blackeyeblitzar 12 hours agorootparentprevChina already wages asymmetrical warfare of all kinds cyberattacks, IP theft, espionage, encroaching on other country’s territory, literally ramming ships in the South China Sea subtly influencing other countries is a bridge they crossed a long time ago probably. It’s why Douyin has time limits and strict guidelines on content to make it more productive and educational, but TikTok doesn’t. reply dutchbookmaker 4 hours agorootparentIt is much more than this. The PLA took huge lessons from the first Gulf War that the way to fight the US was to fight everywhere but the traditional battlefield. Their means and methods have been absolutely brilliant. The most brilliant thing to me is to fight on a time frame that is so long, that even the idea the PLA is at war with the US sounds ridiculous to most Americans. If this is true, Douyin will never divest of Tiktok in the US. They would rather it just shutdown in the US. They won't let the US dissect an information weapon from the inside. The company valuation can't include the information weapon value so the offer price is always going to be a joke from the Douyin side. reply wildrhythms 5 hours agorootparentprevIronic to talk about China's 'warfare' while America has over 1,000 military bases around the world. reply pantalaimon 8 hours agorootparentprevHow did that influence look like? reply mbesto 7 hours agorootparentIt's subtle but super effective they can sow discord. Just look at palestine vs israel as an example of what a major explicit influence looked like. reply bjourne 11 hours agorootparentprev> to me this is the only important one. Not only can they subtely influence the entire us culture, if they were to get in trouble for it, then what? Suppose that is true. Then why are you ok with Mark Zuckerberg, Elon Musk, or any other American oligarch wielding even more influence on US culture? When it comes down to it, it's just jingoism, isn't it? China man bad, America man good. reply sensanaty 8 hours agorootparentI'm not a yank (Serbian but I live in NL), but I'd rather neither. However, since we live in reality land and not make-believe land, that's not an option, so I'd go for the oiligarch from my own country rather than, say, a Russian or Chinese one having influence over the people in my country. Not wanting authoritarian shitholes to have influence on people isn't really all that crazy of a stance, IMO, even if the world isn't perfect and shitheads like Zucc have similar influence. reply bjourne 2 hours agorootparentThe point is that justice is blind, i.e., just. You can't have a law that says if your name is \"bjourne\" you get to do X, but if your name is \"sensanaty\" that is forbidden. So if the law privilege the oligarch living in your country over the foreign oligarch, justice is not blind, justice is jingoistic. That path leads to fascism. You might be fine with that because it doesn't affect you, for now, but sooner or later, unless stopped, the fascists will fuck you too. reply corimaith 1 hour agorootparentThat's like saying the notion of \"citizenship\" (which serves to discriminate between in-group and out-group) is the \"path\" to fascism. That's literally how ever nation-state in this world works, we live in a world of sovereign states where the applicability of law only exists in the context of each individual sovereign. Non-Citizens are not afforded the same rights as Citizens. And Citizens pledge allegiance to solely their Sovereigns against other Sovereigns. If you don't like this, you are free to forgoe your citizenship and the benefits of the protection of the state to live statelessly. reply bjourne 49 minutes agorootparentSince corporations are not \"citizens\" the issue has nothing to do with citizenship. It makes sense that laws sometimes discriminate between citizens and non-citizens, just like they discriminate between adults and children. For example, when it comes to immigration and freedom of movement. But that is not an argument for arbitrarily discriminatory laws. A foreigner and a citizen convicted of murder gets the same punishment. A Chinese oligarch owning TikTok is no more of a threat to \"American democracy\" (or whatever, not like there's much left of it) than Elon Musk owning Twitter is. reply DiogenesKynikos 8 hours agorootparentprevElon Musk is currently using his massive platform to promote neo-Nazis in Germany and far-right political parties throughout Europe. Twitter is a far greater danger to Europe than TikTok is. reply sensanaty 8 hours agorootparentAnd that should be stopped too, but we also just had a bout of Russian campaigns that almost got a cultist Neo-Nazi elected in Romania thanks to tiktok. Ban 'em both for all I care, my whole point is that pretending as if the west is being evil or whatever for banning these obvious propaganda channels is absurd to me reply 6P58r3MXJSLi 4 hours agorootparent> almost got a cultist Neo-Nazi elected in Romania thanks to tiktok. please stop spreading lies. The Romanian supreme court presented no evidence and instead cancelled the election results while the election were still going on (citizen living abroad were still voting) It was just an excuse to stop something NATO did not like from happening and I am saying it as a very left leaning person, anti-fascist and anti-Putin. What happened in Romania is a pure and simple coup d'etat with no military intervention. Besides: if tik tok could really win elections in EU, it means our democracies aren't remotely as strong as we like to believe. And if that's true, imagine what the US can do, having by far the largest budget for these kinds of operations in the entire World. reply tzs 4 hours agorootparentTikTok made a difference in Romania because Romania is the poster child for countries that should not be using \"top 2 advance to the next round\" voting. They had 10 parties and 4 independents that split the vote. In that particular election there were 6 right wing parties that collectively got 47% of the vote. The top 3 of those got 19.18%, 13.86%, and 8.79% of the vote. The highest non-right party got 19.15% of the vote. Georgescu's TikTok campaign just needed to get more than 19.15% of the vote to get to the top 2 round. He got 22.94%. With the number of parties they have and the lack of any parties that come anywhere near majority support they really need to be using ranked choice voting or something similar. reply 6P58r3MXJSLi 4 hours agorootparent> TikTok made a difference in Romania replace Tik Tok with any other social network, that serve much more people, have much more penetration in Europe and have much larger budgets at their disposal and you will see how Tik Tok is a red herring in Romania. It's just that democracy is good only when the \"right\" candidate wins. In my Country the USA have controlled the results of the elections for 50 years, often relying on blackops, infiltrated intelligence, fabricated propaganda, reactionary movements, funding terrorism and in the process killing hundreds of innocent people. It's nothing new to us in Europe. reply ilogik 3 hours agorootparentprevthis is so much BS. it's not the job of the supreme court to present evidence reply 6P58r3MXJSLi 2 hours agorootparent> it's not the job of the supreme court to present evidence I think you meant to say that it is not the job of any supreme court to cancel free elections without evidence. I dare you to quote the documents that link the win of Georgescu to Russian propaganda. I am not saying Georgescu wasn't helped by Russia, I am saying there is absolutely no evidence, and if an election can be bought with a couple hundred thousands dollars spent on tik tok, are you implying I could win the elections in Romania? It is that weak the state of democracy there? Imagine what the US could do there, having tens of billions at their disposal. reply ilogik 1 hour agorootparentWho said anything about Russia. He broke election laws. Again, it's not the job of any court anywhere in the world to present evidence reply wilg 11 hours agorootparentprevno, it's reasonable for countries to want mass media their citizens use to be subject to their own government, especially when the country in question is an adversary, not a democracy, and not a particular beacon of free speech or human richts reply 9dev 11 hours agorootparentprevThat makes little sense. Why would a country be equally afraid of the influence of its citizens compared to a foreign, authoritarian regime with opposing interest? Given the choice, naturally you’ll be on the side of your own people rather than the others. reply 6P58r3MXJSLi 4 hours agorootparent> Given the choice I would chose China, which is on the other side of the globe, has no military bases in my country (USA have 3! two of them with nuclear capabilities) and probably what they gather from me make little or no sense to them and can't really influence me the same way (not even close to it) content in my language, repeated day and night from the top government bodies to the least popular piece of media that then spread from mouth to mouth and becomes a discussion topic at family gatherings, can. No way tik tok remotely has that power, no way China could really do anything like that, they can at most insinuate through the cracks already present in our contemporary societies hoping it will work, but banning tik tok will only widen them. It's one of those situation where having a common enemy should reunite people with opposing views, but it's not evil aliens trying to conquer earth we are fighting, it's social content (mostly entertainment) that this time will take people with opposing views even more apart. reply 9dev 4 hours agorootparentAnd that’s where you’re dead wrong. TikTok is a vessel for any kind of content, with no visibility into the reason why a specific kind of information is displayed to whom. Just think of Field Manual 30-31B if you doubt this capability could be put to good use in a propaganda campaign, if necessary. Sometimes, public opinion can be swayed very easily, by igniting the first spark with something outrageous; this is especially fruitful in times where the president of the United States openly opposes journalism, spreads lies, and generally fosters distrust and doubt. Lots of people are more inclined to believe a random TikTok than a professional journalist with decades of experience; what do you think were to happen if the Chinese government sees immediate value in the US government making a specific decision to their benefit, and one of the tools in their toolbox is playing a flurry of short videos to millions of American citizens, made to influence their understanding of an issue? Most people will follow a reasonable opinion if it's the first time they're confronted with a complex situation. TiktTok is the perfect tool to exploit this, by delivering this opinion to absurdly narrow target groups, in a matter of seconds. Just because you don't notice this right now does neither mean the capability doesn't exist nor that it isn't already happening—which may be one of the reasons there is a bipartisan effort to pull through. reply 6P58r3MXJSLi 3 hours agorootparent> is a vessel for any kind of content, with no visibility into the reason why a specific kind of information is displayed to whom and that makes it different from IG, Facebook, X, YouTube (etc etc) how exactly? reply 9dev 3 hours agorootparentThat China is a totalitarian regime, and the USA (at least for now) is a democracy. With all due criticism, there are still checks and balances in place in the US that make it a very different place. We're not talking about an objectively \"correct\" decision here, but what is in the best interest of the USA and its allies, and that certainly makes a difference when it comes to foreign influence on the own populace. All that being said: American Tech companies are dangerous in their own right, and nothing in my post was defending these either. But that doesn't make TikTok less of a threat. reply 6P58r3MXJSLi 2 hours agorootparent> That China is a totalitarian regime, and the USA (at least for now) is a democracy. This is actually false. The USA are a Republic, not a democracy. By constitution. > there are still checks and balances in place in the US If you are rich, maybe it's true. I give you that. > but what is in the best interest of the USA and its allies The US has no allies. My Country is a vassal of the US, we cannot decide anything geopolitically relevant on our own. Can we for example exit NATO? Of course we can't! They got military bases here, with atomic missiles, recently updated. We can't even negotiate the release of one of our own independently without the US giving the thumb up/down. So, please, before saying that what they do it's in our best interest, please, ask us. It's usually not, BTW. > But that doesn't make TikTok less of a threat My point: same threat should result in the same response to the threat. We should ban any non European propaganda machine on our soil. One simple example: we all know what went down with Cambridge Analytica and yet if you look for it, you won't find any reference to trials or convictions, because there was none! it had a massive influence on shifting political view of the people in UK and in the US, but you'll only find vague scolds to bad apples that unilaterally abused of one with a clear conscience social network, unknowingly to the management. Despite a ton of evidence of the contrary. How can you explain that? reply mint2 2 hours agorootparentprevIs tik tok even banned in your country? Since your perspective is choosing between two foreign powers controlling social media, sounds like an entirely different thing than in the US. reply bjourne 2 hours agorootparentprevWell, you write that it \"makes little sense\" then you argue that the maxim \"China man bad, America man good\" makes total sense... reply 9dev 1 hour agorootparentNo, then you didn't read it properly. I argue for \"I trust my people more than my enemy\", which doesn't sound quite as dumb and is something most people would probably agree with. reply bjourne 45 minutes agorootparentYes, I did read it properly, just like the above comment. You claim Chinese people as your enemy because your rulers told you so. That is very much jingoism and very much on the path to fascism. Sorry that you can't think for yourself. reply 9dev 18 minutes agorootparentI do not claim anyone my enemy, for I am not an American at all. I do, however, see the situation for what it is; the USA and China are political superpowers with opposing interest. Pretending like the world is a peaceful place is just a fantasy. Hence, you can’t just ignore a communication tool used by half the population in your strategic considerations. That is not racism, it’s not fascism, its pragmatism in the face of something very powerful that could well be abused. reply red_admiral 10 hours agorootparentprev> China man bad, America man good. America man friend of president. reply polski-g 11 hours agorootparentprevThose individuals reside in the US, and are US citizens. They have first amendment rights to engage in those activities. Singaporean corporations controlled by the Chinese government in China does not have FA rights. reply aib 11 hours agorootparentprevExactly. They want _their_ oligarchs controlling their 99.(9)%. This ban is as close as you can get to open admittance. reply blackoil 13 hours agorootparentprevWhile I agree with your argument partially, I still find it ironic. It assumes that we must prevent public from accessing some thoughts/propoganda as they may not be able to make right decision themselves. This is rhyming with 1930s Germany or other authoritative regimes since then. reply wilg 13 hours agorootparentyou can still access any thought you want due to our permissive free speech laws. you just cant run the app if you're china reply sodality2 12 hours agorootparent“You can still access any thought you want due to our permissive free speech laws. You just can’t sell this book if you’re Ray Bradbury” reply wilg 11 hours agorootparentanalogy completely misses the point which is that there is no impact on what anyone is allowed to say reply sodality2 11 hours agorootparentThere is an impact on the TikTok’s app to display content to American users. reply wilg 10 hours agorootparentyes exactly but not on any of tiktok's users to say what they want, which is 1000x more important than the rights of the PRC to tweak the algorithm and moderation however they like reply sodality2 10 hours agorootparentIMO the right to use TikTok in the US is actually way more important than the “right” of users to post whatever they want on it. In the same way that FB can ban you for violating content policy, and the app store can ban you for whatever reason. These are all okay because they’re all the domain of that company/entity to police. The problem is when the government steps in and forces it. I don’t think what website I can use is the domain of the government. reply enos_feedler 12 hours agorootparentprevEven more ironic is that we have a government programming us with fears (just fears!) about what China _could_ do to justify some action they are taking. Literally running the playbook of entity they are trying to make us afraid of. Fucked up. reply wilg 10 hours agorootparentdoesn't have to be fears, can just be good security hygiene. and china's running a whole playbook too. welcome to geopolitics! reply encoderer 12 hours agorootparentprevLike encouraging your wife to sleep in another man’s bed. After all, it should be fine! Do you want to prevent her from accessing some thoughts??? Let her make the right decision herself. reply blub 11 hours agorootparentSocial media can’t sleep in beds or other places, it doesn’t have a body. Actually it’s more like preventing your wife to talk to other men, just in case. We know what the world thinks about these kinds of husbands… reply encoderer 1 hour agorootparentSocial media doesn’t sleep anywhere but the ccp does and they are currently staying rent-free in the minds of millions of Americans. reply pjerem 11 hours agorootparentprevWait what ? reply suraci 11 hours agorootparentit's all about sex! reply 8note 12 hours agorootparentprevits a horrible crutch that suggests america is already dead and gone. america and americans should be able to view any media and still come to the best conclusions. banning media is a lack of trust in americans ability to formulate opinions. what the point in having media and democracy if you dont think people can make good decisions based on it? reply Eextra953 11 hours agorootparentI think this perfectly communicates why it feels so wrong that the government has banned tt. Its an implicit acknowledgement that our leaders feel that foreign influence will resonate with the public in a way that doesn't benefit the status quo. reply op00to 5 hours agorootparentForeign manipulation of social media is literally why Trump was elected. reply fspeech 1 hour agorootparentYet banning it creates the largest opportunity for manipulation whereby Trump gets to play the hero to a very large number of Americans. reply fspeech 11 hours agorootparentprevSo many people focus only on TikTok instead of their fellow citizens' rights that are being trampled upon. Even NYT writers happily insinuate that all will be forgotten in no time. Cutting people's social links is not benign. An American may be happily watching Italian content, and when you cut her link it doesn't follow that the Italian creators will move their content to some other platform accessible to that American. Same for Americans with foreign followers. Americans may also have trouble reconnecting with American creators. It boggles the mind that these losses are given so little thought. reply wqaatwt 10 hours agorootparentprev> america and americans should be able to view any media and still come to the best conclusions I’m rather confused how do you think that is somehow connected with: > horrible crutch that suggests america is already dead and gone If you believe that then surely you must also believe that it was never “alive” in the first place? Americans certainly didn’t have unrestricted access to any type of media in ta past. In fact it was heavily centralized and controlled by a small number of entities. One might argue that the decentralization starting with cable television/etc. and then internet led us to where we are. Everyone used to be watching the same handful of television channels (which were relatively “apolitical” anyway) and a small number of available newspapers. It’s rather obvious why it was much easier to reach societal consensus on most issues compared to these days… reply 127 10 hours agorootparentprevHalf of the people are sub-100 IQ. It's very naive to understate the stupidity of some people and their capability to do harm if mislead. Especially when it comes to weaponized social media content from a main geopolitical adversary. Letting Tiktok continue will do far more harm to democracy than banning it. reply wilg 11 hours agorootparentprevthey're not banning any media or expression though so its a non-issue reply low_tech_love 10 hours agorootparentprevThis entire thread could be removed and only this comment should be kept. Unfortunately people have bought into this idea that all players in this game are following the rules. The US government is an extremely complex system and there is no way they would have reached a bipartisan conclusion on this if there wasn’t strong (confidential) evidence to support it. reply aqme28 5 hours agorootparent> The US government is an extremely complex system and there is no way they would have reached a bipartisan conclusion on this if there wasn’t strong (confidential) evidence to support it. I'm sorry, but this is not a good assumption. It has not been the case historically. reply wildrhythms 5 hours agorootparentprevLOL, and what is your opinion on the Iraq War? Let's hear it. reply BeFlatXIII 4 hours agorootparentDownvoted for speaking truth. reply airstrike 2 hours agorootparentDownvoted for whataboutism reply sudosysgen 1 hour agorootparentIt is a relevant example that directly contradicts the general statement made about the motivations for bipartisan consensus, not whataboutism. reply tkel 13 hours agorootparentprevIt is the salient point. A domestic adversary has control over a major influence vector on US public opinion. In the form of Instagram/Twitter/Facebook/etc. reply wilg 13 hours agorootparentthe us has political and legal jurisdiction over those companies which is the entire point reply epolanski 9 hours agorootparentIt also has on bytedance in US. As does turkey or Germany or whoever when it comes to US socials operating in their countries. All you need is a court order and all socials will delete whatever content is requested. reply ternnoburn 12 hours agorootparentprevDo they? Do they actually? I'm not sure the U.S. has control sufficient to exercise meaningful jurisdiction, even if it exists on paper. Big companies have too much influence in Congress and with politicians to be meaningfully reigned in in practice. reply snovv_crash 11 hours agorootparentSo you don't see Zuckerberg doing a roundabout on a bunch of policies with the new administration then? reply ternnoburn 3 hours agorootparentYou think he changed because he was worried about either admin? I think he changed because he sees the outcome of an election as an endorsement of his beliefs by the populace. reply wilg 11 hours agorootparentprevwhether or not that's true it doesn't affect the issue of our jurisdiction over a PRC-controlled app reply tkel 10 hours agorootparentI think it's a stretch to say \"PRC-controlled\". I think the government has influence in working with ByteDance's board, not unlike in the US. This is the propaganda that has infected the American psyche. To think every single organization in China is an arm of the big bad communists. It's quite uninformed and ahistorical and political propaganda. reply roca 8 hours agorootparentIt's not a stretch. For example a large fraction of Chinese private companies have CCP committees embedded in them: https://www.seafarerfunds.com/prevailing-winds/party-committ... Nothing equivalent in the USA. China's rule of law is generally very weak. \"Ultimately, no matter what the laws say, it would be difficult for any Chinese citizen or company to meaningfully resist a direct request from security forces or law enforcement, and the courts cannot be relied on to provide a remedy.\" https://www.chinalawtranslate.com/en/what-the-national-intel... This is particularly obvious with the number of senior executives of key Chinese companies who have simply disappeared, at least temporarily, when they displeased the government. Again, nothing comparable in the USA (yet). reply pizza 12 hours agorootparentprevI’d rather have both data privacy protection through both laws and technological security AND a popular platform run by an adversary, than have neither privacy protections and only platforms that conceal their beneficiaries. reply wilg 12 hours agorootparentwell that doesn't really represent the situation here so it doesn't really matter what you'd prefer of those two options reply pizza 11 hours agorootparentWhy isn’t the latter the situation right now? reply wilg 11 hours agorootparentthe latter might be your debatable characterization of the situation right now, but the former was not on the table and the only reason to couple them together is to make your point reply gdubs 12 hours agorootparentprevAre they not allowed to sell books in the United States? How about guns? Can they release major motion pictures? Video games? We have freedom of speech in this country — and for the boogeyman that China was somehow weaponizing their platform, we just removed the voice of countless communities that had formed on TikTok. reply sfRattan 12 hours agorootparent> How about guns? Imports of firearms and ammunition from China to the USA have been banned since 1994 [1]. IIRC Chinese companies were caught selling rifles and other gear to known gangs in California and that motivated the law. Firearms imports are also much more restricted generally than most other categories. More than one manufacturer has reincorporated in the United States because of the regulations. [1]: https://www.congress.gov/bill/103rd-congress/house-bill/3355... reply gdubs 12 hours agorootparentFair enough — was wrong on that point, and happy to be corrected. reply sterlind 11 hours agorootparentprevChina doesn't allow foreign corporations to operate within their borders. why should we? there is no First Amendment right for Chinese companies to operate within our market. there is no First Amendment right for RT to be carried on US cable networks. if TikTok were a website, it'd be different. it'd be one thing if the US were blackholing tiktok.com. but TikTok is an app that sells ads, and they're not entitled to sell ads to US businesses or publish on US app stores. reply Kamq 4 hours agorootparent> there is no First Amendment right for RT to be carried on US cable networks. There might be, but it would be the cable network's first amendment right to carry them, not RT's right to be carried. The argument in court was kind of backwards, nobody violated TikTok's rights by taking them off the app store, but you could fairly easily argue that Apple and Google's rights were violated by telling them that they can't carry it. That would, presumably, require either Apple or Google to bring a lawsuit though, and they seem to want to play nice with the incoming administration. reply suraci 11 hours agorootparentprev> China doesn't allow foreign corporations to operate within their borders It's not true, just to clarify it. Many foreign corporations operating in China, only if they: 1. Keep all user data within the border. 2. Cooperate with censorship TikTok meets the first condition in the U.S., and I think the issue lies with the second condition. reply sterlind 11 hours agorootparentI could be wrong, but I thought you have to operate a subsidiary in China, which is majority Chinese-owned. for example, Azure China is operated by 21Vianet, who also owns all the infrastructure. reply suraci 11 hours agorootparentYeah, that's the part 1, all data must be within the border so Azure in China can only be ran by a Chinese entity If you look at it from the other side, it's like Tiktok must be hosted by Microsoft/Amazon but not datacenters in China reply logicchains 4 hours agorootparentprev>China doesn't allow foreign corporations to operate within their borders. why should we? China is a dictatorship where people have no rights. America was built on the principle that the government shouldn't have the power to tell the common people what to do. reply TulliusCicero 2 hours agorootparentThe idea that the US government doesn't have the power to regulate trade, especially with geopolitical adversaries, has never been some bedrock principle of America. reply EagnaIonat 12 hours agorootparentprev> we just removed the voice of countless communities that had formed on TikTok. They just move to new place. Loads of online communities have died/migrated for various different reasons over the years. > We have freedom of speech in this country This doesn't impose on your freedom of speech at all. Just because you have the right to say anything, doesn't give you the right to say it where you want. reply tsimionescu 11 hours agorootparent> This doesn't impose on your freedom of speech at all. By this logic, the US government should be able to ban any newspaper that is publishing articles that they don't like: it doesn't encroach on the freedom of speech of the reporters of that newspaper, they can just speak somewhere else. They don't have the right to say anything at that particular newspaper, just in general. Of course, in reality, banning a publication (TikToK) because you think they may publish stories that you won't like (propaganda for Chinese interests) is an obvious violation of the first ammendment and a form of government censorship. reply TulliusCicero 2 hours agorootparentNo, because the ban is based on TikTok coming from a geopolitical adversary, rather than being based on actual content (which is why the Supreme Court declined to stop the implementation of the law). reply tsimionescu 1 hour agorootparentHuawei is also controlled, even more directly, by a geopolitical adversary, and is not banned for regular consumers in the USA. The reason TikTok being owned by China is considered a problem is because it could allow China to control what American citizens see on their timelines the content. reply TulliusCicero 46 minutes agorootparentThe US passes many laws about traffic safety, and yet much of US road design is actually deeply unsafe. Inconsistent sure, but that doesn't mean they were lying about the unsafe things they did ban. > The reason TikTok being owned by China is considered a problem is because it could allow China to control what American citizens see on their timelines the content. It's the PRC control part that's the key here though. There's nothing banning even blatantly pro-PRC content on other platforms. You can find plenty of tankies praising China over the US to high heaven on places like Reddit. reply wilg 11 hours agorootparentprevtiktok isn't a publication and the ease with which people can post on other platforms as well as their relationship to the platform is relevant reply tsimionescu 10 hours agorootparentI agree that there are differences between a publication and a platform, but they are relatively subtle. And as long as the argument is \"China through TikTok can influence which content is popular or allowed to be published at all\", then that is leaning into the publisher-like aspects of TikTok, not the platform-like ones: and it is precisely these rights that are protected. Just to give an example of what would be concerns of the platform aspect of TikTok, that would be concerns about the ability for the app to deploy malicious code to users' phones, or the amount of data that it siphons off legally. But those are de-emphasised in favor of their control on content, which is precisely what's supposed to be protected by the Constitution. reply TulliusCicero 2 hours agorootparentprevTrade and speech are not the same thing, and this sort of conflation is really tiresome. If we banned China from importing video games into the US, that would be a trade issue. It's very ironic you bring this up though, since China is famously very strict about what foreign media it allows in, and really about how foreign businesses in general are allowed to operate there. reply beau_g 11 hours agorootparentprevI think those comparisons are poor TikTok is service that could be used to send instantaneous information to 170 million users in the US. It's potential to cause a problem if it's controllers choose to do so is many orders of magnitude broader and faster than those examples. reply lcnPylGDnU4H9OF 4 hours agorootparentprev> Are they not allowed to sell books in the United States? They would not be allowed to own the publishing company. > How about guns? This doesn’t have anything to do with media. > Can they release major motion pictures? They would not be allowed to own the publishing company. > Video games? They would not be allowed to own the publishing company. The people in these communities still have a right to assemble and say things to each other. It’s more difficult to do so on TikTok after the US distribution ban but it’s ByteDance who made it impossible with this play; this service shutdown is not a requirement of the law. reply FranzFerdiNaN 12 hours agorootparentprevFreedom of speech isn’t freedom of a platform. Their speech isn’t limited. reply jakelazaroff 12 hours agorootparentImagine saying this if the government shut down, say, a newspaper publishing things they didn’t like. “Freedom of speech isn’t freedom of a platform; the reporters can write elsewhere.” reply pjerem 11 hours agorootparentIdk for the US, but where I live, newspapers have special laws that protects them more than other platforms. Pretty sure it’s the same in the US. reply jakelazaroff 5 hours agorootparentThat is not correct. reply ternaryoperator 11 hours agorootparentprevFre",
    "originSummary": [
      "TikTok experienced a temporary shutdown in the U.S. due to a federal ban, but service began to be restored by midday Sunday.",
      "The ban was driven by concerns over potential Chinese surveillance, with bipartisan support for requiring ByteDance, TikTok's owner, to sell the app.",
      "President-elect Donald Trump suggested delaying the ban and proposed a joint venture with U.S. ownership as a potential solution, while alternative apps gained popularity during the ban."
    ],
    "commentSummary": [
      "TikTok's ban in the US has ignited discussions on data privacy and geopolitical influence, with concerns centered around its Chinese ownership. The ban is seen by some as a national security measure, while others perceive it as a limitation on free speech and a potential advantage for American tech companies. This situation has prompted debates on balancing security with freedom and the impact of foreign entities on domestic media."
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "Kalman Filter Tutorial",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "KalmanFilter.NET KalmanFilter.NET English 日本 Português Español 中文 Tiếng Việt Overview About this tutorial About Kalman Filter The prediction requirement Introduction to Kalman Filter Multivariate Kalman Filter Non-linear Kalman Filters Kalman Filter in practice Order Overview \"If you can't explain it simply, you don't understand it well enough.\" Albert Einstein About this tutorial The Kalman Filter algorithm is a powerful tool for estimating and predicting system states in the presence of uncertainty and is widely used as a fundamental component in applications such as target tracking, navigation, and control. Although the Kalman Filter is a straightforward concept, many resources on the subject require extensive mathematical background and fail to provide practical examples and illustrations, making it more complicated than necessary. Back in 2017, I created an online tutorial based on numerical examples and intuitive explanations to make the topic more accessible and understandable. The online tutorial provides introductory material covering the univariate (one-dimensional) and multivariate (multidimensional) Kalman Filters. Over time, I have received many requests to include more advanced topics, such as non-linear Kalman Filters (Extended Kalman Filter and Unscented Kalman Filter), sensors fusion, and practical implementation guidelines. Based on the material covered in the online tutorial, I authored a book. The original online tutorial is available for free access. The e-book and the source code (Python and MATLAB) for the numerical examples are available for purchase. The book takes the reader from the basics to the advanced topics, covering both theoretical concepts and practical applications. The writing style is intuitive, prioritizing clarity of ideas over mathematical rigor, and it approaches the topic from a philosophical perspective before delving into quantification. The book contains many illustrative examples, including 14 fully solved numerical examples with performance plots and tables. Examples progress in a paced, logical manner and build upon each other. The book also includes the necessary mathematical background, providing a solid foundation to expand your knowledge and help to overcome your math fears. Upon finishing this book, you will be able to design, simulate, and evaluate the performance of the Kalman Filter. The book includes four parts: Part 1 serves as an introduction to the Kalman Filter, using eight numerical examples, and doesn't require any prior mathematical knowledge. You can call it \"The Kalman Filter for Dummies,\" as it aims to provide an intuitive understanding and develop \"Kalman Filter intuition.\" Upon completing Part 1, readers will thoroughly understand the Kalman Filter's concept and be able to design a univariate (one-dimensional) Kalman Filter. Most of this part is available for free access! Part 2 presents the Kalman Filter in matrix notation, covering the multivariate (multidimensional) Kalman Filter. It includes a mathematical derivation of Kalman Filter equations, dynamic systems modeling, and two numerical examples. This section is more advanced and requires basic knowledge of Linear Algebra (only matrix operations). Upon completion, readers will understand the math behind the Kalman Filter and be able to design a multivariate Kalman Filter. Most of this part is available for free access! Part 3 is dedicated to the non-linear Kalman Filter, which is essential for mastering the Kalman Filter since most real-life systems are non-linear. This part begins with a problem statement and describes the differences between linear and non-linear systems. It includes derivation and examples of the most common non-linear filters: the Extended Kalman Filter and the Unscented Kalman Filter. Part 4 contains practical guidelines for Kalman Filter implementation, including sensor fusion, variable measurement uncertainty, treatment of missing measurements, treatment of outliers, and the Kalman Filter design process. Get the book \"The road to learning by precept is long, by example short and effective.\" Lucius Seneca About the Kalman Filter Many modern systems utilize multiple sensors to estimate hidden (unknown) states through a series of measurements. For instance, a GPS receiver can estimate location and velocity, where location and velocity represent the hidden states, while the differential time of the arrival of signals from satellites serves as measurements. One of the biggest challenges of tracking and control systems is providing an accurate and precise estimation of the hidden states in the presence of uncertainty. For example, GPS receivers are subject to measurement uncertainties influenced by external factors, such as thermal noise, atmospheric effects, slight changes in satellite positions, receiver clock precision, and more. The Kalman Filter is a widely used estimation algorithm that plays a critical role in many fields. It is designed to estimate the hidden states of the system, even when the measurements are imprecise and uncertain. Also, the Kalman Filter predicts the future system state based on past estimations. The filter is named after Rudolf E. Kálmán (May 19, 1930 – July 2, 2016). In 1960, Kálmán published his famous paper describing a recursive solution to the discrete-data linear filtering problem. The prediction requirement Before delving into the Kalman Filter explanation, let us first understand the necessity of a tracking and prediction algorithm. To illustrate this point, let's take the example of a tracking radar. Suppose we have a track cycle of 5 seconds. At intervals of 5 seconds, the radar samples the target by directing a dedicated pencil beam. Once the radar \"visits\" the target, it proceeds to estimate the current position and velocity of the target. The radar also estimates (or predicts) the target's position at the time of the next track beam. The future target position can be easily calculated using Newton's motion equations: \\[ x= x_{0} + v_{0} \\Delta t+ \\frac{1}{2}a \\Delta t^{2} \\] Where: \\( x \\) is the target position \\( x_{0} \\) is the initial target position \\( v_{0} \\) is the initial target velocity \\( a \\) is the target acceleration \\( \\Delta t \\) is the time interval (5 seconds in our example) If you need a refresh on the motion equations, refer to Appendix I in the book. When dealing with three dimensions, Newton's motion equations can be expressed as a system of equations: \\[ \\left\\{\\begin{matrix} x= x_{0} + v_{x0} \\Delta t+ \\frac{1}{2}a_{x} \\Delta t^{2}\\\\ y= y_{0} + v_{y0} \\Delta t+ \\frac{1}{2}a_{y} \\Delta t^{2}\\\\ z= z_{0} + v_{z0} \\Delta t+ \\frac{1}{2}a_{z} \\Delta t^{2} \\end{matrix}\\right. \\] The set of target parameters \\( \\left[ x, y, z, v_{x},v_{y},v_{z},a_{x},a_{y},a_{z} \\right] \\) is known as the System State. The current state serves as the input for the prediction algorithm, while the algorithm's output is the future state, which includes the target parameters for the subsequent time interval. The system of equations mentioned above is known as a Dynamic Model or State Space Model. The dynamic model describes the relationship between the input and output of the system. Apparently, if the target's current state and dynamic model are known, predicting the target's subsequent state can be easily accomplished. In reality, the radar measurement is not entirely accurate. It contains random errors or uncertainties that can affect the accuracy of the predicted target state. The magnitude of the errors depends on various factors, such as radar calibration, beam width, and signal-to-noise ratio of the returned echo. The random errors or uncertainties in the radar measurement are known as Measurement Noise. In addition, the target motion is not always aligned with the motion equations due to external factors like wind, air turbulence, and pilot maneuvers. This misalignment between the motion equations and the actual target motion results in an error or uncertainty in the dynamic model, which is called Process Noise. Due to the Measurement Noise and the Process Noise, the estimated target position can be far away from the actual target position. In this case, the radar might send the track beam in the wrong direction and miss the target. In order to improve the radar's tracking accuracy, it is essential to employ a prediction algorithm that accounts for both process and measurement uncertainty. The most common tracking and prediction algorithm is the Kalman Filter. Get the book Don't miss out on the Black Friday special! Next Accessibility Privacy Terms and Conditions © Copyright 2024 Alex Becker. All rights reserved.",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "Kalman Filter Tutorial (kalmanfilter.net)329 points by ColinWright 21 hours agohidepastfavorite68 comments rsp1984 19 hours agoAlways telling this whenever the topic of Kalman Filters come up: If you're learning the Kalman Filter in isolation, you're kind of learning it backwards and missing out on huge \"aha\" moments that the surrounding theory can unlock. To truly understand the Kalman Filter, you need to study Least Squares (aka linear regression), then recursive Least Squares, then the Information Filter (which is a different formulation of the KF). Then you'll realize the KF is just recursive Least Squares reformulated in a way to prioritize efficiency in the update step. This PDF gives a concise overview: [1] http://ais.informatik.uni-freiburg.de/teaching/ws13/mapping/... reply bradly 18 hours agoparentI appreciate you taking the time to help people understand higher level concepts. From a different perspective... I have no traditional background in mathematics or physics. I do not understand the first line of the pdf you posted nor do I understand the process for obtaining the context to understand it. But I have intellectual curiosity. So the best path forward for me understanding is a path that can maintain that curiosity while making progress on understanding. I can reread the The Six (Not So ) Easy Pieces and not understand any of it and still find value in it. I can play with Arnold's cat and, slowly, through no scientific rigor other than the curiosity of the naked ape, I can experience these concepts that have traditionally been behind gates of context I do not possess keys to. http://gerdbreitenbach.de/arnold_cat/cat.html reply mnky9800n 7 hours agorootparentYou aren’t supposed to understand things if you don’t know about them. That’s how it works. reply keithalewis 17 hours agorootparentprevnext [5 more] [flagged] bradly 17 hours agorootparent> Just stop whining about it in public. I'm curious if this is how my reply came across? reply keithalewis 35 minutes agorootparentYour statement \"the best path forward for me understanding is a path that can maintain that curiosity\" comes off as entitled. Only you owe yourself that. \"I can play with Arnold's cat and, slowly, through no scientific rigor...\" You are fooling yourself into believing you understand if you leave out rigor. If your post has the words \"I\" and \"me\" in every other sentence, maybe you should consider whether or not you are adding value for others in the online discussion. I doesn't cost you anything to ask other people to do things for you, and you will no doubt find other thoughtless people chiming in about your right to do that. If everything you need is not at your fingertips already, maybe no amount of handholding will help. reply vo2maxer 17 hours agorootparentprevNot at all. I share your sentiment. Many topics are beyond my intellectual grasp at this time, but I’m always hopeful that my curiosity will lessen their obscurity given time and persistence. reply airstrike 16 hours agorootparentprevNot at all. Your comment was perfectly fine! And that reply was way out of line... reply mtizim 17 hours agorootparentprevWith no mathematical rigor there is no mathematical understanding. You are robbing yourself, as the concepts are meaningless without the context. Truly appreciate the power of linear approximations by going through algebra, appreciate the tricks of calculus, marvel at the inherent tradeoffs of knowledge with estimator theory, and see the joy of the central limit theorem being true. All of this knowledge is free, and much more interesting than a formal restatement of \"it was not supposed to rain, but I see clouds outside, I guess I'll expect light rain instead of a big thunderstorm\". reply bradly 16 hours agorootparent> With no mathematical rigor there is no mathematical understanding. You are robbing yourself, as the concepts are meaningless without the context. I will think more about this, but I'm not sure I agree. I have enjoyed reading Feynman talk about twins and one going on a supersonic vacation without understanding the math. Verisimilitude allows a modeling of understanding with a scalar representation of scientific knowledge, so why not? Of course I would like to understand the math in its purest forms–just the same as I wanted to read 1Q84 in Japanese to be able to fully experience it in its purest form, but my life isn't structured in a way were that is realistic even if the knowledge of the Japanese language is free. > Truly appreciate the power of linear approximations by going through algebra, appreciate the tricks of calculus, marvel at the inherent tradeoffs of knowledge with estimator theory, and see the joy of the central limit theorem being true. I can't even foil so the journey toward understanding can feel unattainable in the time resources I have. This absolutely may be a limiting belief, but the concept of knowledge being free ignores the time cost for some exploring these outside of academia or professional setting. reply RossBencina 14 hours agorootparentIndeed everything has an opportunity cost, and every life has its own priorities. Since you mention Feynman, I would like to observe that many expositors who target the lay audience have the skill of making the audience believe that they have comprehended(1) something of an intellectual world that they have no technical grounding to truly comprehend(2). In my view these are two distinct types of comprehension/understanding. So long as the audience is clear on which type of understanding they are getting, and is not wasting time unwittingly pursuing one type at the expense of the other then I see no harm. There is a risk however, that the pop expositors will put you in a headspace where even if you are faced with accessible, but type 2, material you will not be familiar with what really constitutes understanding. As a mature age student it took me quite a few years of maths exams to switch from 1 to 2. Nowadays I am more comfortable with admitting that I don't understand some piece of math (for that is the first step on the path to learning) than being satisfied with a pop-expository gist. reply mlyle 10 hours agorootparentI've thought a lot about this exact topic. You need both to do well. You need handwavy and vague versions of things to understand the shape of them and to build intuition. Then you need to test the intuition and build up levels of rigor. Especially in the context of the Kalman Filter. I just helped a bunch of middle school students build a system for field localization and position tracking. They don't have all kinds of knowledge. They don't have linear algebra or a real understanding of something being gaussian and have to have a bazillion variables. They understand that their estimates and the quality of stuff coming off their sensors have different qualities based on circumstances, and that gain needs to vary. They'll never hit the optimum parameters. But: their system works. They understand how it works (even if they don't know how to quantify how well it works). They understand how changing parameters changes its behavior. When they learn tracking filters and control by root locus and all kinds of things later, they'll have an edge in understanding what things mean and how it actually works. I expect their intuition will give them an easier time in tackling harder problems. Conversely, I've encountered a bunch of students who know what \"multimodal\" means but couldn't name a single example in the real world of such a thing. I would argue that they don't even know what they're talking about, even if they can calculate a mixture coefficient under ideal conditions. reply idiotsecant 11 hours agorootparentprevThere's a lot of fluffly language here that isn't saying much. Linear algebra is not something that takes years of patient study to gain basic competency. It had almost no prerequisites and can be understood enough to understand least squares in a focused weekend or two. reply f1shy 10 hours agorootparentprev> With no mathematical rigor there is no mathematical understanding While I appreciate rigor to really know deep details, is not only not a requirement for understanding, but a hurdle. A terrible insurmountable hurdle. To first have understanding, I need some kind intuition. Some explanation that makes sense easily. That explanation is btw, what typically the inventor or discoverer had to begin with, before nailing it down with rigor. reply jampekka 16 hours agorootparentprev> Truly appreciate the power of linear approximations by going through algebra, appreciate the tricks of calculus, marvel at the inherent tradeoffs of knowledge with estimator theory, and see the joy of the central limit theorem being true. None of these are needed, or even useful, for understanding the Kalman filter. reply 7bit 8 hours agorootparentprev> With no mathematical rigor there is no mathematical understanding. You are robbing yourself, as the concepts are meaningless without the context. You don't need to know what Gravity is to calculate the time it takes for an apple to fall from a tree. You just need to accept that g=9.8m/s2. You also don't need to understand the chemistry of flour, salt, sugar, sodium, milk and eggs to bake a cake. reply jampekka 18 hours agoparentprevI think the easiest way depends on your background knowledge. If you understand linearity of the Gaussian distribution and the Bayesian posterior of Gaussians, the Kalman filter is almost trivial. For (1D) we get the prior from the linear prediction X'1 = X0*a + b, for which mean(X'1) = mean(X0)*a + b and var(X'1) = var(X0)*a^2, where a and b give the assumed dynamics. The posterior for Gaussians is the precision weighted mean of the prior and the observation: X1 = (1 K)*X'1 + Y*K, where the weighting K = (1/var(X'1))/(1/var(X'1) + 1/var(Y)), with Y being the Gaussian observation. Iterating this gives the Kalman filter. Generalizing this to multiple dimensions is straightforward given the linearity of multidimensional Gaussians. This is how (after I understood it) it makes it really simple to me, but things like linearity of (multidimensional) Gaussians and the posterior of Gaussians as such probably are not. reply krtab 7 hours agorootparentI have written down a similar derivation here if anyone is interested: https://ngr.yt/blog/kalman/ reply RossBencina 14 hours agorootparentprevWhat you write is simple. But your scalar model suppresses the common situation of a measurement matrix with output dimension less than state dimension. Exactly how the Kalman gain formula works under this setting I'm less clear on. Beyond that, additional insight is needed when the measurement matrix is non-linear and K = P_xy P_y^{-1} as in the UKF. At least I get stuck there, with little formal statistics work. reply jampekka 9 hours agorootparentGood catch, indeed a measurement matrix is needed if the state and measurement are of different dimensions or require a (linear) transformation. For that use Y = H*z where H is the measurement matrix and z is the observation vector. For UKF the Y is still a multidimensional Gaussian and computing K is the same. The mean and covariance of Y is computed from Z and the nonlinear measurement function using the unscented transform. reply jtrueb 18 hours agoparentprevYou can keep telling this, but this “esoteric” math is often too much for the people actually implementing the filters. reply defrost 18 hours agorootparentIt's bread and butter math for physics, Engineering (trad. Engineering), Geophysics, Signal processing etc. Why would anyone have people implementing Kalman filters who found the math behind them \"esoteric\"? Back in the day, in my wet behind the ears phase, my first time implementing a Kalman Filter from scratch, the application was to perform magnetic heading normalisation for on mag data from an airborne geophysical survey 3 axis nanotesla sensor inputs on each wing and tail boom requiring a per survey calibration pattern to normalise the readings over a fixed location regardless of heading. This was buried as part of a suite requiring calculation of the geomagnetic reference field (a big paramaterised spherical harmonic equation), upward, downward and reduce to pole continuations of magnetic field equations, raw GPS post processing corrections, etc. where \"etc\" goes on for a shelf full of books with a dense chunk of applied mathematics reply jampekka 16 hours agorootparentprevFWIW, I think I understand Kalman filters quite well, but the linked PDF is hard for me to follow, and I'd really struggle to understand it if I didn't already know what it's saying. I think the lesson there is that the Kalman filter is simpler in the \"information form\" where the Gaussian distribution is parameterized using the inverse of the covariance matrix. If you don't already know what that means, you likely don't get much out of that. I think the more intuitive way is to first understand the 1D case where the filter result is weighted average of the prediction and the observation where the weights are the multiplicative inverses of the respective variances (the less uncertainty/\"inprecision\", the more you give weight). In the multidimensional case the inverse is the matrix inverse but the logic is the same. More generally the idea is to statistically predict the next step from the previous and then balance out the prediction and the noisy observation based on the confidence you have in each. This intuition covers all Bayesian filters. The Kalman filter is a special case of the Bayesian filter where the prediction is linear and all uncertainties are Gaussian, although it was understood this way only well after Kalman invented the eponymous filter. Not sure how intuitive that's either, but don't be too worried if these things aren't obvious, because they aren't until you know all the previous steps. To implement or use a Kalman filter you don't really need this statistical understanding. If you prefer to understand things more \"procedually\", check out the particle filter. It's conceptually the Bayesian filter but doesn't require the mathematical analysis. That's the way I really understood the underlying logic. reply IgorPartola 18 hours agorootparentprevI understood it as reestimation with a dynamic weight factor based on the perceived error factor. I know it’s more complex than that but this simplified version I needed at one point and it worked. reply jbullock35 16 hours agoparentprevI found this article invaluable for understanding the Kalman filter from a Bayesian perspective: Meinhold, Richard J., and Nozer D. Singpurwalla. 1983. \"Understanding the Kalman Filter.\" American Statistician 37 (May): 123–27. reply dr_kiszonka 19 hours agoparentprevYou are probably right, but many folks following your advice will give up halfway through and never get to KF. reply RossBencina 15 hours agoparentprevThis is more or less the approach that is taken by Dan Simon's \"Optimal State Estimation\" book that I came here to recommend: https://academic.csuohio.edu/simon-daniel/state-estimation/ All the prerequisites are covered prior to introducing the Kalman filter in chapter 5. Although Simon does not go through the information filter before introducing the Kalman filter, he discusses it later. However, to understand recursive least squares, in particular the covariance matrix update you're going to need a firm grounding in probability and statistics. Simon makes the case that probability theory is a less strict pre-requisite than multiple-input-multiple-output (state space) linear systems theory (for which I can recommend Chen's \"Linear System Theory and Design\"). So I would argue that to understand Kalman filters you need to know state space systems modelling, both continuous time and discrete time discretisation methods (this provides the dynamics that describe the time-update step), plus you need to know enough multivariate statistics to understand how the Kalman filter propagates the gaussian random variables (i.e. the Kalman state) through the dynamics and back and forth through the measurement matrices. reply ilayn 3 hours agoparentprev(Laughs in control theory) reply raincom 19 hours agoparentprevThat’s the one should learn any subject—-be it physics, chemistry, math, etc. However, textbooks don’t follow that technique. reply ryan-duve 18 hours agorootparentI strongly recommend Elements of Physics by Millikan and Gale for anyone who wants to learn pre-quantum physics this way. reply jvanderbot 17 hours agoparentprevAre you me? I feel like I say this every time too! Perfectly captured. reply richrichie 10 hours agoparentprevIndeed. I always recommend Time Series Analysis by Hamilton for this reason. KF comes up as a natural way to solve linear models. reply jtrueb 20 hours agoprevEvery time that one comes up, this one comes up https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Pyt... (and vice versa) reply elcritch 15 hours agoparentThat one is one of my favorite resources on Kalman filters. Deriving it from Bayesian principles make it much more intuitive. It also makes adapting or modifying the filters easier to understand. Using Jupyter notebooks is really great too. reply david_draco 19 hours agoprevAs far as I am aware, there is no symbolic computing tool yet for probability distributions? For example, multiplying two multivariate Gaussian PDFs together and getting the covariance matrix out. Or defining all the ingredients for a Kalman filter (prediction model and observing process) and getting the necessary formulas out (as in sympy's lambdify). reply jampekka 16 hours agoparentSympy can manipulate Gaussian distributions symbolically, but the Gaussian is more or less the only distribution that can be really symbolically manipulated. Though I'm not sure Sympy can handle the conditional (Bayesian posterior) distribution needed for the Kalman filter. In any case, you are better off working direcly with the mean and variance (or covariance matrix) if you want to play around with the Kalman filter with Sympy. reply mitthrowaway2 14 hours agorootparentThe posterior is also a Gaussian, is it not? reply jampekka 10 hours agorootparentYes. reply nathansherburn 6 hours agoparentprevNot sure if relevant but I thought this looked very cool. https://www.squiggle-language.com/docs reply jiggawatts 12 hours agoparentprevI'm pretty sure Wolfram Mathematica can do what you're looking for. See: https://reference.wolfram.com/language/howto/WorkWithStatist... and: https://reference.wolfram.com/language/ref/MultinormalDistri... reply thundercarrot 14 hours agoprevIf Q and R are constant (as is usually the case), the gain quickly converges, such that the Kalman filter is just an exponential filter with a prediction step. For many people this is a lot easier to understand, and even matches how it is typically used, where Q and R are manually tuned until it “looks good” and never changed again. Moreover, there is just one gain to manually tune instead of multiple quantities Q and R. reply blharr 11 hours agoparentThis is really what I have never understood about Kalman Filters. As to how you pick Q and R. Do you just adjust them until the result looks right? How does that end up working for anything not completely over-fit? For example, if I'm tracking birds from video footage, I might choose a certain Q, but depending on the time of day the noise statistics might change. What do you do then? reply zipy124 7 hours agoprevThe best resource is almost always this: https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Pyt... Even if you aren't a python person, it's fantastic and really goes through everything. reply dang 19 hours agoprevRelated. Others? Kalman filter from the ground up https://news.ycombinator.com/item?id=37879715 Oct 2023 (150 comments) (also what's the best year to put in the title above?) reply dpflan 19 hours agoprevAnyone else watch Michael van Biezem (with the bow tie) lectures on Kalman Filters while learning this topic? https://www.youtube.com/watch?v=CaCcOwJPytQ&list=PLX2gX-ftPV... reply FilosofumRex 11 hours agoparentI like how he teaches so many different topics and subjects using nothing more than arithmetics. All computable math is reducible to arithmetics... reply pmarreck 19 hours agoprevSomething occurred to me a while back: Can we treat events that only have eyewitness testimony with a Kalman filter somehow in order to strengthen the evidential value of the observations after encoding it into vectors of some sort? This would treat both lying and inaccuracy as \"error\" I'm thinking of things like: reports of Phoenix lights or UFOs in general, ghosts, NDEs, and more prosaically, claims of rape reply plasticchris 19 hours agoparentOnly if you can make a linear model of those things… reply bradly 18 hours agorootparentWhy does the model need to be linear? reply pinkmuffinere 18 hours agorootparent“Kalman filter” usually refers to “linear quadratic estimator”, which assumes a linear model in its derivation. This will impact the “predict“ step at the very least, and I think also the way the uncertainty propagates. There are nonlinear estimators as well, though they usually have less-nice guarantees (eg particle filter, extended kalman filter) Edit: in fact, I see part three of the book in tfa is devoted to nonlinear Kalman filters. I suspect some of the crowd (myself included) just assumed we were talking about linear Kalman filters reply RossBencina 14 hours agorootparentIndeed the Extended Kalman Filter (EKF) and Unscented Kalman Filter (UKF) are both standard methods to deal with non-linear systems. They each provide a method of propagating uncertainty through nonlinear state and measurement functions. FWIW I would assume that EKF and UKF are within scope whenever Kalman Filtering is mentioned but I may be misinformed. reply pinkmuffinere 12 hours agorootparentIt’s probably just my bias making me think of linear systems — I’ve only used the nonlinear ones in coursework, certainly less familiar. Apologies if I misrepresented it. reply f1shy 10 hours agoprevAnother resource: https://news.ycombinator.com/item?id=42755133 reply blharr 19 hours agoprevThe first example of tracking, is this the same thing as dead reckoning? I've always been confused on the term \"tracking\" since it is used a lot in common speech, but seems to mean some specific type of 'tracking' reply hansvm 19 hours agoparentKind of. \"Tracking\", here, means providing some kind of `f(time) > space` API. Dead reckoning is a mechanism for incorporating velocity and whatnot into a previously estimated position to estimate a new position (and is also one possible way to implement tracking, usually with compounding errors). The Kalman filter example is better than just dead reckoning. For a simple example, imagine you're standing still but don't know exactly where. You have an API (like GPS) that can estimate your current position within some tolerance. If you're able to query that API repeatedly and the errors aren't correlated, you can pinpoint your location much more precisely. Back to tracking with non-zero velocity, every new position estimate (e.g., from GPS) can be incorporated with all the information you've seen so far, adjusting your estimates of velocity, acceleration, and position and giving you a much more accurate current estimate but also better data for dead-reckoning estimates while you wait for your next external signal. The technique (Kalman Filter) is pretty general. It's just merging all your noisy sources of information according to some ruleset (real-world physics being a common ruleset). You can tack on all sorts of other interesting information, like nearby wifi signals or whatever, and even very noisy signals can aggregate to give precise results. Another application I threw it at once was estimating my true weight, glycogen reserves, ..., from a variety of noisy measurements. The sky's the limit. You just need multiple measurements and a rule for how they interact. reply jampekka 15 hours agorootparentThis is a very educational and intuitive way of putting it, but to nitpick the Kalman filter is a very special case of this (it assumes a linear ruleset and Gaussian uncertainties in the sensor readings). What you're describing is in general the Bayesian filter (or Bayesian smoothing if you don't have to give the result immediately). reply hansvm 11 hours agorootparentYep, that's right. I thought about adding that detail but decided it might detract from the main points. Hopefully anyone interested also sees your comment. reply defrost 19 hours agoparentprevDead reckoning is a form of prediction, based on past evidence that indicates location then, you are reckoning (best guessing) a current position and detrmining a direction to move forward to reach some target. \"Past evidence that indicates\" is deliberate phrasing, in the majority of these examples we are looking at acquired data with noise; errors, instrument noise, missing returns, etc. \"Tracking\" is multi-stage, there's a desired target to be found (or to be declared absent) in noisy data .. that's pattern search and locking, the trajectory (the track) of that target must be best guessed, and the best guess forward prediction can be used to assist the search for the target in a new position. This is not all that can be done with a Kalman filter but it's typical of a class of common applications. reply graycat 13 hours agoprevThe Kalman Filter is a topic in the more general David G.\\ Luenberger, {\\it Optimization by Vector Space Methods,\\/} John Wiley and Sons, Inc., New York, 1969.\\ \\ reply einpoklum 19 hours agoprevThe one sentence you really need to know: \"The filter is named after Rudolf E. Kálmán (May 19, 1930 – July 2, 2016). In 1960, Kálmán published his famous paper describing a recursive solution to the discrete-data linear filtering problem.\" reply magic_hamster 20 hours agoprevNot sure why, but I get this vague notion that the author might have written a book. reply esafak 15 hours agoparentIf it takes you a whole book to explain Kalman filtering you're doing it wrong. reply elcritch 15 hours agorootparentPerhaps to get the basics sure, but to go through all the edge cases and parameter tuning and failure modes will easily fill a small book. That's not even going into modifying Kalman filters for non-linear systems. reply greesil 15 hours agoprevYou can do all of this with machine learning better now, if you have the data. reply RossBencina 14 hours agoparentKalman Filtering is machine learning. It has been used as a neural network training method. I'm implementing real-time dual state/parameter estimators at the limits of computational tractability. Please tell me how \"machine learning\" can solve my problem better. reply greesil 14 hours agorootparentYou've got nonlinear things happening? reply RossBencina 13 hours agorootparentThe state dynamics are linear but they are time varying and unknown. I am tracking the dynamics with a second Kalman filter (dual UKF like structure but mostly linear). Main \"problem area\" is covariance propagation, since the dynamics are defined by GRVs estimated by the parameter estimator but this uncertainty is not propagated between state/parameter estimators. It's a known shortcoming with standard (UKF) dual parameter+state estimation. I've yet to conclude whether it's a real or imaginary problem for my use-case. reply escapecharacter 16 hours agoprev [–] Please, if you’re looking to denoise a signal for human input, use the 1-Euro filter instead: https://gery.casiez.net/1euro/ Easier to code, easier to tune parameters without a noise model reply RossBencina 14 hours agoparent [–] It's a one-pole lowpass IIR filter. But I agree, if a one-pole filter will solve your problem. Kalman filter is an optimal state estimator, useful when you have: multiple input and/or multiple output system non-trivial dynamics (i.e. the system of interest is in motion and you have a state space description of the dynamics) noisy measurements statistical estimates of process and measurement noise are available ideally, iid gaussian noises Also good if you want to fuse data on different time scales or with different noise properties. What have I missed? reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "KalmanFilter.NET provides a tutorial on the Kalman Filter, a mathematical tool for estimating and predicting system states in uncertain conditions, commonly used in tracking and navigation.",
      "The tutorial, initiated in 2017, includes numerical examples and intuitive explanations, covering both univariate and multivariate Kalman Filters, and has expanded to advanced topics like non-linear Kalman Filters.",
      "A book based on the tutorial offers a comprehensive guide from basics to advanced topics, with illustrative examples and practical applications, making the Kalman Filter accessible and understandable, with some parts available for free."
    ],
    "commentSummary": [
      "To grasp the Kalman Filter, it's beneficial to first study Least Squares, recursive Least Squares, and the Information Filter, as the Kalman Filter is an efficient reformulation of recursive Least Squares.",
      "The Kalman Filter is a powerful tool for state estimation in systems with noise and dynamic changes, and it can be understood from both procedural and Bayesian perspectives.",
      "While mathematical rigor is crucial for a deep understanding, those without a strong math background can still explore the concepts through intuitive means, supported by various resources like PDFs and online tutorials."
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "Forgejo: A self-hosted lightweight software forge",
    "originLink": "https://forgejo.org/",
    "originBody": "Forgejo Beyond coding. We forge. Forgejo is a self-hosted lightweight software forge. Easy to install and low maintenance, it just does the job. Brought to you by an inclusive community under the umbrella of Codeberg e.V., a democratic non-profit organization, Forgejo can be trusted to be exclusively Free Software. You can create an account on Codeberg and other instances or download it to self-host your own. It focuses on security, scaling, federation and privacy. Learn more about how it compares with other forges. Get Forgejo Try now Learn more Forge great software with Forgejo Take back control of your software development process, self-host your projects and get everyone involved in delivering quality software on the same page. Simple software project management Ease of use is important to get things done efficiently. Forgejo’s user experience is designed for collaboration and productivity. Self-hosted alternative to GitHub Liberate your software from proprietary shackles. Forgejo offers a familiar environment to GitHub users, allowing smooth transition to a platform you own. Easy to install and maintain Hosting your own software forge does not require expert skills. With Forgejo you can control your server with minimal effort. Lightweight and performant With a rich feature set, Forgejo still has a low server profile and requires an order of magnitude less resources than other forges. Guaranteed 100% Free Software Forgejo will always be Free and Open Source Software. Furthermore we exclusively use Free Software for our own project development. Beyond coding, we forge ahead An exciting future awaits. We will innovate the Software Forge and enable collaborative software development facilitated by decentralized platforms. Get Involved Forgejo consists of motivated people, and we are looking forward to your contribution . Feel free to help in the domains of localization, code, federation, releases management, user research, UX and usability, community management, documentation, web design, governance and more. Contribute on Codeberg Donate",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "Forgejo: A self-hosted lightweight software forge (forgejo.org)276 points by thunderbong 14 hours agohidepastfavorite208 comments jazzyjackson 9 hours agoFrom the FAQ, forˈd͡ʒe.jo, to my midwestern ear, \"4 Jay yo\", Esperantese for Forge. A fork of Gitea [0] but managed via a non profit, no premium upsells, all freely licensed [1](GPL) etc. Good to see their community outreach is via Matrix and Mastadon. My kind of nerds. Apparently this is what Codeberg is running out, if you click . Looks like gitea/github to me, nothing wrong with that [2] source code is available from the little branch icon in the top right corner, hosted on codeberg which TIL is a forgejo instance [3] [0] https://forgejo.org/2024-02-forking-forward/ [1] https://forgejo.org/2024-08-gpl/ [2] https://v10.next.forgejo.org/explore/repos [3] https://codeberg.org/forgejo/forgejo reply geek_at 2 hours agoparent> no premium upsells So.. like gitea? From my understanding the fork was done because gitea created a company to build custom-features for companies if they ask. Not really many indicators for a rugpull reply ffsm8 1 hour agorootparentFork timeline Gogs, inspired by GitHub back when it still had the original old UI > Gitea, forked with minor drama (claimed that they forking because the project wasn't maintained, which was untrue they just didn't want to merge their PR) > Gitea goes commercial, making previous community contributions into essentially free labor for their profit -> Forgejo forks Gitea (and never actually does anything new afaik, it's just Gitea under another name, while taking money too) So, the original comment is spot on: the design is basically old GitHub, copied back in early 2010 by Gogs devs Gitea did add several useful features over the years, which I think rationalized their pivot (vertical CI integration etc), but that's just my opinion as a Gogs user that doesn't need them. reply Macha 26 minutes agorootparentThe money that Forgejo takes is €60/month in Liberapay donations, and some grants to developer federation features so I think it's a little disingenuous to compare it to Gitea's pivot to open core and hosted cloud service. reply mort96 1 hour agorootparentprevThe pricing page (https://about.gitea.com/pricing/) talks about paywalled \"Enhanced enterprise-level features and experiences\". Are you sure that doesn't count as a premium upsell? reply xena 6 hours agoparentprevIt's more like \"forge place\" in the same way that kafejo (cafe) is \"coffee place\". reply colanderman 1 hour agorootparentIt's actually more like \"distant gay\" (and would be pronounced with a hard \"g\") because it's a (presumably deliberate) misspelling of forĝejo. reply Karliss 4 hours agorootparentprevThat's English for you, same word is usable for describing action, place and the furnace. reply asddubs 2 hours agoparentprevI was kind of passively wondering the other day what the main differences were between gitea and forgejo at this point, since they've been separate projects for a bit now. It seems there aren't any direct comparisons I could find, though. reply KingMob 6 hours agoprevI got curious about why Forgejo split off from Gitea, and it seems like yet another case of broke FOSS creators/maintainers getting screwed from above (and maybe below too). From the Gitea incorporation announcement (below), it looks like they couldn't pay their bills as FOSS, and there were wealthy free-riders (which the MIT license allows). > \"Over the years we have tried various ways to support maintainers and the project. Some ways we have tried include bounties, direct donations, grants, and a few others. We have found that while there have been many wonderful individuals, and a few corporations who have been incredibly generous, and we are so thankful for their support, there are a few corporations (with revenues that are greater than some countries GDP) are building on Gitea for core products without even contributing back enhancements. [emphasis added] I'm not a fan of Bruce Perens, but he kind of nails the problem when he says: > \"We have a great corporate welfare program, our users are the richest companies in the world. Indeed, we've enabled companies like Google to be created. > \"In contrast, if our developers aren't working for those companies, they probably go un-compensated.\" On the flip side, the community rebelled when the creators formed a company, but not supposedly because they formed a company, but because that co held the domain and trademark. Seems like a small hill to die on to me, but I don't know the details. Regardless, it looks like exhibit #187 of FOSS failing for anyone outside of hobbyists and FAANGs. reply lolinder 5 hours agoparentFOSS isn't a business model. It never was and never will be. What Free Software always was is an ethical movement—one which didn't need to prioritize income streams because the point wasn't sustainable development, it was user freedom. Nowhere in \"users should have the freedom to do what they want with software\" does it say \"and we should be able to pay a few developers a salary for their work towards that fundamentally ethical goal\". Under the original paradigm and goals, any income streams are just cream on top of doing the right thing. According to the OSI's history of itself [0], at some point people got it into their heads that the open development model was inherently a good one for business, too—Netscape jumped on board, and then some people got together and decided to rebrand Free Software: > The conferees decided it was time to dump the moralizing and confrontational attitude that had been associated with \"free software\" in the past and sell the idea strictly on the same pragmatic, business-case grounds that had motivated Netscape. They brainstormed about tactics and a new label. \"Open source\", contributed by Chris Peterson, was the best thing they came up with. The word FOSS reminds me a lot of American corporate Buddhism—mindfulness and meditation totally removed from its original deeply religious context and turned into some sort of self-help program, with the result being something that would be barely recognizable to the original practitioners. Free Software was never about sustainable development. It was about doing the right thing—enabling user freedom—because it is right. Everything else was just means to that end, but at some point along the line the means became the end and we started wondering why FOSS wasn't paying the bills like it was supposed to. [0] http://web.archive.org/web/20071115150105/https://opensource... reply notdiaphone 4 hours agorootparent> FOSS isn't a business model. It never was and never will be. This seems an interesting point and one I share. Yet it seems equally unethical to enable the corporate extractavism that we now see. It's time the \"users should have the freedom to do what they want with software\" be updated to something like 'users and makers should be free of coercion and exploitation by software.' What, after all, are the grounds for such freedoms? Are they issues of property? Or are they ones of the dignity of the persons involved? It doesn't seem controversial that we tend to find it problematic if another uses us as means to their ends without our consent. In personal actions, many act as if they believe this. Yet corporations consistently do not act with those values. You're right: we should strive toward a system not in which it's viable to create businesses out of FOSS but in which both users and developers are not exploited or used unwillingly. reply fluoridation 59 minutes agorootparent>Yet it seems equally unethical to enable the corporate extractavism that we now see. If someone uses and benefits from your product, at what point does it become \"unethical extractivism\"? If I as an individual figure out a way to build a business centered around your product that you make for free, is that already unethical, or is it at a later point? >It doesn't seem controversial that we tend to find it problematic if another uses us as means to their ends without our consent. But you gave your consent by publishing software for anyone to use. reply spookie 2 hours agorootparentprevSometimes I wish I could upvote twice in replies like this. reply KingMob 3 hours agorootparentprev> What Free Software always was is an ethical movement—one which didn't need to prioritize income streams because the point wasn't sustainable development, it was user freedom. This actually illustrates the key flaw in Stallman's understanding. To him, \"user\" encompassed both humans and megacorporations. But a corporation is an abstract legal convenience, cannot feel the pain of being \"thwarted\" in its use of software, and thus, want freedom. Freedom is only an ethical good for humans. Further, I would argue that providing megacorporations with unpaid labor is deeply misguided, if not actually unethical itself. Encouraging otherwise borders on encouraging exploitation. tl;dr Nobody should go broke to enrich Bezos in their spare time, and encouraging THAT is unethical. reply bigstrat2003 1 hour agorootparentStallman's reasoning wasn't flawed (at least, not in the respect you state). Corporations are simply a group of humans. I don't think there's a good argument to be made that humans should have a right to X, but suddenly lose that right when they get together as a group. > Further, I would argue that providing megacorporations with unpaid labor is deeply misguided, if not actually unethical itself. Nobody is \"providing megacorporations with unpaid labor\". People are making an effort to put something out there for the benefit of the entire human race, and if that includes corporations that's fine. Not one person is harmed if Amazon takes my open source project and uses it to turn a profit, even if they make it into closed source. My project remains freely available for the benefit of all, just as it was before Amazon used it. So who exactly has been harmed? Not me, I'm in the same state as I was before. Not my (non-Amazon) users, they are in the same state as they were before. Not Amazon, of course. If every single person is no worse off or even better off than before, I don't see how you can argue that the corporate users are doing something unethical. It seems to me that really this isn't about ethics, but is about \"we don't like those icky people\" masquerading in pretty sounding language. > tl;dr Nobody should go broke to enrich Bezos in their spare time... Nobody should go broke to make open source software, period. reply asddubs 2 hours agorootparentprevWell, stallman would probably advocate for the AGPL in such cases, which the megacorps are still wary of. reply nirui 5 hours agoparentprevMany open source developers has misread the room and thinking the environment is still like it was 15~20 years ago where open source software were the works of hobbyists who has a well-paid day job and only here for street credit. You know who read the room correctly? GitLab. They've found a balanced way to offer their product under an open source scheme while keeping their lights on. They've earned trust as well as income, that's a job well done. If one wants to live off of their open source work, then they need to run it as a business and perform appropriate business tricks. Otherwise their own effort may one day become their own rip-off. Not saying anything sinister, but fairness is a balancing game, if you hard work don't treat you well, then it's unfair too. reply plagiarist 4 hours agorootparentGitLab has collected a few severe CVEs. I would choose \"v4 final final actually final\" folders as a versioning scheme before I used them. It is surprising to me that they have any users at all. reply fluoridation 57 minutes agorootparentWhat does that have to do with whether it's a successful business? reply jcarrano 4 hours agoparentprevCopyleft licenses are supposed to prevent to an extent this sort of free riding, but they are no longer \"fashionable\". I don't see the point of refusing to add additional (copyleft) terms to a license, only to end up hoping companies act as if the terms existed out of good will. Companies like Google love the permissive licenses, and go as far as to sponsor MIT/BSD-licensed replacements to common building blocks like toybox. EDIT: I see that Forgejo v9+ is indeed GPL-licensed. reply kstrauser 1 hour agorootparentI released a tiny toy fun project under the GPL. It’s the kind of thing that no one could possible want to monetize, but the first PR was someone pleading the case that I should relicense to something more friendly, like MIT. I’d never before been so instantly tempted to ban someone from a project. reply KingMob 2 hours agorootparentprevI agree that copyleft is less fashionable these days, but I think big companies have figured out all the tricks they need. Case in point: Amazon offers a hosted Grafana service, which is AGPL. They may not be able to meaningfully change the code in secret, but they can still impoverish the actual Grafana creators trying to sell Grafana as a service. reply notdiaphone 4 hours agoparentprevThis paints it as if Gitea was not a fork of Gogs specifically to turn a profit out of something they did not make on their own. I might be more sympathetic if they'd created Gitea, but given it's a fork of another project, it looks a lot like they're playing the same game that beat them. reply layer8 2 hours agorootparentI don’t think this is quite correct. Gitea was a community fork of Gogs, because Gogs was limited by its single maintainer, who was often unresponsive for months. See https://news.ycombinator.com/item?id=13296717 reply alberth 5 hours agoparentprevFOSS is a distribution strategy, not a business model. reply Vampiero 6 hours agoparentprevIt's not that FOSS fails, it's that unethical corporations worth billions of dollars go unpunished for abusing it (because the law exists to protect them). FOSS is fundamentally anarchy (the good kind that shows that human beings are not all pieces of shit). Anarchy can't exist in a capitalist society because it shows people that they don't HAVE to live like slaves. They can live as members of tribes, as evolution intended for us. So as always the organism is originally healthy and successful until the parasite that is capitalism spreads and suffocates it for its own reproduction. reply rglullis 5 hours agorootparent> They can live as members of tribes, as evolution intended for us. Please, quit the cheap sophistry. Evolution doesn't intend or plan anything for us, and you will have a very hard time convincing people that we would be better off living in a tribal/clan society than whatever we have today. reply Vampiero 5 hours agorootparentEvolution intends in the sense that it follows an abstract fitness function. I didn't think I'd have to explain that here. I know how to implement evolution algorithmically. And no matter what you think about tribal societies, we still live in tribes every day. You and your close friends are a tribe. Your family is a tribe. Forums and now social media communities are tribes. HackerNews is a tribe. Open source projects are tribes, indeed they fork over ideological differences all the time. Political parties are tribes, indeed they split and antagonize each other all the time. Nationalities are tribes. Companies are tribes. Social classes are tribes. Subcultures and \"identities\" are tribes. We are not built to handle global contexts, so we collapse them into tribal ones. We do that for everything. There's always an in-group and an out-group and a hierarchy if we're talking about a cluster of people. reply rglullis 5 hours agorootparentA tribe assumes a strict hierarchy and mobility only though power and violence. I can agree with you about the issue of societies failing to organize themselves past a certain scale, but this is not a problem with \"Capitalism\". reply Vampiero 5 hours agorootparentFair, I used a very loose definition then. My issue with capitalism is fundamentally split in three parts: that profit is the driving force behind action; that short term effects are prioritized over long term ones; and that global markets operate at a scale that does not allow individuals to have any real agency in their environment due to the points outlined in the previous comment. It just fosters the kind of behavior that goes against my idealized version of what society should be according to my understanding of the conditions in which we thrive. i.e. it turns people into selfish venal assholes and it destroys our chances at a better future with each passing day Perhaps I'm also using a wrong definition of anarchy then. But it's honestly the closest label I know for this concept. A less centralized society. reply capr 4 hours agorootparentBut profit _is_ the driving force of human action. Doing anything voluntarily is by definition profitable, otherwise you wouldn't do it. reply KingMob 2 hours agorootparentThis smears out the definition of profit beyond usefulness. I can pretty much guarantee hunter-gatherers hunt to not starve, children play for sheer joy, and nobody's thinking of profit. There are better psychological/anthropological terms to apply to human drives than calling them \"profitable\". That's weird economist thinking, trying to bring everything under their purview. reply spokaneplumb 2 hours agorootparentWorse, it’s an attempt to get us to agree that humans only do things for profit, in order to advance an ideology and make our thought more malleable when an author turns around and starts writing about public policy and ethics applied to things that actually are about profit. At least that’s what is going on when the schools of “thought” this kind of stuff comes from attempt it. This particular poster might not be. But usually it’s a cheap rhetorical trick, coming from folks who present themselves as simply following logic. Gross. reply rglullis 3 hours agorootparentprev\"My issue with capitalism is fundamentally split in three parts\", then you go on to describe things that are not exclusive to Capitalism AT ALL. Again, please quit the cheap sophistry. > the kind of behavior that goes against my idealized version of what society should be Are you listening to yourself? You sound like a college sophomore who is sure has a solution to all of humanity's problems... > turns people into selfish venal assholes ... and can only assign blame on others. I can bet you nourish some well-developed fantasies about what you would do if you were given enough power over any \"less centralized society\", and they are a lot more about imposing your view over everyone than ensuring your small community can prosper and be happy. reply sethev 58 minutes agorootparent\"then you go on to describe things that are not exclusive to Capitalism AT ALL.\" Why are they required to be exclusive? If I said that uncontrolled train crossings lead to more train crashes, would you retort that train crashes aren't exclusive to uncontrolled crossings? reply dotancohen 5 hours agorootparentprevWhat is unethical about the actions of the corporations who use the software? They did so in accordance with the license. reply Vampiero 5 hours agorootparentThe fact that Open Source is about sharing, and they don't share. They only take. It doesn't have to be written in legalese somewhere, it's the spirit of what makes Open Source what it is. And I'd argue that doing something for profit is also against the spirit of open source, but that's a different argument. The thing is that open source is for the most part an effort from hackers, hobbyists and professionals who want to foster a positive ecosystem for people like themselves. To make their passion better and simpler and more fun and more accessible and more interesting and safer and more efficient and more general... So that more people might fall in love with it. It's not to push a product or to convince people that they need it. And that sentiment comes from the fact that open source is the reason many people got into programming in the first place! Thanks to all the free resources out there. So they want to give back to the community. That's how I feel about it at least. But then again, when huge corpos contribute to open source it's great because they have a lot of inertia. So I think that's a good thing, it's a positive feedback loop. My previous point is not black and white, even though I am obviously bitter about a lot of things. reply fluoridation 51 minutes agorootparentA regular user who just downloads a build and runs it on their system (i.e. the most common use case, because it's the one that takes the least effort) also doesn't share anything. Why is it worse if a company does the exact same thing? reply layer8 2 hours agorootparentprevLicenses are about legal agreements, not about ethics. Legality doesn’t imply ethicality (nor vice versa). If this was about legality, people would say so. reply KingMob 2 hours agorootparentprevI'm sympathetic to some of what you're saying, and I believe the original hacker ethos spurred some of the original FS impulses, but... FOSS licenses don't, and can't, embody anarchism (or any socialism) because they make no distinction between humans and capital-holding entities, lumping them all under the term \"users\". reply lloeki 9 hours agoprevAn interesting aspect of Forgejo is ongoing work on forge federation https://codeberg.org/forgejo/forgejo/issues/59#issuecomment-... In an ideal world github and gitlab would also support federation, but I guess that's probably not going to happen. An alternative solution in the problem space would be going p2p, e.g https://radicle.xyz/ reply franga2000 9 hours agoparentIt's a shame \"federation\" these days basically just means \"implement activitpub\". So many projects get caught up in the complicated mess of mapping their data model onto AP, debating about how exactly to map things and writing standard extension proposals.... Useful federation between Forgejo instances could be solved with little more than OIDC and a few webhooks (cross-instance collaboration, forking, and PRs). Nobody needs federation between Forgejo and Mastodon what would that even mean?? reply diggan 4 hours agorootparent> So many projects get caught up in the complicated mess of mapping their data model onto AP, debating about how exactly to map things and writing standard extension proposals.... Well, you either use an existing standard so you can federate with existing implementations, or you come up with a new standard and ask others to implement that. Seems they chose the simpler way, thankfully. > Useful federation between Forgejo instances could be solved with little more than OIDC and a few webhooks (cross-instance collaboration, forking, and PRs). What about federation between more software than just your own? Once you've done those things, you basically end up with another spec (but informal instead of formal) that others also need to implement. So instead of going the informal way, they aim for the formal one. That does sound appropriate to me. Slightly besides the point, but for someone who dealt more with decentralized/distributed systems than bloated authentication systems, it seems both simpler and easier to map+implement ActivityPub than implement OIDC+\"a few webhooks\", but that might just be because of my familiarity. I'll say that ActivityPub is a pretty simple standard though, compared to what's out there. reply vaylian 3 hours agorootparentprev> Useful federation between Forgejo instances could be solved with little more than OIDC and a few webhooks (cross-instance collaboration, forking, and PRs). That would only solve the problem of \"I don't have an account on this forge yet\". The much more relevant problem is identity + reputation. With ActivityPub-based federation you can use your domain-bound identifier to contribute to various projects across servers and gain reputation and trust. If we use OIDC, then it is a lot less clear if the server, you authenticate with, is hosting the real franga2000. reply FireInsight 5 hours agorootparentprevI tend to agree that ActivityPub seems pretty horrifying to work with (as an outsider). At least it works, though, and is implemented by a large amount of different projects and not owned by any single one. reply diggan 4 hours agorootparent> seems pretty horrifying to work with (as an outsider). As someone who both made my own implementation + hacked on others, what was/seemed to be the horrible parts? It's a pretty simple standard that is basically RSS with some added stuff (very simplified of course, before I got jumped) for facilitating the federation parts. reply plagiarist 2 hours agorootparentprevIt's already awkward just between Lemmy and Mastodon. I guess Lemmy could be in the form of issues on the repo and Mastodon would be thumbs up emojis and/or \"starring\" the repo. Yeah I wish there was a different protocol if we are jamming everything on top of it. reply zufallsheld 5 hours agoparentprevGitlab has experimental support for activitypub: https://gitlab.com/gitlab-org/gitlab/-/blob/v17.1.0-ee/doc/d... See also: https://gitlab.com/groups/gitlab-org/-/epics/11247#why reply imiric 7 hours agoparentprevOver the years I've come to the conclusion that all these UIs on top of Git make little sense. Git itself is already distributed, which goes beyond federation. Exposing a Git repo over the network is trivial with HTTP or SSH. It supports code review workflows via email, though I really like the approach of storing reviews inside the repo itself via something like git-appraise[1]. Integrating it with CI/CD pipelines _can_ be simple, if the pipeline can be triggered by pushes. Instead we've created these centralized UIs over Git, and are trying to get them to integrate with one another. This seems backwards to me since Git is already decentralized. [1]: https://github.com/google/git-appraise reply KingMob 7 hours agorootparentI suspect the reason is the same as the use of local git GUIs and TUIs; git has a terrible CLI, so everyone uses its plumbing, but not its porcelain. reply lee_ars 5 hours agorootparentYeah, there's a reason why stuff like the git manpage generator (https://git-man-page-generator.lokaltog.net/) is funny, and it's because git's CLI doesn't have a learning curve. It has a learning brick wall that you smash your face into. reply stavros 1 minute agorootparent> the git manpage generator is funny It would be funny if I didn't mistake it for an actual git manpage. KingMob 2 hours agorootparentprevHehe. Yeah, I can't think of another tool that's simultaneously popular enough, and painful enough, to warrant a site like https://ohshitgit.com reply HankB99 1 hour agorootparentPerhaps there's a similar site for 'ffmpeg'. The link you posted looks pretty helpful. I guess my needs for \"interesting\" git operations are low because I've never felt the need to move beyond the CLI. (Mostly, that is. I do click the colored bars in VS Code to stage commits and then commit from the command line.) Occasionally I need to search for help when I screw something up. More often the solution is in the git warning message (\"You need to 'git pull' before you can push\" paraphrasing.) reply acidburnNSA 6 hours agorootparentprevI needed something like this 16 years ago at work to manage shared code, tickets, and code review of private code across a team of engineers. Code review for formal quality assurance was the most important need. I started with trac, then Phabricator, then GitHub enterprise. I just checked out git appraise to see how my nuclear and mechanical engineer friends would like it, and from what I see, I'm guessing they would not. We were using eclipse back then so maybe if that eclipse UI plugin still works it could work. reply lvncelot 4 hours agoparentprevReally looking forward to the federation, hosting Forgejo for my own stuff while having discoverability/issue tracking with other instances would be the best of both worlds. As of now I'm mirroring stuff across self-hosted forgejo/github.com/gitlab.com where the forgejo instance is just part of my self-hosting hobby and not \"load bearing\". I think that Gitlab Cells[1] might go into the same direction, there is a mention of federation in the design document. [1] https://handbook.gitlab.com/handbook/engineering/architectur... reply DicIfTEx 8 hours agoparentprevThe federation page on the Forgejo Web site (https://forgejo.org/2023-01-10-answering-forgejo-federation-...) is out of date and most of the links don't work. They also used to publish annual progress reports until 2023 (on a Web site that no longer seems to be accessible: https://web.archive.org/web/20240830030315/https://forgefrie...). Although the last mention of federation in a monthly update was in October, where they stressed that federation was and is their 'highest priority'.[0] [0]: https://forgejo.org/2024-10-monthly-update/#:~:text=Forgejo%... reply jwildeboer 7 hours agorootparentFYI: Just last Friday there was a call/meeting to coordinate and build out the federation efforts in Forgejo. More work is coming and more help is appreciated! There will be a presentation at FOSDEM on this topic and there is a matrix room dedicated to Forgejo Federation. reply 3np 8 hours agoparentprevI would expect Gitea to merge back in federation functionality once it's stable if they get some help with it. IIRC that initiative started in gitea and I'm not aware of that level of animosity or divergence of goals between the two? reply nikodunk 12 hours agoprevThe Fedora Project (Linux) is switching to this, FWIW https://fedoramagazine.org/fedora-moves-towards-forgejo-a-un... reply synergy20 4 hours agoparentthis is big! reply kstrauser 13 hours agoprevI’ve migrated over the years from Gogs to Gitea to Forgejo. It’s such an excellent piece of software. 90% of the time, I can get by with hosting my personal git repos on an SSH server I have. When all I’m trying to do is put my Chezmoi repo somewhere that all my computers can access it, Forgejo and friends don’t add much to it. For the 10% of the time when I want to share my code privately with some friends it’s brilliant (and free beats a GitHub paid plan). And if I’m going to have it running anyway for those 10% projects, might as well use it as my personal git repo of record for everything else, too. reply HankB99 1 hour agoparentMy first stab at running a git server was Gitlab CE (because I was using it at work.) I tried running it on an Atom based server with insufficient RAM and it just crawled. Page loads just timed out. I switched to Gitea and it was a breath of fresh air. Forgejo got to my attention when Fedora chose it for their repo server. My needs are pretty simple just some centralized file storage of notes and some source code. I've tested a migration from Gitea 1.21 to Forgejo 9 and it was frictionless. I'm seriously consider migrating, but I still wonder which will be better supported (and suitable for free-as-in-beer use) in the long run. reply kstrauser 1 hour agorootparentI wonder about that, too. I’m still on Forgejo 7 which hasn’t diverged too much from Gitea, but there’s going to be a decision point soon. When I looked recently, it looked like Forgejo was getting much more activity. If I had to guess, I think it’s going to be the leading fork. reply KronisLV 8 hours agoparentprevI initially had a Gogs install, but moved to GitLab because of GitLab CI and some other features. It was a bit too heavyweight in comparison and the updates became difficult to keep up with, so I eventually moved over to Gitea and Drone CI (some might also like the Woodpecker CI project). Honestly, my eventual next move will be either Forgejo with their Actions https://forgejo.org/docs/next/user/actions/ for CI/CD or maybe going off into the deep end with moving back to Jenkins. reply kstrauser 1 hour agorootparentI will never go back to Jenkins. It was my job across several shops over the last decade to keep that thing slogging along and I’m beyond done with it. reply jcarrano 4 hours agorootparentprevFor me GitLab CI is a reason to move _away_ from it. reply KronisLV 2 hours agorootparentReally? What’d you dislike the most about it? In my experience, the syntax was actually more user friendly than that of GitHub Actions and the file based approach a bit easier to carry across projects than what Jenkins and the likes do. Drone CI and Woodpecker both felt similar in that regard, at least to me. Though the docs of GitLab CI definitely make me consider it for group projects across an org. reply antman 7 hours agoparentprevFor my projects I have been using Onedev https://github.com/theonedev/onedev which has also kanban and code editor reply kstrauser 1 hour agorootparentNot my thing but I see why others would like it. Forgejo is freaking tiny by comparison resource-wise, though. It’s a Go program that runs comfortably on a Raspberry Pi with a dozen other services. That alone makes it super attractive to drop onto any spare computer you have laying around. reply diggan 3 hours agorootparentprevYou run that locally on your own machine, or you host it yourself somewhere? If the latter, you just stop programming fully if the internet connection for whatever reason doesn't work? I'd never consider running my code editor as infrastructure, but certainly interesting to see that others seems to do. reply evilduck 2 hours agorootparent> If the latter, you just stop programming fully if the internet connection for whatever reason doesn't work? It's privilege and probably a dose of luck but I can tally up on one hand the number of hours my house and/or phone hasn't had internet in the last 5 years, including total power losses. I also wouldn't run my editor as a hosted service but I can understand why someone in a similar position might take that gamble. It's certainly no bigger of a risk to me than being limited to working on something physically at a workplace and needing to rely on transportation to get there, which also has maintenance concerns and infrastructure congestion and reliability issues that have caused more productivity losses to me than my utility providers ever have. reply antman 3 hours agorootparentprevI just install the container remotely, cicd remotely etc and code locally. My use case is the opposite, I might need to do some adhoc support and not have the laptop with me so then I use the online code editor reply robertclaus 3 hours agorootparentprevI've used Github's built in VSCode for quick one-line PRs or docs cleanup. I'm lazy enough to appreciate the feature even if I would never do deeper work in it. reply okucu 6 hours agoparentprevDid you notice any important differences between gitea and forgejo (besides ideology)? Although it seems like forgejo has added actions in the meantime reply kstrauser 1 hour agorootparentNot a thing. I don’t use actions yet, just the primary repo management UI. I don’t know if I could tell the difference. reply kdmtctl 5 hours agorootparentprevGitea also has actions. https://docs.gitea.com/usage/actions/overview reply lolinder 4 hours agorootparentGitea actually got actions before Forgejo did. That was part of what motivated Forgejo to become a hard fork instead of just a rebrand—there was some sort of disagreement about the way in which actions were rolled out and Forgejo decided from there to stop trying to be fully compatible. https://forgejo.org/2024-02-forking-forward/#the-hard-forkin... reply kdmtctl 3 hours agorootparentI've missed that part. AFAIK both are forked from nektos/act and can't be dramatically different. All this story is an unnecessary dichotomy for me. Still hosting production code on a Gitea instance and will happily pay a dime but didn't get why yet. reply okucu 3 hours agorootparentprevI probably worded that wrong, but that was my point. Forgejo didn't have actions for the longest time, so I was wondering if it \"caught\" up with gitea reply jmpavlec 13 hours agoprevThe tag line isn't the most informative. It took me a scroll or two on the main page to figure out its purpose. (Self hosted GitHub alternative). I'd suggest making that clearer earlier as the word \"forge\" in terms of software could have a variety of interpretations. reply stevekemp 11 hours agoparent\"forge\" has been used since \"sourceforge\" if not longer to describe these kind of hosting-packages. I guess technically you could have called Redmine, and other systems at the time, forges I think the term took off after that. reply dotancohen 5 hours agorootparentThe only time I ever see Sourceforge mentioned is in advertisements on /.. I think most young developers today have no idea what it is, if they even know what /. is. reply spookie 2 hours agorootparentYoung developers are still learning the ropes :) reply anthomtb 1 hour agoparentprevThank you. I was trying to figure out what \"forge\" meant here. When I think \"forge\", I think a tool to turn a raw material into finished product. Ergo, the blacksmith tool that turns iron into a horseshoe. The software analogy would be turning text source code into a runable binary. Ergo, a compiler or an interpreter. Github and SourceForge move source code from one place to another. To overextend the analogy, they are more like a combination shop/delivery service. Source code is moved but never altered or transformed. Long story short, this crusty C/C++ dev thinks forge is a really weird term for a self-hosted, sugar-crusted Git server. reply baobun 13 hours agoparentprevDisagree. Refering to GitHub as category-defining would be antithetical to the Forgejo spirit. Forgejo stands on its own. reply phantomathkg 12 hours agorootparentDisagree. Unfortunately Forge is not a well known category defining term. Using it as a tagline defying the purposes to popularize Forgego. reply rollcat 8 hours agorootparentDisagree. SourceForge was established in 1999. The term \"software forge\" was in widespread use, until Github started gaining mainstream attention. But the term \"hub\" doesn't necessarily always refer to the same thing e.g. certain adult entertainment website is also using it. reply lee_ars 5 hours agorootparent> SourceForge was established in 1999. The term \"software forge\" was in widespread use... Not trying to be contentious, but I've got a 5-digit slashdot ID and I've never heard that phrase explicitly used in my entire life as a term of art by software devs, including at or around 1999. Definitely not saying that nobody was using the term, but \"widespread use\" is a big claim that requires some substantiation. It absolutely does not align with my lived experience of the time. reply dotancohen 5 hours agorootparentFunny that you mention /., I just mentioned it in another comment. Sourceforge bought /. and advertise there heavily I very much associate the two. reply actionfromafar 6 hours agorootparentprev\"Software forge\" has a certain explanatory ring to it, but approximately nobody has any clue what SourceForge is, or even less, what it represented back in its heyday. The kids know github, many don't even know the difference between github and git, or slighly less concerning, assume git is a tool from github. reply IshKebab 4 hours agorootparentprevYou're objectively wrong in this case look at all the comments in this thread. Clearly \"forge\" is not a well known category defining term. reply rollcat 3 hours agorootparentIt very much used to be, before Github delivered where SourceForge couldn't (and still doesn't). But the history is still written in project names like GForge, FusionForge; and of course the contemporary SourceHut refers to itself as a \"hacker's forge\". I know whatever's written in Wikipedia doesn't necessarily have to be authoritative, but it's worth to check out https://en.wikipedia.org/wiki/Forge_(software)#History reply szszrk 11 hours agorootparentprevYet when posts online described it as an alternative/clone of GitHub/gitlab/gitea it was alsa received with criticism and complains that \"what if I don't know what gitea is\". Naming and creating descriptions is not trivial, I wish more complaints would also simply come with proposals of better taglines, so we can bash those ideas quickly in comments and cut that long feedback loop. reply WhyNotHugo 11 hours agorootparentprevDefining itself as simply an alternative to the mainstream is a not a great way to makes its own identity. Imagine if Fedora presented itself as simply “an open source alternative to windows”. Sure, that might be easier to understand for those less in the field, but really doesn’t help it’s own identity. reply arp242 12 hours agorootparentprevForgejo is a GitHub clone. No one can claim with a straight face that it's somehow completely unrelated. reply konart 8 hours agorootparentWhy Github and not Bitbucket? reply selectnull 5 hours agorootparentMaybe because Github was there first. BB was created as the GH clone, for mercurial repos. reply konart 4 hours agorootparentBoth launched in 2008. reply selectnull 1 hour agorootparentYes, both launched in 2008 and yet Github was launched first. According to this archived article[1], there is a quote saying: \"It [BB] sports a feature-set much like Github.\" That is an indication of which one came first and was already a success story on the market and served as a blueprint for BB, which was made in its image with the difference of supporting mercurial, instead of git. [1] https://web.archive.org/web/20110317200833/http://code.djang... (edit) forgot the link to the article reply rapnie 11 hours agorootparentprevAnd then all software revision control systems / forges have more or less the same conceptual model for their platform, and just adding their specific sauce and some tailoring to specific needs. Some more innovative and deviating platforms from this more-of-the-same approach are Sourcehut (brutal minimalism) and Gitlab (enterprise dev lifecycle, process support). And then there's the general trend for these platforms to become one-stop-shop maximized lock-in walled gardens, aiming to support the entirety of software development practices (while they seem open and gratis). reply rapnie 10 hours agorootparentPS. This trend for one-stop-shop platforms will also see their owners start to monetize the absolute hell out of their existing (and often vast, take Github) 3rd-party vendor ecosystem via plugin marketplaces, app stores, and their platform API's and SDK's, which many of these vendors now think bring along on a free ride. reply spookie 2 hours agoparentprevCalling it a software forge is the correct form. Even if the term isn't that well known. See: https://en.wikipedia.org/wiki/Forge_(software) reply dmje 9 hours agoparentprevIt’s clearly a self hosted GitHub alternative and that’s IMO the way to talk about it. And per other comments, it’s obviously this once you start using it it’s basically the GitHub interface and it’s great that it is it’s very familiar and easy to use reply jwildeboer 9 hours agoprevAfter my struggles with trying to keep Gitlab CE (Community Edition) up and running (it needs a lot of CPU and memory) I switched to Forgejo and have not been disappointed. It runs as a rootless container and uses almost nothing, memory and CPU wise. Updating it has been a simple podman pull that JustWorks(tm). It now also runs actions that keep my static websites updated by running Jekyll etc. I really like it to have my own forge that can import repos, issues etc from other forges like GitHub, Gitlab etc. and I am looking forward to the upcoming ActivityPub based integration to the wider fediverse. Having a decentralised, but connected approach to code hosting is what I always wanted to have and now it’s (almost) there. reply jimjimwii 3 hours agoparentWhat is the status of federation support? I imagine cross-instance pull requests and bug reports would make collaboration effortless. reply NoboruWataya 8 hours agoprevCan anyone who migrated from Gitea to Forgejo explain the differences in usability? I understand the fork was driven by licensing/project ownership concerns but it's not clear to me from reading the website how different the end product is now. I believe Gitea is still being actively developed. I host a private Gitea instance (mainly to mirror all my GitHub stuff) so wondering if it is worth migrating. reply homebrewer 8 hours agoparentI evaluated it again a couple of weeks ago and there are basically no differences right now (besides a few cosmetic ones) because the hard fork happened just a few months ago. Stick on 1.22 for the time being, it's the last version from which Forgejo supports in-place upgrades. You'll have to transfer data half-manually or perform deep surgery on the database if you upgrade past 1.22 and then decide to switch forges. Although the next version of gitea should include support for full mirroring from GitHub (so periodic synchronization of new issues, PRs, etc), not just (code mirroring XOR one-off full copy) like it does right now. This might be of interest to you. reply isodev 8 hours agoparentprevThey have a FAQ (https://forgejo.org/compare-to-gitea/) TLDR: Forgejo is free software, prioritizes security and stability over new features and is actively developing the federation module (thus working to enable communities of federated forges) reply thiht 9 hours agoprevI wish they would have chosen a better name. Honestly if I have to install a Git server one day I’m gonna install Gitea, not a tool I can’t even pronounce. Names are important, this is why I also don’t use DuckDuckGo. The reasons for forking from Gitea were also a bit weak in my opinion. reply tasuki 9 hours agoparent> Names are important, this is why I also don’t use DuckDuckGo. You won't use DuckDuckGo because of the name? DuckDuckGo is so tricky to write on mobile that I copy pasted from your comment, but that doesn't stop me from using it. For me, googlability of names is important, but otherwise I don't care. I'm really curious about your reasoning. Does it offend your aesthetic sensibilities? Do you think people who would choose such a name can't be trusted with search? Or something else entirely? reply homebrewer 9 hours agorootparentUse ddg.co on mobile. reply thiht 8 hours agorootparentIt redirects to DuckDuckGo, the name is still written full size, and their stupid logo is still there. Give me ddg.co or duck.com with no redirect, no branding and no logo and I’ll use it. reply zufallsheld 5 hours agorootparentSo what search engine without branding and logo do you use? reply thiht 2 hours agorootparentNot my point, I don't care if the search engine has branding and a logo, I just want it to be not cringe. reply zufallsheld 1 hour agorootparentWell, there is this looking not cringey for me: https://lite.duckduckgo.com/lite reply mkl 9 hours agorootparentprevOr ddg.gg quicker to type. reply rawkode 9 hours agorootparentduck.com too reply arccy 8 hours agorootparenta phisher's dream: anything remotely related to ducks might be a real domain reply thiht 8 hours agorootparentprev> Does it offend your aesthetic sensibilities Yes. I’m completely aware it’s irrational and probably a bit dumb, but I don’t want to use something with a name I actively hate. Some names are \"meh\" or boring and that’s ok. But for DuckDuckGo and Forgejo I have a visceral reaction against their name. DuckDuckGo is an even worst offender because their logo is ALSO dumb and terrible, and I don’t want to see it. reply tasuki 1 hour agorootparentThanks for the reply :) reply HackOfAllTrades 2 hours agoparentprevClearly Postgres is not a good database and you will wisely use any other. I can see real advantages to this. It saves you so much effort and time. In fact, it allows you to make no effort at all. reply thiht 2 hours agorootparentWhy? I don't think Postgres is a bad name, it's not great but not terrible. reply rollcat 7 hours agoparentprev> a tool I can’t even pronounce jazzyjackson provided the pronunciation guide in a comment above: > forˈd͡ʒe.jo, to my midwestern ear, \"4 Jay yo\" It's totally OK for a project to use words from a foreign language. \"Linux\" is derived from Finnish Linus (/ˈliːnʊs/) and pronounced /ˈlɪn.əks/, unlike the English Linus /lɑ́jnəs/. IMHO Forgejo should have the IPA pronunciation spelled out on the landing page. > this is why I also don’t use DuckDuckGo Just how silly \"Google\" sounded when it first popped up? How Torvalds joked that he named \"git\" after himself? \"Bash\" is a play on \"Bourne\" and \"born again\"? Silly names are a part of the hacker culture, remaining playful despite the product having huge impact brings color to people's lives. reply thiht 2 hours agorootparent> Just how silly \"Google\" sounded when it first popped up? How Torvalds joked that he named \"git\" after himself? I knew these examples were coming. Subjectively speaking, these are catchy names, which is why they work. Forjego and DuckDuckGo are not catchy, there's something wrong with their flow. Maybe they're too long or too \"breaking\", or maybe they don't work internationally (I'm French) somehow, I don't know. I'm not going to write a thesis on why some names don't work, but if someone did I would love it. Silly names are ok but there's a very thin line between \"silly\" and \"annoying\". DuckDuckGo definitely crosses it for me. reply bmacho 6 hours agorootparentprevoff: google translate English lady pronounces it as \"4 Jay ho\" with an H. That isn't how a native English speaker would attempt to pronounce Forgejo, is it? reply wpm 3 hours agorootparentHonestly, who cares? I pronounce it Forge-oh. I don’t give a crap if it’s “correct”. reply rollcat 2 hours agorootparentWell, language nerds do, myself included. Also honestly, I don't care when people mispronounce words, as long as they can convey the meaning clearly enough. reply keb_ 1 hour agoparentprevYep, same reason I never used Google, or ffmpeg, or Debian, or Kubernetes. reply isodev 8 hours agoparentprev> I can’t even pronounce Even if one is somehow monolingual, forgejo is a perfectly fine word in English. There are even multiple ways to make it sound funny (forge-joe, forge-yo, etc). reply xeonmc 8 hours agorootparentfor-get-hoe reply runiq 9 hours agoparentprevThat's a weak reason and you know it. reply homebrewer 9 hours agorootparentIt might not be a very strong reason, but quite enough to pick the original project which also has more development effort behind it (and is still used by Blender FWIW, I don't think they have any plans of migrating). I understand your first language is German. Figures. The name is unpronounceable and feels weird to me also. If we ever migrate from gitea (although I currently see no reason to do it), I'll have to pick some generic term and introduce it to others under that name. reply rmgk 8 hours agorootparent> I understand your first language is German. Figures. I assume your argument is: “Everyone who had to learn English as a second language is so used to completely random pronunciation that they won’t complain about anything anymore”. reply homebrewer 8 hours agorootparentIt's just that German is close enough to Esperanto that I'm personally not particularly interested in what a German speaker thinks about the name. Ask a Mandarin/Japanese/Arabic/Ewe/Telugu/etc. speaker what they think. (My first language is quite far away from both English and Esperanto, probably should have mentioned that in the original message.) reply rmgk 8 hours agorootparentMaybe, but the pronunciation of the forge part is essentially just the English one (at least much, much closer to an attempted German pronunciation). The jo part is close to German though, so maybe this is why it’s not too bad for someone who knows English and German. And everyone else gets to dislike at least some part of it :-) reply thiht 8 hours agorootparentprevI know. But I don’t want to use something with a naming sounding weird that I actively hate, especially when there are alternatives with a better name. reply tasuki 9 hours agorootparentprevI think they don't. reply andsoitis 13 hours agoprevQ: “What is Forgego?” A: “Forgejo is a self-hosted lightweight software forge. Easy to install and low maintenance, it just does the job.” ? reply yawaramin 13 hours agoparentWithout mentioning GitHub/BitBucket/GitLab/etc., how would you describe what they are? reply pookeh 13 hours agorootparentCollaborative development platform with Git repository hosting, CI/CD, and project management features. reply thayne 12 hours agorootparentI.e. a software forge. I do think it would be good to have a link or something to explain what a software forge is to people who don't know. reply int0x29 12 hours agorootparentIf it doesn't support SVN or Mercurial I don't see a need to try and be abstract. At a minimum it needs to use the word Git because that page is inscrutable. Also a features page would really help reply cookiengineer 9 hours agorootparentprevGreat! Now let's see if someone really cares enough to make a pull request or whether these complaints are just superficial to have something to complain about. reply ang_cire 12 hours agorootparentprevSource code hosting and version control platform? reply IshKebab 10 hours agorootparentprevI don't see why it's so critical to not mention Github. That would instantly convey what it is to basically everyone, and it doesn't mean it doesn't have its own identity or anything. reply eviks 13 hours agorootparentprevBy describing what they do (also, there is no rule you can't mention github) reply Borealid 13 hours agorootparentprev\"Forgejo hosts source code repositories, lets you track and manage issues (and review code changes), and provides all the integrations you'd expect with CI/CD and similar tooling.\" reply rmgk 8 hours agorootparentThis seems to be a good tagline for a HN audience that kinda clicks a link blind and wants to figure out what it is quickly and move on. But it’s unclear to me why the Forgejo website should care about this type of visitor? Being a “forge” is likely well understood by anyone that is interested in installing this type of software (or they will figure it out because of the context that linked them to the page). None of the features you mention is a good discriminator, as essentially all forges have these features in one form or another, so an interested use will have to look at the details anyway. Being: “self-hosted, lightweight, easy to maintain” those are very important quick discriminators if you are looking at this type of software. reply fishgoesblub 13 hours agorootparentprev\"A platform to host your git repositories including collaboration features like issues, discussions, and a projects page to track important parts of your code base. All able to run on your server local and private.\" reply ycombinatrix 12 hours agorootparentprevGit hosts with proprietary features reply xeonmc 11 hours agorootparentprevRepository Hub reply TNorthover 11 hours agoparentprevTheir communication really is all over the place. Even the name is really awkward in English. (And yes, not everything should be forced to be English and it's apparently supposed to be Esperanto; but nothing else on the site is so that's not how most people will parse it). reply bjackman 7 hours agoprevCan anyone comment on the code review experience? (I assume similar to Gitea but I haven't tried either). I recently did some moderately serious code review in GitHub and discovered it's a baby's toy version of a code review tool. It seems it would be unusable for serious engineering work unless you totally design your source control model around making that work, at the expense of all the other things that influence how you wanna manage your history. I am mostly used to Gerrit which has a very reasonable basic model but a lot of rough edges and some performance issues. Suddenly I realised I don't think I've ever actually used a review tool I really like! I wonder if our industry is just getting by without one? IIRC the Gitlab one was slightly better than GitHub but I can't remember too much about it. reply acidburnNSA 6 hours agoparentI've used Phabricator and GitHub to design nuclear power plant design code... seems pretty serious. Can you tell us more about what's missing in your opinion from making the reviews usable? Curious what I've been missing out on! reply losdanielos 7 hours agoparentprevHave you tried Codelantis? It's a review tool for GitHub reply yoavm 9 hours agoprevChecking out https://v10.next.forgejo.org/explore/repos , the main thing I notice in comparison to GitHub is how fast this is. I wish GitHub was so fast. reply homebrewer 9 hours agoparentThere are only five pages of repositories there, so it's no surprise it responds quickly. We've been running gitea for several years, and when you put enough data into it (repositories, issues, comments, etc) it doesn't feel as fast anymore, although most pages still render within 500 ms. For example, opening large-ish issues can stall the server for a second or two (it reports rendering time in the footer, so I'm sure it's the server). reply zipy124 7 hours agorootparentClick on any repo from: https://codeberg.org/explore/repos It's very speedy. Not as much as sourcehut, but you get a nicer UI. Github is becoming slow enough to meaningfully detract from productivity. reply yoavm 8 hours agorootparentprevI don't know if that's the whole story? Sure, GitHub has more data to process (and way more compute), but even when switching between tabs within one repo (going from code to pull requests, for example) GitHub is still much slower even though its query shouldn't be affected by the number of repositories it has. reply bsdice 3 hours agorootparentprevI have around 1.2 GB of compressed git commits on disk, still fast on an ancient Intel E3 1275-v6 with 64 GB of RAM and 2 TB Intel P3520. Version 10 also now without any startup errors due to slightly wrong sqlite database structure. Together with vscodium a joy to use. reply jazzyjackson 9 hours agoparentprevNow picture it running on-prem ! reply vollbrecht 2 hours agoprevI think this is a great peace of software, though i think its mostly tailored for the single dev, or business case for closed source software, but much less a software peace that allow for great community building. I think this is because of: a) The network effect that you inherently get with for example github b) The barrier to create accounts on yet another platform to contribute. In that regards i find the original way of just using email's to send patches just such a brilliant idea, because at least it eliminates my second point completely. That's why i think sourcehut [0] is such a nice idea at least in theory. Though now you have to teach people not only how to use \"git\" but also how to use \"git\" via email :D https://sourcehut.org/ reply mroche 20 minutes agoparentGitea and Forgejo support OAuth integration and AGit Flow*, which is a breath of fresh air compared to the connected \"fork\" and PR strategies. It's a good middle ground between the \"modern\" method and email collaboration. With some UX tweaks it could become very accessible for many. Available platforms like Codeberg provide the option to sign in/register with GitHub and GitLab auth, so needing \"yet another account\" has become a much weaker argument. * https://forgejo.org/docs/latest/user/agit-support/ reply prakashn27 4 hours agoprevEx-meta engineer here. I miss their internal GitHub which is a mercurial fork. They have so many awesome features like layered PRs. That is something I have not seen anywhere . reply antoineMoPa 2 hours agoprevIt's not clear from the landing page whether it's a git code platform / mercurial / entirely new VCS. I wish it was clearer (looking at the Readme, looks like it's indeed a git hosting platform). I don't really care about the governance model as a user seeing this landing page for the first time, so I wonder why it's so prominent, vs telling me what the actual product is. reply davidkellis 13 hours agoprevIt sounds like this is trying to coin a new term. I hadn't heard the word forge used to mean an all-in-one git+issue tracker+project mgmt+etc. suite before. reply tarxvf 13 hours agoparentThe term is decades old at this point. It doesn't seem to play well outside of the older open source communities, now that github has xeroxed. reply prmoustache 11 hours agoparentprevIt is not new. I have heard that word for more than a decade already. I guess you need to know about the foss ecosystem to know it. reply 000ooo000 6 hours agorootparentOnce upon a time, a lot of software was released/available through \"source forge\", which is pretty self-explanatory in the context of software publishing. Then a decade ago, SourceForge shit the bed and destroyed its reputation. I'd bet that most of the developers saying they've never heard of \"forge\" in this context have entered in the industry in that time. reply IshKebab 10 hours agorootparentprevI also knew it but look at the number of comments saying \"what is a forge?\" here it's clearly not a good description. reply lamontcg 7 hours agorootparentYeah, it is funny to read all the assertions that everyone knows what a \"forge\" refers to in the middle of all the threads wondering wtf a \"forge\" is... reply kookamamie 11 hours agorootparentprevIt is not new, but also not ubiquous enough to express something everyone understands. Trying to get \"forge\" across as some kind of defacto term just adds noise to the product description, I think. reply lfam 13 hours agoparentprevEver heard of Sourceforge? reply photonthug 12 hours agorootparentThis is a bad association even for people that recognize it. Presumably there were good years but most will probably remember the ugly endgame with awkward UX and weird ads masquerading as fake download links. reply coolgoose 11 hours agorootparentThis is such an interesting thing of generational difference, since I remember sourceforge fondly before the crazy era of so many ads. reply astrange 11 hours agorootparentprevI don't remember any era of sourceforge where it had good UI. I also don't remember anyone ever calling it a \"software forge\". reply rdtsc 10 hours agorootparentprev> Ever heard of Sourceforge? Yup! That clears it up. It’s the site that serves lots of ads and binary packages of some old software. At least as of the last time I looked some years ago. Ok then, not sure I would want more things like that today to self host, but to each their own. reply thayne 12 hours agoparentprevhttps://en.m.wikipedia.org/wiki/Forge_(software) reply oever 54 minutes agorootparentThat Wikipedia page was created in April 2008. > Examples of such services are: Sourceforge.net, GNU Savanah, Google code https://en.wikipedia.org/w/index.php?title=Forge_(software)&... reply thunderbong 11 hours agoparentprevThe first time I heard that word was in Sourceforge, decades ago. reply thiht 9 hours agoparentprevIt’s not new, it’s outdated and they’re trying to make it come back. reply CGamesPlay 9 hours agoprevDoes this have a CI/CD solution? I don't see anything from skimming the user docs. reply girvo 9 hours agoparentIt does, called “Actions” https://forgejo.org/docs/latest/user/actions/ reply CGamesPlay 9 hours agorootparentNeat! Thanks. I see this is located in the docs between \"comment via email\" and \"message templates\". If the devs see this, perhaps adding more buzzwords would be helpful to discovery. reply javitury 9 hours agoparentprevYes, you need to spin a forgejo runner reply throawayonthe 9 hours agoparentprevthey are currently developing Forgejo Actions[0], or you can use the existing Woodpecker[1] [0] https://forgejo.org/docs/next/user/actions/ [1] https://woodpecker-ci.org/docs/administration/forges/forgejo reply criticalfault 9 hours agoprevThe project is amazing The name of the project is horrible reply tmountain 10 hours agoprevLooks interesting but I’m not quite sure exactly what it is based on what I am seeing on the front page. reply DrawTR 11 hours agoprevcan anyone share what the benefit is over using a self hosted repository host over a service like github/gitlab? obviously you get more power over the interface & such but are there truly any gains over using the larger platforms? reply Ringz 11 hours agoparentA self hosted repository host gives you the ability to develop software projects without giving up privacy or locking you into a service you don't control. reply PhilipRoman 11 hours agoparentprevAside from the whole self hosting ethos, if you are hosting it from a home server and you are the primary user, you will get a nice performance boost. Downloading binaries, cloning repositories will be instant. If you use CI, it will be running on an actual machine rather than 10% of some 2GHz cloud CPU. I regularly have to upload multi GB images to a VPS and it's very annoying when it takes like 10 minutes. reply IshKebab 10 hours agoparentprevIt's very useful for companies more control, don't have to host your code externally, and you don't have to pay (well, ish; we ended up paying for Gitlab Premium, but that doesn't exist for Forgejo). reply ezst 9 hours agoparentprevFrom the top of my head with dozens of others: Not all projects are suitable for hosting by third parties (you may not want to give away the special sauce behind your wannabe next trillion dollar company, or you may be handling sensitive or confidential data like medical records, etc) You are immune to the trending process recently referred to as enshittification that consists of providers in a consolidated market like this one giving you an increasingly worse experience to compel you into more expensive plans, i.e. you gain independence and control It might be a competitive advantage to your business to still have the lights on when inevitably the centralised platform becomes unavailable to most (think of trading and events like crowdstrike) reply ranguna 9 hours agoparentprevYou just have to pay for the hardware instead of going onto crazy expensive fee schemes. reply bastardoperator 10 hours agoparentprevMaybe privacy, outside of that, same client, so not much. reply homebrewer 9 hours agoparentprevDowntime when you can afford it (for us it's in the middle of the night, and very rarely), not in the middle of the working day when GitHub fucks up yet again. reply tuananh 6 hours agoprevwe are considering moving from gitlab to forgejo. it's not a immediate concern but i think the days of gitlab are numbered with recent change in top management. reply CyberDildonics 57 minutes agoprevIs it a \"software forge\" or is it just using git locally? reply blacklight 9 hours agoprevI did my Github > self-hosted Gitlab > Gitea > Forgejo journey over the years, and I haven't looked back. Forgejo is great and it's probably going to become even greater once federation is done (having distributed forks and PRs across multiple instances solves the fragmentation problem of self-hosted solutions). And I lost my trust in Gitea once it spun off a for-profit branch backed by VC money (which was exactly the reason why it was forked into Forgejo). The only thing I lost from Gitlab is the out-of-the-box CI/CD platform. But I could migrate my pipelines to Drone CI and trigger them via webhooks. Just keep in mind that, depending on the complexity of your Gitlab pipelines, this may not always be an option. Anyway, for me hosting a Gitlab server that hogged up 5GB of RAM to serve a couple of small projects was a big no-no. Forgejo takes 500MB of RAM at peak. reply dartos 3 hours agoprevBeen using forgejo for years to maintain mirrors of GitHub repos I like. Works great. Easy to set up (especially on nixos) reply jamsio 3 hours agoprevThe fact that Open Source is about sharing, and they don't share. They only take. reply meonkeys 3 hours agoparentPlease explain. Not clicking those links. reply seymon 11 hours agoprev [–] Is fogejo the platform that codeberg uses? reply openplatypus 11 hours agoparentYes reply remux 7 hours agorootparentWho owns the Forgejo domains and trademarks? > The Forgejo domains are in the custody of the non-profit Codeberg e.V.. e.g. https://forgejo.org/faq/ reply stop50 10 hours agoparentprev [–] And vice versa. Codeberg is the official host of the sourcecode reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "Forgejo is a self-hosted software forge that emphasizes security, scalability, federation, and privacy, developed by the community under Codeberg e.V.",
      "It serves as a Free Software alternative to GitHub, offering an easy installation process and low maintenance for efficient project management.",
      "Forgejo is designed to be resource-efficient, fostering collaboration and productivity, and supports innovation in decentralized software development."
    ],
    "commentSummary": [
      "Forgejo is a self-hosted, lightweight software forge, serving as an alternative to GitHub, and is managed by a non-profit organization without premium upsells. It originated as a fork of Gitea, following Gitea's shift towards commercialization, and emphasizes being freely licensed and community-driven. Forgejo is noted for its low resource usage, ease of updates, and development of federation features, making it ideal for personal or small-scale hosting."
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
