[
  {
    "id": 42753396,
    "title": "ТикТок погружается во тьму в США",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "",
    "originSummary": [
      "В США TikTok временно прекратил работу из-за федерального запрета, но к полудню воскресенья сервис начал восстанавливаться.",
      "Запрет был вызван опасениями по поводу потенциального китайского шпионажа, при этом обе партии поддержали требование к ByteDance, владельцу TikTok, продать приложение.",
      "Избранный президент Дональд Трамп предложил отложить запрет и предложил совместное предприятие с американской собственностью в качестве потенциального решения, в то время как альтернативные приложения набирали популярность во время запрета."
    ],
    "commentSummary": [
      "Запрет TikTok в США вызвал обсуждения о конфиденциальности данных и геополитическом влиянии, с акцентом на его китайскую собственность. Запрет рассматривается некоторыми как мера национальной безопасности, в то время как другие воспринимают его как ограничение свободы слова и потенциальное преимущество для американских технологических компаний. Эта ситуация вызвала дебаты о балансе между безопасностью и свободой, а также о влиянии иностранных компаний на внутренние СМИ."
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "Учебник по фильтру Калмана",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "",
    "originSummary": [
      "KalmanFilter.NET предоставляет учебное пособие по фильтру Калмана, математическому инструменту для оценки и прогнозирования состояний системы в условиях неопределенности, который часто используется в отслеживании и навигации.",
      "Учебное пособие, начатое в 2017 году, включает числовые примеры и интуитивные объяснения, охватывающие как одномерные, так и многомерные фильтры Калмана, и расширено до продвинутых тем, таких как нелинейные фильтры Калмана.",
      "Книга, основанная на учебном пособии, предлагает всестороннее руководство от основ до продвинутых тем с иллюстративными примерами и практическими приложениями, делая фильтр Калмана доступным и понятным, с некоторыми частями, доступными бесплатно."
    ],
    "commentSummary": [
      "Чтобы понять фильтр Калмана, полезно сначала изучить метод наименьших квадратов, рекурсивный метод наименьших квадратов и информационный фильтр, так как фильтр Калмана является эффективной реформулировкой рекурсивного метода наименьших квадратов.",
      "Фильтр Калмана — это мощный инструмент для оценки состояния в системах с шумом и динамическими изменениями, и его можно понять как с процедурной, так и с байесовской точки зрения.",
      "Хотя математическая строгость важна для глубокого понимания, те, у кого нет сильной математической подготовки, все же могут изучать концепции интуитивными методами, поддерживаемыми различными ресурсами, такими как PDF-файлы и онлайн-учебники."
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "Forgejo: Легковесная программная платформа для самостоятельного размещения",
    "originLink": "https://forgejo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "",
    "originSummary": [
      "Forgejo — это самохостинговая платформа для разработки программного обеспечения, которая акцентирует внимание на безопасности, масштабируемости, федерации и конфиденциальности, разработанная сообществом под эгидой Codeberg e.V.",
      "Это служит альтернативой GitHub с открытым исходным кодом, предлагая простой процесс установки и низкие затраты на обслуживание для эффективного управления проектами.",
      "Forgejo разработан для эффективного использования ресурсов, содействия сотрудничеству и продуктивности, а также поддерживает инновации в децентрализованной разработке программного обеспечения."
    ],
    "commentSummary": [
      "Forgejo — это легковесная платформа для хостинга программного обеспечения, служащая альтернативой GitHub и управляемая некоммерческой организацией без премиальных продаж. Она возникла как форк Gitea после того, как Gitea начала коммерциализацию, и делает акцент на свободной лицензии и ориентированности на сообщество. Forgejo отмечается низким потреблением ресурсов, простотой обновлений и разработкой функций федерации, что делает её идеальной для личного или небольшого хостинга."
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
