[
  {
    "id": 42753396,
    "title": "틱톡, 미국에서 중단",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "",
    "originSummary": [
      "틱톡은 연방 금지로 인해 미국에서 일시적으로 중단되었지만, 일요일 정오까지 서비스가 복구되기 시작했습니다.",
      "이 금지는 잠재적인 중국의 감시에 대한 우려로 인해 추진되었으며, TikTok의 소유주인 ByteDance가 앱을 매각하도록 요구하는 것에 대해 초당적인 지지를 받았습니다.",
      "당선인 도널드 트럼프는 금지 조치를 연기하고 미국 소유의 합작 투자를 잠재적 해결책으로 제안했으며, 금지 기간 동안 대체 앱들이 인기를 얻었다고 제안했습니다."
    ],
    "commentSummary": [
      "미국에서의 틱톡 금지는 데이터 프라이버시와 지정학적 영향력에 대한 논의를 촉발했으며, 그 우려는 중국 소유권에 집중되어 있습니다. 일부 사람들은 이 금지를 국가 안보 조치로 보고 있는 반면, 다른 사람들은 이를 표현의 자유에 대한 제한이자 미국 기술 기업들에게 잠재적인 이점으로 인식하고 있습니다. 이 상황은 안보와 자유의 균형 및 국내 미디어에 대한 외국 기업의 영향에 대한 논쟁을 불러일으켰습니다."
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "칼만 필터 튜토리얼",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "",
    "originSummary": [
      "KalmanFilter.NET은 추적 및 내비게이션에서 일반적으로 사용되는 불확실한 조건에서 시스템 상태를 추정하고 예측하기 위한 수학적 도구인 칼만 필터에 대한 튜토리얼을 제공합니다.",
      "2017년에 시작된 이 튜토리얼은 수치 예제와 직관적인 설명을 포함하여 단변량 및 다변량 칼만 필터를 다루며, 비선형 칼만 필터와 같은 고급 주제로 확장되었습니다.",
      "튜토리얼을 기반으로 한 이 책은 기본부터 고급 주제까지 포괄적인 가이드를 제공하며, 설명이 포함된 예제와 실용적인 응용을 통해 칼만 필터를 쉽게 이해할 수 있도록 합니다. 일부 내용은 무료로 제공됩니다."
    ],
    "commentSummary": [
      "칼만 필터를 이해하기 위해서는 먼저 최소 제곱법, 재귀 최소 제곱법, 정보 필터를 공부하는 것이 유익합니다. 칼만 필터는 재귀 최소 제곱법의 효율적인 재구성입니다.",
      "칼만 필터는 잡음과 동적 변화가 있는 시스템에서 상태 추정을 위한 강력한 도구이며, 절차적 관점과 베이지안 관점 모두에서 이해될 수 있습니다.",
      "수학적 엄밀함은 깊은 이해를 위해 중요하지만, 수학 배경이 강하지 않은 사람들도 PDF와 온라인 튜토리얼과 같은 다양한 자료를 통해 직관적인 방법으로 개념을 탐구할 수 있습니다."
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "Forgejo: 자체 호스팅 경량 소프트웨어 포지",
    "originLink": "https://forgejo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "",
    "originSummary": [
      "Forgejo는 Codeberg e.V. 산하 커뮤니티에 의해 개발된 보안, 확장성, 연합 및 프라이버시를 강조하는 자체 호스팅 소프트웨어 포지입니다.",
      "이는 GitHub의 자유 소프트웨어 대안으로, 효율적인 프로젝트 관리를 위해 쉬운 설치 과정과 낮은 유지보수를 제공합니다.",
      "Forgejo는 자원 효율성을 염두에 두고 설계되어 협업과 생산성을 촉진하며, 분산 소프트웨어 개발에서의 혁신을 지원합니다."
    ],
    "commentSummary": [
      "Forgejo는 자체 호스팅이 가능한 경량 소프트웨어 포지로, GitHub의 대안으로 제공되며 프리미엄 업셀 없이 비영리 단체에 의해 관리됩니다. 이는 Gitea의 상업화 전환 이후 Gitea의 포크로 시작되었으며, 자유 라이선스와 커뮤니티 주도를 강조합니다. Forgejo는 낮은 자원 사용량, 업데이트의 용이성, 연합 기능 개발로 주목받고 있으며, 개인 또는 소규모 호스팅에 이상적입니다."
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
