[
  {
    "id": 42753396,
    "title": "TikTok ABD'de kararıyor",
    "originLink": "https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753396",
    "commentBody": "",
    "originSummary": [
      "TikTok, federal bir yasak nedeniyle ABD'de geçici bir kapanma yaşadı, ancak hizmet Pazar günü öğle saatlerinde yeniden sağlanmaya başladı.",
      "Yasak, potansiyel Çin gözetimi konusundaki endişeler nedeniyle, TikTok'un sahibi ByteDance'in uygulamayı satmasını gerektiren iki partili destekle yönlendirildi.",
      "Seçilmiş Başkan Donald Trump, yasağın ertelenmesini önerdi ve potansiyel bir çözüm olarak ABD sahipliğinde bir ortak girişim önerdi, bu sırada alternatif uygulamalar yasak sırasında popülerlik kazandı."
    ],
    "commentSummary": [
      "TikTok'un ABD'de yasaklanması, veri gizliliği ve jeopolitik etki üzerine tartışmaları ateşledi ve endişeler, Çinli sahipliği etrafında yoğunlaştı. Yasak, bazıları tarafından ulusal güvenlik önlemi olarak görülürken, diğerleri bunu ifade özgürlüğüne bir sınırlama ve Amerikan teknoloji şirketleri için potansiyel bir avantaj olarak algılıyor. Bu durum, güvenlik ile özgürlüğü dengeleme ve yabancı kuruluşların yerel medya üzerindeki etkisi üzerine tartışmaları tetikledi."
    ],
    "points": 1132,
    "commentCount": 2260,
    "retryCount": 0,
    "time": 1737258709
  },
  {
    "id": 42751690,
    "title": "Kalman Filtresi Eğitimi",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42751690",
    "commentBody": "",
    "originSummary": [
      "KalmanFilter.NET, belirsiz koşullarda sistem durumlarını tahmin etmek ve kestirmek için kullanılan matematiksel bir araç olan Kalman Filtresi hakkında bir eğitim sunar, bu araç genellikle izleme ve navigasyonda kullanılır.",
      "2017 yılında başlatılan eğitim, sayısal örnekler ve sezgisel açıklamalar içermekte olup, hem tek değişkenli hem de çok değişkenli Kalman Filtrelerini kapsamaktadır ve doğrusal olmayan Kalman Filtreleri gibi ileri konulara genişletilmiştir.",
      "Bir öğreticiye dayanan kitap, Kalman Filtresi'ni erişilebilir ve anlaşılır hale getirerek, temel konulardan ileri konulara kadar kapsamlı bir rehber sunar, açıklayıcı örnekler ve pratik uygulamalarla birlikte, bazı bölümleri ücretsiz olarak mevcuttur."
    ],
    "commentSummary": [
      "Kalman Filtresi'ni kavramak için, önce En Küçük Kareler, yinelemeli En Küçük Kareler ve Bilgi Filtresi'ni incelemek faydalı olacaktır, çünkü Kalman Filtresi, yinelemeli En Küçük Kareler'in verimli bir yeniden formülasyonudur.",
      "Kalman Filtresi, gürültü ve dinamik değişiklikler içeren sistemlerde durum tahmini için güçlü bir araçtır ve hem prosedürel hem de Bayesçi perspektiflerden anlaşılabilir.",
      "Matematiksel titizlik derin bir anlayış için çok önemli olsa da, güçlü bir matematik geçmişine sahip olmayanlar, PDF'ler ve çevrimiçi eğitimler gibi çeşitli kaynaklarla desteklenen sezgisel yollarla kavramları keşfedebilirler."
    ],
    "points": 329,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1737237015
  },
  {
    "id": 42753523,
    "title": "Forgejo: Kendi kendine barındırılan hafif bir yazılım dövme platformu",
    "originLink": "https://forgejo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42753523",
    "commentBody": "",
    "originSummary": [
      "Forgejo, güvenlik, ölçeklenebilirlik, federasyon ve gizliliği vurgulayan, Codeberg e.V. altında topluluk tarafından geliştirilen, kendi kendine barındırılan bir yazılım platformudur.",
      "GitHub'a bir Özgür Yazılım alternatifi olarak hizmet eder, kolay kurulum süreci ve verimli proje yönetimi için düşük bakım gereksinimi sunar.",
      "Forgejo, kaynakları verimli kullanacak şekilde tasarlanmıştır, iş birliği ve üretkenliği teşvik eder ve merkezi olmayan yazılım geliştirmede yeniliği destekler."
    ],
    "commentSummary": [
      "Forgejo, GitHub'a alternatif olarak hizmet veren, kendi kendine barındırılan, hafif bir yazılım platformudur ve kâr amacı gütmeyen bir kuruluş tarafından yönetilir, premium satış teklifleri sunmaz. Gitea'nın ticarileşmeye yönelmesinin ardından Gitea'nın bir çatalı olarak ortaya çıkmış olup, özgür lisanslı ve topluluk odaklı olmayı vurgular. Forgejo, düşük kaynak kullanımı, kolay güncellemeleri ve federasyon özelliklerinin geliştirilmesi ile dikkat çeker, bu da onu kişisel veya küçük ölçekli barındırma için ideal kılar."
    ],
    "points": 276,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1737260126
  }
]
