[
  {
    "id": 42838700,
    "title": "En afskedigelse ændrede fundamentalt, hvordan jeg opfatter arbejde",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "Forfatteren modtog en uventet opsigelsesmeddelelse fra deres virksomheds COO, på trods af tidligere forsikringer om, at der ikke ville ske afskedigelser, hvilket indikerer en uoverensstemmelse mellem virksomhedens kommunikation og handlinger.",
      "Erfaringen førte til et tab af tillid til moderne arbejdsmiljøer, hvor medarbejdere føler sig udskiftelige, selv når virksomhederne er økonomisk stabile, hvilket fremkalder et skift mod minimal indsats og skepsis over for jobsikkerhed.",
      "I Tyskland prioriterer arbejdsmarkedslovene beskyttelse af sårbare medarbejdere under afskedigelser, men dette garanterer ikke jobsikkerhed for alle, hvilket fører til råd om, at medarbejdere nøje skal overholde kontrakttimer og søge andre jobmuligheder."
    ],
    "commentSummary": [
      "Forfatteren reflekterer over deres erfaring i teknologibranchen og understreger, at det er afgørende at bevare en positiv indstilling og en stærk arbejdsmoral for fremtidige jobmuligheder. At opbygge og pleje professionelle relationer kan føre til nye muligheder, da kontakter fra tidligere job ofte spiller en rolle i at sikre fremtidige stillinger. Selvom ansættelse er transaktionel, foreslår forfatteren at fokusere på personlig stolthed i arbejdet og forholdet til kolleger frem for at forvente loyalitet fra virksomheder."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "Marginalia – En søgemaskine, der prioriterer ikke-kommercielt indhold",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "Marginalia Search har lanceret en ny side med fokus på ikke-kommercielt indhold og opdagelsesværktøjer, der lægger vægt på brugerens privatliv og databeskyttelse.",
      "Den søgemaskine fungerer ved hjælp af open-source teknologi, uden AI eller cloud-tjenester, og overholder GDPR og EU's Cookie-direktiv.",
      "Kildefilen er tilgængelig under en AGPL-licens, hvilket fremmer gennemsigtighed og samarbejde i fællesskabet."
    ],
    "commentSummary": [
      "Marginalia er en søgemaskine, der lægger vægt på ikke-kommercielt indhold og er gået fra at bruge Personalized PageRank til BM25 for rangering. Søgemaskinen har inkorporeret cosinus-lighed til at opdage websites og er flyttet til et nyt domæne, marginalia-search.com. Marginalia er open source, genindlæser sider hver 10. uge, bruger en RSS-crawler til daglige opdateringer og planlægger at udvide ud over engelsk indhold, selvom den i øjeblikket har udfordringer med navigationsforespørgsler."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "Udbruddet af tuberkulose i Kansas er det største registrerede i Amerika siden 1950'erne",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "Kansas står over for det største tuberkuloseudbrud i USA's historie, med 66 aktive tilfælde og 79 latente infektioner rapporteret i Kansas City-området siden 2024, primært i Wyandotte County. Centers for Disease Control and Prevention (CDC) hjælper lokale sundhedsmyndigheder med at håndtere udbruddet, som stadig er i gang, men hvor antallet af aktive tilfælde er reduceret til cirka 32. Tuberkulose er en bakteriel infektion, der påvirker lungerne, spredes gennem luften og kan behandles med antibiotika, med en lav risiko for den brede offentlighed."
    ],
    "commentSummary": [
      "Udbruddet af tuberkulose i Kansas er det største i USA siden 1950'erne, ifølge Centers for Disease Control and Prevention (CDC). Udbruddet har ført til diskussioner om BCG-vaccinen, som ikke rutinemæssigt gives i USA på grund af inkonsekvent effektivitet og mulige bivirkninger. Denne situation understreger behovet for effektive folkesundhedspolitikker og regeringens agenturers rolle i overvågning og forebyggelse af sygdomme."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "Openhaystack: Byg 'AirTags' – spor Bluetooth-enheder via Apples netværk",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack er en ramme, der muliggør sporing af personlige Bluetooth-enheder ved hjælp af Apples Find My-netværk, udviklet af Secure Mobile Networking Lab ved TU Darmstadt.",
      "Det er baseret på reverse-engineering af Apples Find My-netværk og kræver macOS 11 samt en Bluetooth-enhed, såsom en BBC micro:bit, for at fungere.",
      "OpenHaystack er open source under GNU Affero General Public License v3.0, understøtter forskellige enheder og inkluderer en mobilversion til Android og iOS, selvom den stadig er eksperimentel og ikke tilknyttet Apple."
    ],
    "commentSummary": [
      "Openhaystack giver brugerne mulighed for at skabe tilpassede 'AirTags' til at spore Bluetooth-enheder via Apples netværk, hvilket tilbyder et alternativ til Apples proprietære løsning.",
      "Googles version af Bluetooth-sporing kritiseres for dårlig ydeevne og problemer med privatlivets fred, mens Samsungs netværk bemærkes for bedre ydeevne på trods af Googles større Android-brugerbase.",
      "Dialogen fremhæver bekymringer om privatlivets fred og tekniske udfordringer ved udvikling af skræddersyede sporingsenheder, hvor tredjepartsløsninger mangler avancerede funktioner som Ultra-Wideband (UWB) til præcis sporing."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "Undervisning i at skabe familiefotos, som folk ønsker at beholde (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "DeepSeek Min Brugeragent",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 er en ny model designet til at afsløre tankegangen for brugerne, tilgængelig gratis på chat.deepseek.com eller gennem en mere overkommelig API sammenlignet med OpenAI.",
      "Efter udgivelsen af artiklen stødte DeepSeek API på problemer, hvor platform.deepseek.com returnerede 404-fejl, hvilket indikerer potentielle forstyrrelser forårsaget af DeepSeek My User Agent.",
      "Brugere kan udforske topdomme på Hacker News og benytte \"Judge Me\"-prompten på chat.deepseek.com for en personlig oplevelse."
    ],
    "commentSummary": [
      "En bruger delte en humoristisk roast fra DeepSeek, et AI-værktøj, der analyserer browserdata og fremhæver særheder som forældet operativsystem og usædvanlig skærmopløsning. Roasten forbandt humoristisk disse træk med brugerens placering i Calgary, Canada, hvilket udløste diskussioner om værktøjets lejlighedsvise unøjagtigheder og underholdningsværdi. Samtalen udforskede også AI's potentiale til at forbedre webbrowseroplevelser, såsom at filtrere annoncer og irrelevant indhold, samt skabe nye internetinteraktioner."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "Purelymail: Billig, ligetil e-mail",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail tilbyder omkostningseffektiv e-mail-hosting med kompatibilitet til IMAP og POP3, hvilket muliggør brug med de fleste mailapplikationer eller gennem Roundcube webmail.",
      "Servicen er bemærkelsesværdigt overkommelig og tilbyder en enkelt e-mailkonto med 3 GB lagerplads for $10 årligt, hvilket er billigere end konkurrenter som Protonmail, Fastmail og Google Workspace.",
      "Mens Purelymail er i beta og kan have lejlighedsvise problemer som e-mail-blokering og mangel på 24/7 support, lægger det vægt på sikkerhed og sælger ikke brugerdata."
    ],
    "commentSummary": [
      "Purelymail er anerkendt som en budgetvenlig e-mailtjeneste, værdsat for sin enkelhed og pålidelighed, især for brugerdefinerede domæner. Brugere sammenligner den med tjenester som mxroute, Fastmail og Proton, og fremhæver dens overkommelige pris, men bemærker bekymringer om dens drift af én person og manglen på funktioner som kalendersynkronisering. På trods af nogle begrænsninger gør Purelymails ligefremme prissætning og funktionalitet den til en levedygtig mulighed for brugere, der søger en basal e-mailløsning, med alternativer som Zoho og selv-hosting også overvejet."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "Astromomer sletter asteroide, fordi det viste sig at være en Tesla Roadster",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "Astronomer fejlagtigt klassificerede oprindeligt Elon Musks Tesla Roadster som en asteroide, hvilket understreger behovet for forbedret gennemsigtighed i sporing af dybtrumsobjekter.",
      "Minor Planet Center rettede klassifikationsfejlen og fremhævede vanskeligheden ved at skelne mellem naturlige og kunstige objekter i rummet.",
      "Begivenheden peger på fraværet af et centralt arkiv til at spore dybtrumsobjekter, hvilket komplicerer bestræbelserne på at overvåge potentielle asteroide-trusler, hvor amatørastronomer spiller en vigtig rolle i identifikationen."
    ],
    "commentSummary": [
      "Astronomer fejlagtigt klassificerede oprindeligt en Tesla Roadster som en asteroide og mærkede den \"2018 CN41,\" før de indså, at det var en menneskeskabt genstand, der allerede blev sporet som \"2018-017A.\" Denne hændelse understreger nødvendigheden af forbedrede sporings og klassificeringssystemer for kunstige objekter i rummet for at forhindre lignende fejl. Forvekslingen fremhæver udfordringerne ved at skelne mellem naturlige himmellegemer og menneskeskabte objekter i rumforskning."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "DeepSeek udgiver Janus Pro, en tekst-til-billede generator [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek har introduceret Janus Pro, en tekst-til-billede-generator, der bruger en \"forenet model\" med 7 milliarder parametre, som angiveligt overgår Dall-E 3 og Stable Diffusion Medium i ydeevne.",
      "Modellen er kendt for sin omfattende censur på følsomme emner og begrænsede billedopløsning på 384x384, hvilket har udløst debatter om konsekvenserne af AI-udvikling.",
      "Janus Pros lavere træningsomkostninger sammenlignet med konkurrenter kan påvirke virksomheder som Nvidia, og det er tilgængeligt til kommerciel brug med restriktioner på militære anvendelser."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "Brasilien forbyder Sam Altmans teknologifirma Tools for Humanity at betale for irisscanninger",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "Brasiliens databeskyttelsesmyndighed har forbudt Tools for Humanity at tilbyde kompensation, herunder kryptovaluta, for irisscanninger for at forhindre unødig påvirkning af individers beslutninger om at dele biometriske data.",
      "Tools for Humanity, medstiftet af OpenAI's CEO Sam Altman, sigter mod at udvikle et globalt identitetssystem gennem irisscanninger under sit World-projekt.",
      "Virksomheden hævder at overholde brasilianske love og er i dialog med myndigheden for at løse bekymringer efter en undersøgelse, der begyndte sidste november."
    ],
    "commentSummary": [
      "Brasilien har forbudt Tools for Humanity, ledet af Sam Altman, at kompensere individer for irisscanninger for at beskytte personlig autonomi. Denne beslutning har udløst debatter om privatliv og de etiske implikationer ved indsamling af biometriske data, som dem involveret i Altmans Worldcoin-projekt. Situationen understreger den igangværende konflikt mellem teknologisk fremskridt og etiske bekymringer vedrørende databeskyttelse og potentiel misbrug."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "Mit mislykkede forsøg på at reducere alle NPM-pakker med 5%",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "I 2022 blev der fremsat et forslag om at bruge Zopfli-kompressoren til at reducere npm-pakkestørrelser med 5% med det formål at forbedre ydeevnen og sænke lageromkostningerne. Forslaget blev afvist af npm-vedligeholdere på grund af bekymringer om Zopfli's langsomme kompressionshastighed, dekompressionstid, lockfile-problemer og integrationskompleksitet. Erfaringen gav indsigt i at skrive forslag og evaluere kompromiser, på trods af at forslaget blev trukket tilbage."
    ],
    "commentSummary": [
      "En initiativ til at reducere NPM-pakkestørrelser med 5% ved hjælp af Zopfli-komprimering stødte på problemer som øgede udgivelsestider og kompleksitet.",
      "På trods af potentielle båndbreddebesparelser gjorde ulemper som langsommere komprimering og manglende indbygget support forslaget mindre levedygtigt.",
      "Diskussionen understregede udfordringen ved at balancere innovation med praktisk anvendelighed i open source-projekter, hvilket førte til lukningen af forslaget og overvejelsen af alternativer som Brotli eller ZSTD."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "Den tidligere tech-CEO sagsøger for at få fjernet optegnelsen over sin anholdelse fra internettet",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "Den tidligere tech-CEO Maury Blackman sagsøger journalisten Jack Poulson for 25 millioner dollars for at få fjernet en anholdelse for vold i hjemmet fra 2021 fra internettet, på trods af at sagen er blevet forseglet af en dommer.",
      "Retssagen har antændt debatter om First Amendment, hvor Electronic Frontier Foundation forsvarer Poulson og understreger den offentlige interesse i offentliggørelsen.",
      "First Amendment Coalition har anlagt en retssag, der udfordrer den californiske lov, der forhindrer offentliggørelsen af forseglede arrestationsregistre, hvilket fremhæver spændingen mellem privatlivets fred og ytringsfrihedsrettigheder."
    ],
    "commentSummary": [
      "En tidligere tech-CEO sagsøger for at få fjernet sin arrestationsjournal fra internettet, hvilket sætter fokus på den omdømmemæssige skade forårsaget af offentlige arrestationsjournaler.",
      "Den sag fremhæver debatten mellem behovet for gennemsigtighed for at forhindre hemmelige anholdelser og den potentielle skade på individers fremtid, når anholdelsesdetaljer offentliggøres uden en domfældelse.",
      "Retssagen involverer også Streisand-effekten, hvor forsøg på at undertrykke information utilsigtet kan øge dens synlighed."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "Nvidia, ASML falder kraftigt, da DeepSeek udløser salg af teknologiske aktier",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "Nvidias aktieværdi faldt med 560 milliarder dollars, hvilket markerer det største fald i markeds historien, primært på grund af bekymringer over den kinesiske AI-startup DeepSeek.",
      "DeepSeeks konkurrencedygtige lavpris-AI-model har skabt frygt for fremtiden for amerikanske virksomheders AI-investeringer, hvilket påvirker Nvidias aktier og store indeks som S&P 500 og Nasdaq 100.",
      "På trods af Nvidias udfordringer planlægger Meta at øge udgifterne til AI-projekter, og OpenAI, SoftBank og Oracle har annonceret et betydeligt AI-infrastrukturprojekt på 100 milliarder dollars."
    ],
    "commentSummary": [
      "Nvidia og ASML-aktier faldt efter et teknologisalg initieret af den kinesiske AI-startup DeepSeek, som skabte en model, der overgår ChatGPT ved hjælp af ældre Nvidia-hardware.",
      "DeepSeeks open source-model, der er billigere at træne, vækker bekymring om rentabiliteten for AI-virksomheder som OpenAI og Anthropic, hvilket potentielt kan påvirke den fremtidige efterspørgsel efter Nvidias GPU'er.",
      "Markedets reaktion indikerer frygt for reducerede margener og øget konkurrence, på trods af potentialet for bredere AI-adoption."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "Mark Zuckerberg: Denne mand er en kujon",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "Mark Zuckerberg møder kritik for sin tavshed, mens den tidligere præsident Donald Trump nedbryder National Institutes of Health, hvilket påvirker 40 milliarder dollars i forskningsfinansiering, på trods af Zuckerbergs tidligere forpligtelser til sygdomsforskning.",
      "Zuckerbergs handlinger hos Meta, herunder reduktion af faktatjek, indholdsmoderation og diversitetsinitiativer, samtidig med at han fremmer republikanske ledere, tyder på et skift i principper, der er i overensstemmelse med Trumps krav.",
      "Kritikere hævder, at Zuckerbergs eftergivenhed over for Trumps autoritære tendenser afspejler en mangel på mod, hvilket kan påvirke andre teknologivirksomheder som Amazon til potentielt at indtage lignende holdninger, og dermed påvirke hans eftermæle."
    ],
    "commentSummary": [
      "Artiklen kritiserer Mark Zuckerberg for hans handlinger hos Meta og antyder, at hans beslutninger er påvirket af egeninteresse og mangel på principper, især under politisk pres.",
      "Den udforsker temaer som virksomheders ansvar, rigdommens indflydelse på politik og vanskelighederne ved at bevare integritet i lederroller.",
      "Diskussionen er delt, hvor nogle forsvarer Zuckerberg som muligvis tilpassende sig eksterne pres, mens andre udtrykker skuffelse over teknologilederes opfattede mangel på mod."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "Oliver Heaviside og teorien om transmissionslinjer (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "PA3FWM's amatør radiowebsite dykker ned i tekniske emner som single-sideband FM, software-defineret radio (SDR) lydkort og antennedesign.",
      "Webstedet fremhæver Oliver Heavisides bidrag til teorien om transmissionslinjer, herunder hans forbedringer af Maxwells ligninger og telegrafkabelmodeller.",
      "Indholdet er tilpasset fra en artikel fra november 2021 i det hollandske amatør radiomagasin Electron, der giver historiske og tekniske indsigter i signaltransmission og kabeldesign."
    ],
    "commentSummary": [
      "Oliver Heaviside, en selvlært fysiker, ydede bemærkelsesværdige bidrag til elektromagnetisme og teorien om transmissionslinjer, på trods af at han mødte modstand fra etablerede skikkelser som William Henry Preece. Heavisides arbejde, herunder forenklingen af Maxwells ligninger, var afgørende for feltet, men han levede i fattigdom på grund af professionelle forhindringer. Indlægget fremhæver udfordringerne ved at forstå transmissionslinjer og impedans, med henvisning til uddannelsesressourcer og historiske anekdoter for kontekst."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
