[
  {
    "id": 42838700,
    "title": "ஒரு பணிநீக்கம் அடிப்படையாகவே நான் வேலைக்கான பார்வையை மாற்றியது",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் தங்கள் நிறுவனத்தின் COO விலிருந்து எதிர்பாராத பணிநீக்கம் அறிவிப்பை பெற்றனர், முந்தைய உறுதிமொழிகள் இருந்தபோதிலும் பணிநீக்கங்கள் நடைபெறாது என்று கூறியிருந்தனர், இது நிறுவனத்தின் தொடர்பு மற்றும் செயல்பாடுகளுக்கு இடையில் ஒரு இணைப்பின்மையை குறிக்கிறது.",
      "அந்த அனுபவம் நவீன வேலை சூழல்களில் நம்பிக்கையை இழக்கச் செய்தது, அங்கு நிறுவனங்கள் நிதியளவில் நிலைத்திருக்கும்போதும் ஊழியர்கள் பயன்படுத்தப்படும் பொருளாக உணர்கிறார்கள், குறைந்த முயற்சி மற்றும் வேலை பாதுகாப்பு சந்தேகத்திற்கான மாற்றத்தை தூண்டுகிறது.",
      "ஜெர்மனியில், தொழிலாளர் சட்டங்கள் பணிநீக்கத்தின் போது பாதிக்கப்படக்கூடிய ஊழியர்களை பாதுகாக்க முன்னுரிமை அளிக்கின்றன, ஆனால் இது அனைவருக்கும் வேலை பாதுகாப்பை உறுதிசெய்யாது, இதனால் ஊழியர்கள் ஒப்பந்த நேரங்களை கடைபிடிக்கவும், பிற வேலை வாய்ப்புகளைத் தேடவும் ஆலோசனை வழங்கப்படுகிறது."
    ],
    "commentSummary": [
      "ஆசிரியர் தங்கள் தொழில்நுட்ப துறையில் அனுபவத்தைப் பற்றி சிந்திக்கின்றனர், எதிர்கால வேலை வாய்ப்புகளுக்கு நேர்மறை மனப்பாங்கும் வலுவான பணியாற்றும் நெறியும் முக்கியமானவை என்பதை வலியுறுத்துகின்றனர். தொழில்முறை உறவுகளை உருவாக்கி பராமரிப்பது புதிய வாய்ப்புகளுக்கு வழிவகுக்கலாம், ஏனெனில் முந்தைய வேலைகளிலிருந்து தொடர்புகள் எதிர்கால பங்குகளைப் பெறுவதில் பெரும்பாலும் பங்கு வகிக்கின்றன. வேலைவாய்ப்பு பரஸ்பரமாக இருப்பினும், நிறுவனங்களிடமிருந்து நம்பகத்தன்மையை எதிர்பார்ப்பதற்குப் பதிலாக, பணியில் தனிப்பட்ட பெருமை மற்றும் பணியாளர்களுடன் உறவுகளை கவனிக்க ஆசிரியர் பரிந்துரைக்கின்றனர்."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "மார்ஜினாலியா – வணிகரீதியற்ற உள்ளடக்கத்தை முன்னுரிமைப்படுத்தும் தேடுபொறி",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "மார்ஜினாலியா தேடல் புதிய தளத்தை அறிமுகப்படுத்தியுள்ளது, இது வணிகரீதியற்ற உள்ளடக்கம் மற்றும் கண்டுபிடிப்பு கருவிகளை மையமாகக் கொண்டு, பயனர் தனியுரிமை மற்றும் தரவுப் பாதுகாப்பை முக்கியமாகக் கருதுகிறது.",
      "தேடல் இயந்திரம் திறந்த மூல தொழில்நுட்பத்தைப் பயன்படுத்தி இயங்குகிறது, AI அல்லது மேக சேவைகள் இன்றி, மேலும் GDPR மற்றும் EU குக்கீ இயக்குநருக்கு இணங்குகிறது.",
      "மூல குறியீடு AGPL உரிமத்தின் கீழ் கிடைக்கிறது, இது வெளிப்படைத்தன்மை மற்றும் சமூக ஒத்துழைப்பை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "மார்ஜினாலியா என்பது வணிகரீதியற்ற உள்ளடக்கத்தை முக்கியமாகக் கொண்ட தேடுபொறி ஆகும் மற்றும் தரவரிசைக்காக தனிப்பயன் பக்க ரேங்க் பயன்படுத்துவதிலிருந்து BM25 க்கு மாறியுள்ளது. இந்த தேடுபொறி இணையதளங்களை கண்டறிய கோசைன் ஒற்றுமையை இணைத்துள்ளது மற்றும் புதிய டொமைன், marginalia-search.com க்கு மாறியுள்ளது. மார்ஜினாலியா திறந்த மூலமாக உள்ளது, ஒவ்வொரு 10 வாரங்களுக்கும் தளங்களை மீண்டும் தேடுகிறது, தினசரி புதுப்பிப்புகளுக்கு RSS கிராலரைப் பயன்படுத்துகிறது, மற்றும் ஆங்கில உள்ளடக்கத்தைத் தாண்டி விரிவடைய திட்டமிட்டுள்ளது, ஆனால் தற்போது வழிசெலுத்தல் கேள்விகளுடன் போராடுகிறது."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "கான்சாஸ் காசநோய் பரவல் 1950களுக்கு பிறகு அமெரிக்காவில் பதிவான மிகப்பெரியதாகும்",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "கான்சாஸ் அமெரிக்காவின் வரலாற்றில் மிகப்பெரிய காசநோய் பரவலை எதிர்கொள்கிறது, 2024 முதல் கான்சாஸ் சிட்டி மெட்ரோ பகுதியில் 66 செயலில் உள்ள வழக்குகள் மற்றும் 79 மறைமுக தொற்றுகள் பதிவாகியுள்ளன, முக்கியமாக வயண்டாட் கவுண்டியில். நோய்கள் கட்டுப்பாட்டு மற்றும் தடுப்பு மையம் (CDC) இந்த பரவலை நிர்வகிக்க உள்ளூர் சுகாதார அதிகாரிகளுக்கு உதவுகிறது, இது தொடர்ச்சியாக உள்ளது ஆனால் செயலில் உள்ள வழக்குகள் சுமார் 32 ஆக குறைந்துள்ளது. காசநோய் நுரையீரல்களை பாதிக்கும் ஒரு பாக்டீரியா தொற்று, காற்றின் மூலம் பரவுகிறது, மற்றும் ஆன்டிபயாட்டிக்களால் சிகிச்சை அளிக்கக்கூடியது, பொதுமக்களுக்கு ஆபத்து குறைவாகக் கருதப்படுகிறது."
    ],
    "commentSummary": [
      "கான்சாஸ் காசநோய் பரவல் 1950களுக்கு பிறகு அமெரிக்காவில் மிகப்பெரியதாகும், எனது நோய்க் கட்டுப்பாடு மற்றும் தடுப்பு மையம் (CDC) தெரிவித்துள்ளது. இந்த பரவல் BCG தடுப்பூசியை பற்றிய விவாதங்களை தூண்டியுள்ளது, இது அமெரிக்காவில் வழக்கமாக வழங்கப்படுவதில்லை, ஏனெனில் அதன் செயல்திறன் மாறுபடுவதாலும் சாத்தியமான பக்கவிளைவுகளாலும். இந்த நிலைமை பொதுசுகாதாரக் கொள்கைகளின் திறனை மற்றும் நோய்களை கண்காணித்து தடுப்பதில் அரசாங்க நிறுவனங்களின் பங்கினை வலியுறுத்துகிறது."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "ஓபன்ஹேஸ்டாக்: 'ஏர்டேக்ஸ்' உருவாக்கவும் – ஆப்பிளின் நெட்வொர்க்கை வழியாக ப்ளூடூத் சாதனங்களை கண்காணிக்கவும்",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack என்பது TU Darmstadt இல் உள்ள பாதுகாப்பான மொபைல் நெட்வொர்க்கிங் ஆய்வகத்தால் உருவாக்கப்பட்ட, ஆப்பிளின் Find My நெட்வொர்க்கைப் பயன்படுத்தி தனிப்பட்ட ப்ளூடூத் சாதனங்களை கண்காணிக்க உதவும் ஒரு கட்டமைப்பாகும்.",
      "இது ஆப்பிளின் Find My நெட்வொர்க்கை ரிவர்ஸ்-என்ஜினியரிங் செய்வதன் அடிப்படையில் அமைந்துள்ளது மற்றும் செயல்பட macOS 11 மற்றும் ஒரு ப்ளூடூத் சாதனம், உதாரணமாக BBC மைக்ரோ:பிட், தேவைப்படுகிறது.",
      "OpenHaystack என்பது GNU Affero General Public License v3.0 கீழ் திறந்த மூலமாகும், பல்வேறு சாதனங்களை ஆதரிக்கிறது, மேலும் Android மற்றும் iOS க்கான மொபைல் பதிப்பை உள்ளடக்கியுள்ளது, ஆனால் இது பரிசோதனை நிலையில் உள்ளது மற்றும் Apple உடன் தொடர்பில்லாதது."
    ],
    "commentSummary": [
      "\"Openhaystack\" பயனர்களுக்கு ஆப்பிளின் நெட்வொர்க்கை வழியாக ப்ளூடூத் சாதனங்களை கண்காணிக்க தனிப்பயன் 'ஏர்டேக்குகளை' உருவாக்க அனுமதிக்கிறது, இது ஆப்பிளின் சொந்த தீர்வுக்கு மாற்றாக வழங்கப்படுகிறது.",
      "Google இன் ப்ளூடூத் கண்காணிப்பு பதிப்பு குறைந்த செயல்திறன் மற்றும் தனியுரிமை பிரச்சினைகளுக்காக விமர்சிக்கப்படுகிறது, அதேசமயம் Google இன் பெரிய ஆண்ட்ராய்டு பயனர் அடிப்படையைக் கொண்டிருந்தாலும், சாம்சங் இன் நெட்வொர்க் சிறந்த செயல்திறனுக்காக குறிப்பிடப்படுகிறது.",
      "தமிழில் எழுத வேண்டும். உரையாடல் தனியுரிமை கவலைகள் மற்றும் தனிப்பயன் கண்காணிப்பு சாதனங்களை உருவாக்குவதில் தொழில்நுட்ப சவால்களை வெளிப்படுத்துகிறது, மூன்றாம் தரப்பு மாற்று வழிகள் துல்லியமான கண்காணிப்புக்கு அல்ட்ரா-வைட்பேண்ட் (UWB) போன்ற மேம்பட்ட அம்சங்களை கொண்டிருக்கவில்லை."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "குடும்ப புகைப்படங்களை உருவாக்குவதற்கான பாடங்கள், மக்கள் வைத்துக்கொள்ள விரும்புகிறார்கள் (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "டீப் சீக் மை யூசர் ஏஜெண்ட்",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 என்பது பயனர்களுக்கு சிந்தனைச் சங்கிலியை வெளிப்படுத்த வடிவமைக்கப்பட்ட புதிய மாதிரி ஆகும், இது chat.deepseek.com இல் இலவசமாக அல்லது OpenAI ஐ விட மலிவான API மூலம் கிடைக்கிறது.",
      "கட்டுரையின் வெளியீட்டுக்குப் பிறகு, DeepSeek API சிக்கல்களை சந்தித்தது, platform.deepseek.com 404 பிழைகளைத் திருப்பியதால், DeepSeek My User Agent ஏற்படுத்திய சாத்தியமான இடையூறுகளைக் குறிக்கிறது.",
      "பயனர்கள் Hacker News இல் சிறந்த தீர்ப்புகளை ஆராய்ந்து, chat.deepseek.com இல் உள்ள \"Judge Me\" உத்தரவை பயன்படுத்தி தனிப்பட்ட அனுபவத்தை பெறலாம்."
    ],
    "commentSummary": [
      "ஒரு பயனர் DeepSeek என்ற AI கருவியிலிருந்து ஒரு நகைச்சுவையான ரோஸ்டை பகிர்ந்துள்ளார், இது உலாவி தரவுகளை பகுப்பாய்வு செய்து, பழைய OS மற்றும் விசித்திரமான திரை தீர்மானம் போன்ற விசித்திரங்களை வெளிப்படுத்துகிறது. இந்த ரோஸ்ட், இந்த பண்புகளை கனடாவின் கல்கரி நகரில் உள்ள பயனரின் இருப்பிடத்துடன் நகைச்சுவையாக இணைத்தது, கருவியின் சில நேரங்களில் தவறான தகவல்களையும் பொழுதுபோக்கு மதிப்பையும் பற்றிய விவாதங்களை தூண்டியது. இந்த உரையாடல், விளம்பரங்கள் மற்றும் தொடர்பற்ற உள்ளடக்கங்களை வடிகட்டுதல் போன்ற இணைய உலாவல் அனுபவங்களை மேம்படுத்துவதில் AI இன் திறனை ஆராய்ந்தது மற்றும் புதுமையான இணைய தொடர்புகளை உருவாக்கியது."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "பியூர்லிமெயில்: மலிவான, நேர்மையான மின்னஞ்சல்",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail, IMAP மற்றும் POP3 க்கான இணக்கத்தன்மையுடன் செலவுச்செலவான மின்னஞ்சல் ஹோஸ்டிங்கை வழங்குகிறது, இது பெரும்பாலான மின்னஞ்சல் பயன்பாடுகள் அல்லது Roundcube வலை அஞ்சல் மூலம் பயன்படுத்த அனுமதிக்கிறது.",
      "தமிழில் எழுத வேண்டும். சேவை குறிப்பிடத்தக்க வகையில் மலிவானது, ஆண்டுக்கு $10 க்கு 3 ஜிபி சேமிப்பிடத்துடன் ஒரு மின்னஞ்சல் கணக்கை வழங்குகிறது, இது Protonmail, Fastmail, மற்றும் Google Workspace போன்ற போட்டியாளர்களை விட மலிவானது.",
      "Purelymail பீட்டா நிலையில் இருக்கும் போது, மின்னஞ்சல் தடை மற்றும் 24/7 ஆதரவு இல்லாமை போன்ற சில சிக்கல்கள் இருக்கக்கூடும், இது பாதுகாப்பை முக்கியமாகக் கருதுகிறது மற்றும் பயனர் தரவுகளை விற்காது."
    ],
    "commentSummary": [
      "Purelymail என்பது எளிமை மற்றும் நம்பகத்தன்மைக்காக, குறிப்பாக தனிப்பயன் டொமைன்களுக்கு, மதிப்பிடப்படும் ஒரு செலவுச்செலவான மின்னஞ்சல் சேவையாக அங்கீகரிக்கப்படுகிறது. பயனர்கள் இதை mxroute, Fastmail, மற்றும் Proton போன்ற சேவைகளுடன் ஒப்பிடுகின்றனர், அதன் மலிவுத்தன்மையைப் பாராட்டுகின்றனர், ஆனால் ஒரே நபர் இயக்கம் மற்றும் காலண்டர் ஒத்திசைவு போன்ற அம்சங்களின் பற்றாக்குறை குறித்து கவலைப்படுகின்றனர். சில வரம்புகள் இருந்தபோதிலும், Purelymail இன் நேரடியான விலை மற்றும் செயல்பாடு அடிப்படையான மின்னஞ்சல் தீர்வைத் தேடும் பயனர்களுக்கு ஒரு செயல்திறன் வாய்ந்த விருப்பமாக மாற்றுகிறது, Zoho மற்றும் சுய-ஹோஸ்டிங் போன்ற மாற்று வழிகளும் கருதப்படுகின்றன."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "வானியலாளர்கள் ஆஸ்டராய்டை நீக்கினர், ஏனெனில் அது டெஸ்லா ரோட்ஸ்டர் என தெரியவந்தது",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "வானியலாளர்கள் முதலில் எலான் மஸ்கின் டெஸ்லா ரோட்ஸ்டரை ஒரு விண்கல் என தவறாக வகைப்படுத்தினர், இது ஆழமான விண்வெளி பொருட்களை கண்காணிப்பதில் மேம்பட்ட வெளிப்படைத்தன்மையின் தேவையை வலியுறுத்துகிறது.",
      "சிறு கோள் மையம் வகைப்பாட்டுப் பிழையை திருத்தியது, விண்வெளியில் இயற்கை மற்றும் செயற்கை பொருட்களை வேறுபடுத்துவதில் உள்ள சிரமத்தை வெளிப்படுத்தியது.",
      "இந்தச் சம்பவம் ஆழமான விண்வெளி பொருட்களை கண்காணிக்க மையக் களஞ்சியத்தின் இல்லாமையை சுட்டிக்காட்டுகிறது, இது சாத்தியமான விண்கல் அச்சுறுத்தல்களை கண்காணிக்கும் முயற்சிகளை சிக்கலாக்குகிறது, இதில் ஆமெச்சூர் வானியலாளர்கள் அடையாளம் காண்பதில் முக்கிய பங்கு வகிக்கின்றனர்."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். வானியலாளர்கள் முதலில் ஒரு டெஸ்லா ரோட்ஸ்டரை ஒரு விண்கல் என தவறாக வகைப்படுத்தி, அதனை \"2018 CN41\" என குறித்தனர், பின்னர் அது ஏற்கனவே \"2018-017A\" என கண்காணிக்கப்பட்ட மனிதனால் உருவாக்கப்பட்ட பொருள் என்பதை உணர்ந்தனர். இந்த சம்பவம், விண்வெளியில் மனிதனால் உருவாக்கப்பட்ட பொருட்களை கண்காணிக்கும் மற்றும் வகைப்படுத்தும் முறைமைகளை மேம்படுத்துவதன் அவசியத்தை வலியுறுத்துகிறது, இதுபோன்ற தவறுகளைத் தவிர்க்க. இந்த குழப்பம், விண்வெளி ஆராய்ச்சியில் இயற்கை விண்மீன்களுக்கும் மனிதனால் உருவாக்கப்பட்ட பொருட்களுக்கும் இடையே வேறுபாடு காணும் சவால்களை வெளிப்படுத்துகிறது."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "டீப் சீக் ஜனஸ் ப்ரோவை வெளியிடுகிறது, இது ஒரு உரை-மூலம் பட உருவாக்கி [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek, Janus Pro என்ற 7 பில்லியன் அளவுகோள்களைக் கொண்ட 'ஒற்றுமை மாடல்' பயன்படுத்தி உரையிலிருந்து படங்களை உருவாக்கும் ஜெனரேட்டரை அறிமுகப்படுத்தியுள்ளது, இது Dall-E 3 மற்றும் Stable Diffusion Medium ஆகியவற்றை செயல்திறனில் மிஞ்சுவதாகக் கூறப்படுகிறது.",
      "மாதிரி அதன் கனமான தணிக்கை மற்றும் 384x384 என்ற வரையறுக்கப்பட்ட பட தீர்மானத்திற்காக குறிப்பிடப்படுகிறது, இது செயற்கை நுண்ணறிவு மேம்பாட்டின் விளைவுகள் குறித்து விவாதங்களை தூண்டுகிறது.",
      "தமிழில் எழுத வேண்டும். Janus Pro வின் குறைந்த பயிற்சி செலவுகள் போட்டியாளர்களுடன் ஒப்பிடும்போது Nvidia போன்ற நிறுவனங்களை பாதிக்கக்கூடும், மேலும் இது இராணுவ பயன்பாடுகளில் கட்டுப்பாடுகளுடன் வணிக பயன்பாட்டிற்கு கிடைக்கிறது."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "பிரேசில், சாம் ஆல்ட்மனின் தொழில்நுட்ப நிறுவனம் 'டூல்ஸ் ஃபார் ஹ்யூமனிட்டி' ஐ கண் குருட்டு சோதனைகளுக்கான கட்டணத்தை செலுத்துவதிலிருந்து தடை செய்கிறது",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "பிரேசிலின் தரவுப் பாதுகாப்பு அதிகாரம், பயனர்களின் உயிரணு தரவுகளை பகிர்வதற்கான முடிவுகளில் தேவையற்ற செல்வாக்கைத் தவிர்க்க, கண் குருட்டு ஸ்கேன் செய்யும் பணத்திற்கு, கிரிப்டோகரன்சி உட்பட, இழப்பீடு வழங்குவதிலிருந்து Tools for Humanity நிறுவனத்தைத் தடை செய்துள்ளது.",
      "Tools for Humanity, OpenAI நிறுவனத்தின் தலைமை நிர்வாக அதிகாரி சாம் ஆல்ட்மேன் இணைந்து நிறுவிய நிறுவனம், அதன் உலக திட்டத்தின் கீழ் கண் காம்பளி ஸ்கேன் மூலம் ஒரு உலகளாவிய அடையாள அமைப்பை உருவாக்குவதைக் குறிக்கிறது.",
      "TEXT: நிறுவனம் பிரேசிலிய சட்டங்களுக்கு இணங்க செயல்படுவதாக வலியுறுத்தி, கடந்த நவம்பரில் தொடங்கிய விசாரணைக்கு பின் எழுந்துள்ள கவலைகளை தீர்க்க அதிகாரியுடன் ஈடுபடுகிறது."
    ],
    "commentSummary": [
      "பிரேசில், சாம் ஆல்ட்மேன் தலைமையிலான டூல்ஸ் ஃபார் ஹ்யூமனிட்டி நிறுவனத்தை, தனிநபர்களின் தனிப்பட்ட சுயாதீனத்தை பாதுகாக்க கண் குருட்டு ஸ்கேன் செய்யும் நபர்களுக்கு இழப்பீடு வழங்குவதைத் தடை செய்துள்ளது. இந்த முடிவு, ஆல்ட்மேனின் வேர்ல்ட்காயின் திட்டம் போன்ற பயோமெட்ரிக் தரவுகளை சேகரிப்பதன் தனியுரிமை மற்றும் நெறிமுறை விளைவுகள் குறித்த விவாதங்களைத் தூண்டியுள்ளது. இந்த நிலைமை, தரவுத் தனியுரிமை மற்றும் தவறாகப் பயன்படுத்தும் சாத்தியக்கூறுகள் குறித்த நெறிமுறை கவலைகளுக்கு எதிரான தொழில்நுட்ப முன்னேற்றத்தின் தொடர்ச்சியான மோதலை வலியுறுத்துகிறது."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "என் தோல்வியுற்ற முயற்சி: அனைத்து NPM தொகுப்புகளையும் 5% குறைக்க",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "2022 ஆம் ஆண்டில், செயல்திறனை மேம்படுத்தவும் சேமிப்பு செலவுகளை குறைக்கவும் நோக்கமாக npm தொகுப்பு அளவுகளை 5% குறைக்க Zopfli கம்பிரசரை பயன்படுத்த ஒரு முன்மொழிவு செய்யப்பட்டது. Zopfli இன் மந்தமான கம்பிரசன் வேகம், கம்பிரசன் நேரம், லாக்ஃபைல் பிரச்சினைகள் மற்றும் ஒருங்கிணைப்பு சிக்கல்களால் npm பராமரிப்பாளர்களால் அந்த முன்மொழிவு நிராகரிக்கப்பட்டது. முன்மொழிவின் வாபஸ்தலனையின்போதும், முன்மொழிவு எழுதுவதிலும் பரிமாற்றங்களை மதிப்பீடு செய்வதிலும் அனுபவம் கிடைத்தது."
    ],
    "commentSummary": [
      "TEXT: Zopfli சுருக்கத்தைப் பயன்படுத்தி NPM தொகுப்பு அளவுகளை 5% குறைக்க ஒரு முயற்சி வெளியீட்டு நேரங்கள் மற்றும் சிக்கல்களைப் போன்ற பிரச்சினைகளை சந்தித்தது.",
      "பிரதிபலிக்கப்படும் பாண்ட்விட்த் சேமிப்புகளைப் பொருட்படுத்தாமல், மெதுவான சுருக்கம் மற்றும் சொந்த ஆதரவு இல்லாமை போன்ற குறைபாடுகள் இந்த முன்மொழிவை குறைவாக செயல்படுத்தக்கூடியதாக ஆக்கின.",
      "இந்த விவாதம் திறந்த மூல திட்டங்களில் புதுமையை நடைமுறையுடன் சமநிலைப்படுத்தும் சவாலைக் குறிப்பிடுகிறது, இதனால் முன்மொழிவின் முடிவு மற்றும் Brotli அல்லது ZSTD போன்ற மாற்று வழிகளை பரிசீலனை செய்யப்பட்டது."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "முன்னாள் தொழில்நுட்ப நிறுவனத்தின் தலைமை நிர்வாக அதிகாரி தனது கைது பதிவை இணையத்திலிருந்து நீக்க வழக்கு தொடர்ந்துள்ளார்",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "முன்னாள் தொழில்நுட்ப நிறுவனத்தின் தலைமை நிர்வாக அதிகாரி மௌரி பிளாக்மேன், 2021 ஆம் ஆண்டில் நடந்த குடும்ப வன்முறை கைது சம்பவத்தை இணையத்திலிருந்து அகற்றுவதற்காக பத்திரிகையாளர் ஜாக் பவுல்சனை $25 மில்லியன் மதிப்பில் வழக்கு தொடர்ந்துள்ளார், அந்த பதிவை நீதிபதி முத்திரையிட்டிருந்தாலும்.",
      "முறையீடு: வழக்கு முதல் திருத்த உரிமை விவாதங்களை தூண்டியுள்ளது, இதில் எலக்ட்ரானிக் ஃப்ரண்டியர் ஃபவுண்டேஷன் பவுல்சனை பாதுகாத்து, வெளியீட்டில் பொது நலனைக் கவனத்தில் எடுத்துள்ளது.",
      "முதல் திருத்த கூட்டணி, சீல் செய்யப்பட்ட கைது பதிவுகளை வெளியிடுவதில் தடைவிதிக்கும் கலிபோர்னியா சட்டத்தை எதிர்த்து வழக்கு தொடர்ந்துள்ளது, இது தனியுரிமை மற்றும் கருத்துரிமை உரிமைகளுக்கு இடையிலான பதட்டத்தை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "முன்னாள் தொழில்நுட்ப நிறுவனத்தின் தலைமை நிர்வாக அதிகாரி தனது கைது பதிவை இணையத்திலிருந்து நீக்க வழக்கு தொடர்ந்துள்ளார், பொதுமக்கள் கைது பதிவுகள் ஏற்படுத்தும் கண்ணிய இழப்பு குறித்து கவனம் ஈர்க்கிறார்.",
      "இந்த வழக்கு, இரகசியக் கைது நடவடிக்கைகளைத் தடுக்க வெளிப்படைத்தன்மையின் தேவையும், குற்றச்சாட்டு இல்லாமல் கைது விவரங்கள் வெளியிடப்படும் போது தனிநபர்களின் எதிர்காலத்திற்கு ஏற்படும் சாத்தியமான சேதமும் ஆகியவற்றுக்கிடையேயான விவாதத்தை வெளிப்படுத்துகிறது.",
      "வழக்கு ஸ்ட்ரைசாண்ட் விளைவைவும் உள்ளடக்கியது, அங்கு தகவலை ஒடுக்க முயற்சிகள் தவறுதலாக அதன் காட்சியளிப்பை அதிகரிக்கக்கூடும்."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "என்விடியா, ASML ஆழமான தேடல் தொழில்நுட்ப பங்குகளை விற்பனைக்கு தூண்டுகிறது",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "என்விடியாவின் பங்கு மதிப்பு $560 பில்லியன் குறைந்தது, இது சந்தை வரலாற்றில் மிகப்பெரிய சரிவாகும், முக்கியமாக சீன AI ஸ்டார்ட்அப் டீப் சீக் பற்றிய கவலைகளால்.",
      "\"டீப் சீக்\" நிறுவனத்தின் போட்டி குறைந்த செலவிலான செயற்கை நுண்ணறிவு மாடல், அமெரிக்க நிறுவனங்களின் செயற்கை நுண்ணறிவு முதலீடுகளின் எதிர்காலத்தைப் பற்றிய அச்சங்களை எழுப்பியுள்ளது, இது நிவிடியா நிறுவனத்தின் பங்குகள் மற்றும் எஸ் & பி 500 மற்றும் நாஸ்டாக் 100 போன்ற முக்கிய குறியீடுகளை பாதிக்கிறது.",
      "என்விடியாவின் சவால்களை எதிர்கொள்ளும் நிலையில், மெட்டா AI திட்ட செலவுகளை அதிகரிக்க திட்டமிட்டுள்ளது, மேலும் ஓபன்AI, சாப்ட்பேங்க் மற்றும் ஓரகிள் $100 பில்லியன் AI உள்கட்டமைப்பு முயற்சியை அறிவித்துள்ளன."
    ],
    "commentSummary": [
      "என்விடியா மற்றும் ASML பங்குகள், சீன AI ஸ்டார்ட்அப் டீப் சீக் தொடங்கிய தொழில்நுட்ப விற்பனை காரணமாக குறைந்தன, இது பழைய என்விடியா ஹார்ட்வேர் பயன்படுத்தி ChatGPT-ஐ மிஞ்சும் மாடலை உருவாக்கியது.",
      "DeepSeek இன் திறந்த மூல மாதிரி, குறைந்த செலவில் பயிற்சி பெறுவதால், OpenAI மற்றும் Anthropic போன்ற AI நிறுவனங்களின் லாபகரமான நிலை குறித்து கவலைகளை எழுப்புகிறது, இது எதிர்காலத்தில் Nvidia இன் GPU களுக்கான தேவையை பாதிக்கக்கூடும்.",
      "சந்தையின் பதில் குறைந்த நிகர இலாபம் மற்றும் அதிகரித்த போட்டியைப் பற்றிய அச்சங்களை குறிக்கிறது, பரந்த AI ஏற்றுக்கொள்ளும் சாத்தியத்தையும் பொருட்படுத்தாமல்."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "மார்க் சக்கர்பெர்க்: இந்த மனிதன் ஒரு கோழை",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "மார்க் சக்கர்பெர்க் தனது மௌனத்திற்காக விமர்சனங்களை எதிர்கொள்கிறார், ஏனெனில் முன்னாள் ஜனாதிபதி டொனால்ட் டிரம்ப் தேசிய சுகாதார நிறுவனங்களை (NIH) கலைத்து, $40 பில்லியன் ஆராய்ச்சி நிதியை பாதிக்கிறார், சக்கர்பெர்க் முன்பு நோய் ஆராய்ச்சிக்கு அளித்த வாக்குறுதிகளுக்கு மாறாக.",
      "சக்கர்பெர்க் மேட்டாவில் மேற்கொண்ட நடவடிக்கைகள், உண்மைச் சரிபார்ப்பு, உள்ளடக்க மிதமாக்கல் மற்றும் பல்வகைமையினை குறைப்பது உள்ளிட்டவை, குடியரசுக் கட்சியின் நிர்வாகிகளை மேம்படுத்துவதுடன், டிரம்பின் கோரிக்கைகளுடன் ஒத்துப்போகும் விதமாக, கொள்கைகளில் மாற்றத்தை குறிக்கின்றன.",
      "விமர்சகர்கள், டிரம்பின் அதிகாரவாத倾向ங்களுக்கு சக்கர்பெர்க் இணங்குவது தைரியமின்மையை பிரதிபலிக்கிறது என்று வாதிடுகின்றனர், இது அமேசான் போன்ற பிற தொழில்நுட்ப நிறுவனங்களையும் இதேபோன்ற நிலைப்பாடுகளை ஏற்கத் தூண்டக்கூடும், இதனால் அவரது பாரம்பரியத்தை பாதிக்கக்கூடும்."
    ],
    "commentSummary": [
      "கட்டுரை மார்க் சக்கர்பெர்க் மீது அவரது செயல்களை விமர்சிக்கிறது, குறிப்பாக அரசியல் அழுத்தங்களின் கீழ், அவரது முடிவுகள் சுயநலத்தால் மற்றும் கொள்கையின்மையால் பாதிக்கப்படுகின்றன என்று பரிந்துரைக்கிறது.",
      "இது நிறுவன பொறுப்புணர்வு, அரசியலில் செல்வத்தின் தாக்கம், மற்றும் தலைமைப் பொறுப்புகளில் நேர்மையை பராமரிக்கும் சிரமங்கள் போன்ற தலைப்புகளை ஆராய்கிறது.",
      "சர்ச்சை இரண்டாகப் பிரிக்கப்பட்டுள்ளது, சிலர் சக்கர்பெர்க்கை வெளிப்புற அழுத்தங்களுக்கு ஏற்ப மாறக்கூடியவராக பாதுகாக்கின்றனர், மற்றவர்கள் தொழில்நுட்ப தலைவர்களின் தைரியமின்மையைப் பற்றிய ஏமாற்றத்தை வெளிப்படுத்துகின்றனர்."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "ஒலிவர் ஹீவிசைடு மற்றும் பரிமாற்ற கோடுகளின் கோட்பாடு (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "PA3FWM இன் ஆமெச்சூர் ரேடியோ இணையதளம் ஒற்றை பக்க அலைவரிசை FM, மென்பொருள் வரையறுக்கப்பட்ட ரேடியோ (SDR) ஒலிப்பதிவு அட்டைகள் மற்றும் ஆண்டென்னா வடிவமைப்பு போன்ற தொழில்நுட்ப தலைப்புகளை ஆராய்கிறது.",
      "இத்தளம் ஒலிவர் ஹீவிசைடின் பரிமாற்ற வரி கோட்பாட்டிற்கான பங்களிப்புகளை, குறிப்பாக மேக்ஸ்வெல் சமன்பாடுகள் மற்றும் தந்தி கேபிள் மாதிரிகளுக்கான அவரது மேம்பாடுகளை வலியுறுத்துகிறது.",
      "உள்ளடக்கம் நவம்பர் 2021 இல் வெளியான டச்சு அமெச்சூர் ரேடியோ மாத இதழான எலக்ட்ரான் இல் இருந்து மாற்றப்பட்டுள்ளது, இது சிக்னல் பரிமாற்றம் மற்றும் கேபிள் வடிவமைப்பில் வரலாற்று மற்றும் தொழில்நுட்ப பார்வைகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஒலிவர் ஹீவிசைடு, ஒரு சுய கற்றல் இயற்பியலாளர், மின்காந்தம் மற்றும் பரிமாற்ற வரி கோட்பாட்டிற்கு குறிப்பிடத்தக்க பங்களிப்புகளை செய்தார், வில்லியம் ஹென்றி ப்ரீஸ் போன்ற நிலைநிறுத்தப்பட்ட நபர்களின் எதிர்ப்பை எதிர்கொண்டபோதும். ஹீவிசைடின் வேலை, மேக்ஸ்வெல் சமன்பாடுகளை எளிமைப்படுத்துதல் உட்பட, அந்த துறைக்கு முக்கியமானதாக இருந்தது, ஆனால் தொழில்முறை தடைகளால் அவர் வறுமையில் வாழ்ந்தார். இந்த பதிவு, பரிமாற்ற வரிகள் மற்றும் தடையின்மை பற்றிய புரிதலில் உள்ள சவால்களை வெளிப்படுத்துகிறது, கல்வி வளங்கள் மற்றும் வரலாற்று சம்பவங்களை குறிப்பிட்டு பின்னணி அளிக்கிறது."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
