[
  {
    "id": 42838700,
    "title": "Bir işten çıkarılma, işi algılama şeklimi temelden değiştirdi.",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "Yazar, daha önce işten çıkarmaların olmayacağına dair verilen güvencelere rağmen, şirketin COO'sundan beklenmedik bir işten çıkarma bildirimi aldı ve bu durum, şirket iletişimi ile eylemleri arasında bir kopukluk olduğunu gösteriyor.",
      "Bu deneyim, çalışanların kendilerini harcanabilir hissettiği modern iş ortamlarında, şirketler mali açıdan istikrarlı olsa bile güven kaybına yol açtı ve bu durum, minimal çaba ve iş güvenliği şüpheciliğine doğru bir kaymaya neden oldu.",
      "Almanya'da iş kanunları, işten çıkarmalar sırasında savunmasız çalışanları korumayı önceliklendirir, ancak bu, herkes için iş güvencesi sağlamaz ve bu da çalışanlara sözleşme saatlerine sıkı sıkıya uymaları ve başka iş fırsatları aramaları tavsiyesine yol açar."
    ],
    "commentSummary": [
      "Yazar, teknoloji endüstrisindeki deneyimlerini değerlendirirken, olumlu bir tutum ve güçlü bir iş ahlakını korumanın gelecekteki iş fırsatları için çok önemli olduğunu vurguluyor. Profesyonel ilişkiler kurmak ve geliştirmek, geçmiş işlerden gelen bağlantıların genellikle gelecekteki rolleri güvence altına almada rol oynaması nedeniyle yeni fırsatlara yol açabilir. İstihdamın karşılıklı bir alışveriş olduğu belirtilirken, yazar, şirketlerden sadakat beklemek yerine işteki kişisel gurura ve iş arkadaşlarıyla olan ilişkilere odaklanmayı öneriyor."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "Marginalia – Ticari olmayan içeriği önceliklendiren bir arama motoru",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "Marginalia Search, kullanıcı gizliliği ve veri korumasını vurgulayarak ticari olmayan içerik ve keşif araçlarına odaklanan yeni bir site başlattı.",
      "Arama motoru, yapay zeka veya bulut hizmetleri olmadan, açık kaynak teknolojisi kullanarak çalışır ve GDPR ile AB Çerez Direktifi'ne uygundur.",
      "Kaynak kodu, şeffaflığı ve topluluk işbirliğini teşvik eden bir AGPL lisansı altında mevcuttur."
    ],
    "commentSummary": [
      "Marginalia, ticari olmayan içeriği vurgulayan bir arama motorudur ve sıralama için Kişiselleştirilmiş PageRank'ten BM25'e geçiş yapmıştır. Arama motoru, web sitelerini keşfetmek için kosinüs benzerliğini entegre etmiş ve yeni bir alan adı olan marginalia-search.com'a taşınmıştır. Marginalia açık kaynaklıdır, siteleri her 10 haftada bir yeniden tarar, günlük güncellemeler için bir RSS tarayıcı kullanır ve şu anda gezinme sorgularında zorlansa da İngilizce içeriğin ötesine geçmeyi planlamaktadır."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "Kansas tüberküloz salgını, 1950'lerden bu yana Amerika'nın kaydedilen en büyük salgınıdır.",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "Kansas, ABD tarihindeki en büyük tüberküloz salgınıyla karşı karşıya. 2024'ten bu yana Kansas City metro bölgesinde, çoğunlukla Wyandotte County'de, 66 aktif vaka ve 79 latent enfeksiyon bildirildi. Hastalık Kontrol ve Önleme Merkezleri (CDC), salgını yönetmede yerel sağlık yetkililerine yardımcı oluyor. Salgın devam etmekle birlikte aktif vaka sayısı yaklaşık 32'ye düşmüş durumda. Tüberküloz, akciğerleri etkileyen, hava yoluyla yayılan ve antibiyotiklerle tedavi edilebilen bir bakteriyel enfeksiyondur ve genel halk için riskin düşük olduğu düşünülmektedir."
    ],
    "commentSummary": [
      "Kansas'taki tüberküloz salgını, Hastalık Kontrol ve Önleme Merkezleri (CDC) tarafından bildirildiği üzere, 1950'lerden bu yana ABD'deki en büyük salgın. Salgın, ABD'de rutin olarak uygulanmayan BCG aşısı hakkında tartışmalara yol açtı; bunun nedeni tutarsız etkinlik ve olası yan etkilerdir. Bu durum, etkili halk sağlığı politikalarına duyulan ihtiyacı ve hastalık izleme ve önlemede devlet kurumlarının rolünü vurgulamaktadır."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "Openhaystack: 'AirTags' oluşturun – Bluetooth cihazlarını Apple'ın ağı üzerinden takip edin",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack, TU Darmstadt'taki Güvenli Mobil Ağ Laboratuvarı tarafından geliştirilen ve Apple'ın Bul ağı kullanılarak kişisel Bluetooth cihazlarının izlenmesini sağlayan bir çerçevedir.",
      "Apple'ın Find My ağının tersine mühendisliğine dayanmaktadır ve çalışması için macOS 11 ve BBC micro:bit gibi bir Bluetooth cihazı gerektirir.",
      "OpenHaystack, GNU Affero Genel Kamu Lisansı v3.0 altında açık kaynaklıdır, çeşitli cihazları destekler ve Android ve iOS için mobil bir sürüm içerir, ancak bu sürüm deneysel olup Apple ile bağlantılı değildir."
    ],
    "commentSummary": [
      "Openhaystack, kullanıcıların Apple'ın özel çözümüne alternatif olarak, Apple'ın ağı üzerinden Bluetooth cihazlarını izlemek için özel 'AirTag'ler oluşturmasına olanak tanır.",
      "Google'ın Bluetooth izleme versiyonu, yetersiz performansı ve gizlilik sorunları nedeniyle eleştirilirken, Samsung'un ağı, Google'ın daha büyük Android kullanıcı tabanına rağmen daha iyi performans göstermesiyle dikkat çekiyor.",
      "Konuşma, özel takip cihazları geliştirmede gizlilik endişelerini ve teknik zorlukları vurgularken, üçüncü taraf alternatiflerinin hassas takip için Ultra Geniş Bant (UWB) gibi gelişmiş özelliklerden yoksun olduğunu belirtiyor."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "İnsanların saklamak isteyeceği aile fotoğrafları oluşturma dersleri (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "DeepSeek Benim Kullanıcı Aracım",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1, kullanıcıların düşünce zincirini ortaya çıkarmak için tasarlanmış yeni bir modeldir ve chat.deepseek.com adresinde veya OpenAI'ye kıyasla daha uygun fiyatlı bir API aracılığıyla ücretsiz olarak sunulmaktadır.",
      "Makalenin yayınlanmasının ardından, DeepSeek API sorunlarla karşılaştı ve platform.deepseek.com, DeepSeek My User Agent tarafından neden olunan potansiyel kesintileri gösteren 404 hataları verdi.",
      "Kullanıcılar, Hacker News üzerindeki en iyi yargıları keşfedebilir ve chat.deepseek.com adresindeki \"Judge Me\" istemini kullanarak kişiselleştirilmiş bir deneyim yaşayabilirler."
    ],
    "commentSummary": [
      "Bir kullanıcı, tarayıcı verilerini analiz eden bir yapay zeka aracı olan DeepSeek'ten esprili bir taşlama paylaştı ve eski işletim sistemi ile alışılmadık ekran çözünürlüğü gibi tuhaflıkları vurguladı. Taşlama, bu özellikleri kullanıcının Kanada'nın Calgary şehrindeki konumuyla esprili bir şekilde ilişkilendirerek, aracın zaman zaman yanlışlıkları ve eğlence değeri üzerine tartışmalar başlattı. Konuşma ayrıca, reklamları ve alakasız içeriği filtrelemek ve yeni internet etkileşimleri yaratmak gibi web tarama deneyimlerini geliştirmede yapay zekanın potansiyelini de araştırdı."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "Purelymail: Ucuz, sade e-posta",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail, IMAP ve POP3 uyumluluğu ile çoğu e-posta uygulaması veya Roundcube webmail aracılığıyla kullanılabilen uygun maliyetli e-posta barındırma hizmeti sunar.",
      "Bu hizmet, yıllık 10 dolara 3 GB depolama alanına sahip tek bir e-posta hesabı sunarak, Protonmail, Fastmail ve Google Workspace gibi rakiplerinden daha ucuz olan dikkate değer bir uygunluk sunmaktadır.",
      "Purelymail beta aşamasında olduğundan, e-posta engelleme ve 7/24 destek eksikliği gibi ara sıra sorunlar yaşayabilir, ancak güvenliğe önem verir ve kullanıcı verilerini satmaz."
    ],
    "commentSummary": [
      "Purelymail, özellikle özel alan adları için basitliği ve güvenilirliği ile takdir edilen bütçe dostu bir e-posta hizmeti olarak tanınmaktadır. Kullanıcılar, mxroute, Fastmail ve Proton gibi hizmetlerle karşılaştırarak, uygun fiyatlı olduğunu vurgulamakta ancak tek kişilik bir operasyon olması ve takvim senkronizasyonu gibi özelliklerin eksikliği konusunda endişelerini dile getirmektedir. Bazı sınırlamalara rağmen, Purelymail'in basit fiyatlandırması ve işlevselliği, temel bir e-posta çözümü arayan kullanıcılar için uygun bir seçenek haline getirmektedir ve Zoho gibi alternatifler ve kendi barındırma çözümleri de değerlendirilmektedir."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "Astronomlar, Tesla Roadster olduğu ortaya çıktığı için asteroidi sildiler",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "Astronomlar, Elon Musk'ın Tesla Roadster'ını başlangıçta bir asteroit olarak yanlış sınıflandırdı ve bu durum, derin uzay nesnelerinin izlenmesinde daha iyi şeffaflık sağlanması gereğini vurguladı.",
      "Münih Gezegen Merkezi, uzaydaki doğal ve yapay nesneler arasındaki ayrımı yapmanın zorluğunu vurgulayarak sınıflandırma hatasını düzeltti.",
      "Bu olay, derin uzay nesnelerini izlemek için merkezi bir depo eksikliğine işaret ediyor ve potansiyel asteroid tehditlerini izleme çabalarını karmaşık hale getiriyor, amatör astronomlar ise tanımlamada hayati bir rol oynuyor."
    ],
    "commentSummary": [
      "Astromlar başlangıçta bir Tesla Roadster'ı bir asteroit olarak yanlış sınıflandırarak \"2018 CN41\" olarak etiketlediler, ancak bunun zaten \"2018-017A\" olarak izlenen insan yapımı bir nesne olduğunu fark ettiler. Bu olay, benzer hataları önlemek için uzaydaki yapay nesnelerin izlenmesi ve sınıflandırılması sistemlerinin geliştirilmesi gerekliliğini vurguluyor. Karışıklık, uzay keşfinde doğal gök cisimleri ile insan yapımı nesneler arasında ayrım yapmanın zorluklarını öne çıkarıyor."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "DeepSeek, Janus Pro adlı bir metinden görüntüye dönüştürücü yayınladı [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek, performans açısından Dall-E 3 ve Stable Diffusion Medium'u geride bıraktığı bildirilen 7 milyar parametreli \"birleşik model\" kullanan bir metinden görüntüye dönüştürücü olan Janus Pro'yu tanıttı.",
      "Model, hassas konular üzerindeki yoğun sansürü ve 384x384 sınırlı görüntü çözünürlüğü ile dikkat çekiyor, bu da yapay zeka geliştirme etkileri üzerine tartışmalara yol açıyor.",
      "Janus Pro'nun rakiplerine kıyasla daha düşük eğitim maliyetleri, Nvidia gibi şirketleri etkileyebilir ve askeri uygulamalar üzerindeki kısıtlamalarla ticari kullanım için mevcuttur."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "Brezilya, Sam Altman'ın teknoloji firması Tools for Humanity'nin iris taramaları için ödeme yapmasını yasakladı.",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "Brezilya'nın veri koruma otoritesi, bireylerin biyometrik verilerini paylaşma kararları üzerinde gereksiz etkiyi önlemek amacıyla, Tools for Humanity'nin iris taramaları için kripto para birimi de dahil olmak üzere tazminat teklif etmesini yasakladı.",
      "OpenAI CEO'su Sam Altman tarafından ortaklaşa kurulan Tools for Humanity, Dünya projesi kapsamında iris taramaları yoluyla küresel bir kimlik sistemi geliştirmeyi amaçlıyor.",
      "Şirket, Brezilya yasalarına uyduğunu iddia ediyor ve geçen Kasım ayında başlayan bir soruşturmanın ardından endişeleri gidermek için yetkililerle iletişim kuruyor."
    ],
    "commentSummary": [
      "Brezilya, kişisel özerkliği korumak amacıyla Sam Altman liderliğindeki Tools for Humanity'nin bireylere iris taramaları için ödeme yapmasını yasakladı. Bu karar, Altman'ın Worldcoin projesinde yer alanlar gibi biyometrik verilerin toplanmasının gizlilik ve etik sonuçları üzerine tartışmaları ateşledi. Durum, teknolojik ilerleme ile veri gizliliği ve potansiyel kötüye kullanım konusundaki etik kaygılar arasındaki devam eden çatışmayı vurguluyor."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "Başarısız NPM paketlerini %5 küçültme girişimim",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "2022 yılında, npm paket boyutlarını %5 oranında azaltmak amacıyla Zopfli sıkıştırıcısını kullanma önerisi yapıldı; bu, performansı artırmayı ve depolama maliyetlerini düşürmeyi hedefliyordu. Ancak, Zopfli'nin yavaş sıkıştırma hızı, açma süresi, kilit dosyası sorunları ve entegrasyon karmaşıklığı konusundaki endişeler nedeniyle npm bakımcıları tarafından öneri reddedildi. Önerinin geri çekilmesine rağmen, bu deneyim öneri yazımı ve ödünleşimlerin değerlendirilmesi konusunda içgörüler sağladı."
    ],
    "commentSummary": [
      "Zopfli sıkıştırma kullanarak NPM paket boyutlarını %5 azaltma girişimi, artan yayın süreleri ve karmaşıklık gibi sorunlarla karşılaştı.",
      "Potansiyel bant genişliği tasarruflarına rağmen, daha yavaş sıkıştırma ve yerel destek eksikliği gibi dezavantajlar öneriyi daha az uygulanabilir hale getirdi.",
      "Bu tartışma, açık kaynak projelerinde yenilik ile pratikliği dengeleme zorluğunu vurguladı ve önerinin kapatılmasına ve Brotli veya ZSTD gibi alternatiflerin değerlendirilmesine yol açtı."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "Eski teknoloji CEO'su, tutuklanma kaydının internetten kaldırılması için dava açıyor",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "Eski teknoloji CEO'su Maury Blackman, bir hakimin kaydı mühürlemesine rağmen, 2021'deki aile içi şiddet tutuklamasını internetten kaldırmak için gazeteci Jack Poulson'a 25 milyon dolarlık dava açıyor.",
      "Dava, Elektronik Sınır Vakfı'nın Poulson'ı savunarak yayının kamu yararına olduğunu vurgulamasıyla Birinci Değişiklik tartışmalarını ateşledi.",
      "İlk Değişiklik Koalisyonu, mühürlü tutuklama kayıtlarının yayınlanmasını engelleyen Kaliforniya yasasına itiraz eden bir dava açtı ve bu durum, gizlilik ile ifade özgürlüğü hakları arasındaki gerilimi vurguluyor."
    ],
    "commentSummary": [
      "Eski bir teknoloji CEO'su, internetten tutuklama kaydının kaldırılması için dava açarak, kamuya açık tutuklama kayıtlarının neden olduğu itibar zararına dikkat çekiyor.",
      "Bu dava, gizli tutuklamaları önlemek için şeffaflık ihtiyacı ile bir mahkumiyet olmadan tutuklama detaylarının yayınlanmasının bireylerin geleceğine potansiyel zarar verme arasındaki tartışmayı vurgulamaktadır.",
      "Dava, bilgiyi bastırma çabalarının istemeden görünürlüğünü artırabileceği Streisand etkisini de içeriyor."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "Nvidia, ASML, DeepSeek'in Teknoloji Hissesi Satışını Tetiklemesiyle Düşüş Yaşadı",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "Nvidia'nın hisse değeri, Çinli yapay zeka girişimi DeepSeek ile ilgili endişeler nedeniyle, piyasa tarihindeki en büyük düşüşü işaret ederek 560 milyar dolar azaldı.",
      "DeepSeek'in rekabetçi düşük maliyetli yapay zeka modeli, ABD şirketlerinin yapay zeka yatırımlarının geleceği hakkında endişeler yarattı ve bu durum Nvidia'nın hisselerini ve S&P 500 ile Nasdaq 100 gibi büyük endeksleri etkiledi.",
      "Nvidia'nın zorluklarına rağmen, Meta AI proje harcamalarını artırmayı planlıyor ve OpenAI, SoftBank ve Oracle, önemli bir 100 milyar dolarlık AI altyapı girişimini duyurdu."
    ],
    "commentSummary": [
      "Nvidia ve ASML hisseleri, Çinli yapay zeka girişimi DeepSeek'in daha eski Nvidia donanımını kullanarak ChatGPT'yi geride bırakan bir model oluşturmasıyla başlattığı teknoloji satış dalgasının ardından düştü.",
      "DeepSeek'in açık kaynaklı modeli, eğitimi daha ucuz olduğundan, OpenAI ve Anthropic gibi yapay zeka şirketlerinin karlılığı hakkında endişeler uyandırıyor ve bu durum, gelecekte Nvidia'nın GPU'larına olan talebi potansiyel olarak etkileyebilir.",
      "Piyasanın tepkisi, daha geniş AI benimsenme potansiyeline rağmen, azalan marjlar ve artan rekabet korkularını gösteriyor."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "Mark Zuckerberg: Bu Adam Bir Korkak",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "Mark Zuckerberg, eski Başkan Donald Trump'ın Ulusal Sağlık Enstitüleri'ni dağıtması ve 40 milyar dolarlık araştırma fonunu etkilemesi karşısında sessiz kalması nedeniyle eleştirilerle karşı karşıya. Bu durum, Zuckerberg'in daha önce hastalık araştırmalarına olan taahhütlerine rağmen gerçekleşiyor.",
      "Zuckerberg'in Meta'daki eylemleri, gerçek kontrolünü, içerik denetimini ve çeşitlilik girişimlerini azaltarak, Cumhuriyetçi yöneticileri teşvik ederken, Trump'ın talepleriyle uyumlu bir şekilde ilke değişikliğine işaret ediyor.",
      "Eleştirmenler, Zuckerberg'in Trump'ın otoriter eğilimlerine uyum sağlamasının cesaret eksikliğini yansıttığını ve Amazon gibi diğer teknoloji şirketlerini benzer tutumlar benimsemeye yönlendirebileceğini, dolayısıyla mirasını etkileyebileceğini savunuyorlar."
    ],
    "commentSummary": [
      "Makale, Mark Zuckerberg'i Meta'daki eylemleri nedeniyle eleştiriyor ve kararlarının, özellikle siyasi baskılar altında, kişisel çıkar ve ilkesizlikten etkilendiğini öne sürüyor.",
      "Kurumsal sorumluluk, servetin politika üzerindeki etkisi ve liderlik rollerinde dürüstlüğü korumanın zorlukları temalarını araştırıyor.",
      "Bu tartışma ikiye bölünmüş durumda; bazıları Zuckerberg'i dış baskılara uyum sağlıyor olabileceği için savunurken, diğerleri teknoloji liderlerinin algılanan cesaret eksikliğinden dolayı hayal kırıklığı ifade ediyor."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "Oliver Heaviside ve iletim hatları teorisi (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "PA3FWM'nin amatör radyo web sitesi, tek yan bant FM, yazılım tanımlı radyo (SDR) ses kartları ve anten tasarımı gibi teknik konulara dalıyor.",
      "Site, Oliver Heaviside'ın iletim hattı teorisine katkılarını, Maxwell denklemlerine ve telgraf kablo modellerine yaptığı iyileştirmeler de dahil olmak üzere vurgulamaktadır.",
      "İçerik, sinyal iletimi ve kablo tasarımı hakkında tarihsel ve teknik bilgiler sunan, Kasım 2021 tarihli Hollanda amatör radyo dergisi Electron'daki bir makaleden uyarlanmıştır."
    ],
    "commentSummary": [
      "Oliver Heaviside, kendi kendini yetiştirmiş bir fizikçi olarak, elektromanyetizma ve iletim hattı teorisine önemli katkılarda bulundu, William Henry Preece gibi yerleşik figürlerden gelen muhalefetle karşılaşmasına rağmen. Heaviside'ın, Maxwell denklemlerinin basitleştirilmesi de dahil olmak üzere çalışmaları, alan için çok önemliydi, ancak mesleki engeller nedeniyle yoksulluk içinde yaşadı. Gönderi, iletim hatlarını ve empedansı anlamadaki zorlukları vurguluyor ve bağlam için eğitim kaynaklarına ve tarihsel anekdotlara atıfta bulunuyor."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
