[
  {
    "id": 42838700,
    "title": "একটি ছাঁটাই মূলত আমার কাজের ধারণাকে পরিবর্তন করেছে",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "লেখক তাদের কোম্পানির সিওও থেকে একটি অপ্রত্যাশিত ছাঁটাই নোটিশ পেয়েছেন, যদিও পূর্বে আশ্বাস দেওয়া হয়েছিল যে ছাঁটাই হবে না, যা কোম্পানির যোগাযোগ এবং কার্যকলাপের মধ্যে একটি বিচ্ছিন্নতা নির্দেশ করে।",
      "অভিজ্ঞতাটি আধুনিক কর্মপরিবেশে বিশ্বাসের ক্ষতি ঘটিয়েছে, যেখানে কর্মচারীরা নিজেদেরকে অস্থায়ী মনে করেন এমনকি যখন কোম্পানিগুলি আর্থিকভাবে স্থিতিশীল থাকে, যা ন্যূনতম প্রচেষ্টা এবং চাকরির নিরাপত্তা সম্পর্কে সন্দেহের দিকে একটি পরিবর্তন ঘটায়।",
      "জার্মানিতে শ্রম আইন ছাঁটাইয়ের সময় দুর্বল কর্মচারীদের সুরক্ষা প্রদানে অগ্রাধিকার দেয়, তবে এটি সবার জন্য চাকরির নিরাপত্তা নিশ্চিত করে না, যার ফলে কর্মচারীদের চুক্তির ঘন্টাগুলি কঠোরভাবে মেনে চলা এবং অন্যান্য চাকরির সুযোগ খোঁজার পরামর্শ দেওয়া হয়।"
    ],
    "commentSummary": [
      "লেখক তাদের প্রযুক্তি শিল্পে অভিজ্ঞতার উপর প্রতিফলন করেন, জোর দিয়ে বলেন যে ইতিবাচক মনোভাব এবং শক্তিশালী কাজের নীতি বজায় রাখা ভবিষ্যতের চাকরির সুযোগের জন্য অত্যন্ত গুরুত্বপূর্ণ। পেশাদার সম্পর্ক গড়ে তোলা এবং লালন করা নতুন সুযোগের দিকে নিয়ে যেতে পারে, কারণ অতীতের চাকরির যোগাযোগগুলি প্রায়শই ভবিষ্যতের ভূমিকা সুরক্ষিত করতে ভূমিকা পালন করে। যদিও কর্মসংস্থান লেনদেনমূলক, লেখক কোম্পানিগুলির কাছ থেকে আনুগত্যের প্রত্যাশা করার পরিবর্তে কাজের প্রতি ব্যক্তিগত গর্ব এবং সহকর্মীদের সাথে সম্পর্কের উপর মনোযোগ দেওয়ার পরামর্শ দেন।"
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "মার্জিনালিয়া – একটি সার্চ ইঞ্জিন যা অ-বাণিজ্যিক বিষয়বস্তুকে অগ্রাধিকার দেয়",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "মার্জিনালিয়া সার্চ একটি নতুন সাইট চালু করেছে যা অ-বাণিজ্যিক বিষয়বস্তু এবং আবিষ্কার সরঞ্জামগুলির উপর গুরুত্ব দেয়, ব্যবহারকারীর গোপনীয়তা এবং ডেটা সুরক্ষার উপর জোর দিয়ে।",
      "সার্চ ইঞ্জিনটি ওপেন-সোর্স প্রযুক্তি ব্যবহার করে পরিচালিত হয়, যা AI বা ক্লাউড পরিষেবা ছাড়াই কাজ করে এবং GDPR এবং EU কুকি নির্দেশিকার সাথে সঙ্গতিপূর্ণ।",
      "সোর্স কোডটি একটি AGPL লাইসেন্সের অধীনে উপলব্ধ, যা স্বচ্ছতা এবং সম্প্রদায়ের সহযোগিতাকে উৎসাহিত করে।"
    ],
    "commentSummary": [
      "মার্জিনালিয়া একটি সার্চ ইঞ্জিন যা অ-বাণিজ্যিক বিষয়বস্তুকে গুরুত্ব দেয় এবং র্যাঙ্কিংয়ের জন্য পার্সোনালাইজড পেজর্যাঙ্ক থেকে BM25-এ স্থানান্তরিত হয়েছে। সার্চ ইঞ্জিনটি ওয়েবসাইট আবিষ্কারের জন্য কসমাইন সাদৃশ্য অন্তর্ভুক্ত করেছে এবং একটি নতুন ডোমেইনে স্থানান্তরিত হয়েছে, marginalia-search.com। মার্জিনালিয়া ওপেন সোর্স, প্রতি ১০ সপ্তাহে সাইটগুলি পুনরায় ক্রল করে, দৈনিক আপডেটের জন্য একটি আরএসএস ক্রলার ব্যবহার করে এবং ইংরেজি বিষয়বস্তুর বাইরে প্রসারিত করার পরিকল্পনা করছে, যদিও এটি বর্তমানে নেভিগেশনাল প্রশ্নগুলির সাথে সংগ্রাম করছে।"
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "কানসাসে যক্ষ্মার প্রাদুর্ভাব ১৯৫০ এর দশক থেকে আমেরিকার সবচেয়ে বড় রেকর্ডকৃত প্রাদুর্ভাব।",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "কানসাস যুক্তরাষ্ট্রের ইতিহাসে সবচেয়ে বড় যক্ষ্মা প্রাদুর্ভাবের সম্মুখীন হয়েছে, যেখানে ২০২৪ সাল থেকে কানসাস সিটি মেট্রো এলাকায় ৬৬টি সক্রিয় কেস এবং ৭৯টি সুপ্ত সংক্রমণ রিপোর্ট করা হয়েছে, প্রধানত ওয়াইয়ান্ডট কাউন্টিতে। রোগ নিয়ন্ত্রণ ও প্রতিরোধ কেন্দ্র (সিডিসি) স্থানীয় স্বাস্থ্য কর্মকর্তাদের প্রাদুর্ভাব পরিচালনায় সহায়তা করছে, যা চলমান রয়েছে তবে সক্রিয় কেস প্রায় ৩২-এ হ্রাস পেয়েছে। যক্ষ্মা একটি ব্যাকটেরিয়াল সংক্রমণ যা ফুসফুসকে প্রভাবিত করে, বাতাসের মাধ্যমে ছড়ায় এবং অ্যান্টিবায়োটিক দিয়ে চিকিৎসাযোগ্য, সাধারণ জনগণের জন্য ঝুঁকি কম বলে বিবেচিত হয়।"
    ],
    "commentSummary": [
      "কানসাসে যক্ষ্মার প্রাদুর্ভাবটি ১৯৫০ এর দশক থেকে যুক্তরাষ্ট্রে সবচেয়ে বড়, যা রোগ নিয়ন্ত্রণ ও প্রতিরোধ কেন্দ্র (CDC) দ্বারা রিপোর্ট করা হয়েছে। এই প্রাদুর্ভাবটি BCG ভ্যাকসিন নিয়ে আলোচনা উত্থাপন করেছে, যা যুক্তরাষ্ট্রে নিয়মিতভাবে প্রয়োগ করা হয় না এর অমসৃণ কার্যকারিতা এবং সম্ভাব্য পার্শ্বপ্রতিক্রিয়ার কারণে। এই পরিস্থিতি কার্যকর জনস্বাস্থ্য নীতির প্রয়োজনীয়তা এবং রোগ পর্যবেক্ষণ ও প্রতিরোধে সরকারি সংস্থাগুলির ভূমিকা জোরালোভাবে তুলে ধরে।"
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "ওপেনহে স্ট্যাক: 'এয়ারট্যাগস' তৈরি করুন – অ্যাপলের নেটওয়ার্কের মাধ্যমে ব্লুটুথ ডিভাইস ট্র্যাক করুন",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "ওপেনহেইস্ট্যাক একটি ফ্রেমওয়ার্ক যা ব্যক্তিগত ব্লুটুথ ডিভাইসগুলিকে অ্যাপলের ফাইন্ড মাই নেটওয়ার্ক ব্যবহার করে ট্র্যাক করতে সক্ষম করে, যা টিইউ ডার্মস্টাডের সিকিউর মোবাইল নেটওয়ার্কিং ল্যাব দ্বারা উন্নত করা হয়েছে।",
      "এটি অ্যাপলের ফাইন্ড মাই নেটওয়ার্কের রিভার্স-ইঞ্জিনিয়ারিং এর উপর ভিত্তি করে এবং কাজ করার জন্য macOS 11 এবং একটি ব্লুটুথ ডিভাইস, যেমন একটি BBC মাইক্রো:বিট, প্রয়োজন।",
      "ওপেনহেইস্ট্যাক জিএনইউ অ্যাফেরো জেনারেল পাবলিক লাইসেন্স v3.0 এর অধীনে ওপেন-সোর্স, বিভিন্ন ডিভাইস সমর্থন করে এবং অ্যান্ড্রয়েড ও আইওএস-এর জন্য একটি মোবাইল সংস্করণ অন্তর্ভুক্ত করে, যদিও এটি পরীক্ষামূলক এবং অ্যাপলের সাথে সম্পর্কহীন।"
    ],
    "commentSummary": [
      "ওপেনহে স্ট্যাক ব্যবহারকারীদেরকে অ্যাপলের নেটওয়ার্কের মাধ্যমে ব্লুটুথ ডিভাইস ট্র্যাক করার জন্য কাস্টম 'এয়ারট্যাগ' তৈরি করতে সক্ষম করে, যা অ্যাপলের নিজস্ব সমাধানের একটি বিকল্প প্রদান করে।",
      "গুগলের ব্লুটুথ ট্র্যাকিং সংস্করণটি নিম্নমানের কার্যক্ষমতা এবং গোপনীয়তা সমস্যার জন্য সমালোচিত হয়েছে, যেখানে স্যামসাংয়ের নেটওয়ার্কটি গুগলের বৃহত্তর অ্যান্ড্রয়েড ব্যবহারকারী ভিত্তি থাকা সত্ত্বেও উন্নত কার্যক্ষমতার জন্য উল্লেখযোগ্য।",
      "আলোচনাটি কাস্টম ট্র্যাকিং ডিভাইস তৈরি করার সময় গোপনীয়তা উদ্বেগ এবং প্রযুক্তিগত চ্যালেঞ্জগুলিকে তুলে ধরে, যেখানে তৃতীয় পক্ষের বিকল্পগুলিতে সুনির্দিষ্ট ট্র্যাকিংয়ের জন্য আল্ট্রা-ওয়াইডব্যান্ড (UWB) এর মতো উন্নত বৈশিষ্ট্যগুলির অভাব রয়েছে।"
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "পরিবারের ছবি তৈরি করার পাঠ যা মানুষ রাখতে চায় (২০১৮)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "ডিপসিক মাই ইউজার এজেন্ট",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 একটি নতুন মডেল যা ব্যবহারকারীদের চিন্তার শৃঙ্খল প্রকাশ করার জন্য ডিজাইন করা হয়েছে, যা chat.deepseek.com এ বিনামূল্যে বা OpenAI এর তুলনায় আরও সাশ্রয়ী মূল্যের API এর মাধ্যমে উপলব্ধ।",
      "নিবন্ধটি প্রকাশের পর, DeepSeek API সমস্যার সম্মুখীন হয়, যার ফলে platform.deepseek.com 404 ত্রুটি প্রদর্শন করে, যা DeepSeek My User Agent দ্বারা সৃষ্ট সম্ভাব্য বিঘ্নের ইঙ্গিত দেয়।",
      "ব্যবহারকারীরা Hacker News-এ শীর্ষ রায়গুলি অন্বেষণ করতে পারেন এবং ব্যক্তিগতকৃত অভিজ্ঞতার জন্য chat.deepseek.com-এ \"Judge Me\" প্রম্পটটি ব্যবহার করতে পারেন।"
    ],
    "commentSummary": [
      "একজন ব্যবহারকারী ডিপসিক থেকে একটি হাস্যকর রোস্ট শেয়ার করেছেন, যা একটি এআই টুল যা ব্রাউজার ডেটা বিশ্লেষণ করে, যেমন পুরানো অপারেটিং সিস্টেম এবং অস্বাভাবিক স্ক্রীন রেজোলিউশনের মতো বৈশিষ্ট্যগুলি তুলে ধরে। রোস্টটি হাস্যকরভাবে এই বৈশিষ্ট্যগুলিকে কানাডার ক্যালগারিতে ব্যবহারকারীর অবস্থানের সাথে সংযুক্ত করেছে, যা টুলটির মাঝে মাঝে ত্রুটি এবং বিনোদনমূলক মান নিয়ে আলোচনা উস্কে দিয়েছে। কথোপকথনটি এআই-এর ওয়েব ব্রাউজিং অভিজ্ঞতা উন্নত করার সম্ভাবনাও অন্বেষণ করেছে, যেমন বিজ্ঞাপন এবং অপ্রাসঙ্গিক বিষয়বস্তু ফিল্টার করা এবং নতুন ইন্টারনেট মিথস্ক্রিয়া তৈরি করা।"
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "পিউরলিমেইল: সস্তা, ঝামেলামুক্ত ইমেইল",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "পিউরলিমেইল খরচ-সাশ্রয়ী ইমেইল হোস্টিং প্রদান করে যা IMAP এবং POP3 এর সাথে সামঞ্জস্যপূর্ণ, যা বেশিরভাগ মেইল অ্যাপ্লিকেশন বা রাউন্ডকিউব ওয়েবমেইলের মাধ্যমে ব্যবহারের অনুমতি দেয়।",
      "সেবাটি উল্লেখযোগ্যভাবে সাশ্রয়ী, যা একটি একক ইমেইল অ্যাকাউন্টের জন্য ৩ জিবি স্টোরেজ সহ বার্ষিক $১০ খরচ করে, যা প্রতিযোগীদের যেমন প্রোটনমেইল, ফাস্টমেইল এবং গুগল ওয়ার্কস্পেসের তুলনায় সস্তা।",
      "যদিও Purelymail বেটা পর্যায়ে রয়েছে এবং মাঝে মাঝে ইমেল ব্লকিং এবং ২৪/৭ সাপোর্টের অভাবের মতো সমস্যা থাকতে পারে, এটি নিরাপত্তার উপর জোর দেয় এবং ব্যবহারকারীর ডেটা বিক্রি করে না।"
    ],
    "commentSummary": [
      "পিউরলিমেইল একটি বাজেট-বান্ধব ইমেইল পরিষেবা হিসেবে স্বীকৃত, যা এর সরলতা এবং নির্ভরযোগ্যতার জন্য প্রশংসিত, বিশেষ করে কাস্টম ডোমেইনের জন্য। ব্যবহারকারীরা এটিকে এমএক্সরুট, ফাস্টমেইল এবং প্রোটনের মতো পরিষেবার সাথে তুলনা করেন, এর সাশ্রয়ী মূল্যের প্রশংসা করেন কিন্তু এর এক ব্যক্তি পরিচালনা এবং ক্যালেন্ডার সিঙ্কিংয়ের মতো বৈশিষ্ট্যের অভাব নিয়ে উদ্বেগ প্রকাশ করেন। কিছু সীমাবদ্ধতা সত্ত্বেও, পিউরলিমেইলের সরল মূল্য নির্ধারণ এবং কার্যকারিতা এটিকে একটি মৌলিক ইমেইল সমাধান খুঁজছেন এমন ব্যবহারকারীদের জন্য একটি কার্যকর বিকল্প করে তোলে, যেখানে জোহো এবং স্ব-হোস্টিংয়ের মতো বিকল্পগুলিও বিবেচনা করা হয়।"
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "জ্যোতির্বিজ্ঞানীরা গ্রহাণুটি মুছে ফেলেছেন কারণ এটি টেসলা রোডস্টার বলে প্রমাণিত হয়েছে",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "জ্যোতির্বিজ্ঞানীরা প্রাথমিকভাবে এলন মাস্কের টেসলা রোডস্টারকে একটি গ্রহাণু হিসেবে ভুল শ্রেণীবদ্ধ করেছিলেন, যা গভীর মহাকাশের বস্তুগুলির ট্র্যাকিংয়ে উন্নত স্বচ্ছতার প্রয়োজনীয়তাকে জোর দেয়।",
      "মাইনর প্ল্যানেট সেন্টার শ্রেণীবিভাগের ত্রুটি সংশোধন করেছে, যা মহাকাশে প্রাকৃতিক এবং কৃত্রিম বস্তুগুলির মধ্যে পার্থক্য নির্ধারণের জটিলতাকে তুলে ধরে।",
      "ঘটনাটি গভীর মহাকাশের বস্তুগুলি ট্র্যাক করার জন্য একটি কেন্দ্রীয় সংগ্রহস্থলের অনুপস্থিতির দিকে নির্দেশ করে, যা সম্ভাব্য গ্রহাণু হুমকি পর্যবেক্ষণের প্রচেষ্টাকে জটিল করে তোলে, যেখানে অপেশাদার জ্যোতির্বিজ্ঞানীরা সনাক্তকরণে একটি গুরুত্বপূর্ণ ভূমিকা পালন করে।"
    ],
    "commentSummary": [
      "জ্যোতির্বিজ্ঞানীরা প্রাথমিকভাবে একটি টেসলা রোডস্টারকে একটি গ্রহাণু হিসেবে ভুল শ্রেণীবদ্ধ করেছিলেন, এটিকে \"২০১৮ CN41\" নামে লেবেল করেছিলেন, পরে বুঝতে পেরেছিলেন যে এটি একটি মানব-নির্মিত বস্তু যা ইতিমধ্যেই \"২০১৮-০১৭A\" হিসেবে ট্র্যাক করা হয়েছিল। এই ঘটনা মহাকাশে কৃত্রিম বস্তুগুলির উন্নত ট্র্যাকিং এবং শ্রেণীবিভাগ ব্যবস্থার প্রয়োজনীয়তাকে গুরুত্ব দেয় যাতে অনুরূপ ভুল এড়ানো যায়। এই বিভ্রান্তি মহাকাশ অনুসন্ধানে প্রাকৃতিক আকাশীয় বস্তু এবং মানব-নির্মিত বস্তুগুলির মধ্যে পার্থক্য করার চ্যালেঞ্জগুলিকে তুলে ধরে।"
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "ডিপসিক জানুস প্রো প্রকাশ করেছে, একটি টেক্সট-টু-ইমেজ জেনারেটর [পিডিএফ]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ডিপসিক জানুস প্রো নামে একটি টেক্সট-টু-ইমেজ জেনারেটর চালু করেছে, যা ৭ বিলিয়ন প্যারামিটারের \"একীভূত মডেল\" ব্যবহার করে এবং যা পারফরম্যান্সে ডাল-ই ৩ এবং স্টেবল ডিফিউশন মিডিয়ামকে অতিক্রম করেছে বলে জানা গেছে।",
      "মডেলটি সংবেদনশীল বিষয়গুলিতে তার কঠোর সেন্সরশিপ এবং ৩৮৪x৩৮৪ এর সীমিত চিত্র রেজোলিউশনের জন্য উল্লেখযোগ্য, যা এআই উন্নয়নের প্রভাব নিয়ে বিতর্ক উত্থাপন করেছে।",
      "জনাস প্রো-এর প্রশিক্ষণ খরচ প্রতিযোগীদের তুলনায় কম হওয়ায় এটি এনভিডিয়া-এর মতো কোম্পানিগুলোর উপর প্রভাব ফেলতে পারে, এবং এটি বাণিজ্যিক ব্যবহারের জন্য উপলব্ধ তবে সামরিক প্রয়োগে কিছু সীমাবদ্ধতা রয়েছে।"
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "ব্রাজিল স্যাম অল্টম্যানের প্রযুক্তি প্রতিষ্ঠান টুলস ফর হিউম্যানিটিকে আইরিস স্ক্যানের জন্য অর্থ প্রদান থেকে নিষিদ্ধ করেছে",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "ব্রাজিলের ডেটা সুরক্ষা কর্তৃপক্ষ টুলস ফর হিউম্যানিটিকে আইরিস স্ক্যানের জন্য ক্ষতিপূরণ, যার মধ্যে ক্রিপ্টোকারেন্সি অন্তর্ভুক্ত, প্রদান করা নিষিদ্ধ করেছে যাতে ব্যক্তিদের বায়োমেট্রিক ডেটা শেয়ার করার সিদ্ধান্তে অযথা প্রভাব না পড়ে।",
      "টুলস ফর হিউম্যানিটি, যা ওপেনএআই-এর সিইও স্যাম অল্টম্যান দ্বারা সহ-প্রতিষ্ঠিত, তার ওয়ার্ল্ড প্রকল্পের অধীনে আইরিস স্ক্যানের মাধ্যমে একটি বৈশ্বিক পরিচয় ব্যবস্থা বিকাশের লক্ষ্য রাখে।",
      "কোম্পানিটি ব্রাজিলিয়ান আইন মেনে চলার দাবি করে এবং গত নভেম্বর মাসে শুরু হওয়া একটি তদন্তের পর উদ্বেগ সমাধানের জন্য কর্তৃপক্ষের সাথে যোগাযোগ করছে।"
    ],
    "commentSummary": [
      "ব্রাজিল স্যাম অল্টম্যানের নেতৃত্বাধীন টুলস ফর হিউম্যানিটিকে ব্যক্তিগত স্বায়ত্তশাসন রক্ষার জন্য আইরিস স্ক্যানের বিনিময়ে ব্যক্তিদের ক্ষতিপূরণ দেওয়া নিষিদ্ধ করেছে। এই সিদ্ধান্তটি গোপনীয়তা এবং বায়োমেট্রিক ডেটা সংগ্রহের নৈতিক প্রভাব নিয়ে বিতর্ক উসকে দিয়েছে, যেমন অল্টম্যানের ওয়ার্ল্ডকয়েন প্রকল্পের সাথে জড়িত। এই পরিস্থিতি প্রযুক্তিগত অগ্রগতি এবং ডেটা গোপনীয়তা এবং সম্ভাব্য অপব্যবহারের বিষয়ে নৈতিক উদ্বেগের মধ্যে চলমান দ্বন্দ্বকে তুলে ধরে।"
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "আমার ব্যর্থ প্রচেষ্টা সমস্ত NPM প্যাকেজকে ৫% কমানোর জন্য",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "২০২২ সালে, একটি প্রস্তাব করা হয়েছিল যে Zopfli কম্প্রেসার ব্যবহার করে npm প্যাকেজের আকার ৫% কমানো হবে, যা কর্মক্ষমতা উন্নত করতে এবং স্টোরেজ খরচ কমাতে সাহায্য করবে। প্রস্তাবটি npm রক্ষণাবেক্ষকদের দ্বারা প্রত্যাখ্যান করা হয়েছিল Zopfli এর ধীর কম্প্রেশন গতি, ডিকম্প্রেশন সময়, লকফাইল সমস্যা এবং ইন্টিগ্রেশন জটিলতার কারণে। প্রস্তাবটি প্রত্যাহার করা সত্ত্বেও, এই অভিজ্ঞতা প্রস্তাব লেখার এবং বিনিময়মূল্য মূল্যায়নের ক্ষেত্রে অন্তর্দৃষ্টি প্রদান করেছিল।"
    ],
    "commentSummary": [
      "জোপফলি কম্প্রেশন ব্যবহার করে এনপিএম প্যাকেজের আকার ৫% কমানোর একটি উদ্যোগ প্রকাশের সময় এবং জটিলতা বৃদ্ধির মতো সমস্যার সম্মুখীন হয়েছিল।",
      "সম্ভাব্য ব্যান্ডউইথ সাশ্রয়ের পরেও, ধীর কম্প্রেশন এবং নেটিভ সমর্থনের অভাবের মতো অসুবিধাগুলি প্রস্তাবটিকে কম কার্যকর করে তুলেছিল।",
      "আলোচনায় ওপেন-সোর্স প্রকল্পগুলিতে উদ্ভাবন এবং বাস্তবতার মধ্যে ভারসাম্য বজায় রাখার চ্যালেঞ্জটি তুলে ধরা হয়েছিল, যা প্রস্তাবের সমাপ্তি এবং Brotli বা ZSTD এর মতো বিকল্পগুলির বিবেচনার দিকে নিয়ে যায়।"
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "সাবেক প্রযুক্তি সিইও তার গ্রেপ্তারের রেকর্ড ইন্টারনেট থেকে মুছে ফেলার জন্য মামলা করছেন",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "সাবেক প্রযুক্তি সিইও মরি ব্ল্যাকম্যান সাংবাদিক জ্যাক পোলসনের বিরুদ্ধে ২৫ মিলিয়ন ডলারের মামলা দায়ের করেছেন ২০২১ সালের গার্হস্থ্য সহিংসতার গ্রেফতারি রেকর্ড ইন্টারনেট থেকে সরানোর জন্য, যদিও রেকর্ডটি একজন বিচারক দ্বারা সিল করা হয়েছে।",
      "মামলাটি প্রথম সংশোধনী বিতর্ককে উস্কে দিয়েছে, যেখানে ইলেকট্রনিক ফ্রন্টিয়ার ফাউন্ডেশন পোলসনকে সমর্থন করছে এবং প্রকাশনার জনস্বার্থের উপর জোর দিচ্ছে।",
      "প্রথম সংশোধনী জোট একটি মামলা দায়ের করেছে যা ক্যালিফোর্নিয়া আইনের চ্যালেঞ্জ করে যা সিল করা গ্রেপ্তার রেকর্ডের প্রকাশনা প্রতিরোধ করে, যা গোপনীয়তা এবং মুক্ত বক্তৃতার অধিকারের মধ্যে উত্তেজনা তুলে ধরে।"
    ],
    "commentSummary": [
      "একজন প্রাক্তন প্রযুক্তি সিইও তার গ্রেপ্তার রেকর্ড ইন্টারনেট থেকে সরানোর জন্য মামলা করছেন, যা জনসাধারণের গ্রেপ্তার রেকর্ড দ্বারা সৃষ্ট সুনামের ক্ষতির দিকে দৃষ্টি আকর্ষণ করছে।",
      "এই মামলাটি গোপন গ্রেপ্তার প্রতিরোধের জন্য স্বচ্ছতার প্রয়োজন এবং দোষী সাব্যস্ত না হওয়া সত্ত্বেও গ্রেপ্তারের বিবরণ প্রকাশিত হলে ব্যক্তিদের ভবিষ্যতের সম্ভাব্য ক্ষতির মধ্যে বিতর্ককে তুলে ধরে।",
      "মামলাটি স্ট্রেইস্যান্ড প্রভাবকেও জড়িত করে, যেখানে তথ্য দমন করার প্রচেষ্টা অনিচ্ছাকৃতভাবে এর দৃশ্যমানতা বাড়িয়ে তুলতে পারে।"
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "এনভিডিয়া, এএসএমএল গভীরসিকের কারণে প্রযুক্তি শেয়ার বিক্রির ফলে পতন",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "এনভিডিয়ার শেয়ারের মূল্য $৫৬০ বিলিয়ন কমেছে, যা বাজারের ইতিহাসে সবচেয়ে বড় পতন হিসেবে চিহ্নিত হয়েছে, প্রধানত চীনা এআই স্টার্টআপ ডিপসিক নিয়ে উদ্বেগের কারণে।",
      "ডিপসিকের প্রতিযোগিতামূলক কম খরচের এআই মডেল মার্কিন কোম্পানিগুলির এআই বিনিয়োগের ভবিষ্যৎ সম্পর্কে উদ্বেগ সৃষ্টি করেছে, যা এনভিডিয়ার শেয়ার এবং এসঅ্যান্ডপি ৫০০ এবং নাসডাক ১০০ এর মতো প্রধান সূচকগুলিকে প্রভাবিত করেছে।",
      "এনভিডিয়ার চ্যালেঞ্জ সত্ত্বেও, মেটা এআই প্রকল্পে ব্যয় বাড়ানোর পরিকল্পনা করছে, এবং ওপেনএআই, সফটব্যাংক এবং ওরাকল একটি উল্লেখযোগ্য $১০০ বিলিয়ন এআই অবকাঠামো উদ্যোগ ঘোষণা করেছে।"
    ],
    "commentSummary": [
      "চীনা এআই স্টার্টআপ ডিপসিক দ্বারা শুরু হওয়া একটি প্রযুক্তি বিক্রির পর নভিডিয়া এবং এএসএমএল এর শেয়ার কমে গেছে, যা পুরানো নভিডিয়া হার্ডওয়্যার ব্যবহার করে চ্যাটজিপিটি-কে ছাড়িয়ে যাওয়া একটি মডেল তৈরি করেছে।",
      "ডিপসিকের ওপেন-সোর্স মডেল, যা প্রশিক্ষণ দেওয়ার জন্য সস্তা, ওপেনএআই এবং অ্যানথ্রপিকের মতো এআই কোম্পানিগুলোর লাভজনকতা সম্পর্কে উদ্বেগ উত্থাপন করে, যা ভবিষ্যতে এনভিডিয়ার জিপিইউগুলোর চাহিদার উপর প্রভাব ফেলতে পারে।",
      "বাজারের প্রতিক্রিয়া সংকুচিত মার্জিন এবং বাড়তি প্রতিযোগিতার ভয়ের ইঙ্গিত দেয়, যদিও বিস্তৃত এআই গ্রহণের সম্ভাবনা রয়েছে।"
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "মার্ক জাকারবার্গ: এই মানুষটি একজন কাপুরুষ",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "মার্ক জাকারবার্গ সমালোচনার মুখোমুখি হচ্ছেন কারণ প্রাক্তন প্রেসিডেন্ট ডোনাল্ড ট্রাম্প ন্যাশনাল ইনস্টিটিউটস অফ হেলথ ভেঙে ফেলছেন, যা ৪০ বিলিয়ন ডলারের গবেষণা তহবিলকে প্রভাবিত করছে, যদিও জাকারবার্গ পূর্বে রোগ গবেষণায় প্রতিশ্রুতি দিয়েছিলেন।",
      "জাকারবার্গের মেটায় কার্যক্রম, যার মধ্যে রয়েছে তথ্য যাচাই, বিষয়বস্তু নিয়ন্ত্রণ এবং বৈচিত্র্য উদ্যোগ হ্রাস করা, এবং রিপাবলিকান নির্বাহীদের প্রচার করা, নীতির পরিবর্তনের ইঙ্গিত দেয়, যা ট্রাম্পের দাবির সাথে সামঞ্জস্যপূর্ণ।",
      "সমালোচকরা যুক্তি দেন যে ট্রাম্পের স্বৈরাচারী প্রবণতার সাথে জুকারবার্গের সম্মতি সাহসের অভাবকে প্রতিফলিত করে, যা অ্যামাজনের মতো অন্যান্য প্রযুক্তি কোম্পানিগুলিকে সম্ভাব্যভাবে অনুরূপ অবস্থান গ্রহণ করতে প্রভাবিত করতে পারে, ফলে তার উত্তরাধিকারকে প্রভাবিত করে।"
    ],
    "commentSummary": [
      "প্রবন্ধটি মার্ক জাকারবার্গের মেটায় তার কর্মকাণ্ডের সমালোচনা করে, যা প্রস্তাব করে যে তার সিদ্ধান্তগুলি স্বার্থপরতা এবং নীতির অভাব দ্বারা প্রভাবিত হয়, বিশেষ করে রাজনৈতিক চাপের অধীনে।",
      "এটি কর্পোরেট দায়িত্ব, রাজনীতিতে সম্পদের প্রভাব এবং নেতৃত্বের ভূমিকায় সততা বজায় রাখার কঠিনতা নিয়ে আলোচনা করে।",
      "আলোচনাটি বিভক্ত, কিছু লোক জাকারবার্গকে বাহ্যিক চাপের সাথে মানিয়ে নেওয়ার সম্ভাবনা হিসেবে সমর্থন করছে, অন্যদিকে অন্যরা প্রযুক্তি নেতাদের সাহসের অভাবের জন্য হতাশা প্রকাশ করছে।"
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "অলিভার হেভিসাইড এবং সংক্রমণ লাইন তত্ত্ব (২০২১)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "PA3FWM-এর অপেশাদার রেডিও ওয়েবসাইটে একক-পার্শ্ব ব্যান্ড এফএম, সফটওয়্যার-সংজ্ঞায়িত রেডিও (এসডিআর) সাউন্ডকার্ড এবং অ্যান্টেনা ডিজাইনের মতো প্রযুক্তিগত বিষয়গুলি নিয়ে আলোচনা করা হয়েছে।",
      "সাইটটি ট্রান্সমিশন লাইন তত্ত্বে অলিভার হেভিসাইডের অবদানের উপর আলোকপাত করে, যার মধ্যে ম্যাক্সওয়েলের সমীকরণ এবং টেলিগ্রাফ কেবল মডেলের উন্নতি অন্তর্ভুক্ত রয়েছে।",
      "এই বিষয়বস্তুটি ডাচ শৌখিন রেডিও ম্যাগাজিন ইলেকট্রনের নভেম্বর ২০২১ সংখ্যার একটি নিবন্ধ থেকে গৃহীত হয়েছে, যা সংকেত সংক্রমণ এবং কেবল নকশার ঐতিহাসিক এবং প্রযুক্তিগত অন্তর্দৃষ্টি প্রদান করে।"
    ],
    "commentSummary": [
      "অলিভার হেভিসাইড, একজন স্বশিক্ষিত পদার্থবিদ, ইলেক্ট্রোম্যাগনেটিজম এবং ট্রান্সমিশন লাইন তত্ত্বে উল্লেখযোগ্য অবদান রেখেছিলেন, যদিও তিনি উইলিয়াম হেনরি প্রিসের মতো প্রতিষ্ঠিত ব্যক্তিদের বিরোধিতার সম্মুখীন হয়েছিলেন। হেভিসাইডের কাজ, যার মধ্যে ম্যাক্সওয়েলের সমীকরণগুলির সরলীকরণ অন্তর্ভুক্ত ছিল, ক্ষেত্রটির জন্য অত্যন্ত গুরুত্বপূর্ণ ছিল, তবুও তিনি পেশাগত বাধার কারণে দারিদ্র্যে জীবনযাপন করেছিলেন। পোস্টটি ট্রান্সমিশন লাইন এবং প্রতিবন্ধকতা বোঝার চ্যালেঞ্জগুলিকে হাইলাইট করে, প্রসঙ্গের জন্য শিক্ষামূলক সম্পদ এবং ঐতিহাসিক কাহিনীগুলির উল্লেখ করে।"
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
