[
  {
    "id": 42838700,
    "title": "Увольнение в корне изменило мое восприятие работы",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "Автор получил неожиданное уведомление об увольнении от операционного директора своей компании, несмотря на предыдущие заверения, что увольнений не будет, что указывает на разрыв между коммуникацией компании и её действиями.",
      "Этот опыт привел к утрате доверия в современных рабочих средах, где сотрудники чувствуют себя расходным материалом, даже когда компании финансово стабильны, что побуждает к минимальным усилиям и скептицизму в отношении безопасности работы.",
      "В Германии трудовые законы приоритетно защищают уязвимых сотрудников при увольнениях, но это не гарантирует безопасность работы для всех, что приводит к советам для сотрудников строго придерживаться контрактных часов и искать другие возможности трудоустройства."
    ],
    "commentSummary": [
      "Автор размышляет о своем опыте в технологической индустрии, подчеркивая, что поддержание позитивного настроя и сильной трудовой этики имеет решающее значение для будущих возможностей трудоустройства. Построение и поддержание профессиональных отношений может привести к новым возможностям, так как контакты с прошлых мест работы часто играют роль в обеспечении будущих должностей. Хотя трудоустройство является транзакционным, автор предлагает сосредоточиться на личной гордости за свою работу и отношениях с коллегами, а не ожидать лояльности от компаний."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "Marginalia – поисковая система, которая отдает приоритет некоммерческому контенту",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "Marginalia Search запустила новый сайт, ориентированный на некоммерческий контент и инструменты для поиска, с акцентом на конфиденциальность пользователей и защиту данных.",
      "Поисковая система работает с использованием технологий с открытым исходным кодом, без ИИ или облачных сервисов, и соответствует требованиям GDPR и Директивы ЕС о файлах cookie.",
      "Исходный код доступен под лицензией AGPL, что способствует прозрачности и сотрудничеству в сообществе."
    ],
    "commentSummary": [
      "Маргиналия — это поисковая система, которая делает акцент на некоммерческом контенте и перешла от использования персонализированного PageRank к BM25 для ранжирования. Поисковая система внедрила косинусное сходство для обнаружения веб-сайтов и переехала на новый домен, marginalia-search.com. Маргиналия является открытым исходным кодом, повторно сканирует сайты каждые 10 недель, использует RSS-сканер для ежедневных обновлений и планирует расширяться за пределы англоязычного контента, хотя в настоящее время испытывает трудности с навигационными запросами."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "Вспышка туберкулеза в Канзасе является крупнейшей зарегистрированной в Америке с 1950-х годов.",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "Канзас сталкивается с крупнейшей вспышкой туберкулеза в истории США: с 2024 года в районе метро Канзас-Сити зарегистрировано 66 активных случаев и 79 латентных инфекций, главным образом в округе Уайандотт. Центры по контролю и профилактике заболеваний (CDC) помогают местным органам здравоохранения в управлении вспышкой, которая продолжается, но количество активных случаев сократилось примерно до 32. Туберкулез — это бактериальная инфекция, поражающая легкие, распространяющаяся по воздуху и поддающаяся лечению антибиотиками, при этом риск для широкой общественности считается низким."
    ],
    "commentSummary": [
      "Вспышка туберкулеза в Канзасе является крупнейшей в США с 1950-х годов, как сообщают Центры по контролю и профилактике заболеваний (CDC). Эта вспышка вызвала обсуждения о вакцине БЦЖ, которая не вводится в США на регулярной основе из-за непостоянной эффективности и возможных побочных эффектов. Эта ситуация подчеркивает необходимость эффективных политик в области общественного здравоохранения и роль государственных агентств в мониторинге и предотвращении заболеваний."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "Openhaystack: Создайте 'AirTags' – отслеживайте Bluetooth-устройства через сеть Apple",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack — это платформа, которая позволяет отслеживать личные Bluetooth-устройства с использованием сети Find My от Apple, разработанная Лабораторией безопасных мобильных сетей в Техническом университете Дармштадта.",
      "Он основан на обратной разработке сети Apple Find My и требует macOS 11 и Bluetooth-устройство, такое как BBC micro:bit, для работы.",
      "OpenHaystack является проектом с открытым исходным кодом под лицензией GNU Affero General Public License v3.0, поддерживает различные устройства и включает мобильную версию для Android и iOS, хотя она остается экспериментальной и не связана с Apple."
    ],
    "commentSummary": [
      "Openhaystack позволяет пользователям создавать собственные 'AirTags' для отслеживания Bluetooth-устройств через сеть Apple, предлагая альтернативу фирменному решению Apple.",
      "Версия Bluetooth-трекинга от Google подвергается критике за посредственную производительность и проблемы с конфиденциальностью, в то время как сеть Samsung отмечается за лучшую производительность, несмотря на более широкую базу пользователей Android у Google.",
      "Разговор подчеркивает проблемы конфиденциальности и технические трудности в разработке пользовательских устройств отслеживания, при этом сторонние альтернативы не обладают такими продвинутыми функциями, как ультраширокополосная связь (UWB) для точного отслеживания."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "Уроки создания семейных фотографий, которые люди хотят сохранить (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "DeepSeek Мой Пользовательский Агент",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 — это новая модель, разработанная для того, чтобы раскрывать цепочку мыслей пользователям, доступная бесплатно на chat.deepseek.com или через более доступный API по сравнению с OpenAI.",
      "После выпуска статьи API DeepSeek столкнулся с проблемами, и платформа platform.deepseek.com возвращала ошибки 404, что указывает на возможные сбои, вызванные DeepSeek My User Agent.",
      "Пользователи могут изучать лучшие решения на Hacker News и использовать подсказку «Оцени меня» на chat.deepseek.com для персонализированного опыта."
    ],
    "commentSummary": [
      "Пользователь поделился забавным «жарким» от DeepSeek, инструмента ИИ, который анализирует данные браузера, подчеркивая такие особенности, как устаревшая ОС и необычное разрешение экрана. «Жаркое» с юмором связало эти черты с местоположением пользователя в Калгари, Канада, вызвав обсуждения о случайных неточностях инструмента и его развлекательной ценности. В разговоре также исследовался потенциал ИИ в улучшении опыта веб-серфинга, например, фильтрации рекламы и нерелевантного контента, а также создании новых взаимодействий в интернете."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "Purelymail: Дешевый, без излишеств электронный почтовый сервис",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail предоставляет экономичное хостинг-решение для электронной почты с поддержкой IMAP и POP3, что позволяет использовать его с большинством почтовых приложений или через веб-почту Roundcube.",
      "Услуга заметно доступна по цене, предлагая один почтовый ящик с 3 ГБ памяти за $10 в год, что дешевле, чем у конкурентов, таких как Protonmail, Fastmail и Google Workspace.",
      "Хотя Purelymail находится в стадии бета-тестирования и может иметь периодические проблемы, такие как блокировка электронной почты и отсутствие круглосуточной поддержки, он делает акцент на безопасности и не продает данные пользователей."
    ],
    "commentSummary": [
      "Purelymail признан бюджетным почтовым сервисом, ценимым за простоту и надежность, особенно для пользовательских доменов. Пользователи сравнивают его с такими сервисами, как mxroute, Fastmail и Proton, отмечая его доступность, но выражая обеспокоенность по поводу того, что он управляется одним человеком и не имеет таких функций, как синхронизация календаря. Несмотря на некоторые ограничения, простая ценовая политика и функциональность Purelymail делают его жизнеспособным вариантом для пользователей, ищущих базовое почтовое решение, при этом также рассматриваются альтернативы, такие как Zoho и самостоятельный хостинг."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "Астрономы удалили астероид, потому что он оказался Tesla Roadster",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "Изначально астрономы ошибочно классифицировали Tesla Roadster Илона Маска как астероид, что подчеркивает необходимость улучшения прозрачности в отслеживании объектов в глубоком космосе.",
      "Центр малых планет исправил ошибку в классификации, подчеркнув сложность в различении естественных и искусственных объектов в космосе.",
      "Инцидент указывает на отсутствие центрального хранилища для отслеживания объектов в дальнем космосе, что усложняет усилия по мониторингу потенциальных угроз от астероидов, при этом любители астрономии играют важную роль в их идентификации."
    ],
    "commentSummary": [
      "Астрономы первоначально ошибочно классифицировали Tesla Roadster как астероид, обозначив его как \"2018 CN41\", прежде чем осознали, что это был искусственный объект, уже отслеживаемый как \"2018-017A\". Этот инцидент подчеркивает необходимость улучшения систем отслеживания и классификации искусственных объектов в космосе, чтобы предотвратить подобные ошибки. Путаница подчеркивает трудности в различении естественных небесных тел и созданных человеком объектов в исследовании космоса."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "DeepSeek выпускает Janus Pro, генератор текста в изображение [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek представила Janus Pro, генератор изображений по тексту, использующий «унифицированную модель» с 7 миллиардами параметров, который, как сообщается, превосходит Dall-E 3 и Stable Diffusion Medium по производительности.",
      "Модель известна своей жесткой цензурой на чувствительные темы и ограниченным разрешением изображений 384x384, что вызывает дебаты о последствиях развития ИИ.",
      "Более низкие затраты на обучение Janus Pro по сравнению с конкурентами могут повлиять на такие компании, как Nvidia, и он доступен для коммерческого использования с ограничениями на военные приложения."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "Бразилия запрещает компании Сэма Альтмана Tools for Humanity оплачивать сканирование радужной оболочки глаза.",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "Управление по защите данных Бразилии запретило компании Tools for Humanity предлагать компенсацию, включая криптовалюту, за сканирование радужной оболочки глаза, чтобы предотвратить чрезмерное влияние на решения людей о предоставлении биометрических данных.",
      "Компания Tools for Humanity, соучредителем которой является генеральный директор OpenAI Сэм Альтман, стремится разработать глобальную систему идентификации с помощью сканирования радужной оболочки глаза в рамках своего проекта World.",
      "Компания утверждает, что соблюдает бразильские законы, и взаимодействует с властями для разрешения вопросов, возникших после расследования, начатого в ноябре прошлого года."
    ],
    "commentSummary": [
      "Бразилия запретила компании Tools for Humanity, возглавляемой Сэмом Альтманом, выплачивать компенсации за сканирование радужной оболочки глаза, чтобы защитить личную автономию. Это решение вызвало дебаты о конфиденциальности и этических последствиях сбора биометрических данных, таких как те, что связаны с проектом Worldcoin Альтмана. Ситуация подчеркивает продолжающийся конфликт между технологическим прогрессом и этическими вопросами, касающимися конфиденциальности данных и возможного злоупотребления."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "Моя неудачная попытка уменьшить все пакеты NPM на 5%",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "В 2022 году было предложено использовать компрессор Zopfli для уменьшения размеров пакетов npm на 5%, с целью повышения производительности и снижения затрат на хранение. Предложение было отклонено поддерживающими npm из-за опасений по поводу медленной скорости сжатия Zopfli, времени распаковки, проблем с lockfile и сложности интеграции. Этот опыт дал представление о написании предложений и оценке компромиссов, несмотря на отзыв предложения."
    ],
    "commentSummary": [
      "Инициатива по уменьшению размеров пакетов NPM на 5% с использованием сжатия Zopfli столкнулась с такими проблемами, как увеличение времени публикации и усложнение процесса.",
      "Несмотря на потенциальную экономию пропускной способности, такие недостатки, как более медленное сжатие и отсутствие родной поддержки, сделали предложение менее жизнеспособным.",
      "Обсуждение подчеркнуло сложность балансирования между инновациями и практичностью в проектах с открытым исходным кодом, что привело к закрытию предложения и рассмотрению альтернатив, таких как Brotli или ZSTD."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "Бывший генеральный директор технологической компании подает в суд, чтобы удалить запись о его аресте из интернета.",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "Бывший генеральный директор технологической компании Мори Блэкман подал в суд на журналиста Джека Поулсона на сумму 25 миллионов долларов, чтобы удалить из интернета информацию о его аресте за домашнее насилие в 2021 году, несмотря на то, что запись была запечатана судьей.",
      "Иск вызвал дебаты о Первой поправке, при этом Фонд электронных рубежей защищает Поулсона, подчеркивая общественный интерес к публикации.",
      "Коалиция за Первую поправку подала иск, оспаривающий закон Калифорнии, который запрещает публикацию запечатанных арестных записей, подчеркивая напряженность между правами на неприкосновенность частной жизни и свободой слова."
    ],
    "commentSummary": [
      "Бывший генеральный директор технологической компании подал в суд с требованием удалить его арест из интернета, привлекая внимание к ущербу репутации, который могут нанести публичные записи об арестах.",
      "Дело подчеркивает дебаты между необходимостью прозрачности для предотвращения тайных арестов и потенциальным вредом для будущего людей, когда детали ареста публикуются без вынесения приговора.",
      "Иск также затрагивает эффект Стрейзанд, когда попытки подавить информацию могут непреднамеренно увеличить её видимость."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "Акции Nvidia и ASML падают, так как DeepSeek вызывает распродажу технологических акций",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "Стоимость акций Nvidia упала на 560 миллиардов долларов, что стало крупнейшим снижением в истории рынка, главным образом из-за опасений по поводу китайского стартапа в области искусственного интеллекта DeepSeek.",
      "Конкурентоспособная недорогая модель ИИ от DeepSeek вызвала опасения по поводу будущего инвестиций американских компаний в ИИ, что повлияло на акции Nvidia и основные индексы, такие как S&P 500 и Nasdaq 100.",
      "Несмотря на трудности Nvidia, Meta планирует увеличить расходы на проекты в области ИИ, а OpenAI, SoftBank и Oracle объявили о значительном предприятии по созданию инфраструктуры ИИ стоимостью 100 миллиардов долларов."
    ],
    "commentSummary": [
      "Акции Nvidia и ASML упали после распродажи в технологическом секторе, инициированной китайским стартапом в области искусственного интеллекта DeepSeek, который создал модель, превосходящую ChatGPT, используя более старое оборудование Nvidia.",
      "Открытая модель DeepSeek, будучи дешевле в обучении, вызывает опасения по поводу прибыльности таких компаний, занимающихся ИИ, как OpenAI и Anthropic, что может повлиять на будущий спрос на графические процессоры Nvidia.",
      "Реакция рынка указывает на опасения по поводу снижения маржи и усиления конкуренции, несмотря на потенциал более широкого внедрения ИИ."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "Марк Цукерберг: Этот человек трус",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "Марк Цукерберг сталкивается с критикой за свое молчание, в то время как бывший президент Дональд Трамп разрушает Национальные институты здравоохранения, что затрагивает $40 миллиардов в финансировании исследований, несмотря на предыдущие обязательства Цукерберга по исследованию болезней.",
      "Действия Цукерберга в Meta, включая сокращение проверки фактов, модерации контента и инициатив по разнообразию, при одновременном продвижении республиканских руководителей, указывают на изменение принципов, соответствующее требованиям Трампа.",
      "Критики утверждают, что податливость Цукерберга авторитарным наклонностям Трампа свидетельствует о недостатке смелости, что может повлиять на другие технологические компании, такие как Amazon, побудив их принять аналогичные позиции, тем самым влияя на его наследие."
    ],
    "commentSummary": [
      "Статья критикует Марка Цукерберга за его действия в Meta, предполагая, что его решения продиктованы личной выгодой и отсутствием принципов, особенно под политическим давлением.",
      "Он исследует темы корпоративной ответственности, влияние богатства на политику и трудности поддержания честности в руководящих ролях.",
      "Мнения разделились: одни защищают Цукерберга, считая, что он, возможно, адаптируется к внешним давлениям, в то время как другие выражают разочарование в связи с предполагаемой нехваткой смелости у лидеров в сфере технологий."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "Оливер Хевисайд и теория линий передачи (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "Любительский радиосайт PA3FWM углубляется в технические темы, такие как однополосная FM, звуковые карты программно-определяемого радио (SDR) и проектирование антенн.",
      "Сайт подчеркивает вклад Оливера Хевисайда в теорию линий передачи, включая его улучшения уравнений Максвелла и моделей телеграфных кабелей.",
      "Содержание адаптировано из статьи за ноябрь 2021 года в голландском журнале для радиолюбителей Electron, предоставляющей исторические и технические сведения о передаче сигналов и проектировании кабелей."
    ],
    "commentSummary": [
      "Оливер Хевисайд, самоучка-физик, внес значительный вклад в электромагнетизм и теорию линий передачи, несмотря на противодействие со стороны признанных фигур, таких как Уильям Генри Прис. Работа Хевисайда, включая упрощение уравнений Максвелла, была важна для этой области, однако он жил в бедности из-за профессиональных препятствий. Пост подчеркивает трудности в понимании линий передачи и импеданса, ссылаясь на образовательные ресурсы и исторические анекдоты для контекста."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
