[
  {
    "id": 42838700,
    "title": "Een ontslag veranderde fundamenteel hoe ik werk waarneem",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "De auteur ontving een onverwachte ontslagmelding van de COO van hun bedrijf, ondanks eerdere verzekeringen dat er geen ontslagen zouden plaatsvinden, wat wijst op een discrepantie tussen de communicatie en de acties van het bedrijf.",
      "De ervaring førte til et tap av tillit til moderne arbeidsmiljøer, hvor ansatte føler seg som forbruksvarer selv når selskapene er økonomisk stabile, noe som fører til et skifte mot minimal innsats og skepsis til jobbsikkerhet.",
      "In Duitsland prioriterer arbeidslover å beskytte sårbare ansatte under oppsigelser, men dette garanterer ikke jobbtrygghet for alle, noe som fører til råd om at ansatte bør holde seg strengt til kontraktstimer og søke andre jobbmuligheter."
    ],
    "commentSummary": [
      "De auteur reflecteert op hun ervaring in de technologiesector en benadrukt dat het behouden van een positieve houding en een sterke werkethiek cruciaal is voor toekomstige baanmogelijkheden. Het opbouwen en onderhouden van professionele relaties kan leiden tot nieuwe kansen, aangezien contacten van eerdere banen vaak een rol spelen bij het veiligstellen van toekomstige functies. Hoewel werkgelegenheid transactioneel is, suggereert de auteur zich te richten op persoonlijke trots in werk en relaties met collega's in plaats van loyaliteit van bedrijven te verwachten."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "Marginalia – En søkemotor som prioriterer ikke-kommersiellt innhold",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "Marginalia Search heeft een nieuwe site gelanceerd die zich richt op niet-commerciële inhoud en ontdekkingshulpmiddelen, met de nadruk op gebruikersprivacy en gegevensbescherming.",
      "De zoekmachine werkt met open-source technologie, zonder AI of cloud-diensten, en voldoet aan de AVG en de EU Cookie-richtlijn.",
      "De broncode is beschikbaar onder een AGPL-licentie, wat transparantie en samenwerking binnen de gemeenschap bevordert."
    ],
    "commentSummary": [
      "Marginalia is een zoekmachine die de nadruk legt op niet-commerciële inhoud en is overgestapt van het gebruik van Personalized PageRank naar BM25 voor rangschikking. De zoekmachine heeft cosinusgelijkenis geïntegreerd voor het ontdekken van websites en is verhuisd naar een nieuw domein, marginalia-search.com. Marginalia is open source, crawlt sites elke 10 weken opnieuw, gebruikt een RSS-crawler voor dagelijkse updates en is van plan om uit te breiden naar inhoud buiten het Engels, hoewel het momenteel moeite heeft met navigatievragen."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "Kansas tuberkuloseutbrudd er Amerikas største registrerte siden 1950-tallet",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "Kansas står overfor det største tuberkuloseutbruddet i USAs historie, med 66 aktive tilfeller og 79 latente infeksjoner rapportert i Kansas City-området siden 2024, hovedsakelig i Wyandotte County. Centers for Disease Control and Prevention (CDC) bistår lokale helsemyndigheter i håndteringen av utbruddet, som pågår, men har sett en reduksjon i aktive tilfeller til omtrent 32. Tuberkulose er en bakteriell infeksjon som påvirker lungene, spres gjennom luften, og kan behandles med antibiotika, med lav risiko for allmennheten."
    ],
    "commentSummary": [
      "De tuberculose-uitbraak in Kansas is de grootste in de VS sinds de jaren 1950, zoals gerapporteerd door de Centers for Disease Control and Prevention (CDC). De uitbraak heeft discussies op gang gebracht over het BCG-vaccin, dat niet routinematig wordt toegediend in de VS vanwege inconsistente werkzaamheid en mogelijke bijwerkingen. Deze situatie benadrukt de noodzaak van effectieve volksgezondheidsbeleid en de rol van overheidsinstanties in ziektebewaking en preventie."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "Openhaystack: Bouw 'AirTags' – volg Bluetooth-apparaten via het netwerk van Apple",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack is een framework dat het mogelijk maakt om persoonlijke Bluetooth-apparaten te volgen via Apple's Find My-netwerk, ontwikkeld door het Secure Mobile Networking Lab aan de TU Darmstadt.",
      "Het is gebaseerd op reverse-engineering van Apple's Find My-netwerk en vereist macOS 11 en een Bluetooth-apparaat, zoals een BBC micro:bit, om te functioneren.",
      "OpenHaystack er åpen kildekode under GNU Affero General Public License v3.0, støtter ulike enheter, og inkluderer en mobilversjon for Android og iOS, selv om den fortsatt er eksperimentell og ikke tilknyttet Apple."
    ],
    "commentSummary": [
      "Openhaystack stelt gebruikers in staat om aangepaste 'AirTags' te maken voor het volgen van Bluetooth-apparaten via het netwerk van Apple, en biedt een alternatief voor de eigen oplossing van Apple.",
      "De versie van Bluetooth-tracking van Google wordt bekritiseerd voor ondermaatse prestaties en privacykwesties, terwijl het netwerk van Samsung wordt geprezen voor betere prestaties, ondanks de grotere Android-gebruikersbasis van Google.",
      "Het gesprek benadrukt privacyzorgen en technische uitdagingen bij het ontwikkelen van aangepaste volgapparaten, waarbij alternatieven van derden geavanceerde functies zoals Ultra-Wideband (UWB) voor nauwkeurige tracking missen."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "Les in het maken van familiefoto's die mensen willen bewaren (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "DeepSeek Mijn Gebruikersagent",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 is een nieuw model ontworpen om de gedachtegang aan gebruikers te onthullen, gratis beschikbaar op chat.deepseek.com of via een meer betaalbare API in vergelijking met OpenAI.",
      "Na utgivelsen av artikkelen opplevde DeepSeek API problemer, med platform.deepseek.com som returnerte 404-feil, noe som indikerer potensielle forstyrrelser forårsaket av DeepSeek My User Agent.",
      "Gebruikers kunnen de beste beoordelingen op Hacker News verkennen en de \"Judge Me\"-prompt gebruiken op chat.deepseek.com voor een gepersonaliseerde ervaring."
    ],
    "commentSummary": [
      "Een gebruiker deelde een humoristische roast van DeepSeek, een AI-tool die browsergegevens analyseert en eigenaardigheden zoals een verouderd besturingssysteem en ongebruikelijke schermresolutie benadrukt. De roast maakte op humoristische wijze een verbinding tussen deze eigenschappen en de locatie van de gebruiker in Calgary, Canada, wat discussies op gang bracht over de occasionele onnauwkeurigheden en de amusementswaarde van de tool. Het gesprek verkende ook het potentieel van AI om webbrowserervaringen te verbeteren, zoals het filteren van advertenties en irrelevante inhoud, en het creëren van nieuwe internetinteracties."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "Purelymail: Goedkope, no-nonsense e-mail",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail biedt kosteneffectieve e-mailhosting met compatibiliteit voor IMAP en POP3, waardoor het kan worden gebruikt met de meeste e-mailapplicaties of via Roundcube webmail.",
      "De dienst is opmerkelijk rimelig, og tilbyr en enkelt e-postkonto med 3 GB lagringsplass for $10 årlig, noe som er billigere enn konkurrenter som Protonmail, Fastmail og Google Workspace.",
      "Hoewel Purelymail in bèta is en af en toe problemen kan hebben zoals het blokkeren van e-mails en het ontbreken van 24/7 ondersteuning, legt het de nadruk op beveiliging en verkoopt het geen gebruikersgegevens."
    ],
    "commentSummary": [
      "Purelymail wordt erkend als een budgetvriendelijke e-maildienst, gewaardeerd om zijn eenvoud en betrouwbaarheid, vooral voor aangepaste domeinen. Gebruikers vergelijken het met diensten zoals mxroute, Fastmail en Proton, waarbij ze de betaalbaarheid benadrukken, maar ook zorgen uiten over de eenpersoonsoperatie en het ontbreken van functies zoals agenda-synchronisatie. Ondanks enkele beperkingen maken de eenvoudige prijsstelling en functionaliteit van Purelymail het een levensvatbare optie voor gebruikers die op zoek zijn naar een basis e-mailoplossing, waarbij ook alternatieven zoals Zoho en zelfhosting worden overwogen."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "Sterrenkundigen verwijderen asteroïde omdat het een Tesla Roadster bleek te zijn",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "Sterrekundigen classificeerden aanvankelijk de Tesla Roadster van Elon Musk verkeerd als een asteroïde, wat de noodzaak benadrukt voor verbeterde transparantie bij het volgen van objecten in de diepe ruimte.",
      "Het Minor Planet Center corrigeerde de classificatiefout, waarmee de moeilijkheid werd benadrukt om onderscheid te maken tussen natuurlijke en kunstmatige objecten in de ruimte.",
      "Het incident wijst op de afwezigheid van een centrale opslagplaats voor het volgen van objecten in de diepe ruimte, wat de inspanningen bemoeilijkt om potentiële asteroïdebedreigingen te monitoren, waarbij amateurastronomen een cruciale rol spelen in de identificatie."
    ],
    "commentSummary": [
      "Astronomen feilkategoriserte opprinnelig en Tesla Roadster som en asteroide, og merket den som \"2018 CN41,\" før de innså at det var et menneskeskapt objekt som allerede var sporet som \"2018-017A.\" Denne hendelsen understreker nødvendigheten av forbedrede sporings og klassifiseringssystemer for kunstige objekter i verdensrommet for å forhindre lignende feil. Forvekslingen fremhever utfordringer med å skille mellom naturlige himmellegemer og menneskeskapte objekter i romutforskning."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "DeepSeek brengt Janus Pro uit, een tekst-naar-beeld generator [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek heeft Janus Pro geïntroduceerd, een tekst-naar-beeld generator die gebruikmaakt van een 'unified model' met 7 miljard parameters en naar verluidt Dall-E 3 en Stable Diffusion Medium overtreft in prestaties.",
      "Het model staat bekend om zijn zware censuur op gevoelige onderwerpen en beperkte beeldresolutie van 384x384, wat discussies over de implicaties van AI-ontwikkeling oproept.",
      "De lagere trainingskostnadene til Janus Pro sammenlignet med konkurrentene kan påvirke selskaper som Nvidia, og det er tilgjengelig for kommersiell bruk med restriksjoner på militære applikasjoner."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "Brazil verbiedt het technologiebedrijf Tools for Humanity van Sam Altman om te betalen voor irisscans",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "De brasilianske databeskyttelsesmyndighetene har forbudt Tools for Humanity å tilby kompensasjon, inkludert kryptovaluta, for irisskanninger for å forhindre utilbørlig påvirkning på individers beslutninger om å dele biometriske data.",
      "Tools for Humanity, medgrunnlagt av OpenAI-sjef Sam Altman, har som mål å utvikle et globalt identitetssystem gjennom irisskanninger under sitt World-prosjekt.",
      "Het bedrijf beweert te voldoen aan de Braziliaanse wetten en is in gesprek met de autoriteit om zorgen weg te nemen na een onderzoek dat afgelopen november begon."
    ],
    "commentSummary": [
      "Brasil har forbudt Tools for Humanity, ledet av Sam Altman, fra å kompensere individer for irisskanninger for å beskytte personlig autonomi. Denne avgjørelsen har utløst debatter om personvern og de etiske implikasjonene av å samle inn biometriske data, slik som de involvert i Altmans Worldcoin-prosjekt. Situasjonen understreker den pågående konflikten mellom teknologisk fremgang og etiske bekymringer angående datavern og potensiell misbruk."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "Mijn mislukte poging om alle NPM-pakketten met 5% te verkleinen",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "In 2022 werd er een voorstel gedaan om de Zopfli-compressor te gebruiken om de npm-pakketgroottes met 5% te verminderen, met als doel de prestaties te verbeteren en de opslagkosten te verlagen. Het voorstel werd afgewezen door de npm-beheerders vanwege zorgen over de trage compressiesnelheid van Zopfli, de decompressietijd, problemen met lockfiles en de complexiteit van de integratie. De ervaring bood inzichten in het schrijven van voorstellen en het evalueren van afwegingen, ondanks de intrekking van het voorstel."
    ],
    "commentSummary": [
      "Een initiatief om de NPM-pakketgroottes met 5% te verminderen door Zopfli-compressie te gebruiken, stuitte op problemen zoals langere publiceertijden en complexiteit.",
      "Ondanks mogelijke besparingen op bandbreedte, maakten nadelen zoals langzamere compressie en gebrek aan native ondersteuning het voorstel minder levensvatbaar.",
      "De discussie benadrukte utfordringen med å balansere innovasjon med praktisk anvendelse i open-source-prosjekter, noe som førte til at forslaget ble avsluttet og alternativer som Brotli eller ZSTD ble vurdert."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "Voormalig tech-CEO klaagt om het arrestatierecord van het internet te laten verwijderen",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "Voormalig tech-CEO Maury Blackman klaagt journalist Jack Poulson aan voor $25 miljoen om een arrestatie wegens huiselijk geweld uit 2021 van het internet te verwijderen, ondanks dat het dossier door een rechter is verzegeld.",
      "De rechtszaak heeft debatten over het Eerste Amendement aangewakkerd, waarbij de Electronic Frontier Foundation Poulson verdedigt en de nadruk legt op het publieke belang bij de publicatie.",
      "De First Amendment Coalition heeft een rechtszaak aangespannen tegen de Californische wet die de publicatie van verzegelde arrestatieverslagen verbiedt, waarbij de spanning tussen privacy en het recht op vrije meningsuiting wordt benadrukt."
    ],
    "commentSummary": [
      "Een voormalige CEO van een technologiebedrijf klaagt om zijn arrestatierecord van het internet te laten verwijderen, waarmee hij de aandacht vestigt op de reputatieschade die wordt veroorzaakt door openbare arrestatierecords.",
      "De zaak benadrukt debatten over de noodzaak van transparantie om geheime arrestaties te voorkomen en de mogelijke schade aan de toekomst van individuen wanneer arrestatiedetails worden gepubliceerd zonder een veroordeling.",
      "De rechtszaak involverer også Streisand-effekten, hvor forsøk på å undertrykke informasjon utilsiktet kan øke dens synlighet."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "Nvidia, ASML duiken naar beneden da DeepSeek een verkoopgolf van technologieaandelen veroorzaakt",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "Nvidia's aandelenwaarde daalde met $560 miljard, wat de grootste daling in de markthistorie markeert, voornamelijk vanwege zorgen over de Chinese AI-startup DeepSeek.",
      "Het concurrerende, goedkope AI-model van DeepSeek heeft zorgen gewekt over de toekomst van AI-investeringen van Amerikaanse bedrijven, wat invloed heeft gehad op de aandelen van Nvidia en belangrijke indexen zoals de S&P 500 en Nasdaq 100.",
      "Ondanks de uitdagingen van Nvidia, is Meta van plan om de uitgaven voor AI-projecten te verhogen, en hebben OpenAI, SoftBank en Oracle een aanzienlijke AI-infrastructuuronderneming van $100 miljard aangekondigd."
    ],
    "commentSummary": [
      "Nvidia en ASML-aandelen daalden na een technologieverkoop die werd geïnitieerd door de Chinese AI-startup DeepSeek, die een model creëerde dat beter presteert dan ChatGPT met behulp van oudere Nvidia-hardware.",
      "Het open-source model van DeepSeek, dat goedkoper is om te trainen, roept zorgen op over de winstgevendheid van AI-bedrijven zoals OpenAI en Anthropic, wat mogelijk de toekomstige vraag naar Nvidia's GPU's kan beïnvloeden.",
      "De reactie van de markt duidt op angsten voor verminderde marges en toegenomen concurrentie, ondanks het potentieel voor bredere AI-adoptie."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "Mark Zuckerberg: Deze man is een lafaard",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "Mark Zuckerberg krijgt kritiek vanwege zijn stilzwijgen terwijl voormalig president Donald Trump de National Institutes of Health ontmantelt, wat gevolgen heeft voor 40 miljard dollar aan onderzoeksfinanciering, ondanks Zuckerbergs eerdere toezeggingen aan ziekteonderzoek.",
      "De acties van Zuckerberg bij Meta, waaronder het verminderen van fact-checking, contentmoderatie en diversiteitsinitiatieven, terwijl hij Republikeinse leidinggevenden promoot, suggereren een verschuiving in principes, in lijn met de eisen van Trump.",
      "Critici beweren dat Zuckerbergs medgjørlighet overfor Trumps autoritære tendenser gjenspeiler en mangel på mot, noe som kan påvirke andre teknologiselskaper som Amazon til å potensielt innta lignende holdninger, og dermed påvirke hans ettermæle."
    ],
    "commentSummary": [
      "Het artikel bekritiseert Mark Zuckerberg voor zijn acties bij Meta, en suggereert dat zijn beslissingen worden beïnvloed door eigenbelang en een gebrek aan principes, vooral onder politieke druk.",
      "Het verkent thema's als bedrijfsverantwoordelijkheid, de impact van rijkdom op de politiek en de moeilijkheden van het behouden van integriteit in leiderschapsrollen.",
      "De discussie is verdeeld, waarbij sommigen Zuckerberg verdedigen als iemand die zich mogelijk aanpast aan externe druk, terwijl anderen teleurstelling uiten over het vermeende gebrek aan moed van techleiders."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "Oliver Heaviside en de theorie van transmissielijnen (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "De amateur-radiosite van PA3FWM gaat in op technische onderwerpen zoals enkelzijband FM, software-gedefinieerde radio (SDR) geluidskaarten en antenneontwerp.",
      "De site belicht Oliver Heavisides bijdragen aan de transmissielijntheorie, inclusief zijn verbeteringen aan de vergelijkingen van Maxwell en telegraafkabelmodellen.",
      "De inhoud is aangepast van een artikel uit november 2021 in het Nederlandse amateurradiotijdschrift Electron, dat historische en technische inzichten biedt in signaaloverdracht en kabelontwerp."
    ],
    "commentSummary": [
      "Oliver Heaviside, en selvlært fysiker, gjorde bemerkelsesverdige bidrag til elektromagnetisme og transmisjonslinjeteori, til tross for motstand fra etablerte skikkelser som William Henry Preece. Heavisides arbeid, inkludert forenklingen av Maxwells ligninger, var avgjørende for feltet, men han levde i fattigdom på grunn av profesjonelle hindringer. Innlegget fremhever utfordringene med å forstå transmisjonslinjer og impedans, og refererer til pedagogiske ressurser og historiske anekdoter for kontekst."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
