[
  {
    "id": 42838700,
    "title": "Pemutusan hubungan kerja secara mendasar mengubah cara saya memandang pekerjaan",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "Penulis menerima pemberitahuan pemutusan hubungan kerja yang tidak terduga dari COO perusahaan mereka, meskipun sebelumnya telah ada jaminan bahwa pemutusan hubungan kerja tidak akan terjadi, menunjukkan adanya ketidaksesuaian antara komunikasi dan tindakan perusahaan.",
      "Pengalaman tersebut menyebabkan hilangnya kepercayaan terhadap lingkungan kerja modern, di mana karyawan merasa dapat dengan mudah digantikan meskipun perusahaan dalam kondisi keuangan yang stabil, mendorong pergeseran menuju upaya minimal dan skeptisisme terhadap keamanan pekerjaan.",
      "Dalam hukum ketenagakerjaan di Jerman, prioritas diberikan untuk melindungi karyawan yang rentan selama pemutusan hubungan kerja, tetapi ini tidak menjamin keamanan kerja bagi semua orang, sehingga disarankan bagi karyawan untuk mematuhi jam kerja kontrak secara ketat dan mencari peluang kerja lainnya."
    ],
    "commentSummary": [
      "Penulis merenungkan pengalaman mereka di industri teknologi, menekankan bahwa menjaga sikap positif dan etos kerja yang kuat sangat penting untuk peluang kerja di masa depan. Membangun dan memelihara hubungan profesional dapat membuka peluang baru, karena kontak dari pekerjaan sebelumnya sering berperan dalam mendapatkan peran di masa depan. Meskipun pekerjaan bersifat transaksional, penulis menyarankan untuk fokus pada kebanggaan pribadi dalam pekerjaan dan hubungan dengan rekan kerja daripada mengharapkan loyalitas dari perusahaan."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "Marginalia – Mesin pencari yang memprioritaskan konten non-komersial",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "Marginalia Search telah meluncurkan situs baru yang berfokus pada konten non-komersial dan alat penemuan, dengan menekankan privasi pengguna dan perlindungan data.",
      "Teks mesin pencari beroperasi menggunakan teknologi sumber terbuka, tanpa AI atau layanan cloud, dan mematuhi GDPR serta Arahan Cookie Uni Eropa.",
      "Teks sumber tersedia di bawah lisensi AGPL, yang mendorong transparansi dan kolaborasi komunitas."
    ],
    "commentSummary": [
      "Marginalia adalah mesin pencari yang menekankan konten non-komersial dan telah beralih dari menggunakan Personalized PageRank ke BM25 untuk peringkat. Mesin pencari ini telah menggabungkan kesamaan kosinus untuk menemukan situs web dan telah pindah ke domain baru, marginalia-search.com. Marginalia bersifat open source, merayapi ulang situs setiap 10 minggu, menggunakan perayap RSS untuk pembaruan harian, dan berencana untuk memperluas konten di luar bahasa Inggris, meskipun saat ini mengalami kesulitan dengan kueri navigasi."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "Kansas mengalami wabah tuberkulosis terbesar di Amerika sejak tahun 1950-an.",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "Kansas menghadapi wabah tuberkulosis terbesar dalam sejarah AS, dengan 66 kasus aktif dan 79 infeksi laten dilaporkan di wilayah metro Kansas City sejak 2024, terutama di Wyandotte County. Pusat Pengendalian dan Pencegahan Penyakit (CDC) membantu pejabat kesehatan setempat dalam menangani wabah ini, yang masih berlangsung tetapi telah mengalami penurunan kasus aktif menjadi sekitar 32. Tuberkulosis adalah infeksi bakteri yang mempengaruhi paru-paru, menyebar melalui udara, dan dapat diobati dengan antibiotik, dengan risiko terhadap masyarakat umum dianggap rendah."
    ],
    "commentSummary": [
      "Kejadian wabah tuberkulosis di Kansas adalah yang terbesar di AS sejak tahun 1950-an, seperti yang dilaporkan oleh Centers for Disease Control and Prevention (CDC). Wabah ini telah memicu diskusi tentang vaksin BCG, yang tidak diberikan secara rutin di AS karena efektivitas yang tidak konsisten dan kemungkinan efek samping. Situasi ini menekankan perlunya kebijakan kesehatan masyarakat yang efektif dan peran lembaga pemerintah dalam pemantauan dan pencegahan penyakit."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "Openhaystack: Bangun 'AirTags' – lacak perangkat Bluetooth melalui jaringan Apple",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack adalah sebuah kerangka kerja yang memungkinkan pelacakan perangkat Bluetooth pribadi menggunakan jaringan Find My milik Apple, yang dikembangkan oleh Secure Mobile Networking Lab di TU Darmstadt.",
      "Itu didasarkan pada rekayasa balik jaringan Find My Apple dan memerlukan macOS 11 serta perangkat Bluetooth, seperti BBC micro:bit, untuk berfungsi.",
      "OpenHaystack adalah sumber terbuka di bawah Lisensi Publik Umum GNU Affero v3.0, mendukung berbagai perangkat, dan termasuk versi seluler untuk Android dan iOS, meskipun masih bersifat eksperimental dan tidak berafiliasi dengan Apple."
    ],
    "commentSummary": [
      "Openhaystack memungkinkan pengguna untuk membuat 'AirTags' kustom untuk melacak perangkat Bluetooth melalui jaringan Apple, menawarkan alternatif untuk solusi milik Apple.",
      "Versi pelacakan Bluetooth dari Google dikritik karena kinerja yang kurang baik dan masalah privasi, sementara jaringan Samsung dicatat memiliki kinerja yang lebih baik meskipun basis pengguna Android Google lebih besar.",
      "Teks tersebut menyoroti kekhawatiran privasi dan tantangan teknis dalam mengembangkan perangkat pelacakan khusus, dengan alternatif pihak ketiga yang kurang memiliki fitur canggih seperti Ultra-Wideband (UWB) untuk pelacakan yang presisi."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "Pelajaran dalam menciptakan foto keluarga yang ingin disimpan orang (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "DeepSeek My User Agent",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 adalah model baru yang dirancang untuk mengungkapkan alur pemikiran kepada pengguna, tersedia secara gratis di chat.deepseek.com atau melalui API yang lebih terjangkau dibandingkan dengan OpenAI.",
      "Setelah artikel tersebut dirilis, API DeepSeek mengalami masalah, dengan platform.deepseek.com mengembalikan kesalahan 404, yang menunjukkan potensi gangguan yang disebabkan oleh DeepSeek My User Agent.",
      "Pengguna dapat menjelajahi penilaian teratas di Hacker News dan menggunakan prompt \"Judge Me\" di chat.deepseek.com untuk pengalaman yang dipersonalisasi."
    ],
    "commentSummary": [
      "Ada seorang pengguna yang membagikan ejekan lucu dari DeepSeek, sebuah alat AI yang menganalisis data peramban, menyoroti keanehan seperti sistem operasi yang usang dan resolusi layar yang tidak biasa. Ejekan tersebut dengan humor mengaitkan ciri-ciri ini dengan lokasi pengguna di Calgary, Kanada, memicu diskusi tentang ketidakakuratan sesekali dari alat tersebut dan nilai hiburannya. Percakapan tersebut juga mengeksplorasi potensi AI dalam meningkatkan pengalaman menjelajah web, seperti menyaring iklan dan konten yang tidak relevan, serta menciptakan interaksi internet yang baru."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "Purelymail: Email murah tanpa basa-basi",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail menyediakan hosting email yang hemat biaya dengan kompatibilitas untuk IMAP dan POP3, memungkinkan penggunaan dengan sebagian besar aplikasi email atau melalui webmail Roundcube.",
      "Pelayanan ini sangat terjangkau, menawarkan satu akun email dengan penyimpanan 3 GB seharga $10 per tahun, yang lebih murah dibandingkan pesaing seperti Protonmail, Fastmail, dan Google Workspace.",
      "Walaupun Purelymail masih dalam tahap beta dan mungkin mengalami masalah sesekali seperti pemblokiran email dan kurangnya dukungan 24/7, layanan ini menekankan keamanan dan tidak menjual data pengguna."
    ],
    "commentSummary": [
      "Purelymail diakui sebagai layanan email yang ramah anggaran, dihargai karena kesederhanaan dan keandalannya, terutama untuk domain kustom. Pengguna membandingkannya dengan layanan seperti mxroute, Fastmail, dan Proton, menyoroti keterjangkauannya tetapi mencatat kekhawatiran tentang operasinya yang dijalankan oleh satu orang dan kurangnya fitur seperti sinkronisasi kalender. Meskipun ada beberapa keterbatasan, harga dan fungsionalitas Purelymail yang sederhana menjadikannya pilihan yang layak bagi pengguna yang mencari solusi email dasar, dengan alternatif seperti Zoho dan hosting mandiri juga dipertimbangkan."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "Astronom menghapus asteroid karena ternyata itu adalah Tesla Roadster",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "Astronom mengklasifikasikan secara keliru Tesla Roadster milik Elon Musk sebagai asteroid, menekankan perlunya peningkatan transparansi dalam melacak objek-objek di luar angkasa.",
      "Minor Planet Center mengoreksi kesalahan klasifikasi, menyoroti kesulitan dalam membedakan antara objek alami dan buatan di luar angkasa.",
      "Tidak adanya repositori pusat untuk melacak objek-objek di luar angkasa menunjukkan bahwa insiden ini mempersulit upaya untuk memantau potensi ancaman asteroid, dengan astronom amatir memainkan peran penting dalam identifikasi."
    ],
    "commentSummary": [
      "Astronom mengklasifikasikan Tesla Roadster sebagai asteroid dengan label \"2018 CN41\" sebelum menyadari bahwa itu adalah objek buatan manusia yang sudah dilacak sebagai \"2018-017A.\" Insiden ini menekankan perlunya sistem pelacakan dan klasifikasi yang lebih baik untuk objek buatan di luar angkasa guna mencegah kesalahan serupa. Kekeliruan ini menyoroti tantangan dalam membedakan antara benda langit alami dan objek buatan manusia dalam eksplorasi luar angkasa."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "DeepSeek merilis Janus Pro, sebuah generator teks-ke-gambar [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek telah memperkenalkan Janus Pro, sebuah generator teks-ke-gambar yang menggunakan \"model terpadu\" dengan 7 miliar parameter yang dilaporkan melampaui kinerja Dall-E 3 dan Stable Diffusion Medium.",
      "Model ini dikenal karena sensor ketat pada topik sensitif dan resolusi gambar terbatas sebesar 384x384, memicu perdebatan tentang implikasi pengembangan AI.",
      "Biaya pelatihan Janus Pro yang lebih rendah dibandingkan dengan pesaing dapat mempengaruhi perusahaan seperti Nvidia, dan tersedia untuk penggunaan komersial dengan pembatasan pada aplikasi militer."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "Brasil melarang perusahaan teknologi Sam Altman, Tools for Humanity, untuk membayar pemindaian iris.",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "Pengawas perlindungan data Brasil telah melarang Tools for Humanity untuk menawarkan kompensasi, termasuk mata uang kripto, untuk pemindaian iris guna mencegah pengaruh yang tidak semestinya terhadap keputusan individu untuk berbagi data biometrik.",
      "Tools for Humanity, yang didirikan bersama oleh CEO OpenAI Sam Altman, bertujuan untuk mengembangkan sistem identitas global melalui pemindaian iris di bawah proyek World-nya.",
      "Perusahaan menyatakan kepatuhan terhadap hukum Brasil dan sedang berkomunikasi dengan otoritas untuk menyelesaikan kekhawatiran setelah penyelidikan yang dimulai November lalu."
    ],
    "commentSummary": [
      "Brasil telah melarang Tools for Humanity, yang dipimpin oleh Sam Altman, untuk memberikan kompensasi kepada individu atas pemindaian iris guna melindungi otonomi pribadi. Keputusan ini telah memicu perdebatan tentang privasi dan implikasi etis dari pengumpulan data biometrik, seperti yang terlibat dalam proyek Worldcoin Altman. Situasi ini menyoroti konflik yang sedang berlangsung antara kemajuan teknologi dan kekhawatiran etis mengenai privasi data dan potensi penyalahgunaan."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "Tugas saya yang gagal untuk mengecilkan semua paket NPM sebesar 5%",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "Dalam tahun 2022, sebuah usulan diajukan untuk menggunakan kompresor Zopfli guna mengurangi ukuran paket npm sebesar 5%, dengan tujuan meningkatkan kinerja dan menurunkan biaya penyimpanan. Usulan tersebut ditolak oleh pemelihara npm karena kekhawatiran tentang kecepatan kompresi Zopfli yang lambat, waktu dekompresi, masalah lockfile, dan kompleksitas integrasi. Pengalaman ini memberikan wawasan tentang penulisan usulan dan evaluasi trade-off, meskipun usulan tersebut ditarik kembali."
    ],
    "commentSummary": [
      "Suatu inisiatif untuk mengurangi ukuran paket NPM sebesar 5% menggunakan kompresi Zopfli menghadapi masalah seperti peningkatan waktu publikasi dan kompleksitas.",
      "Meskipun ada potensi penghematan bandwidth, kelemahan seperti kompresi yang lebih lambat dan kurangnya dukungan asli membuat proposal tersebut kurang layak.",
      "Teks tersebut menyoroti tantangan dalam menyeimbangkan inovasi dengan kepraktisan dalam proyek open-source, yang mengarah pada penutupan proposal dan pertimbangan alternatif seperti Brotli atau ZSTD."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "Mantan CEO teknologi menggugat untuk menghapus catatan penangkapannya dari internet",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "Mantan CEO teknologi Maury Blackman menggugat jurnalis Jack Poulson sebesar $25 juta untuk menghapus penangkapan kasus kekerasan dalam rumah tangga tahun 2021 dari internet, meskipun catatan tersebut telah disegel oleh hakim.",
      "Tuntutan hukum tersebut telah memicu perdebatan Amandemen Pertama, dengan Electronic Frontier Foundation membela Poulson, menekankan kepentingan publik dalam publikasi tersebut.",
      "The First Amendment Coalition telah mengajukan gugatan yang menantang undang-undang California yang mencegah publikasi catatan penangkapan yang disegel, menyoroti ketegangan antara hak privasi dan kebebasan berbicara."
    ],
    "commentSummary": [
      "Mantan CEO teknologi menggugat untuk menghapus catatan penangkapannya dari internet, menarik perhatian pada kerusakan reputasi yang disebabkan oleh catatan penangkapan publik.",
      "Teks tersebut menyoroti perdebatan antara kebutuhan akan transparansi untuk mencegah penangkapan rahasia dan potensi kerugian terhadap masa depan individu ketika rincian penangkapan dipublikasikan tanpa adanya vonis.",
      "Tuntutan hukum tersebut juga melibatkan efek Streisand, di mana upaya untuk menekan informasi secara tidak sengaja dapat meningkatkan visibilitasnya."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "Nvidia, ASML Anjlok saat DeepSeek Memicu Penjualan Saham Teknologi",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "Nvidia mengalami penurunan nilai saham sebesar $560 miliar, menandai penurunan terbesar dalam sejarah pasar, terutama karena kekhawatiran terhadap startup AI China, DeepSeek.",
      "Model AI berbiaya rendah yang kompetitif dari DeepSeek telah menimbulkan kekhawatiran tentang masa depan investasi AI perusahaan AS, mempengaruhi saham Nvidia dan indeks utama seperti S&P 500 dan Nasdaq 100.",
      "Meskipun menghadapi tantangan dari Nvidia, Meta berencana untuk meningkatkan pengeluaran proyek AI, dan OpenAI, SoftBank, serta Oracle telah mengumumkan usaha infrastruktur AI yang signifikan senilai $100 miliar."
    ],
    "commentSummary": [
      "Nvidia dan saham ASML mengalami penurunan setelah penjualan besar-besaran di sektor teknologi yang dipicu oleh startup AI Tiongkok, DeepSeek, yang menciptakan model yang mengungguli ChatGPT dengan menggunakan perangkat keras Nvidia yang lebih lama.",
      "Model open-source DeepSeek, yang lebih murah untuk dilatih, menimbulkan kekhawatiran tentang profitabilitas perusahaan AI seperti OpenAI dan Anthropic, yang berpotensi mempengaruhi permintaan masa depan untuk GPU Nvidia.",
      "Tanggapan pasar menunjukkan kekhawatiran akan berkurangnya margin dan meningkatnya persaingan, meskipun ada potensi adopsi AI yang lebih luas."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "Mark Zuckerberg: Pria Ini Adalah Seorang Pengecut",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "Mark Zuckerberg menghadapi kritik karena diamnya saat mantan Presiden Donald Trump membongkar National Institutes of Health, yang mempengaruhi pendanaan penelitian sebesar $40 miliar, meskipun Zuckerberg sebelumnya berkomitmen untuk penelitian penyakit.",
      "Langkah-langkah yang diambil Zuckerberg di Meta, termasuk mengurangi pemeriksaan fakta, moderasi konten, dan inisiatif keberagaman, sambil mempromosikan eksekutif dari Partai Republik, menunjukkan pergeseran prinsip yang sejalan dengan tuntutan Trump.",
      "Kritikus berpendapat bahwa kepatuhan Zuckerberg terhadap kecenderungan otoriter Trump mencerminkan kurangnya keberanian, yang mempengaruhi perusahaan teknologi lain seperti Amazon untuk berpotensi mengadopsi sikap serupa, sehingga mempengaruhi warisannya."
    ],
    "commentSummary": [
      "Artikel tersebut mengkritik Mark Zuckerberg atas tindakannya di Meta, dengan menyarankan bahwa keputusannya dipengaruhi oleh kepentingan pribadi dan kurangnya prinsip, terutama di bawah tekanan politik.",
      "Itu mengeksplorasi tema tanggung jawab perusahaan, dampak kekayaan terhadap politik, dan kesulitan mempertahankan integritas dalam peran kepemimpinan.",
      "Terdapat perbedaan pendapat dalam diskusi ini, dengan beberapa pihak membela Zuckerberg yang mungkin beradaptasi dengan tekanan eksternal, sementara yang lain menyatakan kekecewaan terhadap pemimpin teknologi yang dianggap kurang berani."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "Oliver Heaviside dan teori saluran transmisi (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "Website radio amatir PA3FWM membahas topik teknis seperti frekuensi modulasi satu sisi, kartu suara radio yang ditentukan oleh perangkat lunak (SDR), dan desain antena.",
      "Situs ini menyoroti kontribusi Oliver Heaviside terhadap teori saluran transmisi, termasuk perbaikan yang dilakukannya pada persamaan Maxwell dan model kabel telegraf.",
      "Konten ini diadaptasi dari artikel November 2021 di majalah radio amatir Belanda, Electron, yang memberikan wawasan historis dan teknis tentang transmisi sinyal dan desain kabel."
    ],
    "commentSummary": [
      "Oliver Heaviside, seorang fisikawan otodidak, memberikan kontribusi penting pada elektromagnetisme dan teori saluran transmisi, meskipun menghadapi oposisi dari tokoh-tokoh mapan seperti William Henry Preece. Karya Heaviside, termasuk penyederhanaan persamaan Maxwell, sangat penting bagi bidang tersebut, namun ia hidup dalam kemiskinan karena hambatan profesional. Tulisan ini menyoroti tantangan dalam memahami saluran transmisi dan impedansi, dengan merujuk pada sumber daya pendidikan dan anekdot sejarah untuk konteks."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
