[
  {
    "id": 42838700,
    "title": "A demissão mudou fundamentalmente como eu percebo o trabalho",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "O autor recebeu um aviso inesperado de demissão do COO da empresa, apesar de garantias anteriores de que demissões não ocorreriam, indicando uma desconexão entre a comunicação e as ações da empresa.",
      "A experiência levou a uma perda de confiança nos ambientes de trabalho modernos, onde os funcionários se sentem descartáveis mesmo quando as empresas estão financeiramente estáveis, levando a uma mudança em direção ao esforço mínimo e ao ceticismo em relação à segurança no emprego.",
      "Na Alemanha, as leis trabalhistas priorizam a proteção de funcionários vulneráveis durante demissões, mas isso não garante segurança no emprego para todos, levando ao conselho para que os funcionários adiram estritamente às horas contratuais e busquem outras oportunidades de trabalho."
    ],
    "commentSummary": [
      "O autor reflete sobre sua experiência na indústria de tecnologia, enfatizando que manter uma atitude positiva e uma forte ética de trabalho é crucial para futuras oportunidades de emprego. Construir e nutrir relacionamentos profissionais pode levar a novas oportunidades, já que contatos de empregos anteriores muitas vezes desempenham um papel na obtenção de futuros cargos. Embora o emprego seja transacional, o autor sugere focar no orgulho pessoal no trabalho e nos relacionamentos com colegas, em vez de esperar lealdade das empresas."
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "Marginalia – Um mecanismo de busca que prioriza conteúdo não comercial",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "Marginalia Search lançou um novo site focado em conteúdo não comercial e ferramentas de descoberta, enfatizando a privacidade do usuário e a proteção de dados.",
      "O mecanismo de busca opera usando tecnologia de código aberto, sem IA ou serviços em nuvem, e está em conformidade com o GDPR e a Diretiva de Cookies da UE.",
      "O código-fonte está disponível sob uma licença AGPL, promovendo transparência e colaboração comunitária."
    ],
    "commentSummary": [
      "Marginalia é um mecanismo de busca que enfatiza conteúdo não comercial e fez a transição do uso do Personalized PageRank para o BM25 para classificação. O mecanismo de busca incorporou similaridade cosseno para descobrir sites e mudou para um novo domínio, marginalia-search.com. Marginalia é de código aberto, recrawleia sites a cada 10 semanas, usa um rastreador RSS para atualizações diárias e planeja expandir além do conteúdo em inglês, embora atualmente enfrente dificuldades com consultas de navegação."
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "Kansas tem o maior surto de tuberculose registrado nos Estados Unidos desde a década de 1950",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "Kansas está enfrentando o maior surto de tuberculose na história dos EUA, com 66 casos ativos e 79 infecções latentes relatadas na área metropolitana de Kansas City desde 2024, principalmente no Condado de Wyandotte. Os Centros de Controle e Prevenção de Doenças (CDC) estão ajudando os oficiais de saúde locais a gerenciar o surto, que está em andamento, mas viu uma redução nos casos ativos para aproximadamente 32. A tuberculose é uma infecção bacteriana que afeta os pulmões, espalha-se pelo ar e é tratável com antibióticos, com o risco para o público em geral considerado baixo."
    ],
    "commentSummary": [
      "O surto de tuberculose no Kansas é o maior nos EUA desde a década de 1950, conforme relatado pelos Centros de Controle e Prevenção de Doenças (CDC). O surto gerou discussões sobre a vacina BCG, que não é administrada rotineiramente nos EUA devido à eficácia inconsistente e possíveis efeitos colaterais. Esta situação enfatiza a necessidade de políticas de saúde pública eficazes e o papel das agências governamentais no monitoramento e prevenção de doenças."
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "Openhaystack: Construa 'AirTags' – rastreie dispositivos Bluetooth através da rede da Apple",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "OpenHaystack é uma estrutura que permite o rastreamento de dispositivos Bluetooth pessoais usando a rede Find My da Apple, desenvolvida pelo Secure Mobile Networking Lab na TU Darmstadt.",
      "É baseado na engenharia reversa da rede Find My da Apple e requer macOS 11 e um dispositivo Bluetooth, como um BBC micro:bit, para funcionar.",
      "OpenHaystack é de código aberto sob a Licença Pública Geral Affero GNU v3.0, suporta vários dispositivos e inclui uma versão móvel para Android e iOS, embora ainda seja experimental e não esteja afiliada à Apple."
    ],
    "commentSummary": [
      "Openhaystack permite que os usuários criem 'AirTags' personalizados para rastrear dispositivos Bluetooth através da rede da Apple, oferecendo uma alternativa à solução proprietária da Apple.",
      "Versão do Google para rastreamento via Bluetooth é criticada por desempenho inferior e questões de privacidade, enquanto a rede da Samsung é destacada por melhor desempenho, apesar da base de usuários Android maior do Google.",
      "A conversa destaca preocupações com privacidade e desafios técnicos no desenvolvimento de dispositivos de rastreamento personalizados, com alternativas de terceiros carecendo de recursos avançados como Ultra-Wideband (UWB) para rastreamento preciso."
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "Lições para criar fotos de família que as pessoas querem guardar (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "DeepSeek Meu Agente de Usuário",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "DeepSeek R1 é um novo modelo projetado para revelar a cadeia de pensamento aos usuários, disponível gratuitamente em chat.deepseek.com ou através de uma API mais acessível em comparação com a OpenAI.",
      "Após a publicação do artigo, a API do DeepSeek encontrou problemas, com o site platform.deepseek.com retornando erros 404, indicando possíveis interrupções causadas pelo DeepSeek My User Agent.",
      "Os usuários podem explorar os principais julgamentos no Hacker News e utilizar o prompt \"Judge Me\" em chat.deepseek.com para uma experiência personalizada."
    ],
    "commentSummary": [
      "A user shared a roast humorístico do DeepSeek, uma ferramenta de IA que analisa dados do navegador, destacando peculiaridades como sistema operacional desatualizado e resolução de tela incomum. O roast conectou humoristicamente essas características à localização do usuário em Calgary, Canadá, gerando discussões sobre as ocasionais imprecisões da ferramenta e seu valor de entretenimento. A conversa também explorou o potencial da IA em melhorar as experiências de navegação na web, como filtrar anúncios e conteúdo irrelevante, e criar interações novas na internet."
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "Purelymail: Email barato e sem complicações",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "Purelymail oferece hospedagem de e-mail econômica com compatibilidade para IMAP e POP3, permitindo o uso com a maioria dos aplicativos de e-mail ou através do webmail Roundcube.",
      "O serviço é notavelmente acessível, oferecendo uma única conta de e-mail com 3 GB de armazenamento por $10 anuais, o que é mais barato do que concorrentes como Protonmail, Fastmail e Google Workspace.",
      "Embora o Purelymail esteja em beta e possa ter problemas ocasionais, como bloqueio de e-mails e falta de suporte 24/7, ele enfatiza a segurança e não vende dados dos usuários."
    ],
    "commentSummary": [
      "Purelymail é reconhecido como um serviço de e-mail econômico, apreciado por sua simplicidade e confiabilidade, especialmente para domínios personalizados. Os usuários o comparam a serviços como mxroute, Fastmail e Proton, destacando sua acessibilidade, mas observando preocupações sobre sua operação por uma única pessoa e a falta de recursos como sincronização de calendário. Apesar de algumas limitações, o preço direto e a funcionalidade do Purelymail o tornam uma opção viável para usuários que buscam uma solução básica de e-mail, com alternativas como Zoho e auto-hospedagem também consideradas."
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "Astrônomos deletam asteroide porque ele acabou sendo um Tesla Roadster",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "Astrônomos inicialmente classificaram erroneamente o Tesla Roadster de Elon Musk como um asteroide, enfatizando a necessidade de melhorar a transparência no rastreamento de objetos no espaço profundo.",
      "O Minor Planet Center corrigiu o erro de classificação, destacando a dificuldade em distinguir entre objetos naturais e artificiais no espaço.",
      "O incidente aponta para a ausência de um repositório central para rastreamento de objetos no espaço profundo, complicando os esforços para monitorar potenciais ameaças de asteroides, com astrônomos amadores desempenhando um papel vital na identificação."
    ],
    "commentSummary": [
      "Astrônomos inicialmente classificaram erroneamente um Tesla Roadster como um asteroide, rotulando-o como \"2018 CN41\", antes de perceberem que era um objeto feito pelo homem já rastreado como \"2018-017A\". Este incidente ressalta a necessidade de sistemas de rastreamento e classificação aprimorados para objetos artificiais no espaço, a fim de evitar erros semelhantes. A confusão destaca os desafios em distinguir entre corpos celestes naturais e objetos feitos pelo homem na exploração espacial."
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "DeepSeek lança Janus Pro, um gerador de texto para imagem [pdf]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DeepSeek introduziu o Janus Pro, um gerador de texto para imagem que utiliza um \"modelo unificado\" com 7 bilhões de parâmetros, que supostamente supera o Dall-E 3 e o Stable Diffusion Medium em desempenho.",
      "O modelo é conhecido por sua forte censura em tópicos sensíveis e resolução de imagem limitada de 384x384, gerando debates sobre as implicações do desenvolvimento de IA.",
      "Os custos de treinamento mais baixos do Janus Pro em comparação com os concorrentes podem impactar empresas como a Nvidia, e ele está disponível para uso comercial com restrições em aplicações militares."
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "Brasil proíbe a empresa de tecnologia de Sam Altman, Tools for Humanity, de pagar por escaneamentos de íris",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "Autoridade de proteção de dados do Brasil proibiu a Tools for Humanity de oferecer compensação, incluindo criptomoeda, por escaneamentos de íris para evitar influência indevida nas decisões dos indivíduos de compartilhar dados biométricos.",
      "Tools for Humanity, cofundada pelo CEO da OpenAI, Sam Altman, visa desenvolver um sistema de identidade global através de escaneamentos de íris sob seu projeto World.",
      "A empresa afirma estar em conformidade com as leis brasileiras e está se envolvendo com a autoridade para resolver preocupações após uma investigação que começou em novembro passado."
    ],
    "commentSummary": [
      "Brasil proibiu a Tools for Humanity, liderada por Sam Altman, de compensar indivíduos por escaneamentos de íris para salvaguardar a autonomia pessoal. Esta decisão gerou debates sobre privacidade e as implicações éticas da coleta de dados biométricos, como os envolvidos no projeto Worldcoin de Altman. A situação destaca o conflito contínuo entre o progresso tecnológico e as preocupações éticas em relação à privacidade de dados e ao potencial uso indevido."
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "Minha tentativa fracassada de reduzir todos os pacotes NPM em 5%",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "Em 2022, foi feita uma proposta para usar o compressor Zopfli para reduzir os tamanhos dos pacotes npm em 5%, visando melhorar o desempenho e reduzir os custos de armazenamento. A proposta foi rejeitada pelos mantenedores do npm devido a preocupações com a lenta velocidade de compressão do Zopfli, tempo de descompressão, problemas com arquivos de bloqueio e complexidade de integração. A experiência proporcionou insights sobre a redação de propostas e a avaliação de trade-offs, apesar da retirada da proposta."
    ],
    "commentSummary": [
      "Uma iniciativa para reduzir os tamanhos dos pacotes NPM em 5% usando a compressão Zopfli encontrou problemas como aumento nos tempos de publicação e complexidade.",
      "Apesar das potenciais economias de largura de banda, desvantagens como compressão mais lenta e falta de suporte nativo tornaram a proposta menos viável.",
      "A discussão destacou o desafio de equilibrar inovação com praticidade em projetos de código aberto, levando ao encerramento da proposta e à consideração de alternativas como Brotli ou ZSTD."
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "Ex-CEO de tecnologia processa para remover registro de sua prisão da internet",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "Ex-CEO de tecnologia Maury Blackman está processando o jornalista Jack Poulson por $25 milhões para remover da internet uma prisão por violência doméstica de 2021, apesar de o registro ter sido lacrado por um juiz.",
      "A ação judicial desencadeou debates sobre a Primeira Emenda, com a Electronic Frontier Foundation defendendo Poulson, enfatizando o interesse público na publicação.",
      "A First Amendment Coalition entrou com uma ação judicial contestando a lei da Califórnia que impede a publicação de registros de prisão selados, destacando a tensão entre os direitos de privacidade e liberdade de expressão."
    ],
    "commentSummary": [
      "Um ex-CEO de tecnologia está processando para que seu registro de prisão seja removido da internet, chamando a atenção para os danos à reputação causados por registros de prisão públicos.",
      "O caso destaca o debate entre a necessidade de transparência para prevenir prisões secretas e o potencial dano ao futuro dos indivíduos quando detalhes de prisões são publicados sem uma condenação.",
      "A ação judicial também envolve o efeito Streisand, onde esforços para suprimir informações podem, inadvertidamente, aumentar sua visibilidade."
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "Nvidia, ASML despencam enquanto DeepSeek desencadeia venda de ações de tecnologia",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "Nvidia viu seu valor de mercado cair em $560 bilhões, marcando a maior queda na história do mercado, principalmente devido a preocupações com a startup chinesa de IA DeepSeek.",
      "Modelo de IA de baixo custo e competitivo da DeepSeek levantou preocupações sobre o futuro dos investimentos em IA das empresas dos EUA, afetando as ações da Nvidia e principais índices como o S&P 500 e Nasdaq 100.",
      "Apesar dos desafios da Nvidia, a Meta planeja aumentar os gastos com projetos de IA, e a OpenAI, a SoftBank e a Oracle anunciaram um empreendimento significativo de infraestrutura de IA de $100 bilhões."
    ],
    "commentSummary": [
      "Nvidia e ASML tiveram queda nas ações após uma venda no setor de tecnologia iniciada pela startup chinesa de IA DeepSeek, que criou um modelo superando o ChatGPT usando hardware mais antigo da Nvidia.",
      "Com o modelo de código aberto do DeepSeek sendo mais barato de treinar, surgem preocupações sobre a rentabilidade de empresas de IA como OpenAI e Anthropic, o que pode impactar a demanda futura por GPUs da Nvidia.",
      "O mercado respondeu indicando temores de margens reduzidas e aumento da concorrência, apesar do potencial para uma adoção mais ampla da IA."
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "Mark Zuckerberg: Este Homem É um Covarde",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "Mark Zuckerberg enfrenta críticas por seu silêncio enquanto o ex-presidente Donald Trump desmantela os Institutos Nacionais de Saúde, afetando US$ 40 bilhões em financiamento para pesquisa, apesar dos compromissos anteriores de Zuckerberg com a pesquisa de doenças.",
      "As ações de Zuckerberg na Meta, incluindo a redução da verificação de fatos, moderação de conteúdo e iniciativas de diversidade, enquanto promove executivos republicanos, sugerem uma mudança de princípios, alinhando-se com as exigências de Trump.",
      "Críticos argumentam que a conformidade de Zuckerberg com as tendências autoritárias de Trump reflete uma falta de coragem, influenciando outras empresas de tecnologia como a Amazon a potencialmente adotar posturas semelhantes, impactando assim seu legado."
    ],
    "commentSummary": [
      "O artigo critica Mark Zuckerberg por suas ações na Meta, sugerindo que suas decisões são influenciadas por interesses próprios e falta de princípios, especialmente sob pressões políticas.",
      "Explora temas de responsabilidade corporativa, o impacto da riqueza na política e as dificuldades de manter a integridade em papéis de liderança.",
      "A discussão está dividida, com alguns defendendo Zuckerberg como possivelmente se adaptando a pressões externas, enquanto outros expressam decepção com a aparente falta de coragem dos líderes de tecnologia."
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "Oliver Heaviside e a teoria das linhas de transmissão (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "PA3FWM's website de rádio amador explora tópicos técnicos como FM de banda lateral única, placas de som de rádio definido por software (SDR) e design de antenas.",
      "O site destaca as contribuições de Oliver Heaviside para a teoria das linhas de transmissão, incluindo suas melhorias nas equações de Maxwell e nos modelos de cabos telegráficos.",
      "Conteúdo adaptado de um artigo de novembro de 2021 na revista de rádio amador holandesa Electron, fornecendo insights históricos e técnicos sobre transmissão de sinal e design de cabos."
    ],
    "commentSummary": [
      "Oliver Heaviside, um físico autodidata, fez contribuições notáveis para o eletromagnetismo e a teoria das linhas de transmissão, apesar de enfrentar oposição de figuras estabelecidas como William Henry Preece. O trabalho de Heaviside, incluindo a simplificação das equações de Maxwell, foi crucial para o campo, mas ele viveu na pobreza devido a obstáculos profissionais. O post destaca os desafios em entender linhas de transmissão e impedância, referenciando recursos educacionais e anedotas históricas para contexto."
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
