[
  {
    "id": 42838700,
    "title": "एक छंटनी ने मूल रूप से यह बदल दिया कि मैं काम को कैसे देखता हूँ।",
    "originLink": "https://mertbulan.com/2025/01/26/once-you-are-laid-off-you-will-never-be-the-same-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42838700",
    "commentBody": "",
    "originSummary": [
      "लेखक को अपनी कंपनी के सीओओ से अप्रत्याशित रूप से छंटनी का नोटिस मिला, जबकि पहले यह आश्वासन दिया गया था कि छंटनी नहीं होगी, जो कंपनी के संचार और कार्यों के बीच असंगति को दर्शाता है।",
      "इस अनुभव ने आधुनिक कार्य वातावरण में विश्वास की कमी को जन्म दिया, जहां कर्मचारी खुद को अस्थायी महसूस करते हैं, भले ही कंपनियां आर्थिक रूप से स्थिर हों, जिससे न्यूनतम प्रयास और नौकरी सुरक्षा के प्रति संदेह की ओर एक बदलाव हुआ।",
      "जर्मनी में, श्रम कानून छंटनी के दौरान कमजोर कर्मचारियों की सुरक्षा को प्राथमिकता देते हैं, लेकिन यह सभी के लिए नौकरी की सुरक्षा की गारंटी नहीं देता है, जिससे कर्मचारियों को सलाह दी जाती है कि वे अनुबंधित घंटों का सख्ती से पालन करें और अन्य नौकरी के अवसरों की तलाश करें।"
    ],
    "commentSummary": [
      "लेखक तकनीकी उद्योग में अपने अनुभव पर विचार करते हुए इस बात पर जोर देते हैं कि सकारात्मक दृष्टिकोण और मजबूत कार्य नैतिकता बनाए रखना भविष्य की नौकरी के अवसरों के लिए महत्वपूर्ण है। पेशेवर संबंधों का निर्माण और पोषण नए अवसरों की ओर ले जा सकता है, क्योंकि पिछले नौकरियों से संपर्क अक्सर भविष्य की भूमिकाओं को सुरक्षित करने में भूमिका निभाते हैं। जबकि रोजगार लेन-देनात्मक है, लेखक सुझाव देते हैं कि कंपनियों से वफादारी की अपेक्षा करने के बजाय अपने काम और सहकर्मियों के साथ संबंधों में व्यक्तिगत गर्व पर ध्यान केंद्रित करें।"
    ],
    "points": 717,
    "commentCount": 677,
    "retryCount": 0,
    "time": 1737966161
  },
  {
    "id": 42836405,
    "title": "मार्जिनालिया – एक खोज इंजन जो गैर-व्यावसायिक सामग्री को प्राथमिकता देता है",
    "originLink": "https://marginalia-search.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836405",
    "commentBody": "",
    "originSummary": [
      "मार्जिनालिया सर्च ने एक नई साइट लॉन्च की है जो गैर-व्यावसायिक सामग्री और खोज उपकरणों पर केंद्रित है, जिसमें उपयोगकर्ता की गोपनीयता और डेटा सुरक्षा पर जोर दिया गया है।",
      "खोज इंजन ओपन-सोर्स तकनीक का उपयोग करके संचालित होता है, बिना AI या क्लाउड सेवाओं के, और GDPR और EU कुकी निर्देश का पालन करता है।",
      "स्रोत कोड एजीपीएल लाइसेंस के तहत उपलब्ध है, जो पारदर्शिता और सामुदायिक सहयोग को बढ़ावा देता है।"
    ],
    "commentSummary": [
      "मार्जिनेलिया एक सर्च इंजन है जो गैर-व्यावसायिक सामग्री पर जोर देता है और रैंकिंग के लिए पर्सनलाइज्ड पेजरैंक से BM25 में स्थानांतरित हो गया है। इस सर्च इंजन ने वेबसाइटों की खोज के लिए कोसाइन सिमिलैरिटी को शामिल किया है और एक नए डोमेन, marginalia-search.com, पर स्थानांतरित हो गया है। मार्जिनेलिया ओपन सोर्स है, हर 10 सप्ताह में साइटों को फिर से क्रॉल करता है, दैनिक अपडेट के लिए एक आरएसएस क्रॉलर का उपयोग करता है, और अंग्रेजी सामग्री से परे विस्तार करने की योजना बना रहा है, हालांकि यह वर्तमान में नेविगेशनल क्वेरीज़ के साथ संघर्ष करता है।"
    ],
    "points": 512,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1737941945
  },
  {
    "id": 42835183,
    "title": "कैनसस में तपेदिक का प्रकोप 1950 के दशक के बाद से अमेरिका में दर्ज किया गया सबसे बड़ा है।",
    "originLink": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835183",
    "commentBody": "",
    "originSummary": [
      "कैनसस अमेरिका के इतिहास में सबसे बड़े तपेदिक प्रकोप का सामना कर रहा है, जिसमें 66 सक्रिय मामले और 79 गुप्त संक्रमण 2024 से कैनसस सिटी मेट्रो क्षेत्र में रिपोर्ट किए गए हैं, मुख्य रूप से वायंडॉट काउंटी में। रोग नियंत्रण और रोकथाम केंद्र (सीडीसी) स्थानीय स्वास्थ्य अधिकारियों को प्रकोप के प्रबंधन में सहायता कर रहा है, जो चल रहा है लेकिन सक्रिय मामलों में कमी आई है और यह लगभग 32 तक पहुंच गया है। तपेदिक एक बैक्टीरियल संक्रमण है जो फेफड़ों को प्रभावित करता है, हवा के माध्यम से फैलता है, और एंटीबायोटिक्स के साथ इलाज योग्य है, और आम जनता के लिए जोखिम को कम माना जाता है।"
    ],
    "commentSummary": [
      "कंसास में तपेदिक का प्रकोप 1950 के दशक के बाद से अमेरिका में सबसे बड़ा है, जैसा कि रोग नियंत्रण और रोकथाम केंद्र (सीडीसी) द्वारा रिपोर्ट किया गया है। इस प्रकोप ने बीसीजी वैक्सीन पर चर्चाओं को प्रेरित किया है, जिसे अमेरिका में नियमित रूप से नहीं दिया जाता है क्योंकि इसकी प्रभावशीलता असंगत है और इसके संभावित दुष्प्रभाव हो सकते हैं। यह स्थिति प्रभावी सार्वजनिक स्वास्थ्य नीतियों की आवश्यकता और रोग निगरानी और रोकथाम में सरकारी एजेंसियों की भूमिका को उजागर करती है।"
    ],
    "points": 403,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1737932590
  },
  {
    "id": 42835772,
    "title": "ओपनहेस्टैक: 'एयरटैग्स' बनाएं – ऐप्पल के नेटवर्क के माध्यम से ब्लूटूथ डिवाइस ट्रैक करें",
    "originLink": "https://github.com/seemoo-lab/openhaystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835772",
    "commentBody": "",
    "originSummary": [
      "ओपनहेस्टैक एक फ्रेमवर्क है जो व्यक्तिगत ब्लूटूथ उपकरणों को ट्रैक करने की सुविधा प्रदान करता है, जो एप्पल के फाइंड माई नेटवर्क का उपयोग करता है। इसे टीयू डार्मस्टाट के सिक्योर मोबाइल नेटवर्किंग लैब द्वारा विकसित किया गया है।",
      "यह एप्पल के फाइंड माई नेटवर्क के रिवर्स-इंजीनियरिंग पर आधारित है और इसे कार्य करने के लिए macOS 11 और एक ब्लूटूथ डिवाइस, जैसे कि बीबीसी माइक्रो:बिट, की आवश्यकता होती है।",
      "ओपनहेस्टैक GNU Affero जनरल पब्लिक लाइसेंस v3.0 के तहत ओपन-सोर्स है, विभिन्न उपकरणों का समर्थन करता है, और इसमें एंड्रॉइड और iOS के लिए एक मोबाइल संस्करण शामिल है, हालांकि यह अभी भी प्रायोगिक है और एप्पल से असंबद्ध है।"
    ],
    "commentSummary": [
      "ओपनहेस्टैक उपयोगकर्ताओं को ऐप्पल के नेटवर्क के माध्यम से ब्लूटूथ उपकरणों को ट्रैक करने के लिए कस्टम 'एयरटैग्स' बनाने की सुविधा देता है, जो ऐप्पल के स्वामित्व वाले समाधान का एक विकल्प प्रदान करता है।",
      "गूगल के ब्लूटूथ ट्रैकिंग के संस्करण की खराब प्रदर्शन और गोपनीयता मुद्दों के लिए आलोचना की जाती है, जबकि सैमसंग के नेटवर्क को बेहतर प्रदर्शन के लिए सराहा जाता है, भले ही गूगल के पास बड़ा एंड्रॉइड उपयोगकर्ता आधार हो।",
      "यह बातचीत निजता संबंधी चिंताओं और कस्टम ट्रैकिंग उपकरणों के विकास में तकनीकी चुनौतियों को उजागर करती है, जहां तृतीय-पक्ष विकल्पों में अल्ट्रा-वाइडबैंड (UWB) जैसी उन्नत सुविधाओं की कमी होती है जो सटीक ट्रैकिंग के लिए आवश्यक हैं।"
    ],
    "points": 380,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1737936687
  },
  {
    "id": 42835282,
    "title": "परिवार की तस्वीरें बनाने के सबक जिन्हें लोग संजो कर रखना चाहते हैं (2018)",
    "originLink": "https://estherschindler.medium.com/the-old-family-photos-project-lessons-in-creating-family-photos-that-people-want-to-keep-ea3909129943",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42835282",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 326,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1737933181
  },
  {
    "id": 42834648,
    "title": "डीपसीक माई यूजर एजेंट",
    "originLink": "https://www.jasonthorsness.com/20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834648",
    "commentBody": "",
    "originSummary": [
      "डीपसीक आर1 एक नया मॉडल है जिसे उपयोगकर्ताओं के लिए विचार श्रृंखला को प्रकट करने के लिए डिज़ाइन किया गया है, जो chat.deepseek.com पर मुफ्त में या ओपनएआई की तुलना में अधिक किफायती एपीआई के माध्यम से उपलब्ध है।",
      "लेख के जारी होने के बाद, DeepSeek API को समस्याओं का सामना करना पड़ा, जिसमें platform.deepseek.com 404 त्रुटियाँ दिखा रहा था, जो DeepSeek My User Agent द्वारा संभावित व्यवधानों का संकेत देता है।",
      "उपयोगकर्ता Hacker News पर शीर्ष निर्णयों का अन्वेषण कर सकते हैं और chat.deepseek.com पर \"Judge Me\" प्रॉम्प्ट का उपयोग करके एक व्यक्तिगत अनुभव प्राप्त कर सकते हैं।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने डीपसीक से एक हास्यपूर्ण रोस्ट साझा किया, जो एक एआई टूल है जो ब्राउज़र डेटा का विश्लेषण करता है, और इसमें पुराने ओएस और असामान्य स्क्रीन रेजोल्यूशन जैसी विचित्रताओं को उजागर किया गया। इस रोस्ट ने हास्यपूर्ण तरीके से इन विशेषताओं को कनाडा के कैलगरी में उपयोगकर्ता के स्थान से जोड़ा, जिससे टूल की कभी-कभी होने वाली गलतियों और मनोरंजन मूल्य पर चर्चाएं शुरू हुईं। बातचीत ने वेब ब्राउज़िंग अनुभवों को बढ़ाने में एआई की क्षमता का भी पता लगाया, जैसे कि विज्ञापनों और अप्रासंगिक सामग्री को फ़िल्टर करना और इंटरनेट पर नए प्रकार की इंटरैक्शन बनाना।"
    ],
    "points": 325,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1737929019
  },
  {
    "id": 42836818,
    "title": "प्योरलीमेल: सस्ता, बिना झंझट वाला ईमेल",
    "originLink": "https://purelymail.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42836818",
    "commentBody": "",
    "originSummary": [
      "प्योरलीमेल किफायती ईमेल होस्टिंग प्रदान करता है जो IMAP और POP3 के साथ संगत है, जिससे अधिकांश मेल एप्लिकेशन या राउंडक्यूब वेबमेल के माध्यम से उपयोग की अनुमति मिलती है।",
      "यह सेवा विशेष रूप से किफायती है, जो $10 वार्षिक शुल्क में 3 जीबी स्टोरेज के साथ एकल ईमेल खाता प्रदान करती है, जो Protonmail, Fastmail, और Google Workspace जैसे प्रतिस्पर्धियों की तुलना में सस्ती है।",
      "हालांकि Purelymail बीटा में है और इसमें कभी-कभी ईमेल ब्लॉकिंग और 24/7 समर्थन की कमी जैसी समस्याएं हो सकती हैं, यह सुरक्षा पर जोर देता है और उपयोगकर्ता डेटा नहीं बेचता है।"
    ],
    "commentSummary": [
      "प्योरलीमेल को एक बजट-अनुकूल ईमेल सेवा के रूप में मान्यता प्राप्त है, जो अपनी सरलता और विश्वसनीयता के लिए सराही जाती है, विशेष रूप से कस्टम डोमेन के लिए। उपयोगकर्ता इसकी तुलना mxroute, फास्टमेल, और प्रोटॉन जैसी सेवाओं से करते हैं, इसकी किफायती दरों की प्रशंसा करते हुए लेकिन इसके एक व्यक्ति द्वारा संचालित होने और कैलेंडर सिंकिंग जैसी सुविधाओं की कमी पर चिंता व्यक्त करते हैं। कुछ सीमाओं के बावजूद, प्योरलीमेल की सीधी-सादी मूल्य निर्धारण और कार्यक्षमता इसे उन उपयोगकर्ताओं के लिए एक व्यवहार्य विकल्प बनाती है जो एक बुनियादी ईमेल समाधान की तलाश में हैं, जिसमें ज़ोहो और स्वयं-होस्टिंग जैसे विकल्प भी विचार किए जाते हैं।"
    ],
    "points": 283,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1737945505
  },
  {
    "id": 42834043,
    "title": "खगोलविदों ने क्षुद्रग्रह को हटा दिया क्योंकि यह टेस्ला रोडस्टर निकला।",
    "originLink": "https://www.astronomy.com/science/astronomers-just-deleted-an-asteroid-because-it-turned-out-to-be-elon-musks-tesla-roadster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834043",
    "commentBody": "",
    "originSummary": [
      "खगोलविदों ने शुरू में एलन मस्क की टेस्ला रोडस्टर को एक क्षुद्रग्रह के रूप में गलत वर्गीकृत किया, जिससे गहरे अंतरिक्ष वस्तुओं की ट्रैकिंग में बेहतर पारदर्शिता की आवश्यकता पर जोर दिया गया।",
      "माइनर प्लैनेट सेंटर ने वर्गीकरण की त्रुटि को ठीक किया, जो अंतरिक्ष में प्राकृतिक और कृत्रिम वस्तुओं के बीच अंतर करने की कठिनाई को उजागर करता है।",
      "यह घटना गहरे अंतरिक्ष वस्तुओं को ट्रैक करने के लिए एक केंद्रीय भंडार की अनुपस्थिति की ओर इशारा करती है, जिससे संभावित क्षुद्रग्रह खतरों की निगरानी के प्रयास जटिल हो जाते हैं, जिसमें शौकिया खगोलविद पहचान में महत्वपूर्ण भूमिका निभाते हैं।"
    ],
    "commentSummary": [
      "खगोलविदों ने शुरू में एक टेस्ला रोडस्टर को एक क्षुद्रग्रह के रूप में गलत वर्गीकृत किया, इसे \"2018 CN41\" लेबल दिया, इससे पहले कि उन्हें एहसास हुआ कि यह एक मानव निर्मित वस्तु है जिसे पहले से ही \"2018-017A\" के रूप में ट्रैक किया गया था। यह घटना अंतरिक्ष में कृत्रिम वस्तुओं के लिए बेहतर ट्रैकिंग और वर्गीकरण प्रणालियों की आवश्यकता को रेखांकित करती है ताकि इसी तरह की गलतियों को रोका जा सके। यह गड़बड़ी अंतरिक्ष अन्वेषण में प्राकृतिक खगोलीय पिंडों और मानव निर्मित वस्तुओं के बीच अंतर करने की चुनौतियों को उजागर करती है।"
    ],
    "points": 265,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737925156
  },
  {
    "id": 42843131,
    "title": "डीपसीक ने जनस प्रो, एक टेक्स्ट-टू-इमेज जनरेटर जारी किया [पीडीएफ]",
    "originLink": "https://github.com/deepseek-ai/Janus/blob/main/janus_pro_tech_report.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42843131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "डीपसीक ने जनस प्रो पेश किया है, जो एक 7 बिलियन पैरामीटर \"यूनिफाइड मॉडल\" का उपयोग करके टेक्स्ट-टू-इमेज जनरेटर है, जो कथित तौर पर प्रदर्शन में डल-ई 3 और स्टेबल डिफ्यूजन मीडियम को पार करता है।",
      "मॉडल को संवेदनशील विषयों पर भारी सेंसरशिप और 384x384 की सीमित छवि रिज़ॉल्यूशन के लिए जाना जाता है, जो एआई विकास के प्रभावों पर बहस को जन्म देता है।",
      "जनस प्रो की कम प्रशिक्षण लागतें प्रतिस्पर्धियों की तुलना में कंपनियों जैसे कि एनवीडिया को प्रभावित कर सकती हैं, और यह व्यावसायिक उपयोग के लिए उपलब्ध है, लेकिन सैन्य अनुप्रयोगों पर प्रतिबंध है।"
    ],
    "points": 235,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1737997065
  },
  {
    "id": 42834432,
    "title": "ब्राज़ील ने सैम ऑल्टमैन की टेक फर्म टूल्स फॉर ह्यूमैनिटी को आईरिस स्कैन के लिए भुगतान करने से प्रतिबंधित किया।",
    "originLink": "https://economictimes.indiatimes.com/tech/technology/brazil-bans-sam-altmans-tech-firm-tools-for-humanity-from-paying-for-iris-scans/articleshow/117540826.cms?from=mdr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834432",
    "commentBody": "",
    "originSummary": [
      "ब्राज़ील की डेटा सुरक्षा प्राधिकरण ने टूल्स फॉर ह्यूमैनिटी को आईरिस स्कैन के लिए मुआवजा, जिसमें क्रिप्टोकरेंसी भी शामिल है, देने से मना किया है ताकि व्यक्तियों के बायोमेट्रिक डेटा साझा करने के निर्णयों पर अनुचित प्रभाव को रोका जा सके।",
      "टूल्स फॉर ह्यूमैनिटी, जिसे ओपनएआई के सीईओ सैम ऑल्टमैन ने सह-स्थापित किया है, अपनी वर्ल्ड परियोजना के तहत आईरिस स्कैन के माध्यम से एक वैश्विक पहचान प्रणाली विकसित करने का लक्ष्य रखता है।",
      "कंपनी ब्राज़ीलियाई कानूनों के अनुपालन का दावा करती है और पिछले नवंबर में शुरू हुई जांच के बाद चिंताओं को हल करने के लिए प्राधिकरण के साथ बातचीत कर रही है।"
    ],
    "commentSummary": [
      "ब्राज़ील ने सैम ऑल्टमैन के नेतृत्व में टूल्स फॉर ह्यूमैनिटी को व्यक्तिगत स्वायत्तता की सुरक्षा के लिए आईरिस स्कैन के बदले व्यक्तियों को मुआवजा देने से रोक दिया है। इस निर्णय ने गोपनीयता और बायोमेट्रिक डेटा के संग्रहण के नैतिक प्रभावों पर बहस छेड़ दी है, जैसे कि ऑल्टमैन के वर्ल्डकॉइन प्रोजेक्ट में शामिल हैं। यह स्थिति डेटा गोपनीयता और संभावित दुरुपयोग के संबंध में तकनीकी प्रगति और नैतिक चिंताओं के बीच चल रहे संघर्ष को उजागर करती है।"
    ],
    "points": 230,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1737927635
  },
  {
    "id": 42840548,
    "title": "मेरी असफल कोशिश सभी NPM पैकेजों को 5% तक घटाने की",
    "originLink": "https://evanhahn.com/my-failed-attempt-to-shrink-all-npm-packages-by-5-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840548",
    "commentBody": "",
    "originSummary": [
      "2022 में, npm पैकेज के आकार को 5% तक कम करने के लिए Zopfli कंप्रेसर का उपयोग करने का प्रस्ताव दिया गया था, जिसका उद्देश्य प्रदर्शन को बढ़ाना और भंडारण लागत को कम करना था। npm मेंटेनर्स ने Zopfli की धीमी कंप्रेशन गति, डीकंप्रेशन समय, लॉकफाइल समस्याओं और एकीकरण की जटिलता के कारण इस प्रस्ताव को अस्वीकार कर दिया। इस अनुभव ने प्रस्ताव लेखन और व्यापार-ऑफ का मूल्यांकन करने में अंतर्दृष्टि प्रदान की, भले ही प्रस्ताव को वापस ले लिया गया हो।"
    ],
    "commentSummary": [
      "एनपीएम पैकेज आकार को 5% तक कम करने के लिए ज़ोप्फली संपीड़न का उपयोग करने की एक पहल को बढ़े हुए प्रकाशन समय और जटिलता जैसी समस्याओं का सामना करना पड़ा।",
      "संभावित बैंडविड्थ बचत के बावजूद, धीमी संपीड़न और मूल समर्थन की कमी जैसे नुकसानों ने प्रस्ताव को कम व्यावहारिक बना दिया।",
      "चर्चा ने ओपन-सोर्स परियोजनाओं में नवाचार और व्यावहारिकता के संतुलन की चुनौती को उजागर किया, जिसके परिणामस्वरूप प्रस्ताव को बंद कर दिया गया और ब्रोटली या ZSTD जैसे विकल्पों पर विचार किया गया।"
    ],
    "points": 225,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1737981879
  },
  {
    "id": 42833193,
    "title": "पूर्व टेक सीईओ इंटरनेट से अपनी गिरफ्तारी के रिकॉर्ड को हटाने के लिए मुकदमा कर रहे हैं",
    "originLink": "https://sf.gazetteer.co/a-former-tech-ceo-is-on-a-crusade-to-get-the-record-of-his-arrest-removed-from-the-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42833193",
    "commentBody": "",
    "originSummary": [
      "पूर्व टेक सीईओ मॉरी ब्लैकमैन पत्रकार जैक पॉलसन पर $25 मिलियन का मुकदमा कर रहे हैं ताकि 2021 की घरेलू हिंसा की गिरफ्तारी को इंटरनेट से हटाया जा सके, हालांकि रिकॉर्ड को एक जज द्वारा सील कर दिया गया है।",
      "मुकदमे ने प्रथम संशोधन पर बहस छेड़ दी है, जिसमें इलेक्ट्रॉनिक फ्रंटियर फाउंडेशन ने पॉलसन का बचाव करते हुए प्रकाशन में सार्वजनिक हित पर जोर दिया है।",
      "फर्स्ट अमेंडमेंट कोएलिशन ने एक मुकदमा दायर किया है जो कैलिफोर्निया कानून को चुनौती देता है, जो सील किए गए गिरफ्तारी रिकॉर्ड के प्रकाशन को रोकता है, और यह गोपनीयता और अभिव्यक्ति की स्वतंत्रता के अधिकारों के बीच तनाव को उजागर करता है।"
    ],
    "commentSummary": [
      "एक पूर्व टेक सीईओ अपनी गिरफ्तारी रिकॉर्ड को इंटरनेट से हटाने के लिए मुकदमा कर रहे हैं, जिससे सार्वजनिक गिरफ्तारी रिकॉर्ड के कारण होने वाले प्रतिष्ठानात्मक नुकसान पर ध्यान आकर्षित हो रहा है।",
      "यह मामला गुप्त गिरफ्तारियों को रोकने के लिए पारदर्शिता की आवश्यकता और बिना दोषसिद्धि के गिरफ्तारी विवरण प्रकाशित होने पर व्यक्तियों के भविष्य को संभावित नुकसान के बीच की बहस को उजागर करता है।",
      "मुकदमे में स्ट्रीसैंड प्रभाव भी शामिल है, जहां जानकारी को दबाने के प्रयास अनजाने में उसकी दृश्यता बढ़ा सकते हैं।"
    ],
    "points": 225,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1737919973
  },
  {
    "id": 42839650,
    "title": "एनवीडिया, एएसएमएल में गिरावट आई क्योंकि डीपसीक ने टेक स्टॉक बिकवाली को प्रेरित किया।",
    "originLink": "https://finance.yahoo.com/news/asml-sinks-china-ai-startup-081823609.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42839650",
    "commentBody": "",
    "originSummary": [
      "एनवीडिया के स्टॉक मूल्य में $560 बिलियन की गिरावट आई, जो बाजार के इतिहास में सबसे बड़ी गिरावट है, मुख्य रूप से चीनी एआई स्टार्टअप डीपसीक को लेकर चिंताओं के कारण।",
      "डीपसीक के प्रतिस्पर्धी कम लागत वाले एआई मॉडल ने अमेरिकी कंपनियों के एआई निवेश के भविष्य के बारे में चिंताएं बढ़ा दी हैं, जिससे एनवीडिया के शेयर और एसएंडपी 500 और नैस्डैक 100 जैसे प्रमुख सूचकांक प्रभावित हुए हैं।",
      "एनवीडिया की चुनौतियों के बावजूद, मेटा एआई परियोजना खर्च को बढ़ाने की योजना बना रहा है, और ओपनएआई, सॉफ्टबैंक, और ओरेकल ने एक महत्वपूर्ण $100 बिलियन एआई इंफ्रास्ट्रक्चर वेंचर की घोषणा की है।"
    ],
    "commentSummary": [
      "चीनी एआई स्टार्टअप डीपसीक द्वारा शुरू किए गए टेक सेलऑफ के बाद एनवीडिया और एएसएमएल के शेयरों में गिरावट आई, जिसने पुराने एनवीडिया हार्डवेयर का उपयोग करके चैटजीपीटी से बेहतर प्रदर्शन करने वाला एक मॉडल बनाया।",
      "डीपसीक का ओपन-सोर्स मॉडल, जिसे प्रशिक्षित करना सस्ता है, ओपनएआई और एंथ्रोपिक जैसी एआई कंपनियों की लाभप्रदता के बारे में चिंताएं बढ़ाता है, जो संभावित रूप से एनवीडिया के जीपीयू की भविष्य की मांग को प्रभावित कर सकता है।",
      "बाजार की प्रतिक्रिया से संकेत मिलता है कि व्यापक एआई अपनाने की संभावना के बावजूद, कम मार्जिन और बढ़ती प्रतिस्पर्धा का डर है।"
    ],
    "points": 212,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1737975464
  },
  {
    "id": 42834911,
    "title": "मार्क जुकरबर्ग: यह व्यक्ति एक कायर है",
    "originLink": "https://www.theindex.media/this-man-is-a-coward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42834911",
    "commentBody": "",
    "originSummary": [
      "मार्क जुकरबर्ग को आलोचना का सामना करना पड़ रहा है क्योंकि पूर्व राष्ट्रपति डोनाल्ड ट्रंप ने नेशनल इंस्टीट्यूट्स ऑफ हेल्थ को समाप्त कर दिया है, जिससे $40 बिलियन के शोध फंडिंग पर असर पड़ा है, जबकि जुकरबर्ग ने पहले बीमारी अनुसंधान के प्रति प्रतिबद्धता जताई थी।",
      "मेटा में जुकरबर्ग की कार्रवाइयाँ, जिनमें तथ्य-जाँच, सामग्री मॉडरेशन, और विविधता पहलों को कम करना शामिल है, जबकि रिपब्लिकन अधिकारियों को बढ़ावा देना, सिद्धांतों में बदलाव का संकेत देती हैं, जो ट्रम्प की मांगों के साथ मेल खाती हैं।",
      "आलोचकों का तर्क है कि ट्रंप की अधिनायकवादी प्रवृत्तियों के साथ जुकरबर्ग की सहमति साहस की कमी को दर्शाती है, जिससे अन्य तकनीकी कंपनियों जैसे अमेज़न भी संभावित रूप से इसी तरह के रुख अपना सकती हैं, और इस प्रकार उनके विरासत पर प्रभाव पड़ सकता है।"
    ],
    "commentSummary": [
      "लेख में मार्क जुकरबर्ग की मेटा में की गई कार्रवाइयों की आलोचना की गई है, यह सुझाव देते हुए कि उनके निर्णय स्वार्थ और सिद्धांतों की कमी से प्रभावित होते हैं, विशेष रूप से राजनीतिक दबावों के तहत।",
      "यह कॉर्पोरेट जिम्मेदारी, राजनीति पर धन के प्रभाव, और नेतृत्व भूमिकाओं में ईमानदारी बनाए रखने की कठिनाइयों के विषयों की पड़ताल करता है।",
      "चर्चा विभाजित है, कुछ लोग जुकरबर्ग का बचाव करते हुए उन्हें बाहरी दबावों के अनुकूल होने की संभावना के रूप में देखते हैं, जबकि अन्य तकनीकी नेताओं की कथित साहस की कमी पर निराशा व्यक्त करते हैं।"
    ],
    "points": 197,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1737930846
  },
  {
    "id": 42840352,
    "title": "ओलिवर हेवीसाइड और संचरण रेखाओं का सिद्धांत (2021)",
    "originLink": "https://www.pa3fwm.nl/technotes/tn28-heaviside-transmission-lines.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42840352",
    "commentBody": "",
    "originSummary": [
      "PA3FWM की शौकिया रेडियो वेबसाइट तकनीकी विषयों जैसे सिंगल-साइडबैंड एफएम, सॉफ्टवेयर-डिफाइंड रेडियो (SDR) साउंडकार्ड्स, और एंटीना डिज़ाइन में गहराई से जानकारी प्रदान करती है।",
      "यह साइट ओलिवर हेवीसाइड के ट्रांसमिशन लाइन सिद्धांत में योगदान को उजागर करती है, जिसमें मैक्सवेल के समीकरणों और टेलीग्राफ केबल मॉडलों में उनके सुधार शामिल हैं।",
      "सामग्री को डच शौकिया रेडियो पत्रिका इलेक्ट्रॉन के नवंबर 2021 के लेख से अनुकूलित किया गया है, जो सिग्नल ट्रांसमिशन और केबल डिज़ाइन में ऐतिहासिक और तकनीकी अंतर्दृष्टि प्रदान करता है।"
    ],
    "commentSummary": [
      "ओलिवर हेवीसाइड, एक स्व-शिक्षित भौतिक विज्ञानी, ने विद्युतचुंबकत्व और ट्रांसमिशन लाइन सिद्धांत में महत्वपूर्ण योगदान दिया, हालांकि उन्हें विलियम हेनरी प्रीस जैसे स्थापित व्यक्तियों से विरोध का सामना करना पड़ा। हेवीसाइड का कार्य, जिसमें मैक्सवेल के समीकरणों का सरलीकरण शामिल है, इस क्षेत्र के लिए महत्वपूर्ण था, फिर भी वे पेशेवर बाधाओं के कारण गरीबी में जीवन व्यतीत करते थे। पोस्ट में ट्रांसमिशन लाइनों और प्रतिबाधा को समझने में आने वाली चुनौतियों को उजागर किया गया है, जिसमें शैक्षिक संसाधनों और ऐतिहासिक उपाख्यानों का संदर्भ दिया गया है।"
    ],
    "points": 193,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1737980315
  }
]
