[
  {
    "id": 42363727,
    "title": "تم إزالة Itch.io بواسطة Funko",
    "originLink": "https://bsky.app/profile/itch.io/post/3lcu6h465bs2n",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42363727",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم تعطيل نطاق Itch.io بسبب تقرير احتيال وتصيد خاطئ من قبل BrandShield يتعلق بصفحة معجبين للعبة Funko Pop. يبرز الحادث مشكلات في تنفيذ العلامات التجارية الآلي وغياب الإشراف البشري، بالإضافة إلى الاستجابة البطيئة من قبل المسجل، iwantmyname. أثارت الحالة دعم المستخدمين لـ itch.io وانتقادات للأطراف المعنية في عملية الإزالة."
    ],
    "points": 948,
    "commentCount": 387,
    "retryCount": 0,
    "time": 1733728759
  },
  {
    "id": 42363102,
    "title": "التلاعب في سلسلة توريد OpenWrt",
    "originLink": "https://flatt.tech/research/posts/compromising-openwrt-supply-chain-sha256-collision/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42363102",
    "commentBody": "",
    "originSummary": [
      "حدد مهندس أمني ثغرات في عملية ترقية البرامج الثابتة لـ OpenWrt، بما في ذلك حقن الأوامر ومشاكل تصادم تجزئة SHA-256. سمحت الثغرات للمهاجمين المحتملين بحقن الأوامر وخلق تصادمات تجزئة، مما أدى إلى تثبيت برامج ثابتة ضارة. قام فريق OpenWrt بسرعة بمعالجة وإصلاح هذه الثغرات، مؤكدين على الحاجة إلى أمان قوي في سلاسل توريد البرمجيات."
    ],
    "commentSummary": [
      "أدى وجود ثغرة في سلسلة توريد OpenWrt إلى تمكين تنفيذ التعليمات البرمجية المستهدفة دون التحقق، مما يشكل خطرًا على الإنشاءات التي تحتوي على أبواب خلفية. - يبرز الحادث أهمية القابلية لإعادة الإنتاج والشفافية في إنشاء البرمجيات، على غرار الممارسات في مستودع ebuild الخاص بـ Gentoo. - يسلط استجابة OpenWrt السريعة الضوء على كفاءة المشاريع مفتوحة المصدر في معالجة القضايا الأمنية مقارنة بالبدائل مغلقة المصدر."
    ],
    "points": 473,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1733718969
  },
  {
    "id": 42361955,
    "title": "بات جيلسنجر كان غير مناسب لإنتل",
    "originLink": "https://bcantrill.dtrace.org/2024/12/08/why-gelsinger-was-wrong-for-intel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42361955",
    "commentBody": "",
    "originSummary": [
      "على الرغم من خبرته التقنية ومهاراته الإدارية، اعتُبر بات غيلسنجر غير مناسب لمنصب الرئيس التنفيذي لشركة إنتل بسبب عدم قدرته على معالجة التحديات الثقافية والاستراتيجية للشركة.",
      "تم انتقاد قراراته القيادية، مثل الحفاظ على توزيعات الأرباح والإعلانات العدوانية، لكونها تعكس نهجًا في زمن السلم بدلاً من القيادة الضرورية في زمن الحرب.",
      "إدارة جيلسنجر لخدمات فاوندرى إنتل وإنهاء مشروع توفينو، وهو مشروع واعد لرقائق التبديل القابلة للبرمجة، اعتبرت خطوات خاطئة كبيرة، مما ترك القضايا الثقافية لإنتل دون حل."
    ],
    "commentSummary": [
      "واجه بات غيلسنجر، الرئيس التنفيذي لشركة إنتل، تحديات تشمل تأخيرات في إنتاج 10 نانومتر والمنافسة من شركة TSMC، مما أدى إلى انخفاضات كبيرة في الأسهم رغم الاستثمارات الاستراتيجية في مرافق التصنيع.",
      "يشير النقاد إلى أن مجلس إدارة إنتل، الذي يتكون في الغالب من أعضاء غير تقنيين، قد يكون مشكلة أساسية، متسائلين عما إذا كانت خبرة جيلسنجر التقنية أو شخص خارجي ضرورية لحل مشاكل إنتل.",
      "يدور النقاش المستمر حول ما إذا كانت استراتيجيات جيلسنجر مناسبة أم أن تكوين مجلس الإدارة وقراراته تعيق تقدم إنتل."
    ],
    "points": 405,
    "commentCount": 323,
    "retryCount": 0,
    "time": 1733703592
  },
  {
    "id": 42360681,
    "title": "JSON5 - JSON للبشر",
    "originLink": "https://json5.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42360681",
    "commentBody": "",
    "originSummary": [
      "JSON5، وهو امتداد لـ JSON، مصمم لتسهيل التحرير اليدوي، مما يجعله مثاليًا لملفات التكوين ولكنه غير مناسب للتواصل بين الآلات.",
      "منذ إطلاقه في عام 2012، اكتسب JSON5 شعبية كبيرة، حيث يتم تحميله أكثر من 65 مليون مرة أسبوعيًا، ويُستخدم في مشاريع كبيرة مثل Chromium وNext.js.",
      "JSON5 هو مجموعة شاملة من JSON، يدمج ميزات ECMAScript 5.1، مما يسمح بمرونة في بناء الجملة، وهو متوافق مع ES5، مع توفر مكتبة JavaScript لتحليل البيانات والتسلسل."
    ],
    "commentSummary": [
      "JSON5 هو امتداد لـ JSON مصمم ليكون أكثر ملاءمة للبشر من خلال السماح بميزات مثل التعليقات والفواصل اللاحقة.",
      "هناك نقاش حول ما إذا كان يجب أن يظل JSON بسيطًا أو يتطور مع ميزات إضافية، كما هو الحال مع JSON5، الذي ليس تحديثًا رسميًا بل هو تنسيق بديل.",
      "يقترح البعض استخدام صيغ أخرى مثل TOML أو HJSON لجعل التكوينات أكثر قابلية للقراءة من قبل البشر، مما يبرز النقاش المستمر حول تطور JSON."
    ],
    "points": 328,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1733693345
  },
  {
    "id": 42359836,
    "title": "المملكة المتحدة تحظر إعلانات التلفزيون النهارية للحبوب والكعك والبرغر",
    "originLink": "https://www.france24.com/en/live-news/20241204-uk-bans-daytime-tv-ads-for-cereals-muffins-and-burgers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42359836",
    "commentBody": "",
    "originSummary": [
      "تقوم الحكومة البريطانية بتنفيذ حظر على الإعلانات التلفزيونية النهارية للأطعمة السكرية و\"الأقل صحة\"، مثل الحبوب، والكعك، والبرغر، لمعالجة السمنة لدى الأطفال.",
      "بدءًا من أكتوبر المقبل، لن يُسمح بعرض هذه الإعلانات إلا بعد الساعة 9:00 مساءً، بهدف منع 20,000 حالة من السمنة لدى الأطفال كل عام.",
      "أكد وزير الصحة ويس ستريتينج على أهمية وقف استهداف الأطفال بالإعلانات عن الوجبات السريعة."
    ],
    "commentSummary": [
      "فرضت المملكة المتحدة حظرًا على الإعلانات التلفزيونية للوجبات السريعة خلال النهار، بما في ذلك الحبوب والمخبوزات والبرغر، كإجراء لمكافحة السمنة لدى الأطفال.",
      "يجادل النقاد بأن الحظر غير كافٍ، حيث يتأثر الأطفال بشكل أكبر بالإعلانات عبر الإنترنت على منصات مثل يوتيوب وتيك توك، والتي لم يشملها الحظر.",
      "لا يزال الجدل قائمًا حول ما إذا كان ينبغي على الحكومة تطبيق القوانين الحالية وتنظيم الإعلانات عبر الإنترنت التي تستهدف الأطفال، أم يجب على الآباء تحمل المزيد من المسؤولية في حماية الأطفال من الإعلانات الضارة."
    ],
    "points": 273,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1733687515
  },
  {
    "id": 42365295,
    "title": "قررت شركة هيتزنر إلغاء حسابنا وإنهاء جميع الخوادم.",
    "originLink": "https://mastodon.social/@kiwix/113622081750449356",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42365295",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أثارت إلغاء حسابات هيتزنر وإنهاء الخوادم مناقشات حول ضرورة النسخ الاحتياطي وخطط التعافي من الكوارث.",
      "شارك المستخدمون تجاربهم مع تطبيق هيتزنر الصارم لشروط الخدمة، بما في ذلك إيقاف الخوادم فورًا عند حدوث انتهاكات، مما أثار مخاوف بشأن موثوقية مزود الخدمة السحابية.",
      "أكدت المناقشة على مخاطر الاعتماد على مزود واحد وأهمية استخدام مزودين متعددين للنسخ الاحتياطي لضمان أمان البيانات."
    ],
    "points": 216,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1733744925
  },
  {
    "id": 42367649,
    "title": "ويلو، شريحتنا الكمية",
    "originLink": "https://blog.google/technology/research/google-willow-quantum-chip/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42367649",
    "commentBody": "",
    "originSummary": [
      "قدمت جوجل شريحة ويلو، وهي شريحة كمومية تمثل تقدمًا كبيرًا في تصحيح الأخطاء الكمومية وسرعة الحوسبة. أظهرت ويلو قدرتها من خلال تنفيذ عملية حسابية في أقل من خمس دقائق، وهي مهمة كانت ستستغرق حاسوبًا فائقًا 10 سكستيليون سنة، مما يشير إلى إمكانيتها في معالجة المشكلات المعقدة التي تتجاوز قدرات الحواسيب التقليدية. يُعتبر هذا التطور محوريًا لمستقبل الحواسيب الكمومية التجارية القابلة للتطبيق، مع تداعيات على ثورة صناعات مثل الطب والطاقة والذكاء الاصطناعي."
    ],
    "commentSummary": [
      "إعلان جوجل عن الشريحة الكمية، ويلو، التي تحتوي على أكثر من 100 كيوبت مع استقرار، يمثل علامة فارقة في الحوسبة الكمية. هذا التطور يمكن أن يؤثر على الذكاء الاصطناعي وأمن البيانات، حيث تشكل الحوسبة الكمية تحديات لطرق التشفير التقليدية. على الرغم من هذا الإنجاز، فإن التطبيقات العملية مثل خوارزمية شور تتطلب عددًا أكبر بكثير من الكيوبتات، مما يؤدي إلى ردود فعل متباينة بشأن التأثير الفوري للشريحة."
    ],
    "points": 209,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1733761703
  },
  {
    "id": 42368604,
    "title": "OpenAI: سورا",
    "originLink": "https://sora.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42368604",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أداة توليد الفيديو Sora من OpenAI تتلقى مراجعات متباينة بسبب التحديات في إنشاء محتوى دقيق، حيث تواجه التكنولوجيا الحالية للذكاء الاصطناعي صعوبة في التعامل مع التعليمات التفصيلية ودقة الحركة.",
      "الأداة غير متوفرة بعد في الاتحاد الأوروبي، وقد واجه إطلاقها مشاكل في الخوادم، مما أثر على تجربة المستخدم.",
      "بينما يقدر بعض المستخدمين الجدة والإمكانيات التي يوفرها المحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي، هناك مخاوف بشأن الجودة وهيكل التسعير، حيث يلاحظ البعض أنه يتخلف عن المنافسين."
    ],
    "points": 198,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1733767330
  }
]
