[
  {
    "id": 42669754,
    "title": "توقف عن محاولة تحديد موعد مكالمة معي",
    "originLink": "https://matduggan.com/stop-trying-to-schedule-a-call-with-me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42669754",
    "commentBody": "",
    "originSummary": [
      "غالبًا ما تؤدي تجارب الخدمات الجديدة إلى متابعات مستمرة ورسائل بريد إلكتروني تسويقية، مما يحول التواصل الأولي إلى عروض مبيعات لا هوادة فيها.",
      "غالبًا ما تكون عملية المبيعات مملة وتستغرق وقتًا طويلاً، خاصة في الشركات الكبيرة، حيث لا تلبي المنتجات التوقعات بشكل متكرر وتقدم دعمًا محدودًا.",
      "غالبًا ما ينتقل العملاء إلى بدائل مفتوحة المصدر أفضل، مما يؤدي إلى مغادرة هادئة من الخدمة الأصلية على الرغم من جهود الاحتفاظ."
    ],
    "commentSummary": [
      "يواجه أصحاب الشركات الناشئة الصغيرة تحديات عند التعامل مع الشركات الكبيرة، مثل العروض التوضيحية غير الضرورية، ومقارنات الأسعار، وعمليات الشراء الطويلة، مما يؤدي إلى زيادة التكاليف على الشركات الكبيرة. - غالبًا ما تكون عملية البيع غير فعالة، حيث تتضمن اجتماعات غير ضرورية وتكتيكات محبطة، مما يبرز الحاجة إلى الشفافية، والتواصل المباشر، والخيارات المرنة. - يتضمن النهج الناجح إنشاء خدمة سهلة التكامل، تُسعد العملاء، وتقدم نموذج تسعير بسيط، على الرغم من المشكلات الشائعة مثل الوثائق غير المقروءة والتكتيكات البيعية غير الأخلاقية."
    ],
    "points": 494,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1736637610
  },
  {
    "id": 42671472,
    "title": "Kenney.nl: أصول ألعاب مجانية",
    "originLink": "https://www.kenney.nl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42671472",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تُعرف Kenney.nl بتقديم أصول ألعاب عالية الجودة ومجانية، وهي مفيدة بشكل خاص لتطوير الألعاب والنماذج الأولية السريعة.",
      "لقد اكتسبت المنصة متابعة قوية، مما أكسب كيني لقب \"يسوع الأصول\" لمساهماته في مجتمع تطوير الألعاب.",
      "تشمل الموارد الإضافية لأصول الألعاب المجانية OpenGameArt.org و Itch.io، بينما يمكن العثور على الموسيقى الخالية من حقوق الملكية من فنانين مثل كيفن ماكليود وHeatly Bros."
    ],
    "points": 439,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1736659070
  },
  {
    "id": 42671512,
    "title": "الدليل المصور للحصول على درجة الدكتوراه",
    "originLink": "https://matt.might.net/articles/phd-school-in-pictures/?_nospa=true",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42671512",
    "commentBody": "",
    "originSummary": [
      "يُستخدم دليل مصور لشرح كيفية توسيع طلاب الدكتوراه الجدد لحدود المعرفة البشرية، والتي تُرمز إليها كأنها انبعاج صغير.",
      "تدعم عائدات الدليل المطبوع الأبحاث حول الاضطرابات الجينية، مدفوعة بالصلة الشخصية للمؤلف بحالة ابنه النادرة.",
      "الدليل مرخص بموجب رخصة المشاع الإبداعي، مما يسمح بالمشاركة مع الإسناد، وهو متاح بعدة لغات."
    ],
    "commentSummary": [
      "يؤكد دليل الدكتوراه المصور لمات مايت على أهمية متابعة مشكلة تحبها والسعي المستمر للمعرفة في رحلة الدكتوراه.",
      "تناقش المناقشة التحديات في الأوساط الأكاديمية، مثل الضغط للنشر وخطر إعطاء الأولوية للكمية على حساب الجودة في البحث.",
      "يسلط الدليل الضوء على قيمة تجربة الدكتوراه للنمو الشخصي وفرص العمل، مشددًا على أهمية اختيار المستشار المناسب واستكشاف العمل متعدد التخصصات."
    ],
    "points": 343,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1736659614
  },
  {
    "id": 42671105,
    "title": "لماذا اخترت لغة البرمجة Common Lisp",
    "originLink": "https://blog.djhaskin.com/blog/why-i-chose-common-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42671105",
    "commentBody": "",
    "originSummary": [
      "انتقل المؤلف من لغة Clojure إلى لغة Common Lisp بسبب الإحباطات من بطء أوقات بدء التشغيل لتطبيقات واجهة سطر الأوامر (CLI) في Clojure والشعور بعدم اهتمام المجتمع بذلك.",
      "تم اختيار لغة البرمجة Common Lisp لقدرتها على إنشاء ملفات تنفيذية مستقلة تبدأ بسرعة، وتوافقها مع محرر النصوص Vim، ودعمها عبر أنظمة التشغيل ويندوز وماك ولينكس، بالإضافة إلى مجتمعها القوي ونظامها البيئي المتكامل.",
      "يشارك المؤلف تجربته لمساعدة القادمين الجدد في فهم فوائد لغة البرمجة Common Lisp وكيف تكيفوا لاستخدامها بشكل فعال."
    ],
    "commentSummary": [
      "يسلط المؤلف الضوء على نظام Common Lisp الديناميكي، الذي يسمح بحل المشكلات حتى بدون الشيفرة المصدرية الأصلية، مما يبرز مرونته وقوته.",
      "يُشيد بـ SBCL، وهو تنفيذ لـ Common Lisp، لتمكينه من حل المشكلات بسرعة، حتى في السيناريوهات التي يكون فيها كود المصدر غير متاح.",
      "تتناول المناقشة أيضًا أهمية وحدود التحكم في الإصدارات، خاصة عندما يتم فقدان المستودع، وتشمل مقارنات بين لغة Lisp ولغات مثل Clojure وJulia."
    ],
    "points": 291,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1736653105
  },
  {
    "id": 42672790,
    "title": "سيتعلم مؤسسو الذكاء الاصطناعي الدرس المرير",
    "originLink": "https://lukaspetersson.com/blog/2025/bitter-vertical/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42672790",
    "commentBody": "",
    "originSummary": [
      "تاريخيًا، تفوقت الأساليب العامة للذكاء الاصطناعي على الأساليب المتخصصة، كما هو الحال في مجالات مثل التعرف على الكلام ورؤية الكمبيوتر. - يؤكد \"الدرس المر\" لريتشارد ساتون أن الأساليب العامة التي تستخدم الحوسبة أكثر فعالية من تلك التي تعتمد على المعرفة البشرية في المجال. - يقترح المنشور أن مؤسسي الذكاء الاصطناعي يجب أن يركزوا على إنشاء منتجات تستفيد من تحسينات النماذج بدلاً من التعويض عن قيود النماذج الحالية، حيث أن هذه استراتيجية أكثر استدامة."
    ],
    "commentSummary": [
      "تواجه الشركات الناشئة في مجال الذكاء الاصطناعي تحديًا أساسيًا في توفير السياق، حيث تتطلب أنظمة الذكاء الاصطناعي معلومات وخطوات محددة لتعمل بفعالية. - من المرجح أن تركز الشركات الناشئة الناجحة في مجال الذكاء الاصطناعي على عمليات ETL (استخراج، تحويل، تحميل) لتوفير السياق الضروري، مع التأكيد على أهمية بيانات التدريب وقدرات البحث. - قد يتطور قطاع الذكاء الاصطناعي بشكل مشابه لقطاع الهواتف الذكية، حيث تهيمن الشركات الكبيرة بسبب ملكية البيانات، لكن يمكن للشركات الناشئة أن تنجح من خلال تطوير نماذج متخصصة في مجالات معينة وإدارة تكامل الأنظمة المعقدة وإدارة البيانات."
    ],
    "points": 285,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1736680975
  },
  {
    "id": 42671427,
    "title": "آرون سوارتز وسام ألتمان",
    "originLink": "https://journa.host/@jeremiak/113811327999722586",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42671427",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "كان آرون شوارتز عبقريًا تقنيًا وناشطًا مشهورًا، حيث ساهم في مشاريع مثل RSS وMarkdown وCreative Commons، لكنه واجه تحديات قانونية بسبب تنزيله مقالات أكاديمية من JSTOR.",
      "تتناول المقالة مقارنة بين نشاط سوارز في مجال النشاط الاجتماعي ونجاح سام ألتمان في شركة OpenAI، مما يثير تساؤلات حول الشرعية والأخلاقيات في صناعة التكنولوجيا.",
      "تسلط المناقشة الضوء على وجهات النظر المختلفة حول المساهمات الإيجابية لكلا الفردين في ثقافة التكنولوجيا والتفاوت في المعاملة القانونية بين الأفراد والشركات."
    ],
    "points": 283,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1736658377
  },
  {
    "id": 42669637,
    "title": "الأشياء الواضحة التي يجب أن يقوم بها C",
    "originLink": "https://www.digitalmars.com/articles/Cobvious.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42669637",
    "commentBody": "",
    "originSummary": [
      "لقد قامت مجتمع Dlang بدمج مترجم C داخل مترجم D، المعروف باسم ImportC، لمعالجة القضايا غير المحلولة في معيار C، الذي وصل الآن إلى C23. - يتيح ImportC تنفيذ الوظائف في وقت الترجمة، مما يسهل اختبار الوحدات في وقت الترجمة دون الحاجة إلى بناءات منفصلة. - كما يدعم الإشارة الأمامية واستيراد التصريحات دون الحاجة إلى ملفات .h، مما يبسط عملية التطوير."
    ],
    "commentSummary": [
      "تُميز ملفات الرأس في لغة C بين الواجهات العامة والخاصة، وهو ما يقدره بعض المطورين لبساطته وسهولة استخدامه. - توفر الأدوات الحديثة مثل `cargo doc` في لغة Rust إدارة فعالة للتوثيق والواجهات دون تكرار الكود، مما يجذب آخرين. - يعتمد الاختيار بين هذه الأساليب غالبًا على التفضيلات الشخصية واحتياجات المشروع وسير العمل في الفريق."
    ],
    "points": 225,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1736636302
  },
  {
    "id": 42668953,
    "title": "أكثر سماء العالم ظلمة ووضوحًا في خطر بسبب مشروع صناعي ضخم",
    "originLink": "https://www.eso.org/public/news/eso2501/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42668953",
    "commentBody": "",
    "originSummary": [
      "المرصد الأوروبي الجنوبي (ESO) قلق بشأن مجمع صناعي مقترح من قبل AES Andes بالقرب من مرصد بارانال في تشيلي، والذي قد يتسبب في تلوث ضوئي يؤثر على الأبحاث الفلكية. - مرصد بارانال مهم لمشاريع مثل التلسكوب الكبير للغاية (ELT)، مما يبرز أهمية الحفاظ على السماء المظلمة. - ESO يدعو إلى نقل المشروع الصناعي لحماية بيئة المرصد."
    ],
    "commentSummary": [
      "يهدف مشروع صناعي ضخم في تشيلي، بقيادة شركة AES Andes، إلى إنتاج الهيدروجين والكهرباء والأمونيا باستخدام طاقة الرياح والطاقة الشمسية، مما قد يؤثر على أظلم وأصفى سماء في العالم.",
      "يعبر النقاد عن قلقهم من أن المشروع، الذي يقع بالقرب من موقع تلسكوب رئيسي، قد يعيق الملاحظات الفلكية، مما يثير جدلاً حول ما إذا كان ينبغي نقل المشروع.",
      "تؤكد الحالة على الصراع بين التنمية الصناعية والحفاظ على الموارد الطبيعية الفريدة، حيث يدعو البعض إلى الفوائد الاقتصادية بينما يفضل آخرون الحفاظ على البيئة."
    ],
    "points": 212,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1736629866
  },
  {
    "id": 42674116,
    "title": "تفاحة سيئة لكنها 6,500 تعبير منتظم أبحث عنها في فيم",
    "originLink": "https://eieio.games/blog/bad-apple-with-regex-in-vim/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42674116",
    "commentBody": "",
    "originSummary": [
      "تم إعادة إنشاء فيديو \"Bad Apple\" في محرر النصوص Vim باستخدام استعلامات البحث، حيث تم تمثيل كل من الإطارات الـ 6,500 كشبكة بحجم 120x90 من الأرقام الثنائية.",
      "تم استخدام بايثون لمعالجة الإطارات، وتم اختبار خوارزميات مختلفة لتحسين سلاسل البحث لأداء أفضل في فيم.",
      "كان المشروع تجربة إبداعية أُجريت في مركز Recurse، حيث تم عرض استخدام وحدات ماكرو Vim لتشغيل الفيديو من خلال التنقل عبر أنماط البحث."
    ],
    "commentSummary": [
      "مشروع يستخدم 6,500 تعبير منتظم (regexes) في برنامج Vim لتحريك \"Bad Apple\" أثار نقاشًا حيويًا، مما أظهر براعة إبداعية وتقنية.",
      "شارك المشاركون في مشاريع مشابهة، مثل تشغيل \"Bad Apple\" على نظام نينتندو إنترتينمنت (NES) واستخدام ماكرو Vim، مما يبرز التحديات الخوارزمية والعروض التقنية.",
      "كما تناولت المحادثة التأثير الثقافي لأغنية \"Bad Apple\" واشتملت على مناقشات حول محتوى ألعاب Touhou، مما يعكس آراء واهتمامات متنوعة."
    ],
    "points": 199,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1736694794
  },
  {
    "id": 42670132,
    "title": "أضافت ميزة إزالة الذكاء الاصطناعي في أدوبي لايت روم عملة بيتكوين إلى صورة طائر في الطيران.",
    "originLink": "https://bsky.app/profile/matthewraifman.bsky.social/post/3lfaqbygva22j",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42670132",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أدخلت ميزة إزالة الذكاء الاصطناعي في Adobe Lightroom عن طريق الخطأ صورة لعملة بيتكوين في صورة طائر، مما أثار مناقشات حول تأثير الذكاء الاصطناعي في التصوير الفوتوغرافي. - انتقد المستخدمون تأثير \"الوميض\" للذكاء الاصطناعي، مفضلين الصورة الأصلية، مما يبرز التحديات في التصوير الرقمي، مثل إدارة النقاط البارزة المقطوعة وقيود أدوات الذكاء الاصطناعي. - يسلط هذا الحادث الضوء على مخاوف أوسع بشأن دور الذكاء الاصطناعي في الأدوات الإبداعية وجودة المحتوى الذي يولده الذكاء الاصطناعي."
    ],
    "points": 193,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1736642018
  },
  {
    "id": 42672675,
    "title": "مولينويغ يغلق فريق الاستدامة في ووردبريس، مما يشعل ردود فعل غاضبة",
    "originLink": "https://www.therepository.email/mullenweg-shuts-down-wordpress-sustainability-team-igniting-backlash",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42672675",
    "commentBody": "",
    "originSummary": [
      "قام مات مولينويج، المؤسس المشارك لـ WordPress، بحل فريق الاستدامة الخاص بـ WordPress، مما أدى إلى رد فعل عنيف كبير من المجتمع.",
      "تم حل الفريق بعد استقالة ممثل الفريق ثيس بويز، الذي أشار إلى مشاكل في القيادة، وادعاء مولينويج بأن الفريق لم يكن يحقق أهدافه.",
      "اتهم النقاد مولينويغ بالنفاق، حيث دعم في البداية تشكيل الفريق، وقد أثار التفكك مخاوف بشأن مستقبل مبادرات الاستدامة داخل ووردبريس."
    ],
    "commentSummary": [
      "قام مات مولينويج بحل فريق الاستدامة في ووردبريس، مما أدى إلى انتقادات ومخاوف بشأن التأثير على علامة ووردبريس التجارية والمجتمع.",
      "ينتقد النقاد السيطرة الكبيرة لمولينويج على ووردبريس باعتبارها مشكلة، مشيرين إلى الحاجة المحتملة لتغييرات في الحوكمة.",
      "كان الفريق الذي تم حله يعمل على مبادرات مثل إضافة تتبع البصمة الكربونية، مما أثار تساؤلات حول التزام ووردبريس بالاستدامة واستقرار القيادة."
    ],
    "points": 160,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1736679715
  },
  {
    "id": 42670468,
    "title": "عناوين IP حتى عام 2024",
    "originLink": "https://www.potaroo.net/ispcol/2025-01/addr2024.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42670468",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة التي كتبها جيف هيوستن تحديثًا سنويًا حول عناوين IP، مع التركيز على الانتقال البطيء من IPv4 إلى IPv6 على الرغم من الحاجة المتوقعة لمساحة عناوين أكبر.",
      "يتناول استنفاد عناوين IPv4، ودور نقل العناوين، والتحديات في تبني IPv6، مسلطًا الضوء على التجزئة وديناميكيات السوق لعناوين IPv4.",
      "تتناول المقالة اتجاهات تخصيص IPv6، مشيرة إلى الاختلافات الإقليمية وتأثير التخصيصات الكبيرة، وتنعكس على الآثار الأوسع لمستقبل الإنترنت، بما في ذلك حيادية الشبكة وتوحيد السوق."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على اتساع مساحة عناوين IPv6 مقارنة بـ IPv4، مشيرة إلى أن IPv6 يوفر عددًا أكبر بكثير من العناوين. - تُثار مخاوف بشأن ممارسات التخصيص غير الفعالة، حيث تحصل الشركات الكبرى على كتل IPv6 كبيرة بشكل مفرط، مما قد يؤدي إلى نقص في المستقبل. - تُناقش التحديات في تبني IPv6، بما في ذلك القيود التقنية وتردد الشركات في السماح بالاتصالات المباشرة بين الأجهزة، إلى جانب القضايا المستمرة مع ندرة IPv4 وديناميكيات تسعير السوق."
    ],
    "points": 145,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1736645950
  }
]
