[
  {
    "id": 42334327,
    "title": "العدد الصحيح للإعلانات هو صفر",
    "originLink": "https://manuelmoreale.com/the-correct-amount-of-ads-is-zero",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42334327",
    "commentBody": "",
    "originSummary": [
      "قدمت ذا فيرج نموذج اشتراك مع نسخة محجوبة، تقدم فوائد مثل خلاصات RSS النصية الكاملة للمشتركين.",
      "يهدف الاشتراك إلى تقليل التعرض للإعلانات، ولكن هناك انتقادات بأن المشتركين الذين يدفعون يجب ألا يروا أي إعلانات على الإطلاق.",
      "تُثار مخاوف بشأن احتمال بيع البيانات للمعلنين، مما يشير إلى أنه لا ينبغي أن يكون المشتركون عرضة للإعلانات وتحقيق الدخل من البيانات في الوقت نفسه."
    ],
    "commentSummary": [
      "يدور النقاش حول الإعلانات في وسائل الإعلام حول ضرورتها، حيث يرى البعض أنها ضرورية لتنويع الإيرادات وتقليل التكاليف، بينما يدعو آخرون إلى تجربة خالية من الإعلانات للمشتركين الذين يدفعون.",
      "يسلط النقاد الضوء على قضايا الخصوصية والطبيعة التدخلية للإعلانات عبر الإنترنت مقارنة بالإعلانات المطبوعة التقليدية، مما يثير القلق بشأن تجربة المستهلك ونزاهة وسائل الإعلام.",
      "تشمل المناقشة استدامة النماذج المدعومة بالإعلانات وتستكشف طرق تمويل بديلة مثل الاشتراكات أو الدعم المباشر من خلال منصات مثل باتريون."
    ],
    "points": 760,
    "commentCount": 502,
    "retryCount": 0,
    "time": 1733443347
  },
  {
    "id": 42336553,
    "title": "مشكلة الـ 70%: حقائق صعبة حول البرمجة بمساعدة الذكاء الاصطناعي",
    "originLink": "https://addyo.substack.com/p/the-70-problem-hard-truths-about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42336553",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يمكن لأدوات البرمجة المدعومة بالذكاء الاصطناعي توليد الشيفرة بسرعة، بشكل مشابه للمطورين المبتدئين، ولكنها غالبًا ما تتطلب مراجعة دقيقة من قبل المطورين ذوي الخبرة بسبب الأخطاء المتكررة.",
      "في حين أن أدوات الذكاء الاصطناعي تتفوق في التعامل مع المهام المتكررة وتقديم مسودات أولية للشفرة، إلا أنها تواجه صعوبة في حل المشكلات المعقدة والإبداع، مما يحد من قدرتها على استبدال المبرمجين البشريين بشكل كامل.",
      "يمثل دمج أدوات الذكاء الاصطناعي في سير العمل التطويري تحديًا: تعزيز التعلم والإنتاجية دون عرقلة تطوير مهارات حل المشكلات الأساسية."
    ],
    "points": 495,
    "commentCount": 374,
    "retryCount": 0,
    "time": 1733461871
  },
  {
    "id": 42334323,
    "title": "مطار بورتلاند يتوسع بسقف واسع من الخشب الضخم",
    "originLink": "https://design-milk.com/portland-airport-grows-with-expansive-mass-timber-roof-canopy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42334323",
    "commentBody": "",
    "originSummary": [
      "قام مطار بورتلاند (PDX) بتوسيع مبناه الرئيسي بإضافة سقف مظلة مصنوع من الخشب المستدام، صممته شركة ZGF، باستخدام خشب دوغلاس فير المصفح محلي المصدر.",
      "تهدف المظلة التي تمتد على مساحة تسعة أفدنة إلى تعزيز قدرة المطار وتجربة الركاب مع تقليل البصمة الكربونية، من خلال دمج عناصر بيولوجية لإضفاء جو مرحب.",
      "يضع هذا المشروع معيارًا جديدًا لتصميم المطارات المستدامة، ومن المتوقع الانتهاء منه في عام 2026."
    ],
    "commentSummary": [
      "قدمت مطار بورتلاند سقفًا جديدًا من الخشب الضخم، الذي يعزز الضوء الطبيعي ويرفع السقف، كجزء من مشروع تجديد متعدد المراحل.",
      "يُقدَّر التصميم لجمالياته وتحسيناته الصوتية، لكن بعض المستخدمين يبلغون عن ارتباك في العثور على الطريق.",
      "يُعتبر استخدام الخشب خيارًا مستدامًا في البناء، رغم وجود مناقشات حول تأثيره على انبعاثات الكربون، مما يثير مقارنات مع مطارات حديثة أخرى ذات طابع طبيعي."
    ],
    "points": 377,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1733443313
  },
  {
    "id": 42334697,
    "title": "مجلس إدارة إنتل، ومثال على فشل المجالس وقصر النظر",
    "originLink": "https://www.fabricatedknowledge.com/p/the-death-of-intel-when-boards-fail",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42334697",
    "commentBody": "",
    "originSummary": [
      "يُصور خروج بات جيلسنجر من إنتل على أنه إقالة بدلاً من تقاعد، مما يبرز إخفاقات مجلس الإدارة وتركيزه على الأهداف قصيرة الأجل بدلاً من الاستراتيجية طويلة الأجل. وقد تعرض مجلس الإدارة لانتقادات بسبب نقص الخبرة في مجال أشباه الموصلات وتركيزه على القيمة الفورية للمساهمين، مما قد يضر بآفاق إنتل طويلة الأجل وصناعة أشباه الموصلات في الولايات المتحدة. يشير فشل مجلس الإدارة في دعم استراتيجية IDM 2.0 لجيلسنجر إلى تحول نحو بيع أجزاء من الشركة، مما قد يفيد المساهمين على المدى القصير ولكنه قد يضر بمستقبل إنتل."
    ],
    "commentSummary": [
      "واجه مجلس إدارة إنتل انتقادات لافتقاره إلى الخبرة التقنية وتفضيله المكاسب قصيرة الأجل، وهو ما يعتقد البعض أنه ساهم في الصعوبات الأخيرة التي تواجهها الشركة.",
      "بات جيلسنجر، الرئيس التنفيذي الحالي، يُنظر إليه على أنه قادر ولكن يُقال إنه يفتقر إلى الدعم الكافي من مجلس الإدارة، الذي ركز تاريخياً بشكل أكبر على الأرباح الموزعة ومصالح المساهمين بدلاً من الابتكار.",
      "هناك دعوات لإحداث تحول ثقافي داخل شركة إنتل، مع التأكيد على الحاجة إلى تحسين التوافق مع الأهداف طويلة الأجل لضمان مستقبل الشركة."
    ],
    "points": 320,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1733445863
  },
  {
    "id": 42336207,
    "title": "Trailbase: خادم تطبيق مفتوح المصدر وسريع ومكون من ملف واحد، تم بناؤه باستخدام لغة Rust وقاعدة بيانات SQLite",
    "originLink": "https://github.com/trailbaseio/trailbase",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42336207",
    "commentBody": "",
    "originSummary": [
      "TrailBase هو خادم تطبيقات مفتوح المصدر مصمم لتوفير واجهات برمجة تطبيقات سريعة وآمنة من النوع، باستخدام Rust وSQLite وV8، وهو مناسب لتطبيقات الجوال أو الويب أو سطح المكتب.",
      "يوفر زمن انتقال أقل من المللي ثانية، مما يلغي الحاجة إلى التخزين المؤقت المخصص، ويدعم منصات مختلفة مع حزم ثنائية جاهزة وحزم عملاء متاحة لنظامي التشغيل لينكس وماك أو إس والعديد من لغات البرمجة.",
      "يتم ترخيص TrailBase بموجب OSL-3.0، مما يسمح باستخدامه كإطار عمل دون متطلبات ترخيص إضافية، ويتم تشجيع المساهمات من المجتمع."
    ],
    "commentSummary": [
      "Trailbase هو خادم تطبيق مفتوح المصدر وسريع ومكون من ملف واحد، تم تطويره باستخدام لغة Rust وSQLite، وقد أثار مناقشات حول أمانه، خاصة فيما يتعلق بمخاطر حقن SQL. - اقترح المستخدمون تحسينات مثل استخدام العبارات المحضرة أو سلاسل القوالب الموسومة لتعزيز أمان استعلامات SQL، وقارنوا Trailbase بمشاريع مماثلة مثل Pocketbase وSupabase. - على الرغم من بعض المخاوف بشأن وضوح الوثائق والنقاشات حول الترخيص، فقد تم استقبال Trailbase بشكل إيجابي لإمكاناته والمقارنات المحترمة مع المشاريع الأخرى."
    ],
    "points": 271,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1733457619
  },
  {
    "id": 42333052,
    "title": "تعيين بيل ستابلز كرئيس تنفيذي جديد لشركة Gitlab",
    "originLink": "https://www.businesswire.com/news/home/20241205391064/en/GitLab-Names-Bill-Staples-as-New-CEO",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42333052",
    "commentBody": "",
    "originSummary": [
      "عينت GitLab بيل ستابلز كرئيس تنفيذي جديد، بينما انتقل المؤسس المشارك سيد سيجبيراندي إلى منصب رئيس مجلس الإدارة التنفيذي لأسباب صحية.",
      "يجلب ستابلز، الذي كان يشغل سابقًا منصب الرئيس التنفيذي في شركة نيو ريليك، خبرة واسعة في منصات المطورين إلى جيت لاب، وهي منصة بارزة في مجال DevSecOps المدعومة بالذكاء الاصطناعي.",
      "تخدم GitLab أكثر من 10,000 عميل، وتحقق إيرادات تزيد عن 750 مليون دولار، وتُعتبر موثوقة من قبل أكثر من 40 مليون مستخدم، بما في ذلك أكثر من نصف شركات Fortune 100."
    ],
    "commentSummary": [
      "عينت GitLab بيل ستابلز كرئيس تنفيذي جديد، خلفًا لسيد سيجبيراندي، الذي يتنحى للتركيز على علاجه من السرطان.",
      "يشير التغيير في القيادة إلى تحول استراتيجي في GitLab من نهج يركز على المطورين إلى استهداف مبيعات الشركات، حيث يمتلك ستابلز خبرة في إعداد الشركات للاستحواذ.",
      "أثار التعيين مناقشات حول مستقبل GitLab، والبيع المحتمل، والمنافسة مع GitHub، إلى جانب مخاوف المستخدمين بشأن التسعير وتركيز المنتج."
    ],
    "points": 251,
    "commentCount": 218,
    "retryCount": 0,
    "time": 1733434610
  },
  {
    "id": 42337980,
    "title": "استعادت محطات الطاقة النووية الثلاث في أوكرانيا إنتاج الكهرباء",
    "originLink": "https://www.iaea.org/newscenter/pressreleases/update-263-iaea-director-general-statement-on-situation-in-ukraine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42337980",
    "commentBody": "",
    "originSummary": [
      "استأنفت محطات الطاقة النووية في أوكرانيا إنتاج الكهرباء بعد الهجمات الأخيرة على الشبكة، مما يبرز أهمية توفير إمدادات طاقة مستقرة لضمان السلامة النووية.",
      "الوكالة الدولية للطاقة الذرية (IAEA) تراقب الوضع في أوكرانيا بنشاط، مما يؤكد التزامها بالسلامة والأمن النووي.",
      "تم توفير معدات تزيد قيمتها عن 14 مليون يورو لأوكرانيا لتعزيز إجراءات السلامة والأمن النووي."
    ],
    "commentSummary": [
      "استأنفت محطات الطاقة النووية في أوكرانيا إنتاج الكهرباء، مما يظهر قدرتها على الصمود رغم الصراع المستمر.",
      "عادةً ما يتم حل انقطاعات الكهرباء في غضون 48 ساعة، مما يبرز كفاءة إدارة شبكة الكهرباء في أوكرانيا وقدراتها على الإصلاح.",
      "يبرز استخدام الحلول البديلة، مثل بطاريات العاكس الشمسي، من قبل السكان والشركات القدرة على التكيف في الحفاظ على العمليات أثناء انقطاع التيار الكهربائي."
    ],
    "points": 213,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1733477072
  },
  {
    "id": 42340346,
    "title": "حملة اختراق مأجورة مزعومة من إكسون موبيل تستهدف نشطاء المناخ",
    "originLink": "https://www.vulnu.com/p/inside-exxonmobils-alleged-hack-for-hire-campaign-targeting-climate-activists",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42340346",
    "commentBody": "",
    "originSummary": [
      "تُتهم شركة إكسون موبيل بتنظيم حملة قرصنة مأجورة تُعرف باسم \"فوكس هانت\"، استهدفت أكثر من 500 ناشط في مجال المناخ وصحفي باستخدام قدرات سيبرانية متقدمة.",
      "العملية زُعم أنها تضمنت هجمات تصيد واحتيال وتسريب رسائل بريد إلكتروني لتقويض دعاة البيئة ودعم استراتيجيات إكسون القانونية، رغم نفي الشركة تورطها.",
      "تؤكد هذه الحالة على الاتجاه المتزايد للحرب الرقمية في النزاعات التجارية، مما يدفع مكتب التحقيقات الفيدرالي إلى إجراء تحقيقات ويدعو إلى اتخاذ تدابير قانونية أقوى لمكافحة مثل هذه العمليات السيبرانية."
    ],
    "commentSummary": [
      "تُتهم شركة إكسون موبيل بتنظيم حملة قرصنة مستأجرة تستهدف نشطاء المناخ ومنظمة \"فايت فور ذا فيوتشر\" التي تدافع عن حيادية الإنترنت.",
      "تم التعرف لاحقًا على الهجوم، الذي كان يُعتقد في البداية أنه عشوائي، كمحاولة للوصول إلى الاتصالات الداخلية، مما دفع المنظمة إلى تبني سياسة احتفاظ بالبريد الإلكتروني لمدة 3 أشهر للحماية.",
      "يؤكد الحادث على ضرورة المساءلة وفرض لوائح أكثر صرامة على سوء السلوك المؤسسي، مع وجود روابط محتملة لمزود خدمة إنترنت أمريكي رئيسي أو مجموعة الضغط التابعة له."
    ],
    "points": 198,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1733496896
  },
  {
    "id": 42339048,
    "title": "فرق كاجي",
    "originLink": "https://blog.kagi.com/kagi-teams",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42339048",
    "commentBody": "",
    "originSummary": [
      "كاجي للفرق، المقرر إطلاقه في 5 ديسمبر 2024، يوفر للشركات أداة بحث وذكاء اصطناعي تركز على الخصوصية، مع التأكيد على عدم وجود إعلانات أو تتبع أو جمع للبيانات.",
      "تشمل الخدمة محرك بحث متميز ووصولاً عالميًا للذكاء الاصطناعي، مع تسعير مرن يعتمد على المستخدمين النشطين، وتقديم خطط احترافية ونهائية.",
      "تعد كاجي بإعداد سريع، ودعم متاح، وعائد استثمار كبير من خلال تقليل أوقات البحث، مما يضمن خصوصية البيانات للشركات."
    ],
    "commentSummary": [
      "يُشيد بمحرك البحث Kagi Teams لنتائجه البحثية عالية الجودة والخالية من الإعلانات، مما يوفر تجربة أنظف مقارنةً بجوجل.",
      "بعض المستخدمين على استعداد لدفع 120 دولارًا سنويًا مقابل Kagi، حيث يقدرون قدرتها على تصفية الإعلانات والاحتيالات، لكن هناك مخاوف بشأن استخدامها لمحرك البحث Yandex، وهو محرك بحث روسي له صلات بالكرملين.",
      "كما تقدم Kagi تكاملات الذكاء الاصطناعي وخطة فريق للشركات، على الرغم من أن الارتباط مع Yandex لا يزال مصدر قلق كبير لبعض المستخدمين."
    ],
    "points": 178,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1733486960
  },
  {
    "id": 42331660,
    "title": "قضيت عامًا في بناء دورة تدريبية على نظام أندرويد لكبار السن",
    "originLink": "https://kopiascsaba.hu/blog/teaching-elderly-people-to-use-android/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42331660",
    "commentBody": "",
    "originSummary": [
      "قام المؤلف بتطوير دورة فيديو لتعليم الأفراد المسنين كيفية استخدام الهواتف الذكية التي تعمل بنظام أندرويد، مع معالجة التحديات الشائعة مثل الخوف من الواجهات ونقص المهارات الأساسية مثل التمرير أو السحب.",
      "تتضمن الدورة نصًا مكونًا من 400 صفحة، وتسجيلات فيديو، وتطبيق أندرويد يحتوي على تمارين، تم استضافتها في البداية على منصة Udemy ثم نُقلت لاحقًا إلى موقع إلكتروني مخصص يُسمى \"Smartphone How-To\".",
      "تسويق الدورة يمثل تحديًا بسبب صعوبات الجمهور المستهدف في التسجيل والدفع عبر الإنترنت، ويبحث المؤلف عن ملاحظات لتحسين الوضع."
    ],
    "commentSummary": [
      "تم تطوير دورة أندرويد خصيصًا لكبار السن لمساعدتهم في استخدام الهواتف الذكية الأساسية، وحصلت على تقييمات إيجابية على منصة Udemy رغم بعض التحديات. أشارت التعليقات إلى مشكلات مثل تحذيرات الكوكيز والارتباك بشأن الاشتراكات، مع اقتراحات لتبسيط المحتوى وضم تطبيقات شائعة مثل واتساب. قد تتضمن التحسينات المستقبلية ترجمات ومعالجة قضايا الوصول لدعم كبار السن بشكل أفضل في التنقل عبر الهواتف الذكية والموارد عبر الإنترنت."
    ],
    "points": 178,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1733426673
  },
  {
    "id": 42332352,
    "title": "ستدفع وحدة ماكينزي 123 مليون دولار لتسوية دعاوى تتعلق برشوة مسؤولين في جنوب أفريقيا",
    "originLink": "https://www.cnbc.com/2024/12/05/mckinsey-bribery-settlement-south-africa.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42332352",
    "commentBody": "",
    "originSummary": [
      "وافقت شركة تابعة لشركة ماكينزي وشركاه على دفع 123 مليون دولار لتسوية اتهامات برشوة مسؤولين في جنوب أفريقيا، وفقًا لما ذكرته وزارة العدل الأمريكية.",
      "أسفرت خطة الرشوة التي تورطت فيها شركة ماكينزي أفريقيا عن تحقيق أرباح بقيمة 85 مليون دولار من خلال عقود مع شركات المرافق التي تسيطر عليها الدولة.",
      "اعترف الشريك السابق في شركة ماكينزي، فيكاس ساجار، بالذنب في تهم التآمر بموجب قانون الممارسات الأجنبية الفاسدة، ووافقت ماكينزي أفريقيا على اتفاقية تأجيل الملاحقة القضائية لمدة ثلاث سنوات، متعهدة بتعزيز إجراءات الامتثال."
    ],
    "commentSummary": [
      "وافقت شركة ماكينزي على دفع 123 مليون دولار لتسوية اتهامات برشوة مسؤولين في جنوب أفريقيا، مما يبرز المخاوف بشأن الفساد داخل شركات الاستشارات.",
      "يثير التسوية مناقشات حول فعالية العقوبات المالية كوسيلة ردع ومساءلة الشركات الكبرى.",
      "تسلط القضية الضوء على قضايا أوسع تتعلق بالفساد في الأعمال والحكومة، مع احتمالات تأثيرها على التجارة الدولية والتنظيم."
    ],
    "points": 171,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1733430283
  },
  {
    "id": 42341388,
    "title": "لاما-3.3-70B-إينستركت",
    "originLink": "https://huggingface.co/meta-llama/Llama-3.3-70B-Instruct",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42341388",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "قامت شركة ميتا بفتح مصدر Llama-3.3-70B-Instruct، في خطوة لجعل الذكاء الاصطناعي أكثر سهولة وتعزيز منصاتها الاجتماعية.",
      "النموذج يتمتع بقدرة تنافسية مع Llama 3.2 405B وأكثر فعالية من حيث التكلفة مقارنة بـ GPT-4o، مما يوفر للمطورين أدوات قوية للتخصيص.",
      "بينما تُعتبر نماذج Llama مفتوحة، إلا أنها تحتوي على قيود تجارية، مما يشير إلى جهد استراتيجي لمواجهة هيمنة OpenAI والاستفادة من مجتمع الذكاء الاصطناعي."
    ],
    "points": 161,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1733503496
  },
  {
    "id": 42340065,
    "title": "قم بتثبيت postmarketOS على هاتف أندرويد واستخدم Docker كخادم منزلي",
    "originLink": "https://crackoverflow.com/docs/system_administration/containerization/install-docker-natively-on-android-phone-and-use-it-as-a-home-server/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42340065",
    "commentBody": "",
    "originSummary": [
      "يشرح الدليل كيفية تثبيت Docker على هاتف OnePlus 6T باستخدام نظام postmarketOS، مما يحوله بشكل فعال إلى خادم منزلي، ولكنه يمحو جميع بيانات الهاتف.",
      "تشمل المتطلبات الأساسية وجود هاتف OnePlus 6 أو 6T، وبرنامج Fastboot على جهاز الكمبيوتر، وملفات postmarketOS، مع خطوات تتضمن تفعيل وضع المطور، وتثبيت postmarketOS، وإعداد SSH.",
      "بينما يوفر هذا الإعداد بديلاً عن Raspberry Pi مع شاشة وبطارية مدمجتين، إلا أنه يفتقر إلى دعم Ethernet ويقتصر على التخزين الداخلي."
    ],
    "commentSummary": [
      "تستكشف المقالة استخدام نظام التشغيل postmarketOS، وهو نظام تشغيل يعتمد على لينكس، على هواتف أندرويد لإعادة توظيفها كخوادم منزلية باستخدام Docker، مما يوفر بيئة أكثر استقرارًا من أندرويد. - تؤكد المقالة على مزايا postmarketOS أو Mobian لتعزيز أمان النواة ودعم الأجهزة القديمة، مثل OnePlus 6/6T، مع معالجة المخاوف بشأن عمر البطارية والتشغيل المستمر. - تتضمن المناقشة قيود استخدام musl (مكتبة C القياسية خفيفة الوزن) بدلاً من glibc (مكتبة GNU C)، والفكرة المبتكرة لاستخدام الهواتف القديمة كخوادم."
    ],
    "points": 155,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1733494997
  },
  {
    "id": 42338327,
    "title": "هاكر هيرالد - مثل HN ولكن مع صور وعناوين فرعية من مصادر جماهيرية",
    "originLink": "https://hackerherald.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42338327",
    "commentBody": "",
    "originSummary": [
      "أطلق المؤلف، إلى جانب المدرب السابق أرناف والطالب أرتشيس، مشروعًا يسمى Hacker Herald، وهو واجهة أمامية لموقع Hacker News. تم تطوير المشروع خلال دورة برمجة جافا سكريبت عبر الإنترنت ويهدف إلى توفير تصميم مرئي جذاب مشابه لمواقع الصحف الشهيرة. يهدف تضمين العناصر المرئية، مثل الصور، إلى تعزيز تجربة السرد من خلال توفير سياق فوري دون الحاجة إلى النقر على المقالات."
    ],
    "commentSummary": [
      "هكر هيرالد هو مشروع جديد مستوحى من هكر نيوز، يقدم تصميمًا يشبه الصحيفة مع صور وعناوين فرعية يتم جمعها من الجمهور لأخبار التكنولوجيا.",
      "تلقى المشروع ردود فعل متباينة، حيث يقدر بعض المستخدمين الجاذبية البصرية، بينما يفضل آخرون بساطة تنسيق Hacker News الأصلي.",
      "تم إثارة مخاوف بشأن أصالة الصور وقضايا الخصوصية الناتجة عن الربط الساخن، مع اقتراحات لتحسينات مثل إضافة البحث، والفئات، والروابط الدائمة."
    ],
    "points": 153,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1733480554
  },
  {
    "id": 42332129,
    "title": "تقول حكومة الكونغو إنها 'في حالة تأهب' بسبب مرض غامض يشبه الإنفلونزا أودى بحياة العشرات",
    "originLink": "https://www.ctvnews.ca/health/congo-government-says-it-s-on-alert-over-mystery-flu-like-disease-that-killed-dozens-1.7134550",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42332129",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "حكومة الكونغو في حالة تأهب قصوى بسبب مرض غامض يشبه الإنفلونزا أدى إلى وفاة العشرات، مما أثار القلق بشأن طبيعته وأصله.",
      "يبحث الخبراء في احتمالات مختلفة، بما في ذلك كونه مرضًا متوطنًا، أو مرضًا معديًا ناشئًا، أو مسببًا مرضيًا جديدًا، مع إجراء اختبارات لتحديد السبب.",
      "المنطقة المتضررة معروفة بسوء التغذية، مما قد يزيد من حدة التأثير، ولكن لا يوجد حاليًا دليل على انتقال سريع أو واسع النطاق."
    ],
    "points": 151,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1733429179
  }
]
