[
  {
    "id": 42344002,
    "title": "मेरे बिना नौकरी के दूसरा साल",
    "originLink": "https://shilin.ca/my-second-year-without-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42344002",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 381,
    "commentCount": 567,
    "retryCount": 0,
    "time": 1733516765
  },
  {
    "id": 42343089,
    "title": "संवाद तत्व",
    "originLink": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/dialog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343089",
    "commentBody": "",
    "originSummary": [
      "HTML `` तत्व का उपयोग संवाद बॉक्स बनाने के लिए किया जाता है, जो कि मोडल (पृष्ठ इंटरैक्शन को रोकते हुए) या गैर-मोडल (इंटरैक्शन की अनुमति देते हुए) हो सकते हैं।",
      "जावास्क्रिप्ट विधियाँ `.showModal()` और `.show()` का उपयोग क्रमशः मोडल और गैर-मोडल संवाद प्रदर्शित करने के लिए किया जाता है, जबकि `.close()` का उपयोग उन्हें बंद करने के लिए किया जाता है।",
      "पहुँचनीयता महत्वपूर्ण है; सुनिश्चित करें कि फोकस सही ढंग से सेट किया गया है और एक समापन तंत्र प्रदान करें, जैसे कि एक बटन, जबकि CSS `::backdrop` का उपयोग करके मोडल बैकड्रॉप्स के लिए स्टाइलिंग करें।"
    ],
    "commentSummary": [
      "डेवलपर.mozilla.org पर डायलॉग तत्व ने इंटरैक्टिव HTML तत्वों के उपयोग के बारे में एक बहस शुरू की है, जैसे कि फाइल पिकर्स और मीडिया प्लेयर्स, जिनके बारे में ब्राउज़रों में उनकी संगति और पूर्वानुमानिता पर विभिन्न राय हैं।",
      "जब कुछ डेवलपर्स डायलॉग तत्व की आलोचना करते हैं कि यह बिना स्टाइल का होता है और मूल पॉपअप की तरह कार्य नहीं करता, तो अन्य इसके अर्थपूर्ण और पहुंच संबंधी लाभों को महत्व देते हैं।",
      "चर्चा में डिज़ाइन की स्थिरता बनाए रखने में चुनौतियों और विज्ञापनदाताओं द्वारा संभावित दुरुपयोग की चिंताओं को उजागर किया गया है, यह दर्शाते हुए कि संवाद तत्व एक प्रगतिशील कदम है लेकिन अभी भी सुधार की आवश्यकता है।"
    ],
    "points": 295,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733512147
  },
  {
    "id": 42343121,
    "title": "Maps.me के सह-संस्थापक ने ऑर्गेनिक मैप्स ओपन-सोर्स फोर्क को बंद करने की कोशिश की",
    "originLink": "https://github.com/orgs/organicmaps/discussions/9837",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343121",
    "commentBody": "",
    "originSummary": [
      "ऑर्गेनिक मैप्स ने अपने \"मेटासर्वर\" का स्रोत कोड जारी किया है, जो उपयोगकर्ताओं को उनके स्थान के आधार पर सर्वश्रेष्ठ कंटेंट डिलीवरी नेटवर्क (CDN) सर्वरों की ओर निर्देशित करके मैप डाउनलोड गति को अनुकूलित करता है।",
      "कोड, जिसे अनधिकृत फोर्क्स को रोकने के लिए शुरू में बंद रखा गया था, अब एमआईटी लाइसेंस के तहत खुला है, जो पारदर्शिता और सामुदायिक भागीदारी को बढ़ावा देता है।",
      "टीम विक्रेता लॉक-इन को रोकने के लिए क्लाउडफ्लेयर वर्कर्स के उपयोग पर पुनर्विचार कर रही है और एक योगदानकर्ता द्वारा किए गए अनधिकृत परिवर्तनों को वापस ले लिया है, जिससे उनकी गोपनीयता और पारदर्शिता के प्रति प्रतिबद्धता पर जोर दिया गया है।"
    ],
    "commentSummary": [
      "एलेक्जेंडर बोरसुक, मैप्स.मी के सह-संस्थापक, ने ऑर्गेनिक मैप्स के ओपन-सोर्स फोर्क को बंद करने की कोशिश की, इसके एमआईटी लाइसेंस को बदलकर और एक निजी रिपॉजिटरी में लॉगिंग जोड़कर। - रोमन त्सिसिक, एक अन्य परियोजना मेंटेनर, ने इन परिवर्तनों को उलट दिया और रिपॉजिटरी को सार्वजनिक कर दिया, जिससे एक संघर्ष उत्पन्न हुआ और उनके अनुमतियों को रद्द कर दिया गया। - यह घटना परियोजना की ओपन-सोर्स प्रकृति के बारे में आंतरिक असहमति को उजागर करती है, फिर भी ऑर्गेनिक मैप्स एक व्यापक रूप से उपयोग किया जाने वाला ऑफलाइन मैप एप्लिकेशन बना हुआ है।"
    ],
    "points": 269,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1733512298
  },
  {
    "id": 42347606,
    "title": "हर चीज के लिए पोस्टग्रेस का उपयोग कैसे करें",
    "originLink": "https://github.com/Olshansk/postgres_for_everything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42347606",
    "commentBody": "",
    "originSummary": [
      "‘पोस्टग्रेस फॉर एवरीथिंग’ एक रिपॉजिटरी है जो PostgreSQL, एक लोकप्रिय ओपन-सोर्स रिलेशनल डेटाबेस, के उपयोग को पारंपरिक डेटाबेस कार्यों से परे विस्तृत अनुप्रयोगों के लिए प्रोत्साहित करती है।- यह रिपॉजिटरी योगदान आमंत्रित करती है और PostgreSQL के विभिन्न नवाचारी उपयोगों को ट्रैक करती है, जिसमें क्रॉन जॉब्स, मैसेज क्यूज़, एनालिटिक्स और अधिक शामिल हैं, जो इसकी बहुमुखी प्रतिभा को उजागर करते हैं।- इस पहल में Supabase से संबंधित 11 आइटम शामिल हैं, जो एक प्लेटफॉर्म है जो PostgreSQL का उपयोग करके बैकएंड सेवाएं प्रदान करता है, और आधुनिक एप्लिकेशन विकास में इसके एकीकरण और उपयोगिता को प्रदर्शित करता है।"
    ],
    "commentSummary": [
      "चर्चा में विभिन्न अनुप्रयोगों में Postgres की बहुमुखी प्रतिभा पर जोर दिया गया है, लेकिन कुछ सीमाओं की ओर भी इशारा किया गया है, जैसे कि स्ट्रिंग्स में शून्य वर्णों को संभालना और स्किप-इंडेक्स स्कैन के लिए कस्टम SQL की आवश्यकता।- सभी उद्देश्यों के लिए Postgres का उपयोग करने पर राय भिन्न हैं, कुछ लोग बड़े टीमों के लिए एकल डेटाबेस पर अत्यधिक निर्भरता के खिलाफ चेतावनी देते हैं, जबकि अन्य इसकी सरलता और कम जटिलता की प्रशंसा करते हैं।- Redis जैसे विकल्पों का उल्लेख किया गया है, साथ ही स्केलिंग में चुनौतियों और परियोजना के प्रारंभिक चरणों में अत्यधिक इंजीनियरिंग से बचने के महत्व पर भी चर्चा की गई है।"
    ],
    "points": 257,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1733550975
  },
  {
    "id": 42343953,
    "title": "मुझे सहयोगी संपादन के बारे में जो झूठ बताया गया, भाग 1: ऑफलाइन संपादन के लिए एल्गोरिदम",
    "originLink": "https://www.moment.dev/blog/lies-i-was-told-pt-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343953",
    "commentBody": "",
    "originSummary": [
      "2024 की शुरुआत में, मोमेंट के टेक्स्ट एडिटर के लिए सहयोगात्मक संपादन प्रणालियों पर शोध ने ऑफलाइन संपादन में चुनौतियों को उजागर किया, जहां CRDTs (कन्फ्लिक्ट-फ्री रेप्लिकेटेड डेटा टाइप्स) और OT (ऑपरेशनल ट्रांसफॉर्मेशन) जैसे लोकप्रिय एल्गोरिदम अक्सर विफल हो जाते हैं।- ऑफलाइन संपादन से सीधे संघर्ष बढ़ जाते हैं, जिनमें से 20-30% संघर्ष अस्वीकार्य परिणाम देते हैं, यह सुझाव देते हुए कि यह समस्या एल्गोरिदमिक की बजाय उपयोगकर्ता इंटरफ़ेस/उपयोगकर्ता अनुभव (UI/UX) की चुनौती है।- शोधकर्ता अब ऑफलाइन संपादन में उपयोगकर्ता अनुभव को सुधारने पर ध्यान केंद्रित कर रहे हैं, यह देखते हुए कि गिट दस्तावेज़ मर्जिंग को कैसे संभालता है, जो एक आशाजनक विकास है।"
    ],
    "commentSummary": [
      "लेख सहयोगात्मक संपादन की चुनौतियों पर ध्यान केंद्रित करता है, विशेष रूप से ऑफ़लाइन, और वर्तमान एल्गोरिदम जैसे कि कॉन्फ्लिक्ट-फ्री रेप्लिकेटेड डेटा टाइप्स (CRDTs) और ऑपरेशनल ट्रांसफॉर्मेशन (OT) की आलोचना करता है क्योंकि वे हमेशा अर्थपूर्ण परिणाम नहीं देते हैं।- संघर्ष समाधान में सुधार की आवश्यकता पर एक आम सहमति है, संभावित रूप से उपयोगकर्ता इनपुट या बड़े भाषा मॉडल (LLMs) जैसे उन्नत उपकरणों के माध्यम से, ताकि अर्थपूर्ण संघर्षों को प्रभावी ढंग से संभाला जा सके।- चर्चा में यूजर इंटरफेस/यूजर एक्सपीरियंस (UI/UX) समाधानों की भूमिका पर भी विचार किया गया है, जो सहयोगात्मक संपादन अनुभव को बढ़ाने में मदद कर सकते हैं, यह दर्शाते हुए कि यह मुद्दा केवल एल्गोरिदम तक सीमित नहीं है बल्कि उपयोगकर्ता के इरादे को समझने तक भी फैला हुआ है।"
    ],
    "points": 243,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1733516527
  },
  {
    "id": 42346344,
    "title": "ओल्लामा के साथ संरचित आउटपुट",
    "originLink": "https://ollama.com/blog/structured-outputs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42346344",
    "commentBody": "",
    "originSummary": [
      "ओलामा ने संरचित आउटपुट के लिए समर्थन पेश किया है, जिससे मॉडल को JSON स्कीमा का उपयोग करके एक विशिष्ट प्रारूप में आउटपुट उत्पन्न करने की क्षमता मिलती है।",
      "यह सुविधा अब अपडेटेड Ollama Python और JavaScript लाइब्रेरी में उपलब्ध है, जो दस्तावेज़ों और छवियों से डेटा पार्सिंग जैसे कार्यों के लिए उपयोगी है।",
      "उपयोगकर्ताओं को नवीनतम ओलामा संस्करण में अपडेट करना चाहिए और cURL अनुरोधों या लाइब्रेरी में फॉर्मेट पैरामीटर का उपयोग करना चाहिए, जिसमें भविष्य के अपडेट प्रदर्शन सुधार और अधिक फॉर्मेट विकल्पों का वादा करते हैं।"
    ],
    "commentSummary": [
      "Ollama भाषा मॉडलों से संरचित डेटा, जैसे JSON, उत्पन्न करने की एक विधि प्रदान करता है, जिसमें XML या SQL जैसे अधिक बहुमुखी आउटपुट प्रारूपों के लिए GBNF व्याकरण का उपयोग करने पर चर्चा की जाती है।- उपयोगकर्ता JSON आउटपुट की विश्वसनीयता की तुलना प्राकृतिक भाषा से करते हैं, जिसमें यह अंतर्दृष्टि शामिल है कि भाषा मॉडल (LLMs) कैसे पाठ उत्पन्न करते हैं और संरचित प्रॉम्प्ट की भूमिका क्या होती है।- llama.cpp के साथ Ollama के एकीकरण को मॉडल उपयोग को सरल बनाने के लिए नोट किया गया है, हालांकि कुछ इसे केवल एक रैपर के रूप में देखते हैं, और यह सुविधा विभिन्न सटीकता स्तरों के साथ विभिन्न मॉडलों का समर्थन करती है।"
    ],
    "points": 223,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1733533952
  },
  {
    "id": 42346463,
    "title": "रोलरकोस्टर टाइकून अपने प्रकार का अंतिम था [वीडियो]",
    "originLink": "https://www.youtube.com/watch?v=0JouTsMQsEA",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42346463",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "रोलरकोस्टर टाइकून, जिसे मुख्य रूप से असेंबली भाषा में एक छोटे से टीम द्वारा विकसित किया गया था, 1999 में एक बेस्ट-सेलर बन गया, जो एक दुर्लभ विकास शैली को प्रदर्शित करता है।",
      "प्रशंसक OpenRCT2 को उन्नत सुविधाओं और संगतता के लिए सुझाव देते हैं, और Roller Coaster Tycoon Classic को आधुनिक उपकरणों के लिए, जबकि Parkitect और Planet Coaster जैसे विकल्प विविध अनुभव प्रदान करते हैं।",
      "वीडियो में गेम विकास के विकास और उन चुनौतियों को उजागर किया गया है जिनका सामना छोटे दलों को बड़े स्टूडियो के साथ प्रतिस्पर्धा करते समय करना पड़ता है, जिसमें Minecraft जैसी इंडी सफलताएँ छोटे दलों की उपलब्धियों की संभावनाओं को दर्शाती हैं।"
    ],
    "points": 220,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1733535139
  },
  {
    "id": 42343544,
    "title": "आहार में फ्रुक्टोज ट्यूमर के विकास को बढ़ाता है: शोध",
    "originLink": "https://source.washu.edu/2024/12/research-reveals-how-fructose-in-diet-enhances-tumor-growth/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343544",
    "commentBody": "",
    "originSummary": [
      "पिछले 50 वर्षों में फ्रुक्टोज की खपत में उल्लेखनीय वृद्धि हुई है, मुख्यतः पेय पदार्थों और प्रसंस्कृत खाद्य पदार्थों में उच्च-फ्रुक्टोज कॉर्न सिरप के कारण।",
      "वाशिंगटन यूनिवर्सिटी इन सेंट लुइस के शोध से पता चलता है कि जबकि फ्रुक्टोज सीधे तौर पर ट्यूमर को ऊर्जा नहीं देता, लेकिन यकृत इसे उन पोषक तत्वों में परिवर्तित कर देता है जो मेलानोमा, स्तन और गर्भाशय ग्रीवा के कैंसर जैसे कैंसर में ट्यूमर के विकास का समर्थन करते हैं।",
      "अध्ययन यह सुझाव देता है कि कैंसर के नए संभावित उपचारों के लिए उन तरीकों का अन्वेषण किया जाए जो फ्रक्टोज को ट्यूमर के विकास में सहायता करने से रोक सकते हैं, संभवतः आहार में बदलाव या दवाओं के माध्यम से, जिसमें आंशिक रूप से राष्ट्रीय स्वास्थ्य संस्थान (NIH) से वित्त पोषण प्राप्त हुआ है।"
    ],
    "commentSummary": [
      "वॉशिंगटन यूनिवर्सिटी के शोध से संकेत मिलता है कि उच्च फ्रुक्टोज का सेवन ट्यूमर के विकास को बढ़ावा दे सकता है क्योंकि यह परिसंचारी लिपिड्स को बढ़ाता है, जिनका उपयोग कैंसर कोशिकाएं विकास के लिए करती हैं।- फलों में मौजूद फ्रुक्टोज आमतौर पर सुरक्षित होता है क्योंकि इसमें अतिरिक्त पोषक तत्व होते हैं, लेकिन उच्च फ्रुक्टोज कॉर्न सिरप जैसे स्रोतों से अत्यधिक सेवन जोखिम भरा हो सकता है।- अध्ययन कैंसर चयापचय की जटिलता और कैंसर की प्रगति पर आहार के संभावित प्रभाव को रेखांकित करता है, हालांकि इन तंत्रों को पूरी तरह से समझने के लिए और अधिक शोध की आवश्यकता है।"
    ],
    "points": 185,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1733514389
  },
  {
    "id": 42346274,
    "title": "सबसे बड़े शेल प्रोग्राम",
    "originLink": "https://github.com/oils-for-unix/oils/wiki/The-Biggest-Shell-Programs-in-the-World",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42346274",
    "commentBody": "",
    "originSummary": [
      "पृष्ठ महत्वपूर्ण शेल प्रोग्रामों को उजागर करता है, जो मुख्य रूप से हाथ से लिखी गई स्क्रिप्ट्स पर केंद्रित हैं, बजाय उन स्क्रिप्ट्स के जो autoconf जैसे टूल्स द्वारा उत्पन्न की गई हैं।- उल्लेखनीय प्रविष्टियों में akinomyoga/ble.sh शामिल है, जो 61K लाइनों के कोड (LoC) के साथ एक बाश लाइन एडिटर है, और kalua, जो 56K स्रोत लाइनों के कोड (SLoC) के साथ एक OpenWRT ऐडऑन है।- सूची शेल स्क्रिप्टिंग की जटिलता और विविधता में अंतर्दृष्टि प्रदान करती है, जिसमें डेटा संरचनाओं और एल्गोरिदम का उपयोग करने वाले प्रोग्राम शामिल हैं, जो आमतौर पर 5,000 लाइनों के कोड से अधिक होते हैं।"
    ],
    "commentSummary": [
      "चर्चा बड़े शेल स्क्रिप्ट्स के उपयोग की जटिलताओं और चुनौतियों पर केंद्रित है, जैसे कि पठनीयता, त्रुटि प्रबंधन, और पोर्टेबिलिटी से संबंधित मुद्दे। - उपयोगकर्ता जटिल कार्यों के लिए बेहतर रखरखाव के कारण पायथन या AWK जैसे विकल्पों पर विचार करने का सुझाव देते हैं, जबकि ShellCheck जैसे उपकरण शेल स्क्रिप्ट की गुणवत्ता में सुधार करने में मदद कर सकते हैं। - बातचीत इस बात को उजागर करती है कि त्वरित कार्यों के लिए शेल स्क्रिप्ट्स का उपयोग करने और बड़े प्रोजेक्ट्स के लिए अधिक मजबूत प्रोग्रामिंग भाषाओं का चयन करने के बीच संतुलन कैसे बनाया जाए।"
    ],
    "points": 169,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1733533151
  },
  {
    "id": 42343692,
    "title": "डीएसपीवाई – प्रोग्रामिंग–प्रॉम्प्टिंग नहीं–एलएमएस",
    "originLink": "https://dspy.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343692",
    "commentBody": "",
    "originSummary": [
      "डीएसपीवाई एक फ्रेमवर्क है जो संयोजनीय पायथन कोड का उपयोग करके मॉड्यूलर एआई सिस्टम बनाने के लिए डिज़ाइन किया गया है, जो केवल प्रॉम्प्ट्स पर निर्भर किए बिना भाषा मॉडल (एलएम) के आउटपुट को सुधारने पर केंद्रित है।- यह ओपनएआई, एंथ्रोपिक और डेटाब्रिक्स जैसे कई बड़े भाषा मॉडल (एलएलएम) प्रदाताओं का समर्थन करता है, जिससे उपयोगकर्ताओं को एआई व्यवहार को कोड के रूप में वर्णित करने की अनुमति मिलती है, जिससे आसान पुनरावृत्ति और अनुकूलन की सुविधा मिलती है।- स्टैनफोर्ड एनएलपी से उत्पन्न, डीएसपीवाई का गिटहब और डिस्कॉर्ड पर एक मजबूत समुदायिक उपस्थिति है, जो ओपन-सोर्स एआई अनुसंधान में योगदान देता है और प्रोग्राम आर्किटेक्चर और ऑप्टिमाइज़र को आगे बढ़ाता है।"
    ],
    "commentSummary": [
      "डीएसपीवाई एक फ्रेमवर्क है जो भाषा मॉडलों (एलएम) के लिए प्रॉम्प्ट्स को अनुकूलित करने के लिए डिज़ाइन किया गया है, जो प्रशिक्षण डेटा उपसमुच्चयों के चयन को स्वचालित करके प्रदर्शन को बढ़ाता है और मैन्युअल समायोजन को कम करता है।",
      "यह बड़े भाषा मॉडल (LLM) कार्यक्रमों के एंड-टू-एंड प्रशिक्षण का समर्थन करता है, कोड में पुराने प्रॉम्प्ट के उपयोग को रोकता है, और डेटा निष्कर्षण और सारांशण जैसे कार्यों के लिए विशेष रूप से उपयोगी है।",
      "हालांकि कुछ उपयोगकर्ताओं को DSPy की जटिलता चुनौतीपूर्ण लगती है, इसे इसकी संरचित दृष्टिकोण और ऐसे फीचर्स के लिए महत्व दिया जाता है जैसे कि अनुमोदन और सुझाव जो आउटपुट बाधाओं को लागू करते हैं।"
    ],
    "points": 159,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1733515189
  }
]
