[
  {
    "id": 42344002,
    "title": "İşsiz geçen ikinci yılım",
    "originLink": "https://shilin.ca/my-second-year-without-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42344002",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 381,
    "commentCount": 567,
    "retryCount": 0,
    "time": 1733516765
  },
  {
    "id": 42343089,
    "title": "Dialog Öğesi",
    "originLink": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/dialog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343089",
    "commentBody": "",
    "originSummary": [
      "HTML `` elementi, etkileşimi duraklatan modal veya etkileşime izin veren non-modal diyalog kutuları oluşturmak için kullanılır.",
      "JavaScript yöntemleri `.showModal()` ve `.show()`, sırasıyla modal ve modal olmayan diyalogları görüntülemek için kullanılırken, `.close()` bunları kapatmak için kullanılır.",
      "Erişilebilirlik çok önemlidir; odak noktasının doğru ayarlandığından emin olun ve modal arka planları stilize etmek için CSS `::backdrop` kullanırken bir düğme gibi bir kapatma mekanizması sağlayın."
    ],
    "commentSummary": [
      "developer.mozilla.org üzerindeki dialog öğesi, dosya seçiciler ve medya oynatıcılar gibi etkileşimli HTML öğelerinin kullanımı hakkında, tarayıcılar arasında tutarlılık ve öngörülebilirlik konularında farklı görüşlerle bir tartışma başlattı.",
      "Bazı geliştiriciler, dialog öğesini stilize edilmemiş ve yerel açılır pencereler gibi çalışmadığı için eleştirirken, diğerleri onun anlamsal ve erişilebilirlik avantajlarını değerli buluyor.",
      "Bu tartışma, tasarım tutarlılığını koruma zorluklarını ve reklamverenler tarafından potansiyel kötüye kullanım endişelerini vurgulamakta, diyalog unsurunun ilerici bir adım olduğunu ancak hala geliştirmelere ihtiyaç duyduğunu göstermektedir."
    ],
    "points": 295,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733512147
  },
  {
    "id": 42343121,
    "title": "Maps.me kurucu ortağı, Organic Maps açık kaynak çatallanmasını kapatmaya çalışıyor",
    "originLink": "https://github.com/orgs/organicmaps/discussions/9837",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343121",
    "commentBody": "",
    "originSummary": [
      "Organic Maps, kullanıcıları konumlarına göre en iyi İçerik Dağıtım Ağı (CDN) sunucularına yönlendirerek harita indirme hızlarını optimize eden \"metaserver\" kaynak kodunu yayınladı.",
      "Kod, başlangıçta yetkisiz çatallamaları önlemek için kapalıydı, şimdi MIT lisansı altında açık hale getirildi ve bu da şeffaflığı ve topluluk katılımını teşvik ediyor.",
      "Takım, satıcıya bağımlılığı önlemek için Cloudflare Workers kullanımını yeniden değerlendiriyor ve bir katkıda bulunan tarafından yapılan izinsiz değişiklikleri geri aldı, gizlilik ve şeffaflığa olan bağlılıklarını vurguluyor."
    ],
    "commentSummary": [
      "Alexander Borsuk, Maps.me'nin kurucu ortağı, MIT lisansını değiştirerek ve özel bir depoya günlük kaydı ekleyerek Organic Maps'in açık kaynak çatallanmasını kapatmaya çalıştı. - Başka bir proje sorumlusu olan Roman Tsisyk, bu değişiklikleri geri aldı ve depoyu herkese açık hale getirdi, bu da bir çatışmaya ve izinlerinin iptaline yol açtı. - Olay, projenin açık kaynak doğası hakkındaki iç anlaşmazlıkları vurguluyor, ancak Organic Maps, yaygın olarak kullanılan bir çevrimdışı harita uygulaması olmaya devam ediyor."
    ],
    "points": 269,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1733512298
  },
  {
    "id": 42347606,
    "title": "Her şey için Postgres nasıl kullanılır",
    "originLink": "https://github.com/Olshansk/postgres_for_everything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42347606",
    "commentBody": "",
    "originSummary": [
      "Her Şey İçin Postgres\", popüler bir açık kaynaklı ilişkisel veritabanı olan PostgreSQL'in, geleneksel veritabanı görevlerinin ötesinde geniş bir uygulama yelpazesi için kullanımını teşvik eden bir depodur. - Depo, katkıları davet eder ve PostgreSQL'in çok yönlülüğünü vurgulayan cron işleri, mesaj kuyrukları, analizler ve daha fazlası dahil olmak üzere çeşitli yenilikçi kullanımlarını izler. - Girişim, PostgreSQL kullanarak arka uç hizmetleri sağlayan bir platform olan Supabase ile ilgili 11 öğeyi içerir ve modern uygulama geliştirmedeki entegrasyonunu ve faydasını sergiler."
    ],
    "commentSummary": [
      "Metin, Postgres'in çeşitli uygulamalardaki çok yönlülüğünü vurgularken, dizelerdeki null karakterleri işleme ve atlama-indeks taramaları için özel SQL gerektirme gibi sınırlamaları da belirtmektedir. Postgres'in her amaç için kullanılmasına dair görüşler farklılık göstermekte, bazıları büyük ekipler için tek bir veritabanına aşırı güvenilmemesi konusunda uyarırken, diğerleri basitliği ve azalan karmaşıklığı övmektedir. Redis gibi alternatiflerden bahsedilmekte, ölçeklendirme zorlukları ve bir projenin erken aşamalarında aşırı mühendislikten kaçınmanın önemi vurgulanmaktadır."
    ],
    "points": 257,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1733550975
  },
  {
    "id": 42343953,
    "title": "Yalanlar: Ortak Düzenleme Hakkında Bana Söylenenler, Bölüm 1: Çevrimdışı Düzenleme için Algoritmalar",
    "originLink": "https://www.moment.dev/blog/lies-i-was-told-pt-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343953",
    "commentBody": "",
    "originSummary": [
      "2024'ün başlarında, Moment'in metin düzenleyicisi için işbirlikçi düzenleme sistemleri üzerine yapılan araştırmalar, CRDT'ler (Çatışmasız Çoğaltılmış Veri Türleri) ve OT (Operasyonel Dönüşüm) gibi popüler algoritmaların genellikle başarısız olduğu çevrimdışı düzenleme ile ilgili zorlukları vurguladı. Çevrimdışı düzenleme, doğrudan çatışmaları artırır ve bu çatışmaların %20-30'u kabul edilemez sonuçlara yol açar, bu da sorunun algoritmikten ziyade bir kullanıcı arayüzü/kullanıcı deneyimi (UI/UX) zorluğu olduğunu düşündürmektedir. Araştırmacılar şimdi, belgelerin birleştirilmesini ele alan git'e benzer şekilde, çevrimdışı düzenlemede kullanıcı deneyimini iyileştirmeye odaklanıyorlar, bu da umut verici bir gelişme."
    ],
    "commentSummary": [
      "Makale, özellikle çevrimdışı durumda, işbirlikçi düzenlemenin zorluklarını ele alıyor ve Çatışmasız Çoğaltılmış Veri Türleri (CRDT'ler) ve Operasyonel Dönüşüm (OT) gibi mevcut algoritmaları, her zaman anlamsal olarak anlamlı sonuçlar vermedikleri için eleştiriyor. Anlamsal çatışmaları etkili bir şekilde ele almak için kullanıcı girdisi veya Büyük Dil Modelleri (LLM'ler) gibi gelişmiş araçlar aracılığıyla iyileştirilmiş çatışma çözümüne ihtiyaç duyulduğu konusunda bir fikir birliği var. Tartışma ayrıca, kullanıcı niyetini anlamanın algoritmaların ötesine geçtiğini vurgulayarak, Kullanıcı Arayüzü/Kullanıcı Deneyimi (UI/UX) çözümlerinin işbirlikçi düzenleme deneyimini geliştirmedeki rolünü de değerlendiriyor."
    ],
    "points": 243,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1733516527
  },
  {
    "id": 42346344,
    "title": "Yapılandırılmış Çıktılar ile Ollama",
    "originLink": "https://ollama.com/blog/structured-outputs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42346344",
    "commentBody": "",
    "originSummary": [
      "Ollama, modellerin JSON şeması kullanarak belirli bir formatta çıktılar üretmesini sağlayan yapılandırılmış çıktılar için destek sunmuştur.",
      "Bu özellik artık belgelerden ve görüntülerden veri ayrıştırma gibi görevler için yararlı olan güncellenmiş Ollama Python ve JavaScript kütüphanelerinde mevcuttur.",
      "Kullanıcılar, en son Ollama sürümüne güncellemeli ve cURL isteklerinde veya kütüphanelerinde format parametresini kullanmalıdır, gelecekteki güncellemeler performans iyileştirmeleri ve daha fazla format seçeneği vaat etmektedir."
    ],
    "commentSummary": [
      "Ollama, dil modellerinden JSON gibi yapılandırılmış veriler oluşturmak için bir yöntem sunar ve XML veya SQL gibi daha esnek çıktı formatları için GBNF gramerlerinin kullanımını tartışır. Kullanıcılar, JSON çıktılarının güvenilirliğini doğal dil ile karşılaştırarak, dil modellerinin (LLM'ler) metin oluşturma süreci ve yapılandırılmış istemlerin rolü hakkında içgörüler sunar. Ollama'nın llama.cpp ile entegrasyonu, model kullanımını basitleştirdiği için dikkat çeker, ancak bazıları bunu sadece bir sarmalayıcı olarak görür ve bu özellik, farklı doğruluk seviyelerine sahip çeşitli modelleri destekler."
    ],
    "points": 223,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1733533952
  },
  {
    "id": 42346463,
    "title": "RollerCoaster Tycoon kendi türünün son örneğiydi [video]",
    "originLink": "https://www.youtube.com/watch?v=0JouTsMQsEA",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42346463",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "RollerCoaster Tycoon, küçük bir ekip tarafından öncelikle assembly dilinde geliştirilen, nadir bir geliştirme tarzını sergileyerek 1999 yılında en çok satanlar arasına girdi.",
      "Hayranlar, gelişmiş özellikler ve uyumluluk için OpenRCT2'yi ve modern cihazlar için Roller Coaster Tycoon Classic'i önerirken, Parkitect ve Planet Coaster gibi alternatifler çeşitli deneyimler sunar.",
      "Video, oyun geliştirmesinin evrimini ve küçük ekiplerin daha büyük stüdyolarla rekabet ederken karşılaştıkları zorlukları vurguluyor; Minecraft gibi bağımsız başarılar, küçük ekiplerin başarı potansiyelini gösteriyor."
    ],
    "points": 220,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1733535139
  },
  {
    "id": 42343544,
    "title": "Beslenmedeki fruktoz, tümör büyümesini artırıyor: araştırma",
    "originLink": "https://source.washu.edu/2024/12/research-reveals-how-fructose-in-diet-enhances-tumor-growth/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343544",
    "commentBody": "",
    "originSummary": [
      "Fruktoz tüketimi, son 50 yılda, öncelikle içecekler ve işlenmiş gıdalardaki yüksek fruktozlu mısır şurubu nedeniyle önemli ölçüde artmıştır.",
      "St. Louis'deki Washington Üniversitesi'nden yapılan araştırma, fruktozun doğrudan tümörleri beslemediğini, ancak karaciğerin fruktozu melanom, meme ve serviks kanseri gibi kanserlerde tümör büyümesini destekleyen besinlere dönüştürdüğünü göstermektedir.",
      "Çalışma, tümör büyümesine yardımcı olan fruktozun önlenmesi için yöntemler araştırarak, olası yeni kanser tedavilerini önermektedir. Bu yöntemler, diyet değişiklikleri veya ilaçlar yoluyla olabilir ve kısmen Ulusal Sağlık Enstitüleri (NIH) tarafından finanse edilmektedir."
    ],
    "commentSummary": [
      "Washington Üniversitesi'nden yapılan araştırmalar, yüksek fruktoz tüketiminin dolaşımdaki lipidleri artırarak tümör büyümesini teşvik edebileceğini, bu lipidlerin kanser hücreleri tarafından büyüme için kullanıldığını göstermektedir. Meyvelerdeki fruktoz genellikle ek besinler nedeniyle güvenli olsa da, yüksek fruktozlu mısır şurubu gibi kaynaklardan aşırı alım riskli olabilir. Çalışma, kanser metabolizmasının karmaşıklığını ve diyetin kanser ilerlemesi üzerindeki potansiyel etkisini vurgulamakta, ancak bu mekanizmaları tam olarak anlamak için daha fazla araştırmaya ihtiyaç duyulmaktadır."
    ],
    "points": 185,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1733514389
  },
  {
    "id": 42346274,
    "title": "En büyük kabuk programları",
    "originLink": "https://github.com/oils-for-unix/oils/wiki/The-Biggest-Shell-Programs-in-the-World",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42346274",
    "commentBody": "",
    "originSummary": [
      "Sayfa, önemli shell programlarını vurgulamakta ve autoconf gibi araçlar tarafından üretilenlerden ziyade elle yazılmış önemli betiklere odaklanmaktadır.- Dikkate değer girişler arasında 61K kod satırına (LoC) sahip bir Bash Satır Düzenleyici olan akinomyoga/ble.sh ve 56K kaynak kod satırına (SLoC) sahip bir OpenWRT eklentisi olan kalua bulunmaktadır.- Liste, genellikle 5.000 kod satırını aşan veri yapıları ve algoritmalar kullanan programları içeren shell betiklerinin karmaşıklığı ve çeşitliliği hakkında içgörüler sunmaktadır."
    ],
    "commentSummary": [
      "Bu tartışma, büyük kabuk betiklerinin kullanımıyla ilgili karmaşıklıklar ve zorluklar üzerinde yoğunlaşıyor; okunabilirlik, hata yönetimi ve taşınabilirlik gibi sorunlar ele alınıyor.- Kullanıcılar, daha iyi sürdürülebilirlik nedeniyle karmaşık görevler için Python veya AWK gibi alternatifleri düşünmeyi öneriyor, ShellCheck gibi araçlar ise kabuk betiklerinin kalitesini artırmaya yardımcı olabilir.- Konuşma, hızlı görevler için kabuk betiklerini kullanma ile daha büyük projeler için daha sağlam programlama dillerini tercih etme arasındaki dengeyi vurguluyor."
    ],
    "points": 169,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1733533151
  },
  {
    "id": 42343692,
    "title": "DSPy – Programlama–yönlendirme değil–LM'ler",
    "originLink": "https://dspy.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42343692",
    "commentBody": "",
    "originSummary": [
      "DSPy, modüler yapay zeka sistemleri oluşturmak için kompozisyonel Python kodu kullanan bir çerçevedir ve dil modeli (LM) çıktılarının iyileştirilmesine odaklanır, yalnızca istemlere dayanmaz.- OpenAI, Anthropic ve Databricks gibi birden fazla büyük dil modeli (LLM) sağlayıcısını destekler, kullanıcıların yapay zeka davranışını kod olarak tanımlamasına olanak tanır, bu da daha kolay yineleme ve optimizasyon sağlar.- Stanford NLP'den kaynaklanan DSPy, GitHub ve Discord'da güçlü bir topluluk varlığına sahiptir, açık kaynak yapay zeka araştırmalarına katkıda bulunur ve program mimarilerini ve optimizasyon araçlarını geliştirir."
    ],
    "commentSummary": [
      "DSPy, dil modelleri (LM'ler) için istemleri optimize etmek amacıyla tasarlanmış bir çerçevedir ve bu, eğitim veri alt kümelerinin seçimini otomatikleştirerek performansı artırır ve manuel ayarlamaları en aza indirir.",
      "Büyük dil modeli (LLM) programlarının uçtan uca eğitimini destekler, kodda eski istemlerin kullanılmasını önler ve özellikle veri çıkarma ve özetleme gibi görevler için kullanışlıdır.",
      "Bazı kullanıcılar DSPy'nin karmaşıklığını zorlayıcı bulsa da, yapılandırılmış yaklaşımı ve çıktı kısıtlamalarını zorlayan doğrulamalar ve öneriler gibi özellikleri nedeniyle değer verilmektedir."
    ],
    "points": 159,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1733515189
  }
]
