[
  {
    "id": 42203543,
    "title": "المحكمة الجنائية الدولية تصدر مذكرات توقيف بحق نتنياهو وجالانت ومسؤولين في حماس",
    "originLink": "https://www.icc-cpi.int/news/situation-state-palestine-icc-pre-trial-chamber-i-rejects-state-israels-challenges",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42203543",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أصدرت المحكمة الجنائية الدولية مذكرات اعتقال بحق القادة الإسرائيليين نتنياهو وجالانت، إلى جانب مسؤولين من حماس، بتهمة ارتكاب جرائم حرب مزعومة.",
      "تؤكد مذكرات التوقيف على اختصاص المحكمة الجنائية الدولية في الجرائم المرتكبة في الأراضي الفلسطينية، على الرغم من أن إسرائيل لا تعترف بسلطة المحكمة.",
      "تسلط هذه الحالة الضوء على التحديات في إنفاذ القانون الدولي، حيث أن القوى الكبرى مثل الولايات المتحدة لا تعترف بالمحكمة الجنائية الدولية، مما قد يحد من فعاليتها ويجعل الاعتقالات الفعلية غير محتملة."
    ],
    "points": 441,
    "commentCount": 399,
    "retryCount": 0,
    "time": 1732191197
  },
  {
    "id": 42200209,
    "title": "كل شخص قادر على التفكير الرياضي ويمكنه الاستفادة منه",
    "originLink": "https://www.quantamagazine.org/mathematical-thinking-isnt-what-you-think-it-is-20241118/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42200209",
    "commentBody": "",
    "originSummary": [
      "يطرح ديفيد بيسيس، وهو رياضياتي، أن التفكير الرياضي الذي يوازن بين الحدس والمنطق مفيد للجميع، حيث يعزز الإبداع والفهم. في كتابه \"ماثيماتيكا: عالم سري من الحدس والفضول\"، يشبه بيسيس التفكير الرياضي بحوار بين العقل والغريزة، مشابه لليوغا، ويؤكد أنه مهارة تتطور من خلال الممارسة. يرى بيسيس أن الرياضيات درس عالمي في الحياة يمكن أن يجلب الفرح والوضوح والثقة بالنفس، مشيرًا إلى أنها ليست مجرد حل للمشكلات بل شكل من أشكال المساعدة الذاتية."
    ],
    "commentSummary": [
      "التفكير الرياضي مفيد للجميع، لكن العديد يواجهون تحديات بسبب طرق التدريس غير الفعالة ونقص الدافع. غالبًا ما يُنظر إلى الرياضيات بشكل خاطئ على أنها موهبة فطرية بدلاً من كونها مهارة يمكن تطويرها بالنهج والعقلية الصحيحة، مثل الرياضة. من المهم التأكيد على أن الرياضيات متاحة للجميع، ويجب أن يركز التدريس على تطوير مهارات التفكير الرياضي، مما يجعل التعلم ممتعًا وشاملًا."
    ],
    "points": 439,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1732153547
  },
  {
    "id": 42199301,
    "title": "تساعد مكتبة Z-Library الطلاب على التغلب على الفقر الأكاديمي، وفقًا لدراسة.",
    "originLink": "https://torrentfreak.com/z-library-helps-students-to-overcome-academic-poverty-study-finds-241120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42199301",
    "commentBody": "",
    "originSummary": [
      "تتناول دراسة في مجلة ممارسة التدريس والتعلم الجامعي استخدام مكتبة Z-Library، وهي مكتبة ظل توفر الكتب والمقالات الأكاديمية مجانًا، مسلطة الضوء على التكاليف العالية والوصول المحدود كدوافع رئيسية.",
      "يستخدم طلاب الدراسات العليا الصينيون، من بين آخرين، مكتبة Z-Library لمكافحة الفقر الأكاديمي، حيث يعتبرونها ضرورية للنجاح الأكاديمي على الرغم من المشكلات القانونية التي تواجهها المنصة.",
      "يوصي البحث بأن تزيد الجامعات والناشرون من الوصول المجاني إلى المحتوى لسد الفجوات الرقمية وتلبية احتياجات الطلاب الذين يعتمدون على هذه الموارد."
    ],
    "commentSummary": [
      "تؤكد دراسة على دور مكتبة Z في التخفيف من الفقر الأكاديمي من خلال توفير الوصول المجاني إلى الكتب الدراسية، مما يساعد الطلاب في معاينة الكتب قبل شراء النسخ الورقية.",
      "تناقش المناقشة الطبيعة المزدوجة للقرصنة، مع وجود حجج تشير إلى أنها يمكن أن تؤثر سلبًا على المبيعات وفي الوقت نفسه قد تؤدي إلى عمليات شراء شرعية، مما يحافظ على أهمية الموارد.",
      "تشير المحادثة أيضًا إلى منصات أخرى مثل Sci-Hub وLibgen، حيث تناقش الآثار الأخلاقية والتعليمية للقرصنة في الوصول إلى الموارد التعليمية والبرمجيات."
    ],
    "points": 379,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1732145770
  },
  {
    "id": 42199447,
    "title": "تم العثور على دواء لفقدان الوزن يقلص العضلات في الفئران وخلايا الإنسان",
    "originLink": "https://www.ualberta.ca/en/folio/2024/11/weight-loss-drug-found-to-shrink-heart-muscle.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42199447",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة من جامعة ألبرتا إلى أن أدوية فقدان الوزن مثل أوزيمبيك قد تؤدي إلى تقلص القلب والعضلات، مما يثير القلق بشأن الآثار الصحية المحتملة على المدى الطويل.",
      "لاحظت الدراسة فقدان عضلة القلب في كل من الفئران وخلايا الإنسان، مما دفع الباحثين إلى التوصية بمراقبة صحة القلب لدى مستخدمي هذه الأدوية.",
      "يشير الخبراء إلى أن ما يصل إلى 40% من فقدان الوزن الناتج عن هذه الأدوية يكون من العضلات، وينصحون المستخدمين بالحفاظ على كتلة العضلات من خلال التغذية السليمة والتدريب على المقاومة أثناء العلاج."
    ],
    "commentSummary": [
      "تشير دراسة إلى أن عقار سيماغلوتايد، المستخدم لفقدان الوزن، قد يؤدي إلى فقدان العضلات بشكل أكبر مقارنة بالحمية التقليدية، مما يثير القلق بشأن آثاره الصحية على المدى الطويل.",
      "وجدت الأبحاث أن السيماغلوتايد يقلل من عضلة القلب في كل من الفئران وخلايا الإنسان، مما أثار جدلاً حول ما إذا كانت فوائد فقدان الوزن تفوق المخاطر المحتملة.",
      "يوصي الخبراء بالتغذية السليمة والتمارين الرياضية لمواجهة فقدان العضلات، مع التأكيد على الحاجة إلى مزيد من البحث حول تأثير السيماغلوتايد على العضلات والصحة العامة."
    ],
    "points": 326,
    "commentCount": 369,
    "retryCount": 0,
    "time": 1732146805
  },
  {
    "id": 42202397,
    "title": "تقاطع حضري شائع في هولندا (2018)",
    "originLink": "https://bicycledutch.wordpress.com/2018/02/20/a-common-urban-intersection-in-the-netherlands/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42202397",
    "commentBody": "",
    "originSummary": [
      "تم تصميم التقاطعات الحضرية في هولندا، مثل تلك الموجودة في 'س-هيرتوجنبوش، لإعطاء الأولوية للسلامة والكفاءة لجميع مستخدمي الطريق، بما في ذلك حركة المرور الآلية وراكبي الدراجات والمشاة.",
      "تشمل الميزات الرئيسية مسارات دراجات محمية، وتقاطعات مرتفعة، وعلامات طرق واضحة، وقواعد أولوية تفضل حركة المرور غير الآلية، مما يقلل الحاجة إلى إشارات المرور.",
      "يؤكد هذا النهج التصميمي على التزام الهولنديين باستيعاب أنواع حركة المرور المتنوعة من خلال التخطيط المبتكر والمدروس للبنية التحتية."
    ],
    "commentSummary": [
      "تولي هولندا الأولوية لراكبي الدراجات والمشاة عند التقاطعات الحضرية، مما يتناقض مع دول مثل المملكة المتحدة وإيطاليا، حيث تفتقر البنية التحتية للدراجات في كثير من الأحيان إلى الأولوية ويمكن أن تكون غير مريحة أو سيئة التصميم. يعود نجاح النموذج الهولندي إلى تحول ثقافي وأطر قانونية تفضل راكبي الدراجات، مما يؤدي إلى بيئات ركوب أكثر أمانًا وكفاءة. هناك دعوات لدول أخرى لتبني النموذج الهولندي لتحسين سلامة البنية التحتية للدراجات، مما يبرز فعاليته وجاذبيته."
    ],
    "points": 303,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1732179542
  },
  {
    "id": 42198115,
    "title": "توقف جوجل عن السماح لمواقع مثل فوربس بالتحكم في البحث عن \"أفضل حلوى CBD\"",
    "originLink": "https://arstechnica.com/gadgets/2024/11/google-cracks-down-on-parasite-seo-punishing-established-publishers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42198115",
    "commentBody": "",
    "originSummary": [
      "قامت جوجل بتعديل سياسة إساءة استخدام سمعة الموقع لمعالجة \"تحسين محركات البحث الطفيلي\"، حيث تستخدم المواقع الإلكترونية المعروفة سلطتها في المجال للترويج لتوصيات منتجات تابعة لأطراف ثالثة غير ذات صلة.",
      "أدى هذا التحديث إلى تراجع في تصنيفات البحث لمواقع مثل فوربس وتايم، التي كانت تستخدم هذه الاستراتيجية للمحتوى التابع.",
      "يهدف تغيير السياسة إلى تحسين تجربة البحث من خلال تقليل تأثير ممارسات تحسين محركات البحث الاستغلالية على نتائج البحث."
    ],
    "commentSummary": [
      "قامت جوجل بتنفيذ تغييرات لمنع مواقع مثل فوربس من السيطرة على نتائج البحث لمصطلحات مثل \"أفضل حلوى CBD\"، وذلك لمعالجة مشكلات البريد العشوائي في تحسين محركات البحث والتسويق بالعمولة.",
      "يهدف هذا التغيير إلى تحسين جودة نتائج البحث، التي تأثرت بالمحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي والتكتيكات العدوانية لتحسين محركات البحث.",
      "تُعتبر هذه الخطوة أيضًا ردًا على المنافسة من أدوات الذكاء الاصطناعي مثل ChatGPT، حيث تسعى جوجل إلى تحسين نتائج البحث وتقليل تأثير المحتوى منخفض الجودة."
    ],
    "points": 245,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1732136848
  },
  {
    "id": 42199486,
    "title": "Electrobun: تطبيقات سطح المكتب عبر الأنظمة الأساسية مكتوبة بلغة TypeScript",
    "originLink": "https://electrobun.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42199486",
    "commentBody": "",
    "originSummary": [
      "Electrobun هو أداة لتطوير تطبيقات سطح المكتب السريعة والصغيرة وعبر الأنظمة الأساسية باستخدام Typescript، مستفيدًا من bun للتنفيذ وzig للربط الأصلي.",
      "يمكن تثبيت أحدث إصدار، Electrobun v0.0.13، باستخدام الأمر `$ bun install electrobun`، حيث يقدم حزم تطبيقات مدمجة (~12MB) وتحديثات صغيرة الحجم (بحجم 4KB فقط).",
      "يوفر سير عمل متكامل يسمح للمطورين ببدء البرمجة في غضون 5 دقائق وتوزيع التطبيقات في 10 دقائق، مما يضمن أداءً فعالاً مع عمليات معزولة وقدرات استدعاء الإجراءات البعيدة (RPC) بسهولة."
    ],
    "commentSummary": [
      "Electrobun هو إطار عمل جديد مصمم لإنشاء تطبيقات سطح المكتب عبر الأنظمة باستخدام TypeScript، مشابه لـ Electron ولكنه يستخدم Bun وواجهة الويب الخاصة بالنظام بدلاً من Node.js وChromium.",
      "حاليًا، يتوفر Electrobun فقط لنظام macOS، مع خطط مستقبلية لدعم Windows وLinux، وهو في مراحله الأولى من التطوير مع التركيز على الاستقرار.",
      "يعد الإطار بتحديثات صغيرة الحجم وآلية استدعاء إجراءات عن بُعد (RPC) مخصصة لتحقيق اتصال فعال بين العمليات، على الرغم من أنه يفتقر حاليًا إلى وثائق شاملة وأمثلة مرئية."
    ],
    "points": 240,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1732147100
  },
  {
    "id": 42202670,
    "title": "بي إتش بي 8.4",
    "originLink": "https://www.php.net/releases/8.4/en.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42202670",
    "commentBody": "",
    "originSummary": [
      "يقدم PHP 8.4.1 تحديثات هامة، بما في ذلك خطافات الخصائص للخصائص المحسوبة والرؤية غير المتناظرة للتحكم في الوصول إلى الخصائص. تشمل التحسينات تحديث واجهة برمجة التطبيقات DOM مع دعم HTML5، وظائف مصفوفة جديدة، وتنفيذ JIT (التجميع في الوقت المناسب) جديد لتحسين الأداء. تتضمن الميزات المهملة ملحقات غير مدمجة وتغييرات في بعض الثوابت والوظائف، مما يشجع المستخدمين على الترقية للحصول على أداء أفضل وصياغة محسنة."
    ],
    "commentSummary": [
      "يقدم PHP 8.4 خاصية الخطافات، وهي ميزة تهدف إلى تبسيط عمليات الحصول والتعيين، مما يتيح مقارنات مع وظائف مشابهة في لغة C#.",
      "يتضمن التحديث تحسينات في الأداء، وتحسين تتبع الأخطاء، ووظائف جديدة للمصفوفات، مما يساهم في التطور المستمر للغة PHP.",
      "ينقسم المطورون حول التغييرات، حيث يشعر البعض بالقلق من التعقيد المضاف، بينما يقدر آخرون تقليل الكود المتكرر والتحول من الإطناب الشبيه بجافا."
    ],
    "points": 212,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1732183012
  },
  {
    "id": 42201892,
    "title": "قانون هيروم في لغة Golang",
    "originLink": "https://abenezer.org/blog/hyrum-law-in-golang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42201892",
    "commentBody": "",
    "originSummary": [
      "قانون هيروم، الذي سمي على اسم مهندس جوجل هيروم رايت، يشير إلى أنه مع وجود عدد كافٍ من مستخدمي واجهة برمجة التطبيقات (API)، سيتم الاعتماد على جميع السلوكيات الملحوظة من قبل شخص ما، مما يجعل التغييرات محفوفة بالمخاطر.",
      "في لغة البرمجة Go، يمكن أن يؤدي تغيير رسائل الخطأ مثل \"http: request body too large\" إلى تعطيل الشيفرة الحالية التي تعتمد على هذه الرسائل، مما يوضح قانون هيروم.",
      "هذا المفهوم ليس حصريًا للغة Go؛ فهو واضح أيضًا في لغات أخرى مثل JavaScript، مما يؤكد على أهمية تصميم الأنظمة لتقليل التبعيات غير المقصودة."
    ],
    "commentSummary": [
      "يشير قانون هيروم إلى أن أي سلوك يمكن ملاحظته في النظام، حتى لو كان غير مقصود، يمكن أن يصبح اعتمادًا للمستخدمين، مما يجعل التغييرات قد تكون مدمرة.",
      "يجب على مؤلفي المكتبات توثيق الأجزاء المستقرة من واجهة برمجة التطبيقات والنظر في اعتماديات المستخدمين، بينما يجب على المستهلكين توخي الحذر عند الاعتماد على الميزات غير الموثقة.",
      "تؤكد المناقشة على تحقيق التوازن بين التحسينات التقنية وتوقعات المستخدمين، مشيرة إلى الفروق في التعامل مع التغييرات بين البرمجيات مفتوحة المصدر وبرمجيات المؤسسات."
    ],
    "points": 210,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1732173155
  },
  {
    "id": 42200099,
    "title": "قمنا بفتح مصدر تقنية مراقبة السماد الخاصة بنا",
    "originLink": "https://github.com/gtls64/MontyHome-Hackers-Guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42200099",
    "commentBody": "",
    "originSummary": [
      "شركة مونتي كومبوست هي شركة ناشئة تركز على تحسين كفاءة التسميد للاستخدام السكني والصناعي من خلال التكنولوجيا مفتوحة المصدر. تتكامل التكنولوجيا مع منصات مثل Raspberry Pi وArduino، باستخدام أجهزة استشعار لمراقبة الغاز ودرجة الحرارة والرطوبة وضغط الهواء، مع إمكانية تصدير البيانات كملفات CSV. وعلى الرغم من تصميمها في البداية لمراقبة التسميد، إلا أن التكنولوجيا قابلة للتكيف مع تطبيقات إنترنت الأشياء (IoT) ومراقبة البيئة."
    ],
    "commentSummary": [
      "أصدرت شركة مونتي كومبوست تكنولوجيتها لمراقبة السماد كمصدر مفتوح، مما يسمح بتكييفها في تطبيقات متنوعة تتجاوز عملية التسميد.",
      "النظام متوافق مع Raspberry Pi وArduino، ويتميز بأجهزة استشعار لتركيب الغاز ودرجة الحرارة والرطوبة وضغط الهواء، مع إمكانية تصدير البيانات كملفات CSV.",
      "تم تصميم هذه التقنية لتحسين عملية التسميد، لكنها قابلة للتطبيق أيضًا في إنترنت الأشياء (IoT) ومراقبة البيئة، مما يشجع على تجربة المستخدم ومشاركة المشاريع."
    ],
    "points": 170,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1732152607
  },
  {
    "id": 42200699,
    "title": "تحويل \"النواة الشيطانية\" إلى ميم",
    "originLink": "https://doomsdaymachines.net/p/the-meme-ification-of-the-demon-core",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42200699",
    "commentBody": "",
    "originSummary": [
      "ارتبط \"نواة الشيطان\" بحادثتين نوويتين قاتلتين، وأصبحت ميمًا مظلمًا على الإنترنت، غالبًا ما يظهر في تداخلات غير متوقعة مع شخصيات أنمي لطيفة. تبرز شعبية الميم منذ عام 2019 اهتمامًا خاصًا اكتسب اعترافًا أوسع، رغم اعتباره سيئ الذوق. كانت \"نواة الشيطان\" هي النواة البلوتونية الثالثة المخصصة للحرب العالمية الثانية، مما يضيف تعقيدًا لعملية تحويلها إلى ميم، خاصة بسبب أصولها اليابانية."
    ],
    "commentSummary": [
      "تأتي ميمات \"نواة الشيطان\" من مزيج من الفكاهة السوداء والحوادث النووية التاريخية التي تتعلق بكرة من البلوتونيوم.",
      "تضع الميمات الطبيعة الخطرة للنواة في سياقات فكاهية أو عبثية، مما يثير الجدل حول ما إذا كان الفكاهة تنبع من التجارب المتهورة أو كآلية للتكيف مع التاريخ النووي.",
      "يوضح هذا الظاهرة كيف يمكن أن ينبثق الفكاهة من مواضيع جادة، مما يقدم رؤى حول السلوك البشري وردود الفعل غير المتوقعة."
    ],
    "points": 158,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1732158356
  },
  {
    "id": 42201117,
    "title": "المصفوفة: توليد عالم بلا حدود مع تفاعل في الوقت الحقيقي",
    "originLink": "https://thematrix1999.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42201117",
    "commentBody": "",
    "originSummary": [
      "مشروع الماتريكس يقوم بتطوير عالم رقمي غامر في الوقت الحقيقي بجودة بصرية عالية ودقة على مستوى الإطار، مستوحى من مفهوم الفيلم.",
      "يستخدم نماذج متقدمة مثل Swin-DPM لتوليد مقاطع فيديو طويلة بلا حدود، مما يتيح التحكم والاستكشاف في الوقت الحقيقي للبيئات الديناميكية.",
      "يخطط المشروع لجعل بياناته مفتوحة المصدر لتشجيع البحث والابتكار، مع عرض مشاهد متنوعة تمزج بين البيئات الافتراضية والواقعية."
    ],
    "commentSummary": [
      "تركز المناقشة على الإمكانية لإنشاء عوالم افتراضية لا نهائية، مستوحاة من \"المصفوفة: توليد عوالم لا نهائية الأفق مع التفاعل في الوقت الحقيقي\".",
      "تُجرى مقارنات مع ألعاب مثل ماينكرافت، التي تستخدم التوليد الإجرائي للحفاظ على التناسق المكاني، وتتضمن الاقتراحات استخدام عوالم ثلاثية الأبعاد منخفضة الدقة لتحقيق الفعالية.",
      "يتم تسليط الضوء على دور الذكاء الاصطناعي في تعزيز تجارب الواقع الافتراضي (VR) والواقع المختلط، إلى جانب المخاوف بشأن قابلية استخدام التكنولوجيا الحالية وتسويقها."
    ],
    "points": 157,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1732163176
  },
  {
    "id": 42197754,
    "title": "مخطط مسار الدراجات الذي يتبع تقريبًا فقط المسارات الرسمية للدراجات",
    "originLink": "https://trailimap.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42197754",
    "commentBody": "",
    "originSummary": [
      "تم تطوير تطبيق جديد لتخطيط مسارات جولات الدراجات، يركز على استخدام البنية التحتية الحالية للدراجات ويسمح للمستخدمين باستكشاف المسارات عبر الخرائط أو المسارات الرسمية. يغطي التطبيق حاليًا أوروبا ويستخدم بيانات OpenStreetMap للتخطيط الأمثل للمسارات، مع خطط للتوسع في المستقبل إلى أمريكا الشمالية وعلى مستوى العالم. من الناحية التقنية، يستخدم التطبيق Graphhopper للعثور على المسارات، وهو مبني باستخدام Next.js 14 وTypescript، ويستخدم خلفية .NET، مع بلاطات الخرائط مأخوذة من MapTiler، على الرغم من أن الاستضافة الذاتية مخطط لها."
    ],
    "commentSummary": [
      "تم تطوير تطبيق جديد لتخطيط مسارات الدراجات، يركز على المسارات الرسمية لجولات الدراجات، وهو متاح حاليًا في أوروبا. يستخدم التطبيق بيانات OpenStreetMap ويعتمد على Graphhopper للعثور على المسارات، مع تطبيق ويب مبني باستخدام Next.js و.NET. تشمل خطط التوسع المستقبلية توسيع توفر التطبيق ليشمل أمريكا الشمالية ومناطق أخرى، مع دعوة مفتوحة لتلقي الملاحظات والتعاون من المطورين."
    ],
    "points": 150,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1732134235
  },
  {
    "id": 42201068,
    "title": "فرضت شركة بوينغ على القوات الجوية الأمريكية سعرًا أعلى بنسبة 8000% من السعر السوقي لموزعات الصابون.",
    "originLink": "https://www.reuters.com/business/aerospace-defense/boeing-overcharged-air-force-nearly-8000-soap-dispensers-watchdog-alleges-2024-10-29/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42201068",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "فرضت شركة بوينغ على القوات الجوية الأمريكية مبلغ 149,072 دولارًا مقابل موزعات الصابون، وهو مبلغ يفوق بكثير السعر السوقي، مما يعادل 671 دولارًا لكل طائرة من طراز C-17 البالغ عددها 222 طائرة.",
      "يُعزى ارتفاع التكلفة إلى الامتثال للمواصفات العسكرية ومتطلبات التوثيق، مما أثار جدلاً حول كفاءة عملية الشراء.",
      "تسلط الوضعية الضوء على احتمالات عدم الكفاءة في التعاقدات العسكرية، مع اقتراحات بأن النظام قد يفضل المتعاقدين مثل بوينغ."
    ],
    "points": 146,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1732162748
  },
  {
    "id": 42198635,
    "title": "قدرة الإنترنت في أوروبا على الصمود تخفف من تأثير قطع الكابلات البحرية",
    "originLink": "https://blog.cloudflare.com/resilient-internet-connectivity-baltic-cable-cuts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42198635",
    "commentBody": "",
    "originSummary": [
      "لم تتسبب القطوعات الأخيرة للكابلات في بحر البلطيق، وتحديدًا كابلات BCS East-West Interlink وC-Lion1، في تعطيل كبير لاتصال الإنترنت في أوروبا بفضل البنية التحتية القوية.",
      "تضمن البنية التحتية القوية للإنترنت في أوروبا، التي تتميز باتصالات بحرية وبرية متعددة، تأثيرًا ضئيلًا من مثل هذه الحوادث من خلال توفير مسارات بديلة.",
      "يراقب Cloudflare Radar بشكل نشط الاتصال بالإنترنت على مستوى العالم، ويقدم تحديثات عبر وسائل التواصل الاجتماعي ومنشورات المدونات، مسلطًا الضوء على أهمية بنية الشبكة الاحتياطية لمنع الانقطاعات."
    ],
    "commentSummary": [],
    "points": 141,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1732140631
  }
]
