[
  {
    "id": 42203543,
    "title": "ICC, Netanyahu, Gallant ve Hamas yetkilileri için tutuklama emri çıkardı",
    "originLink": "https://www.icc-cpi.int/news/situation-state-palestine-icc-pre-trial-chamber-i-rejects-state-israels-challenges",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42203543",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Uluslararası Ceza Mahkemesi (UCM), İsrailli liderler Netanyahu ve Gallant ile Hamas yetkilileri için savaş suçları iddiasıyla tutuklama emri çıkardı.",
      "Bu tutuklama emirleri, İsrail mahkemenin yetkisini tanımamasına rağmen, ICC'nin Filistin topraklarındaki suçlar üzerindeki yargı yetkisini vurgulamaktadır.",
      "Bu durum, ABD gibi büyük güçlerin ICC'yi tanımadığı için uluslararası hukuk uygulamalarında zorlukları vurgulamakta, bu da etkinliğini potansiyel olarak sınırlamakta ve gerçek tutuklamaları olası kılmamaktadır."
    ],
    "points": 441,
    "commentCount": 399,
    "retryCount": 0,
    "time": 1732191197
  },
  {
    "id": 42200209,
    "title": "Herkes matematiksel düşünme yeteneğine sahiptir ve bundan fayda sağlayabilir.",
    "originLink": "https://www.quantamagazine.org/mathematical-thinking-isnt-what-you-think-it-is-20241118/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42200209",
    "commentBody": "",
    "originSummary": [
      "David Bessis, bir matematikçi olarak, sezgi ve mantığı dengeleyen matematiksel düşüncenin herkes için faydalı olduğunu, yaratıcılığı ve anlayışı artırdığını öne sürüyor. \"Mathematica: A Secret World of Intuition and Curiosity\" adlı kitabında Bessis, matematiksel düşünceyi akıl ve içgüdü arasında bir diyaloğa, yogaya benzetiyor ve bunun pratikle geliştirilen bir beceri olduğunu vurguluyor. Bessis, matematiği evrensel bir yaşam dersi olarak görüyor ve bunun sadece problem çözme değil, aynı zamanda bir tür kişisel gelişim olduğunu, neşe, netlik ve özgüven getirebileceğini öne sürüyor."
    ],
    "commentSummary": [
      "Matematiksel düşünme herkes için faydalıdır, ancak birçok kişi etkisiz öğretim yöntemleri ve motivasyon eksikliği nedeniyle zorluklarla karşılaşır. Matematik genellikle, doğru yaklaşım ve zihniyetle geliştirilebilecek bir beceri yerine, doğuştan gelen bir yetenek olarak yanlış bir şekilde görülür, tıpkı sporlar gibi. Matematiğin herkese açık olduğunu vurgulamak için, öğretim matematiksel düşünme becerilerini geliştirmeye odaklanmalı, öğrenmeyi keyifli ve kapsayıcı hale getirmelidir."
    ],
    "points": 439,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1732153547
  },
  {
    "id": 42199301,
    "title": "Çalışma, Z-Library'nin Öğrencilerin Akademik Yoksulluğu Aşmasına Yardımcı Olduğunu Buldu",
    "originLink": "https://torrentfreak.com/z-library-helps-students-to-overcome-academic-poverty-study-finds-241120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42199301",
    "commentBody": "",
    "originSummary": [
      "Üniversite Öğretim ve Öğrenme Uygulamaları Dergisi'nde yer alan bir çalışma, ücretsiz kitaplar ve akademik makaleler sunan bir gölge kütüphane olan Z-Library'nin kullanımını inceleyerek, yüksek maliyetler ve sınırlı erişimi birincil motivasyonlar olarak vurguluyor.",
      "Çinli lisansüstü öğrenciler, diğerleri arasında, akademik yoksullukla mücadele etmek için Z-Library'i kullanıyor ve platformun karşılaştığı yasal sorunlara rağmen bunu akademik başarı için hayati olarak görüyorlar.",
      "Çalışma, üniversitelerin ve yayıncıların dijital uçurumları kapatmak ve bu tür kaynaklara güvenen öğrencilerin ihtiyaçlarını karşılamak için içeriğe ücretsiz erişimi artırmalarını önermektedir."
    ],
    "commentSummary": [
      "Bir çalışma, Z-Library'nin akademik yoksulluğu hafifletmedeki rolünü vurgulayarak, öğrencilere fiziksel kopyaları satın almadan önce kitapları önizleme imkanı sunarak ücretsiz ders kitabı erişimi sağladığını belirtmektedir.",
      "Bu tartışma, korsanlığın çift yönlü doğasını araştırıyor; satışları olumsuz etkileyebileceği gibi, kaynakların önemini koruyarak meşru satın alımlara da yol açabileceği yönünde argümanlar sunuyor.",
      "Konuşma ayrıca Sci-Hub ve Libgen gibi diğer platformlara da atıfta bulunarak, eğitim ve yazılım kaynaklarına erişimde korsanlığın etik ve eğitsel etkilerini tartışıyor."
    ],
    "points": 379,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1732145770
  },
  {
    "id": 42199447,
    "title": "Farelerde ve insan hücrelerinde kas küçülmesine neden olan kilo kaybı ilacı bulundu",
    "originLink": "https://www.ualberta.ca/en/folio/2024/11/weight-loss-drug-found-to-shrink-heart-muscle.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42199447",
    "commentBody": "",
    "originSummary": [
      "Alberta Üniversitesi tarafından yapılan bir çalışma, Ozempic gibi kilo kaybı ilaçlarının kalp ve kas küçülmesine yol açabileceğini, bu durumun potansiyel uzun vadeli sağlık etkileri hakkında endişeleri artırdığını gösteriyor.",
      "Çalışma, hem farelerde hem de insan hücrelerinde kalp kası kaybı gözlemledi ve bu da araştırmacıların bu ilaçları kullananların kalp sağlığını izlemelerini önermesine yol açtı.",
      "Uzmanlar, bu ilaçlarla kilo kaybının %40'ının kas olabileceğini öne sürerek, kullanıcıların tedavi sırasında uygun beslenme ve direnç antrenmanları ile kas kütlesini korumalarını tavsiye ediyor."
    ],
    "commentSummary": [
      "Bir çalışma, kilo kaybı ilacı olan semaglutidin, geleneksel diyetten daha fazla kas kaybına yol açabileceğini ve bu durumun uzun vadeli sağlık etkileri konusunda endişelere neden olduğunu göstermektedir.",
      "Yapılan araştırma, semaglutidin hem farelerde hem de insan hücrelerinde kalp kasını azalttığını buldu ve bu durum, kilo kaybının faydalarının potansiyel risklerden daha ağır basıp basmadığı konusunda bir tartışma başlattı.",
      "Uzmanlar, kas kaybını önlemek için uygun beslenme ve egzersizi öneriyor ve semaglutidin kas ve genel sağlık üzerindeki etkisi hakkında daha fazla araştırma yapılması gerektiğini vurguluyor."
    ],
    "points": 326,
    "commentCount": 369,
    "retryCount": 0,
    "time": 1732146805
  },
  {
    "id": 42202397,
    "title": "2018 yılında Hollanda'da yaygın bir kentsel kavşak",
    "originLink": "https://bicycledutch.wordpress.com/2018/02/20/a-common-urban-intersection-in-the-netherlands/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42202397",
    "commentBody": "",
    "originSummary": [
      "Şehir içi kavşaklar, 's-Hertogenbosch gibi Hollanda'da, motorlu trafik, bisikletliler ve yayalar dahil olmak üzere tüm yol kullanıcıları için güvenlik ve verimliliği öncelikli hale getirecek şekilde tasarlanmıştır.",
      "Temel özellikler arasında korumalı bisiklet yolları, yükseltilmiş kavşaklar, net yol işaretlemeleri ve motorlu olmayan trafiği tercih eden öncelik kuralları yer alır, bu da trafik sinyallerine olan ihtiyacı azaltır.",
      "Bu tasarım yaklaşımı, yenilikçi ve düşünceli altyapı planlaması yoluyla çeşitli trafik türlerini karşılamaya yönelik Hollanda'nın bağlılığını vurgulamaktadır."
    ],
    "commentSummary": [
      "Hollanda, kentsel kavşaklarda bisikletliler ve yayalara öncelik tanır; bu, bisiklet altyapısının genellikle öncelik taşımadığı ve garip veya kötü tasarlanmış olabileceği Birleşik Krallık ve İtalya gibi ülkelerle tezat oluşturur. Hollanda modelinin başarısı, bisikletlileri destekleyen kültürel bir değişim ve yasal çerçeveler sayesinde daha güvenli ve verimli bisiklet ortamlarına yol açmıştır. Diğer ülkelerin de bisiklet güvenliğini ve altyapısını iyileştirmek için Hollanda modelini benimsemeleri yönünde çağrılar bulunmaktadır, bu da modelin etkinliğini ve çekiciliğini vurgulamaktadır."
    ],
    "points": 303,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1732179542
  },
  {
    "id": 42198115,
    "title": "Google, Forbes gibi sitelerin 'En İyi CBD Sakızları' aramalarında hükmetmesine izin vermeyi durduruyor.",
    "originLink": "https://arstechnica.com/gadgets/2024/11/google-cracks-down-on-parasite-seo-punishing-established-publishers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42198115",
    "commentBody": "",
    "originSummary": [
      "Google, köklü web sitelerinin alan adı otoritelerini kullanarak alakasız üçüncü taraf ürün tavsiyelerini tanıtması anlamına gelen \"Parazit SEO\"yu ele almak için site itibar suistimali politikasını revize etti.",
      "Bu güncelleme, Forbes ve Time gibi sitelerin ortaklık içeriği için bu taktiği kullanmaları nedeniyle arama sıralamalarında düşüşe yol açtı.",
      "Politika değişikliği, arama sonuçları üzerindeki istismarcı SEO uygulamalarının etkisini azaltarak arama deneyimini iyileştirmeyi amaçlıyor."
    ],
    "commentSummary": [
      "Google, Forbes gibi sitelerin \"En İyi CBD Sakızları\" gibi terimler için arama sonuçlarına hakim olmasını önlemek amacıyla değişiklikler uyguladı ve SEO spamı ile bağlı kuruluş pazarlaması sorunlarını ele aldı.",
      "Bu değişiklik, yapay zeka tarafından üretilen içerik ve agresif SEO taktiklerinden etkilenen arama sonuçlarının kalitesini artırmayı amaçlamaktadır.",
      "Bu hamle, Google'ın arama sonuçlarını geliştirmeye ve düşük kaliteli içeriğin etkisini azaltmaya çalışırken, ChatGPT gibi yapay zeka araçlarından gelen rekabete bir yanıt olarak da görülüyor."
    ],
    "points": 245,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1732136848
  },
  {
    "id": 42199486,
    "title": "Electrobun: TypeScript ile yazılmış çapraz platform masaüstü uygulamaları",
    "originLink": "https://electrobun.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42199486",
    "commentBody": "",
    "originSummary": [
      "Electrobun, Typescript kullanarak hızlı, küçük, platformlar arası masaüstü uygulamaları geliştirmek için bir araçtır ve çalıştırma için bun, yerel bağlamalar için zig kullanır.",
      "En son sürüm, Electrobun v0.0.13, `$ bun install electrobun` komutuyla kurulabilir ve kompakt uygulama paketleri (~12MB) ve minimal güncellemeler (4KB kadar küçük) sunar.",
      "Bu, geliştiricilerin 5 dakika içinde kodlamaya başlamasına ve 10 dakika içinde uygulamaları dağıtmasına olanak tanıyan entegre bir iş akışı sağlar, izole edilmiş süreçler ve kolay Uzaktan Yordam Çağrısı (RPC) yetenekleri ile verimli performans sağlar."
    ],
    "commentSummary": [
      "Electrobun, TypeScript kullanarak çapraz platform masaüstü uygulamaları oluşturmak için tasarlanmış yeni bir çerçevedir. Electron'a benzer, ancak Node.js ve Chromium yerine Bun ve sistem web görünümünü kullanır.",
      "Şu anda Electrobun yalnızca macOS için mevcuttur, gelecekte Windows ve Linux'u destekleme planları bulunmaktadır ve kararlılığa odaklanan erken geliştirme aşamalarındadır.",
      "Çerçeve, küçük güncelleme boyutları ve verimli süreçler arası iletişim için özel bir Uzaktan Yordam Çağrısı (RPC) mekanizması vaat ediyor, ancak şu anda kapsamlı belgeler ve görsel örnekler eksik."
    ],
    "points": 240,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1732147100
  },
  {
    "id": 42202670,
    "title": "PHP 8.4",
    "originLink": "https://www.php.net/releases/8.4/en.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42202670",
    "commentBody": "",
    "originSummary": [
      "PHP 8.4.1, hesaplanmış özellikler için özellik kancaları ve özellik erişim kontrolü için asimetrik görünürlük dahil olmak üzere önemli güncellemeler sunar.- Geliştirmeler, HTML5 desteği ile güncellenmiş bir DOM API, yeni dizi fonksiyonları ve performansı artırmak için yeni bir JIT (Just-In-Time) uygulaması içerir.- Kullanımdan kaldırılan özellikler, ayrılmış uzantılar ve belirli sabitler ve fonksiyonlardaki değişiklikleri içerir, kullanıcıları daha iyi performans ve sözdizimi için yükseltmeye teşvik eder."
    ],
    "commentSummary": [
      "PHP 8.4, C#'deki benzer işlevsellik ile karşılaştırmalar yaparak, getter ve setter'ları basitleştirmeyi amaçlayan bir özellik olan özellik kancalarını tanıtır.",
      "Güncelleme, PHP'nin sürekli evrimine katkıda bulunan performans iyileştirmeleri, geliştirilmiş yığın izleri ve yeni dizi işlevlerini içeriyor.",
      "Geliştiriciler değişiklikler konusunda ikiye bölünmüş durumda; bazıları eklenen karmaşıklıktan endişe ederken, diğerleri şablon kodun azalmasını ve Java benzeri ayrıntılı anlatımdan uzaklaşılmasını takdir ediyor."
    ],
    "points": 212,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1732183012
  },
  {
    "id": 42201892,
    "title": "Hyrum'un Yasası Golang'da",
    "originLink": "https://abenezer.org/blog/hyrum-law-in-golang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42201892",
    "commentBody": "",
    "originSummary": [
      "Hyrum Yasası, Google mühendisi Hyrum Wright'ın adını taşıyan ve yeterince API kullanıcısı olduğunda, tüm gözlemlenebilir davranışların birileri tarafından güvenileceğini ve değişiklikleri riskli hale getireceğini öne süren bir yasadır.",
      "Go programlama dilinde, \"http: request body too large\" gibi hata mesajlarını değiştirmek, bu mesajlara bağlı olan mevcut kodu bozabilir ve bu durum Hyrum'un Yasası'nı örneklemektedir.",
      "Bu kavram yalnızca Go'ya özgü değildir; JavaScript gibi diğer dillerde de görülür ve istenmeyen bağımlılıkları en aza indirmek için sistemler tasarlamanın önemini vurgular."
    ],
    "commentSummary": [
      "Hyrum'un Yasası, bir sistemde gözlemlenebilir herhangi bir davranışın, istenmeyen olsa bile, kullanıcılar için bir bağımlılık haline gelebileceğini ve değişikliklerin potansiyel olarak bozucu olabileceğini öne sürer.",
      "Kütüphane yazarları, kararlı API bölümlerini belgelendirmeli ve kullanıcı bağımlılıklarını dikkate almalıdır, tüketiciler ise belgelenmemiş özelliklere güvenme konusunda dikkatli olmalıdır.",
      "Metin, teknik iyileştirmeleri kullanıcı beklentileriyle dengelemenin önemini vurguluyor ve açık kaynak ile kurumsal yazılım arasındaki değişikliklerin ele alınmasındaki farklılıklara dikkat çekiyor."
    ],
    "points": 210,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1732173155
  },
  {
    "id": 42200099,
    "title": "Kompost izleme teknolojimizi açık kaynaklı hale getirdik",
    "originLink": "https://github.com/gtls64/MontyHome-Hackers-Guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42200099",
    "commentBody": "",
    "originSummary": [
      "Monty Compost Co., hem konut hem de endüstriyel kullanım için kompostlama verimliliğini artırmaya odaklanan bir girişimdir ve bunu açık kaynak teknolojisi aracılığıyla yapmaktadır.- Teknoloji, gaz, sıcaklık, nem ve hava basıncını izlemek için sensörler kullanarak Raspberry Pi ve Arduino gibi platformlarla entegre olur ve veriler CSV dosyaları olarak dışa aktarılabilir.- Başlangıçta kompost izleme için tasarlanmış olsa da, teknoloji Nesnelerin İnterneti (IoT) ve çevresel izleme uygulamaları için uyarlanabilir."
    ],
    "commentSummary": [
      "Monty Compost Co., kompost izleme teknolojisini açık kaynak olarak yayınladı ve bu sayede kompostlamanın ötesinde çeşitli uygulamalarda uyarlanmasına olanak tanıdı.",
      "Sistem, gaz bileşimi, sıcaklık, nem ve hava basıncı için sensörler içeren Raspberry Pi ve Arduino ile uyumludur ve veriler CSV dosyaları olarak dışa aktarılabilir.",
      "Bu teknoloji, kompostlamayı optimize etmek için tasarlanmıştır, ancak aynı zamanda Nesnelerin İnterneti (IoT) ve çevresel izleme için de uygulanabilir, kullanıcı deneylerini ve proje paylaşımını teşvik eder."
    ],
    "points": 170,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1732152607
  },
  {
    "id": 42200699,
    "title": "“Şeytan Çekirdeği”nin meme haline getirilmesi",
    "originLink": "https://doomsdaymachines.net/p/the-meme-ification-of-the-demon-core",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42200699",
    "commentBody": "",
    "originSummary": [
      "Demon Core\" ile ilişkilendirilen iki ölümcül nükleer kaza, genellikle sevimli anime karakterleriyle beklenmedik yan yana gelmeler içeren karanlık bir internet memi haline gelmiştir. 2019'dan bu yana memin popülaritesi, kötü bir zevk olarak kabul edilmesine rağmen, daha geniş bir tanınırlık kazanan niş bir ilgiyi vurgulamaktadır. \"Demon Core\", II. Dünya Savaşı için tasarlanan üçüncü plütonyum çekirdeğiydi ve özellikle Japon kökenleri nedeniyle memleştirilmesine karmaşıklık katmaktadır."
    ],
    "commentSummary": [
      "Demon Core\" memleri, karanlık mizah ve bir plütonyum küresi içeren tarihi nükleer olayların bir karışımından kaynaklanmaktadır.",
      "Memler, çekirdeğin tehlikeli doğasını mizahi veya absürt bağlamlarla yan yana getirerek, mizahın pervasız deneylerden mi yoksa nükleer tarihle başa çıkma mekanizması olarak mı kaynaklandığı konusunda tartışma başlatıyor.",
      "Bu fenomen, mizahın ciddi konulardan nasıl ortaya çıkabileceğini, insan davranışlarına ve beklenmedik tepkilere dair içgörüler sunduğunu göstermektedir."
    ],
    "points": 158,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1732158356
  },
  {
    "id": 42201117,
    "title": "Matrix: Gerçek Zamanlı Etkileşim ile Sonsuz Ufuklu Dünya Üretimi",
    "originLink": "https://thematrix1999.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42201117",
    "commentBody": "",
    "originSummary": [
      "Matrix projesi, filmin konseptinden esinlenerek yüksek kaliteli görseller ve kare düzeyinde hassasiyetle gerçek zamanlı, sürükleyici bir dijital evren geliştiriyor.",
      "Dinamik ortamların gerçek zamanlı kontrolü ve keşfi için sonsuz uzunlukta videolar üreten Swin-DPM gibi gelişmiş modelleri kullanır.",
      "Proje, sanal ve gerçek dünya ortamlarını harmanlayan çeşitli sahneleri sergileyerek araştırma ve yeniliği teşvik etmek amacıyla verilerini açık kaynak olarak sunmayı planlıyor."
    ],
    "commentSummary": [
      "Bu tartışma, 'The Matrix: Sonsuz Ufuklu Dünya Üretimi ile Gerçek Zamanlı Etkileşim' adlı eserden esinlenerek sonsuz sanal dünyalar oluşturma potansiyeline odaklanıyor.",
      "Karşılaştırmalar, mekansal tutarlılığı korumak için prosedürel üretim kullanan Minecraft gibi oyunlarla yapılmakta ve öneriler arasında etkinlik için düşük çözünürlüklü 3D dünyaların kullanılması bulunmaktadır.",
      "Yapay zekanın sanal gerçeklik (VR) ve karma gerçeklik deneyimlerini geliştirmedeki rolü vurgulanırken, mevcut teknolojinin kullanılabilirliği ve pazarlanabilirliği konusundaki endişeler de dile getirilmektedir."
    ],
    "points": 157,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1732163176
  },
  {
    "id": 42197754,
    "title": "Bisiklet rotası planlayıcısı, neredeyse yalnızca resmi bisiklet yollarını takip eder.",
    "originLink": "https://trailimap.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42197754",
    "commentBody": "",
    "originSummary": [
      "Mevcut bisiklet altyapısını kullanmaya odaklanan ve kullanıcıların haritalar veya resmi parkurlar aracılığıyla rotaları keşfetmelerine olanak tanıyan yeni bir bisiklet turu rota planlayıcı uygulaması geliştirildi.- Uygulama şu anda Avrupa'yı kapsıyor ve optimal rota planlaması için OpenStreetMap verilerini kullanıyor, gelecekte Kuzey Amerika ve dünya genelinde genişleme planları bulunuyor.- Teknik olarak, uygulama rota bulma için Graphhopper kullanıyor, Next.js 14 ve Typescript ile inşa edilmiş ve .NET backend kullanıyor, harita döşemeleri MapTiler'dan sağlanıyor, ancak kendi barındırma planlanıyor."
    ],
    "commentSummary": [
      "Resmi bisiklet yollarına odaklanan yeni bir bisiklet rotası planlayıcı uygulaması geliştirildi ve şu anda Avrupa'da kullanılabilir durumda.- Uygulama, OpenStreetMap verilerini kullanıyor ve rota bulma için Graphhopper'ı kullanıyor, web uygulaması ise Next.js ve .NET kullanılarak oluşturulmuş.- Gelecekteki genişleme planları, uygulamanın Kuzey Amerika ve diğer bölgelere yayılmasını içeriyor ve geliştiricilerden geri bildirim ve işbirliği için açık bir davet sunuluyor."
    ],
    "points": 150,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1732134235
  },
  {
    "id": 42201068,
    "title": "Boeing, sabunluklar için piyasa fiyatının %8.000 üzerinde ABD Hava Kuvvetleri'ne fazla ücretlendirdi.",
    "originLink": "https://www.reuters.com/business/aerospace-defense/boeing-overcharged-air-force-nearly-8000-soap-dispensers-watchdog-alleges-2024-10-29/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42201068",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Boeing, 222 adet C-17 uçağı için uçak başına 671 dolara denk gelen, piyasa fiyatının oldukça üzerinde bir fiyatla, sabunluklar için ABD Hava Kuvvetleri'nden 149.072 dolar talep etti.",
      "Şişirilmiş maliyet, askeri spesifikasyonlara uyum ve dokümantasyon gerekliliklerine atfedilmekte olup, tedarik sürecinin verimliliği konusunda tartışmalara yol açmaktadır.",
      "Durum, sistemin Boeing gibi yüklenicileri kayırabileceği önerileriyle birlikte askeri sözleşmelerdeki potansiyel verimsizlikleri vurguluyor."
    ],
    "points": 146,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1732162748
  },
  {
    "id": 42198635,
    "title": "Avrupa'nın internet dayanıklılığı, denizaltı kablo kesintilerinin etkisini azaltıyor",
    "originLink": "https://blog.cloudflare.com/resilient-internet-connectivity-baltic-cable-cuts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42198635",
    "commentBody": "",
    "originSummary": [
      "Son zamanlarda Baltık Denizi'ndeki kablo kesintileri, özellikle BCS Doğu-Batı Bağlantısı ve C-Lion1 kabloları, dayanıklı altyapı sayesinde Avrupa'daki internet bağlantısını önemli ölçüde kesintiye uğratmadı.",
      "Avrupa'nın çok sayıda denizaltı ve karasal bağlantıya sahip sağlam internet altyapısı, alternatif rotalar sağlayarak bu tür olaylardan minimum etkiyle kurtulmayı garanti eder.",
      "Cloudflare Radar, küresel İnternet bağlantısını aktif olarak izler, sosyal medya ve blog gönderileri aracılığıyla güncellemeler sunar ve kesintileri önlemek için yedekli ağ mimarisinin önemini vurgular."
    ],
    "commentSummary": [],
    "points": 141,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1732140631
  }
]
