[
  {
    "id": 42225481,
    "title": "الزجاج المثلج من الألعاب إلى الويب: واجهة مستخدم زجاجية HTML مستوحاة من تطوير الألعاب AAA",
    "originLink": "https://www.tyleo.com/html-glass.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42225481",
    "commentBody": "",
    "originSummary": [
      "يستكشف الدليل كيفية إنشاء تأثير الزجاج المثلج في HTML، مستوحى من ألعاب AAA مثل Forza Horizon 3 وForza Motorsport 7، مع توفير أمثلة على الشفرات والأصول.",
      "تشمل التقنيات الرئيسية استخدام `backdrop-filter` في CSS لتأثيرات التمويه، و`box-shadow` لإضافة العمق، وجافا سكريبت لانعكاسات الضوء الديناميكية، مع وجود نسخ لكل من جافا سكريبت وبدونها لضمان التوافق عبر المنصات.",
      "يتضمن الدليل قسم \"الوصفة النهائية\" لبدء سريع، مما يتيح للمستخدمين تصميم واجهة زجاجية مذهلة خاصة بهم."
    ],
    "commentSummary": [
      "تركز المناقشة على استخدام تأثيرات واجهة المستخدم الزجاجية المثلجة في تطوير الويب، المستوحاة من تصميم الألعاب الراقية، مع تسليط الضوء على الجاذبية الجمالية ومخاوف التكلفة الحاسوبية.",
      "هناك نقاش حول الموازنة بين عرض النطاق الترددي للخادم ومعالجة الجانب العميل، مع وجود آراء متباينة بناءً على التجارب الشخصية والمنظورات التكنولوجية.",
      "تتناول المحادثة أيضًا كفاءة وحدات معالجة الرسوميات الحديثة والأثر البيئي لطرق الحوسبة المختلفة."
    ],
    "points": 612,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732414785
  },
  {
    "id": 42224670,
    "title": "بوكر: تنفيذ Docker في حوالي 100 سطر من Bash (2015)",
    "originLink": "https://github.com/p8952/bocker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42224670",
    "commentBody": "",
    "originSummary": [
      "بوكر دوكر هو تنفيذ بسيط لدوكر مكتوب في حوالي 100 سطر من لغة باش، مصمم لإدارة الحاويات بشكل خفيف الوزن.",
      "يتطلب حزم نظام وتكوينات محددة، بما في ذلك نظام ملفات btrfs وإعدادات الشبكة، ومن الأفضل تشغيله في جهاز افتراضي نظرًا لحاجته إلى الوصول الجذري.",
      "يدعم Bocker الوظائف الأساسية لدوكر مثل بناء الحاويات وسحبها وتشغيلها وإدارة الموارد، لكنه يفتقر إلى ميزات مثل حاويات حجم البيانات وتوجيه المنافذ."
    ],
    "commentSummary": [
      "بوكر هو تنفيذ مبسط لدور Docker مكتوب بلغة Bash، يوضح كيف يمكن تقليل الوظائف الأساسية لدور Docker.",
      "تشمل المناقشة مقارنات مع أدوات بيئة خفيفة الوزن أخرى مثل proot وchroot، وبدائل مثل Podman.",
      "تشمل المواضيع الرئيسية تطور Docker، وقيمة نظامه البيئي، والتحديات المتعلقة بتشغيل الحاويات على الأنظمة غير اللينكس."
    ],
    "points": 336,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1732403931
  },
  {
    "id": 42223099,
    "title": "كيفية تقديم ملاحظات لقائد كبير دون التعرض للفصل",
    "originLink": "https://newsletter.weskao.com/p/how-to-give-a-senior-leader-feedback-without-getting-fired",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42223099",
    "commentBody": "",
    "originSummary": [
      "تقدم نشرة ويس كاو الإخبارية استراتيجيات لتقديم الملاحظات إلى القادة الكبار بأمان، مثل تقنية \"حتى أكثر\" واستخدام اللغة الدبلوماسية.",
      "تؤكد النشرة الإخبارية على دعم التغذية الراجعة بالبيانات ومشاركة التجارب الشخصية لتعزيز فعالية التواصل.",
      "كما يروج لدورة التواصل التنفيذي والتأثير التي يقدمها ويس، والتي تهدف إلى تحسين مهارات التواصل في مكان العمل."
    ],
    "commentSummary": [],
    "points": 335,
    "commentCount": 287,
    "retryCount": 0,
    "time": 1732389354
  },
  {
    "id": 42224330,
    "title": "دليل على أقدم كتابة أبجدية معروفة تم اكتشافه في مدينة سورية قديمة",
    "originLink": "https://hub.jhu.edu/2024/11/21/ancient-alphabet-discovered-syria/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42224330",
    "commentBody": "",
    "originSummary": [
      "اكتشف باحثون من جامعة جونز هوبكنز ما يمكن أن يكون أقدم كتابة أبجدية معروفة، تعود إلى حوالي 2400 قبل الميلاد، في قبر سوري.",
      "تشير هذه الاكتشافات إلى أن الكتابة الأبجدية أقدم بـ 500 عام مما كان يُعتقد سابقًا، مما قد يغير الفهم الحالي لأصولها.",
      "الكتابة، التي وُجدت على أسطوانات طينية في تل أم المرة في سوريا، تسبق النصوص المعروفة من مصر وسيتم تقديمها في الاجتماع السنوي للجمعية الأمريكية للبحث في الخارج."
    ],
    "commentSummary": [
      "اكتشف الباحثون أقدم كتابة أبجدية معروفة في مدينة سورية قديمة، تعود إلى حوالي 2400 قبل الميلاد، مما يشير إلى أن الكتابة الأبجدية قد تكون نشأت في وقت أسبق مما كان يُعتقد سابقًا. وُجدت الكتابة على أربعة أسطوانات طينية، ولكن بدون طريقة للترجمة، يبقى المحتوى تخمينيًا، مما يثير تساؤلات حول تطور وانتشار أنظمة الكتابة الأبجدية. هذا الاكتشاف مهم لأنه يتحدى النظريات الحالية حول الجدول الزمني وتأثير الكتابة الأبجدية في المجتمعات القديمة."
    ],
    "points": 314,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1732399882
  },
  {
    "id": 42223690,
    "title": "صمامات الهوائي في معالج بنتيوم",
    "originLink": "http://www.righto.com/2024/11/antenna-diodes-in-pentium-processor.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42223690",
    "commentBody": "",
    "originSummary": [
      "يتعمق مدونة كين شيريف في تاريخ الحواسيب، مع التركيز على الحواسيب القديمة والهندسة العكسية للدوائر المتكاملة (IC)، مما يوفر رؤى حول تعقيدات تصميم وتصنيع الرقائق.",
      "في منشور حول معالج بنتيوم، يشرح \"ثنائيات الهوائي\"، التي تحمي الدوائر من الشحنات الناتجة عن البلازما أثناء عملية النقش، وهو جانب حاسم في التصنيع.",
      "على الرغم من إطلاقه في عام 1993 مع 3.1 مليون ترانزستور، فإن استخدام الديودات الهوائية في معالج بنتيوم كان محدودًا بسبب قيود المساحة، مما يبرز التحديات المستمرة في تصميم الدوائر المتكاملة الحديثة للتخفيف من تأثيرات الهوائي."
    ],
    "commentSummary": [
      "تُستخدم صمامات الهوائي في معالجات بنتيوم أثناء التصنيع لمنع تراكم الشحنات على الأسلاك الطويلة، مما يحمي الدوائر من التلف.",
      "هذه الثنائيات ليست وظيفية في التصميم النشط للشريحة، مما يبرز دورها فقط في مرحلة التصنيع.",
      "تسلط المناقشة الضوء على العمليات المعقدة لتصنيع الرقائق، بما في ذلك استخدام طبقات ومواد متعددة مثل التنجستن للوصلات، مما يجذب اهتمام المهتمين بتصميم وتصنيع الرقائق."
    ],
    "points": 235,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1732394126
  },
  {
    "id": 42228538,
    "title": "خطأ ينهي المسيرة المهنية",
    "originLink": "https://bitfieldconsulting.com/posts/career",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42228538",
    "commentBody": "",
    "originSummary": [
      "تؤكد المقالة على أهمية التخطيط لنهاية مسيرتك المهنية، مع التركيز على تحقيق الأهداف المهنية التي تتجاوز مجرد التقاعد.",
      "يحدد ثلاثة مسارات مهنية محتملة: الأقدمية (أن تصبح مساهمًا فرديًا كبيرًا)، الإدارة (الانتقال إلى دور إداري)، والاستقلالية (العمل لحسابك الخاص).",
      "يؤكد النص على الحاجة إلى التأمل الذاتي، وتطوير المهارات، والمرونة، مشجعًا القراء على التخطيط النشط لمساراتهم المهنية والبقاء منفتحين على التغيير والفرص غير المتوقعة."
    ],
    "commentSummary": [
      "في صناعة التكنولوجيا، يمكن أن تصبح المساهمات قديمة بسرعة بعد المغادرة، حيث يتم إعادة كتابة الشفرات وفقدان الوثائق.",
      "يشير المنشور إلى أهمية إعطاء الأولوية للمكاسب المالية والرفاهية الشخصية على اتباع مسار وظيفي صارم، مسلطًا الضوء على أن الأدوار الإدارية قد تقدم قيمة طويلة الأمد أكثر من المناصب الفردية.",
      "يؤكد على أهمية التكيف في مسارات الحياة المهنية ويقترح أن العلاقات والرضا الشخصي غالبًا ما يفوقان الإنجازات المهنية."
    ],
    "points": 188,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1732463794
  },
  {
    "id": 42228759,
    "title": "مؤسس موقع Howstuffworks.com، مارشال برين، قد توفي",
    "originLink": "https://www.wral.com/news/local/nc-state-marshall-brain-dies-november-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42228759",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "مارشال برين، مبتكر موقع Howstuffworks.com ومؤلف الخيال التأملي \"مانا\"، قد توفي، تاركًا تأثيرًا كبيرًا على الكثيرين من خلال أعماله.",
      "كان أستاذًا في جامعة ولاية كارولينا الشمالية، حيث أثر في مستقبل العديد من الطلاب وشكله.",
      "وفاته، التي يُقال إنها كانت انتحارًا، تؤكد على الأهمية البالغة للوعي بالصحة النفسية، بينما يستمر إرثه في إلهام الفضول والفهم."
    ],
    "points": 147,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1732466347
  }
]
