[
  {
    "id": 42225481,
    "title": "AAA oyun geliştirmesinden ilham alan HTML cam kullanıcı arayüzü: Oyunlardan web'e buzlu cam",
    "originLink": "https://www.tyleo.com/html-glass.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42225481",
    "commentBody": "",
    "originSummary": [
      "Rehber, Forza Horizon 3 ve Forza Motorsport 7 gibi AAA oyunlarından ilham alarak HTML'de buzlu cam efekti oluşturmayı inceliyor, örnek kod ve varlıklar sağlıyor.",
      "Temel teknikler arasında bulanıklık efektleri için CSS'nin `backdrop-filter` özelliğini, derinlik için `box-shadow` özelliğini ve dinamik ışık yansımaları için JavaScript'i kullanmak yer alır. Hem JavaScript hem de JavaScript olmayan sürümler, platformlar arası uyumluluk için mevcuttur.",
      "Öğretici, kullanıcıların kendi çarpıcı cam kullanıcı arayüzlerini oluşturmalarına olanak tanıyan hızlı bir başlangıç için \"Son Tarif\" bölümünü içerir."
    ],
    "commentSummary": [
      "Metin, yüksek kaliteli oyun tasarımından ilham alan web geliştirmede buzlu cam kullanıcı arayüzü efektlerinin kullanımına odaklanıyor ve hem estetik çekiciliği hem de hesaplama maliyeti endişelerini vurguluyor.",
      "Sunucu bant genişliği ile istemci tarafı işleme arasındaki ödünleşmeler üzerine, kişisel deneyimlere ve teknolojik bakış açılarına dayanan farklı görüşlerle bir tartışma bulunmaktadır.",
      "Konuşma ayrıca modern GPU'ların verimliliğini ve farklı hesaplama yöntemlerinin çevresel etkisini de ele alıyor."
    ],
    "points": 612,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732414785
  },
  {
    "id": 42224670,
    "title": "Bocker: Yaklaşık 100 satır Bash ile uygulanmış Docker (2015)",
    "originLink": "https://github.com/p8952/bocker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42224670",
    "commentBody": "",
    "originSummary": [
      "Bocker Docker, hafif konteyner yönetimi için tasarlanmış, yaklaşık 100 satır bash ile yazılmış minimal bir Docker uygulamasıdır.",
      "Belirli sistem paketleri ve yapılandırmaları gerektirir, bunlar arasında bir btrfs dosya sistemi ve ağ ayarları bulunur ve kök erişimi ihtiyacı nedeniyle sanal bir makinede çalıştırılması en iyisidir.",
      "Bocker, konteynerleri oluşturma, çekme, çalıştırma ve kaynakları yönetme gibi temel Docker işlevlerini destekler, ancak veri hacmi konteynerleri ve port yönlendirme gibi özelliklerden yoksundur."
    ],
    "commentSummary": [
      "Bocker, Docker'ın temel işlevlerinin nasıl en aza indirilebileceğini gösteren, Bash ile yazılmış basitleştirilmiş bir Docker uygulamasıdır.",
      "Bu tartışma, proot ve chroot gibi diğer hafif ortam araçlarıyla karşılaştırmaları ve Podman gibi alternatifleri içermektedir.",
      "Temel konular arasında Docker'ın evrimi, ekosisteminin değeri ve konteynerleri Linux dışı sistemlerde çalıştırmanın zorlukları yer almaktadır."
    ],
    "points": 336,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1732403931
  },
  {
    "id": 42223099,
    "title": "Üst düzey bir lidere işten kovulmadan nasıl geri bildirim verilir",
    "originLink": "https://newsletter.weskao.com/p/how-to-give-a-senior-leader-feedback-without-getting-fired",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42223099",
    "commentBody": "",
    "originSummary": [
      "Wes Kao'nun Bülteni, 'daha da' tekniği ve diplomatik dil kullanımı gibi, üst düzey liderlere güvenli bir şekilde geri bildirimde bulunma stratejileri sunar.",
      "Bu bülten, iletişim etkinliğini artırmak için geri bildirimi verilerle desteklemeyi ve kişisel deneyimleri paylaşmayı vurgulamaktadır.",
      "Bu aynı zamanda, işyeri iletişim becerilerini geliştirmeyi amaçlayan Wes'in Yönetici İletişimi ve Etkileme kursunu da tanıtır."
    ],
    "commentSummary": [],
    "points": 335,
    "commentCount": 287,
    "retryCount": 0,
    "time": 1732389354
  },
  {
    "id": 42224330,
    "title": "En eski bilinen alfabetik yazının kanıtı, antik Suriye şehrinde ortaya çıkarıldı.",
    "originLink": "https://hub.jhu.edu/2024/11/21/ancient-alphabet-discovered-syria/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42224330",
    "commentBody": "",
    "originSummary": [
      "Johns Hopkins Üniversitesi'nden araştırmacılar, Suriye'deki bir mezarda yaklaşık MÖ 2400 yılına tarihlenen, bilinen en eski alfabetik yazı olabilecek bir keşif yaptılar.",
      "Bu keşif, alfabe yazısının daha önce inanıldığından 500 yıl daha eski olduğunu öne sürüyor ve bu durum, kökenine dair anlayışı potansiyel olarak değiştirebilir.",
      "Yazı, Suriye'deki Tell Umm-el Marra'da kil silindirler üzerinde bulunmuş olup, Mısır'dan bilinen yazılardan daha eski tarihlidir ve Amerikan Yurtdışı Araştırmalar Derneği'nin Yıllık Toplantısı'nda sunulacaktır."
    ],
    "commentSummary": [
      "Araştırmacılar, yaklaşık MÖ 2400 yılına tarihlenen, antik bir Suriye şehrinde bilinen en eski alfabetik yazıyı keşfettiler ve bu da alfabetik yazının daha önce inanıldığından daha erken bir dönemde ortaya çıkmış olabileceğini gösteriyor.- Yazı, dört kil silindir üzerinde bulundu, ancak bir çeviri yöntemi olmadan içeriği spekülatif kalıyor ve bu da alfabetik yazı sistemlerinin evrimi ve yayılması hakkında sorular ortaya çıkarıyor.- Bu bulgu, antik toplumlarda alfabetik yazının zaman çizelgesi ve etkisi hakkındaki mevcut teorilere meydan okuduğu için önemlidir."
    ],
    "points": 314,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1732399882
  },
  {
    "id": 42223690,
    "title": "Pentium İşlemcide Anten Diyotları",
    "originLink": "http://www.righto.com/2024/11/antenna-diodes-in-pentium-processor.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42223690",
    "commentBody": "",
    "originSummary": [
      "Ken Shirriff'in blogu, bilgisayar tarihine dalarak, eski bilgisayarlar ve entegre devre (IC) tersine mühendisliğine odaklanmakta, çip tasarımı ve üretiminin karmaşıklıkları hakkında bilgiler sunmaktadır.",
      "Pentium işlemcisi hakkında bir gönderide, üretimin kritik bir yönü olan aşındırma işlemi sırasında devreleri plazma kaynaklı yüklerden koruyan 'anten diyotlarını' açıklıyor.",
      "1993 yılında 3.1 milyon transistörle piyasaya sürülmesine rağmen, Pentium'un anten diyotları kullanımı, alan kısıtlamaları nedeniyle sınırlıdır ve bu durum, modern IC tasarımında anten etkilerini azaltma konusundaki devam eden zorlukları vurgulamaktadır."
    ],
    "commentSummary": [
      "Anten diyotları, üretim sırasında uzun tellerdeki yük birikimini önlemek için Pentium işlemcilerde kullanılır ve devreleri hasardan korur.",
      "Bu diyotlar, çipin aktif tasarımında işlevsel değildir, yalnızca üretim aşamasındaki rollerini vurgulamaktadır.",
      "Bu tartışma, çip tasarımı ve üretimiyle ilgilenenlere hitap ederek, via'lar için tungsten gibi çoklu katmanlar ve malzemelerin kullanımını içeren çip üretiminin karmaşık süreçlerine ışık tutuyor."
    ],
    "points": 235,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1732394126
  },
  {
    "id": 42228538,
    "title": "Mesleği Bitiren Bir Hata",
    "originLink": "https://bitfieldconsulting.com/posts/career",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42228538",
    "commentBody": "",
    "originSummary": [
      "Makale, sadece emeklilikten öte kariyer hedeflerine ulaşmaya odaklanarak kariyerinizin sonunu planlamanın önemini vurgulamaktadır.",
      "Üç potansiyel kariyer yolunu özetler: Kıdem (kıdemli bireysel katkı sağlayıcı olma), Yönetim (yönetici rolüne geçiş yapma) ve Bağımsızlık (kendi hesabına çalışma).",
      "Metin, öz değerlendirme, beceri geliştirme ve esnekliğin önemini vurgulamakta, okuyucuları kariyer yollarını aktif bir şekilde planlamaya ve değişime ve beklenmedik fırsatlara açık olmaya teşvik etmektedir."
    ],
    "commentSummary": [
      "Teknoloji endüstrisinde, kod yeniden yazıldıkça ve belgeler kayboldukça, katkılar ayrıldıktan sonra hızla geçersiz hale gelebilir.",
      "Yazı, katı bir kariyer yolundan ziyade finansal kazanç ve kişisel refahı önceliklendirmeyi öneriyor, yönetim rollerinin bireysel katkı sağlayan pozisyonlardan daha uzun vadeli değer sunabileceğini vurguluyor.",
      "Meslek yollarında uyum sağlama yeteneğinin önemini vurgular ve ilişkilerin ve kişisel tatminin genellikle kariyer başarılarından daha ağır bastığını öne sürer."
    ],
    "points": 188,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1732463794
  },
  {
    "id": 42228759,
    "title": "Howstuffworks.com'un yaratıcısı Marshall Brain hayatını kaybetti.",
    "originLink": "https://www.wral.com/news/local/nc-state-marshall-brain-dies-november-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42228759",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Howstuffworks.com'un yaratıcısı ve spekülatif kurgu \"Manna\"nın yazarı Marshall Brain, eserleriyle birçok kişide önemli bir etki bırakarak vefat etti.",
      "NC State Üniversitesi'nde profesördü, burada birçok öğrencinin geleceğini etkiledi ve şekillendirdi.",
      "İntihar sonucu olduğu bildirilen ölümü, ruh sağlığı farkındalığının kritik önemini vurgularken, mirası merak ve anlayışa ilham vermeye devam ediyor."
    ],
    "points": 147,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1732466347
  }
]
