[
  {
    "id": 42825441,
    "title": "Steam Brick: Ekran yok, kontrol cihazı yok, sadece bir güç düğmesi ve bir USB portu",
    "originLink": "https://crastinator-pro.github.io/steam-brick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42825441",
    "commentBody": "",
    "originSummary": [
      "Steam Brick Mod, bir Steam Deck'i daha küçük ve hafif hale getirmek için ekran ve kontrolcüyü çıkararak yalnızca temel bileşenleri bırakan özel bir projedir. Modifikasyon, 1TB OLED Steam Deck kullanır ve 3D yazıcı ile özel bir kasa oluşturmayı içerir, bu da orijinalinin yaklaşık üçte biri boyutunda ve %24 daha hafif bir cihazla sonuçlanır. Taşınabilirlik avantajlarına rağmen, modun BIOS erişimi olmaması ve cihazın açık olup olmadığını belirlemenin zorluğu gibi sınırlamaları vardır ve Valve tarafından resmi olarak desteklenmediği için hasar riski taşır."
    ],
    "commentSummary": [
      "Steam Brick, Steam Deck'in modifiye edilmiş bir versiyonudur ve yalnızca bir güç düğmesi ve USB portu bulunan, ekran veya kontrolcü içermeyen, taşınabilirlik ve kullanım kolaylığı için tasarlanmış bir cihazdır.",
      "XReal gözlüklerini ekran için kullanarak, geleneksel ekran korumasına ihtiyaç duymadan oyun oynamaya yönelik benzersiz bir yaklaşım sunuyor.",
      "Bu mod, kişisel bir projedir ve Valve tarafından resmi olarak desteklenmemektedir, çeşitli teknoloji kurulumları ve eğitim sistemleri üzerine tartışmalara yol açmaktadır."
    ],
    "points": 734,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737843313
  },
  {
    "id": 42830646,
    "title": "Bir uygulama ile yaparsak suç değildir",
    "originLink": "https://pluralistic.net/2025/01/25/potatotrac/#carbo-loading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42830646",
    "commentBody": "",
    "originSummary": [
      "Büyük gıda şirketlerinin, Potatotrac gibi üçüncü taraf veri aracılar aracılığıyla fiyatları koordine ederek fiyat sabitleme uygulamalarına katıldıkları ve bu uygulamanın \"açgözlüflasyon\" olarak adlandırıldığı iddia ediliyor.",
      "Bu sorun sadece gıda endüstrisi ile sınırlı kalmayıp, konut ve diğer sektörleri de etkileyerek rekabet otoritelerinin dikkatini çekmektedir.",
      "Cory Doctorow'un yeni kitabı \"Picks and Shovels,\" bu temalara dalıyor ve yazar, kitabı tanıtmak için birkaç kez ortaya çıkıyor."
    ],
    "commentSummary": [
      "ABD adalet sistemi, genellikle şirketlere karşı hoşgörülü davranarak, onların suistimaller için önemli cezalardan kaçınmalarına izin verirken, bireyler küçük ihlaller için daha sert sonuçlarla karşı karşıya kalmaktadır.",
      "Şirketler, yasal boşluklardan yararlanır ve lobiciler ile avukatlar kullanarak cezaları azaltır ve sistemleri manipüle eder, Uber'in sürücülere asgari ücret ödemekten kaçınmak için algoritmalar kullanması örneğinde görüldüğü gibi.",
      "Kurumsal suçları kanıtlamanın bireysel suçlara kıyasla karmaşıklığı, adalet sisteminin şirketleri etkili bir şekilde sorumlu tutmasını zorlaştırmaktadır."
    ],
    "points": 607,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1737905093
  },
  {
    "id": 42823722,
    "title": "Her HTML Elemanı",
    "originLink": "https://iamwillwang.com/dollar/every-html-element/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42823722",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Blog yazısı, büyük bir veri kümesi kullanarak HTML etiketleri ve niteliklerinin bir analizini sunmakta ve popüler etiket-nitelik kombinasyonlarının indirilebilir bir SQLite veritabanını sunmaktadır.",
      "HTML öğelerini keşfetmeye yönelik farklı yaklaşımları karşılaştırır, HTML ayrıştırma, kullanımdan kaldırılmış etiketler ve formlarda etiketlerin kullanımı gibi konuları tartışır.",
      "Yazı ayrıca XHTML'in tarihine, HTML'in anlambilimine ve özel öğelerin kullanımına da değiniyor, bazı kullanıcılar eski web tasarım uygulamalarını hatırlıyor."
    ],
    "points": 408,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1737831746
  },
  {
    "id": 42826536,
    "title": "Güney Vietnamlı pilot, ailesini kurtarmak için bir Cessna'yı bir uçak gemisine indirdi (2019)",
    "originLink": "https://www.historynet.com/maj-buang-lys-daring-feat-to-save-his-family/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42826536",
    "commentBody": "",
    "originSummary": [
      "Nisan 1975'te, Güney Vietnamlı pilot Binbaşı Buang-Ly, Güney Vietnam'ın düşüşü sırasında ailesiyle birlikte küçük bir uçakla cesur bir kaçış gerçekleştirdi. USS Midway'den Kaptan Lawrence Chambers, Buang'ın iniş yapabilmesi için güverteyi temizleme kararı aldı ve helikopterleri denize attı, böylece Buang güvenli bir şekilde iniş yapabildi. Bu olay, Amerikan sivillerinin ve \"risk altındaki\" Vietnamlıların Saygon'dan tahliyesinin son aşaması olan Sık Rüzgar Operasyonu'nun bir parçasıydı ve Buang'ın uçağı şu anda Ulusal Deniz Havacılığı Müzesi'nde sergilenmektedir."
    ],
    "commentSummary": [
      "Bir Güney Vietnamlı pilot, ailesini kurtarmak için Saigon'un düşüşü sırasında bir Cessna'yı bir ABD gemisine indirdi, bu da Vietnam Savaşı sırasında kişisel mücadeleleri ve direnci gösteriyor. Birçok Güney Vietnamlı asker, o dönemin umutsuzluğunu ve kaosunu vurgulayarak, mevcut herhangi bir uçakla kaçtı. Şimdi bir müze olan USS Midway, bu olaylarda önemli bir rol oynadı ve savaşın daha geniş insan etkisini ve karmaşık jeopolitik meseleleri yansıtıyor."
    ],
    "points": 294,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1737852046
  },
  {
    "id": 42828198,
    "title": "YC Mezarlığı: 821 aktif olmayan Y Combinator girişimi",
    "originLink": "https://ycgraveyard.iamwillwang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42828198",
    "commentBody": "",
    "originSummary": [
      "YC Mezarlığı, önde gelen bir girişim hızlandırıcısı olan Y Combinator'dan 821 aktif olmayan girişimi listeleyerek yeni girişimlerin karşılaştığı zorlukları vurguluyor. 39 parti ve 50 sektörden gelen bu girişimler, finans, sağlık, perakende ve teknoloji gibi alanları kapsayarak Y Combinator'un geniş etkisini gösteriyor. Blume Benefits, Fileforge ve Celest gibi dikkat çekici şirketler, girişimlerin yüksek riskli doğasını yansıtarak faaliyetlerini durduranlar arasında yer alıyor."
    ],
    "commentSummary": [
      "YC Graveyard, Y Combinator girişimlerinden 821 tanesinin aktif olmadığını belirledi ve bu durum, girişim ekosistemindeki yüksek başarısızlık oranını vurguluyor.",
      "Yatırımcılar, genellikle ölçeklenemeyen bir \"yaşam tarzı işinden\" ziyade kesin bir başarısızlığı tercih ederler, çünkü bu onlara kayıpları silme imkanı tanır, bazı girişimler ise yetenekleri veya varlıkları için \"acqui-hire\" edilir.",
      "Bu tartışma, küçük işletmelerin doğası, yatırımcı rollerini, girişim başarısı zorluklarını ve girişim sermayesinin daha geniş etkilerini, girişim finansmanı dinamikleri ve kurucu tazminatı dahil olmak üzere ele alıyor."
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737873432
  },
  {
    "id": 42824562,
    "title": "Geçersiz bir 68030 komutu, Mac Classic II'nin yanlışlıkla başlatılmasına izin verdi.",
    "originLink": "https://www.downtowndougbrown.com/2025/01/the-invalid-68030-instruction-that-accidentally-allowed-the-mac-classic-ii-to-successfully-boot-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42824562",
    "commentBody": "",
    "originSummary": [
      "Doug Brown, Macintosh Classic II'nin ROM'unda, cihazın başlamasını engellemesi gereken bir hata tespit etti, ancak Motorola MC68030 CPU'daki tanımsız bir komutun bu işlemi sürdürmesine izin verdi. Doug, MAME emülatörünü kullanarak, Classic II'nin geçersiz bir adresten kaynaklanan bir veri yolu hatası nedeniyle 32-bit modunda başlatılamadığını keşfetti; bu hata, gerçek donanımda belgelenmemiş bir komutla düzeltildi. Bu bulgu, emülatörlerin gizli donanım hatalarını ortaya çıkarmadaki rolünü ve belgelenmemiş CPU komutlarının karmaşıklıklarını vurguluyor; gerçek donanım testleri, başlatma için belgelenmemiş komutun önemini doğruluyor."
    ],
    "commentSummary": [
      "MC68030 CPU'da belgelenmemiş bir talimat, Mac Classic II'nin yasadışı talimat algılamayı atlayarak önyükleme yapmasına ve A1 kaydını beklenmedik bir şekilde değiştirmesine olanak tanıdı.",
      "Bu keşif, 6502 ve x86 mimarilerinde bulunanlara benzer şekilde, CPU'larda belgelenmemiş talimatların varlığını vurgulamakta olup, beklenmedik davranışlara yol açabilir.",
      "68030 mimarisi, zarafetiyle tanınır, çeşitli sistemlerde kullanılmıştır, ancak karmaşıklığı sonunda ölçeklenebilirliğini engellemiştir."
    ],
    "points": 269,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1737836981
  }
]
