[
  {
    "id": 42825441,
    "title": "Steam Brick: Без экрана, без контроллера, только кнопка питания и USB-порт",
    "originLink": "https://crastinator-pro.github.io/steam-brick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42825441",
    "commentBody": "",
    "originSummary": [
      "Мод Steam Brick — это кастомный проект, который модифицирует Steam Deck, делая его меньше и легче за счет удаления экрана и контроллера, оставляя только основные компоненты. Модификация использует 1TB OLED Steam Deck и включает создание кастомного корпуса с помощью 3D-принтера, в результате чего устройство становится примерно на треть меньше и на 24% легче оригинала. Несмотря на преимущества в портативности, мод имеет ограничения, такие как отсутствие доступа к BIOS и сложность определения, включено ли устройство, и он не поддерживается официально компанией Valve, что создает риски повреждения."
    ],
    "commentSummary": [
      "Steam Brick — это модифицированная версия Steam Deck, не имеющая экрана или контроллера, только кнопка питания и USB-порт, разработанная для портативности и простоты использования.",
      "Он использует очки XReal для отображения, предлагая уникальный подход к играм без необходимости в традиционной защите экрана.",
      "Этот мод является личным проектом и не поддерживается официально компанией Valve, вызывая обсуждения о различных технических настройках и образовательных системах."
    ],
    "points": 734,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737843313
  },
  {
    "id": 42830646,
    "title": "Это не преступление, если мы делаем это с помощью приложения",
    "originLink": "https://pluralistic.net/2025/01/25/potatotrac/#carbo-loading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42830646",
    "commentBody": "",
    "originSummary": [
      "Крупные продовольственные компании якобы используют приложения для участия в ценовом сговоре, практике, называемой «жадной инфляцией», координируя ценообразование через сторонних брокеров данных, таких как Potatotrac.",
      "Эта проблема не ограничивается пищевой промышленностью, но также затрагивает жилищный сектор и другие отрасли, привлекая внимание антимонопольных органов.",
      "Новая книга Кори Доктороу «Кирки и лопаты» углубляется в эти темы, и автор делает несколько выступлений для её продвижения."
    ],
    "commentSummary": [
      "Система правосудия США часто проявляет снисходительность к корпорациям, позволяя им избегать значительных наказаний за неправомерные действия, в то время как отдельные лица сталкиваются с более суровыми последствиями за незначительные нарушения.",
      "Корпорации используют юридические лазейки и нанимают лоббистов и юристов, чтобы уменьшить штрафы и манипулировать системами, как это видно на примере использования Uber алгоритмов для уклонения от выплаты водителям минимальной заработной платы.",
      "Сложность доказывания корпоративных преступлений по сравнению с индивидуальными правонарушениями делает систему правосудия менее эффективной в привлечении корпораций к ответственности."
    ],
    "points": 607,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1737905093
  },
  {
    "id": 42823722,
    "title": "Каждый HTML-элемент",
    "originLink": "https://iamwillwang.com/dollar/every-html-element/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42823722",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "В блоге представлен анализ HTML-тегов и атрибутов с использованием большого набора данных, предлагается для скачивания база данных SQLite с популярными комбинациями тегов и атрибутов.",
      "Он сравнивает различные подходы к исследованию HTML-элементов, обсуждая такие темы, как разбор HTML, устаревшие теги и использование меток в формах.",
      "Пост также углубляется в историю XHTML, семантику HTML и использование пользовательских элементов, при этом некоторые пользователи вспоминают старые практики веб-дизайна."
    ],
    "points": 408,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1737831746
  },
  {
    "id": 42826536,
    "title": "Южновьетнамский пилот, который посадил Cessna на авианосец, чтобы спасти свою семью (2019)",
    "originLink": "https://www.historynet.com/maj-buang-lys-daring-feat-to-save-his-family/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42826536",
    "commentBody": "",
    "originSummary": [
      "В апреле 1975 года майор Буанг-Ли, южновьетнамский пилот, совершил дерзкий побег со своей семьей на небольшом самолете во время падения Южного Вьетнама. Капитан Лоуренс Чамберс с авианосца USS Midway принял беспрецедентное решение освободить палубу для посадки Буанга, даже сбросив вертолеты, что позволило Буангу безопасно приземлиться. Это событие было частью операции \"Частый ветер\", заключительной фазы эвакуации американских гражданских лиц и \"находящихся в зоне риска\" вьетнамцев из Сайгона, и самолет Буанга теперь выставлен в Национальном музее военно-морской авиации."
    ],
    "commentSummary": [
      "Южновьетнамский пилот посадил самолет Cessna на американский авианосец, чтобы спасти свою семью во время падения Сайгона, иллюстрируя личные трудности и стойкость вьетнамской войны. Многие южновьетнамские солдаты бежали, используя любые доступные воздушные суда, что подчеркивает отчаяние и хаос того времени. USS Midway, ныне музей, сыграл ключевую роль в этих событиях, отражая более широкий человеческий эффект войны и сложные геополитические проблемы."
    ],
    "points": 294,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1737852046
  },
  {
    "id": 42828198,
    "title": "YC Graveyard: 821 неактивный стартап Y Combinator",
    "originLink": "https://ycgraveyard.iamwillwang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42828198",
    "commentBody": "",
    "originSummary": [
      "Список YC Graveyard включает 821 неактивный стартап от Y Combinator, известного акселератора стартапов, подчеркивая трудности, с которыми сталкиваются новые предприятия. Эти стартапы из 39 наборов и 50 отраслей, включая такие сектора, как финансы, здравоохранение, розничная торговля и технологии, демонстрируют широкий охват влияния Y Combinator. Известные компании, такие как Blume Benefits, Fileforge и Celest, входят в число тех, кто прекратил свою деятельность, что отражает высокорисковый характер стартапов."
    ],
    "commentSummary": [
      "YC Graveyard выявил 821 неактивный стартап Y Combinator, подчеркивая высокий уровень неудач в экосистеме стартапов.",
      "Инвесторы часто предпочитают определенный провал «бизнесу для жизни», который не масштабируется, так как это позволяет им списать убытки, в то время как некоторые стартапы приобретаются через «аквахайринг» ради их талантов или активов.",
      "Обсуждение углубляется в природу малого бизнеса, роли инвесторов, проблемы успеха стартапов и более широкие последствия венчурного капитала, включая динамику финансирования стартапов и компенсацию основателей."
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737873432
  },
  {
    "id": 42824562,
    "title": "Неверная инструкция 68030 случайно позволила Mac Classic II загрузиться.",
    "originLink": "https://www.downtowndougbrown.com/2025/01/the-invalid-68030-instruction-that-accidentally-allowed-the-mac-classic-ii-to-successfully-boot-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42824562",
    "commentBody": "",
    "originSummary": [
      "«Даг Браун выявил ошибку в ПЗУ Macintosh Classic II, которая должна была помешать его загрузке, но неопределенная инструкция на процессоре Motorola MC68030 позволила ему продолжить. Используя эмулятор MAME, Даг обнаружил, что Classic II не загружается в 32-битном режиме из-за ошибки шины от недопустимого адреса, исправленной не документированной инструкцией на реальном оборудовании. Это открытие подчеркивает роль эмуляторов в выявлении скрытых ошибок оборудования и сложностей не документированных инструкций процессора, при этом тесты на реальном оборудовании подтверждают важность не документированной инструкции для загрузки.»"
    ],
    "commentSummary": [
      "Недокументированная инструкция в процессоре MC68030 позволяла Mac Classic II загружаться, обходя обнаружение недопустимых инструкций, неожиданно изменяя регистр A1.",
      "Это открытие подчеркивает существование недокументированных инструкций в процессорах, аналогичных тем, что обнаружены в архитектурах 6502 и x86, которые могут приводить к непредсказуемому поведению.",
      "Архитектура 68030, известная своей элегантностью, использовалась в различных системах, но её сложность в конечном итоге препятствовала её масштабируемости."
    ],
    "points": 269,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1737836981
  }
]
