[
  {
    "id": 42825441,
    "title": "„Steam Brick: Žádná obrazovka, žádný ovladač, jen tlačítko napájení a USB port“",
    "originLink": "https://crastinator-pro.github.io/steam-brick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42825441",
    "commentBody": "",
    "originSummary": [
      "„Steam Brick Mod je vlastní projekt, který upravuje Steam Deck tak, aby byl menší a lehčí odstraněním obrazovky a ovladače, přičemž zůstávají pouze nezbytné komponenty. Úprava využívá 1TB OLED Steam Deck a zahrnuje vytvoření vlastního pouzdra pomocí 3D tiskárny, což vede k zařízení přibližně třetiny velikosti a o 24 % lehčímu než originál. Navzdory výhodám v přenosnosti má modifikace omezení, jako je nemožnost přístupu k BIOSu a obtížné zjištění, zda je zařízení zapnuté, a není oficiálně podporována společností Valve, což představuje riziko poškození.“"
    ],
    "commentSummary": [
      "„Steam Brick je upravená verze Steam Decku, která nemá obrazovku ani ovladač, pouze tlačítko napájení a USB port, navržená pro přenosnost a snadné použití.“",
      "„Využívá brýle XReal pro zobrazení, což nabízí jedinečný přístup ke hraní her bez potřeby tradiční ochrany obrazovky.“",
      "„Tento mod je osobním projektem a není oficiálně podporován společností Valve, což vyvolává diskuse o různých technologických nastaveních a vzdělávacích systémech.“"
    ],
    "points": 734,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737843313
  },
  {
    "id": 42830646,
    "title": "„Není to zločin, pokud to uděláme pomocí aplikace.“",
    "originLink": "https://pluralistic.net/2025/01/25/potatotrac/#carbo-loading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42830646",
    "commentBody": "",
    "originSummary": [
      "„Velké potravinářské společnosti údajně používají aplikace k zapojení do cenové fixace, což je praktika nazývaná 'chamtivá inflace', tím, že koordinují ceny prostřednictvím zprostředkovatelů dat třetích stran, jako je Potatotrac.“",
      "„Tento problém se netýká pouze potravinářského průmyslu, ale také ovlivňuje bydlení a další sektory, což přitahuje pozornost antimonopolních úřadů.“",
      "„Nová kniha Coryho Doctorowa, 'Picks and Shovels', se zabývá těmito tématy, přičemž autor se několikrát objeví, aby ji propagoval.“"
    ],
    "commentSummary": [
      "„Americký justiční systém často projevuje shovívavost vůči korporacím, což jim umožňuje vyhnout se významným trestům za pochybení, zatímco jednotlivci čelí přísnějším důsledkům za drobné přestupky.“",
      "„Korporace využívají právní mezery a zaměstnávají lobbisty a právníky k redukci pokut a manipulaci systémů, jak je vidět na příkladu Uberu, který používá algoritmy k tomu, aby se vyhnul placení minimální mzdy řidičům.“",
      "„Složitost prokazování korporátních zločinů ve srovnání s individuálními delikty činí pro justiční systém výzvu efektivně pohnat korporace k odpovědnosti.“"
    ],
    "points": 607,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1737905093
  },
  {
    "id": 42823722,
    "title": "„Každý HTML prvek“",
    "originLink": "https://iamwillwang.com/dollar/every-html-element/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42823722",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Blogový příspěvek poskytuje analýzu HTML značek a atributů pomocí rozsáhlého datového souboru a nabízí ke stažení SQLite databázi oblíbených kombinací značek a atributů.“",
      "„Porovnává různé přístupy k prozkoumávání HTML prvků, diskutuje témata jako je parsování HTML, zastaralé značky a použití štítků ve formulářích.“",
      "„Příspěvek se také zabývá historií XHTML, sémantikou HTML a používáním vlastních prvků, přičemž někteří uživatelé vzpomínají na starší praktiky webového designu.“"
    ],
    "points": 408,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1737831746
  },
  {
    "id": 42826536,
    "title": "„Jihovietnamský pilot, který přistál s Cessnou na letadlové lodi, aby zachránil svou rodinu (2019)“",
    "originLink": "https://www.historynet.com/maj-buang-lys-daring-feat-to-save-his-family/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42826536",
    "commentBody": "",
    "originSummary": [
      "„V dubnu 1975 provedl major Buang-Ly, jihovietnamský pilot, odvážný útěk se svou rodinou v malém letadle během pádu Jižního Vietnamu. Kapitán Lawrence Chambers z USS Midway učinil bezprecedentní rozhodnutí uvolnit palubu pro Buangovo přistání, dokonce vyhodil vrtulníky, což umožnilo Buangovi bezpečně přistát. Tato událost byla součástí Operace Častý vítr, závěrečné fáze evakuace amerických civilistů a „ohrožených“ Vietnamců ze Saigonu, a Buangovo letadlo je nyní vystaveno v Národním muzeu námořního letectví.“"
    ],
    "commentSummary": [
      "„Jihovietnamský pilot přistál s letounem Cessna na americké letadlové lodi, aby zachránil svou rodinu během pádu Saigonu, což ilustruje osobní boje a odolnost během války ve Vietnamu. Mnoho jihovietnamských vojáků prchalo pomocí jakéhokoli dostupného letadla, což zdůrazňuje zoufalství a chaos té doby. USS Midway, nyní muzeum, byla klíčová v těchto událostech, což odráží širší lidský dopad války a složité geopolitické otázky.“"
    ],
    "points": 294,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1737852046
  },
  {
    "id": 42828198,
    "title": "„YC Graveyard: 821 neaktivních startupů Y Combinator“",
    "originLink": "https://ycgraveyard.iamwillwang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42828198",
    "commentBody": "",
    "originSummary": [
      "„YC Graveyard uvádí 821 neaktivních startupů z Y Combinator, významného akcelerátoru startupů, což zdůrazňuje výzvy, kterým čelí nové podniky. Tyto startupy, pocházející z 39 skupin a 50 odvětví, zahrnují sektory jako finance, zdravotnictví, maloobchod a technologie, což ukazuje na široký dosah vlivu Y Combinator. Mezi známé společnosti, které ukončily svou činnost, patří Blume Benefits, Fileforge a Celest, což odráží vysoké riziko spojené s podnikáním ve startupovém prostředí.“"
    ],
    "commentSummary": [
      "„YC Graveyard identifikoval 821 neaktivních startupů z Y Combinatoru, což zdůrazňuje vysokou míru neúspěchu v ekosystému startupů.“",
      "„Investoři často upřednostňují definitivní neúspěch před „lifestyle business“, který se nerozšiřuje, protože jim to umožňuje odepsat ztráty, zatímco některé startupy jsou „acqui-hired“ pro svůj talent nebo aktiva.“",
      "„Diskuse se zabývá povahou malých podniků, rolemi investorů, výzvami úspěchu startupů a širšími důsledky rizikového kapitálu, včetně dynamiky financování startupů a odměňování zakladatelů.“"
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737873432
  },
  {
    "id": 42824562,
    "title": "„Neplatná instrukce 68030 náhodně umožnila Mac Classic II spustit.“",
    "originLink": "https://www.downtowndougbrown.com/2025/01/the-invalid-68030-instruction-that-accidentally-allowed-the-mac-classic-ii-to-successfully-boot-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42824562",
    "commentBody": "",
    "originSummary": [
      "„Doug Brown identifikoval chybu v ROM počítače Macintosh Classic II, která by měla zabránit jeho spuštění, ale nedefinovaná instrukce na procesoru Motorola MC68030 mu umožnila pokračovat. Pomocí emulátoru MAME Doug zjistil, že Classic II se v 32bitovém režimu nespustil kvůli chybě sběrnice z neplatné adresy, kterou opravila nedokumentovaná instrukce na skutečném hardwaru. Tento nález zdůrazňuje roli emulátorů při odhalování skrytých chyb hardwaru a složitosti nedokumentovaných instrukcí CPU, přičemž testy na skutečném hardwaru potvrdily důležitost nedokumentované instrukce pro spuštění.“"
    ],
    "commentSummary": [
      "„Nezdokumentovaná instrukce v procesoru MC68030 umožnila počítači Mac Classic II spustit se tím, že obešla detekci nelegálních instrukcí a neočekávaně změnila registr A1.“",
      "„Tento objev zdůrazňuje existenci nedokumentovaných instrukcí v procesorech, podobně jako u architektur 6502 a x86, které mohou vést k neočekávanému chování.“",
      "„Architektura 68030, známá svou elegancí, byla používána v různých systémech, ale její složitost nakonec bránila její škálovatelnosti.“"
    ],
    "points": 269,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1737836981
  }
]
