[
  {
    "id": 42825441,
    "title": "סטים בריק: ללא מסך, ללא בקר, רק כפתור הפעלה ויציאת USB",
    "originLink": "https://crastinator-pro.github.io/steam-brick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42825441",
    "commentBody": "",
    "originSummary": [
      "המוד של Steam Brick הוא פרויקט מותאם אישית שמבצע שינוי ב-Steam Deck כדי להפוך אותו לקטן וקל יותר על ידי הסרת המסך והבקר, והשארת הרכיבים החיוניים בלבד. השינוי משתמש ב-Steam Deck עם 1TB OLED וכולל יצירת מארז מותאם אישית עם מדפסת תלת-ממד, מה שמוביל למכשיר בגודל של כשליש מהמקורי וקל ב-24% ממנו. למרות היתרונות בניידות, למוד יש מגבלות, כמו חוסר גישה ל-BIOS וקושי לקבוע אם המכשיר פועל, והוא אינו נתמך רשמית על ידי Valve, מה שמעמיד בסיכון לנזק."
    ],
    "commentSummary": [
      "ה-Steam Brick הוא גרסה מותאמת של ה-Steam Deck, הכוללת ללא מסך או בקר, רק כפתור הפעלה ויציאת USB, שתוכננה לניידות ולנוחות שימוש.",
      "זה משתמש במשקפי XReal לתצוגה, ומציע גישה ייחודית למשחקים ללא הצורך בהגנה מסורתית על המסך.",
      "מוד זה הוא פרויקט אישי ואינו נתמך רשמית על ידי Valve, מה שמעורר דיונים על מערכות טכנולוגיות שונות ומערכות חינוך."
    ],
    "points": 734,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737843313
  },
  {
    "id": 42830646,
    "title": "זה לא פשע אם אנחנו עושים את זה עם אפליקציה",
    "originLink": "https://pluralistic.net/2025/01/25/potatotrac/#carbo-loading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42830646",
    "commentBody": "",
    "originSummary": [
      "נטען כי חברות מזון גדולות משתמשות באפליקציות כדי לעסוק בתיאום מחירים, תופעה המכונה \"אינפלציית חמדנות\", על ידי תיאום מחירים באמצעות מתווכי נתונים צד שלישי כמו Potatotrac.",
      "בעיה זו אינה מוגבלת לתעשיית המזון אלא משפיעה גם על תחום הדיור ומגזרים אחרים, ומושכת תשומת לב מרשויות ההגבלים העסקיים.",
      "ספרו החדש של קורי דוקטורוב, \"Picks and Shovels\", מתעמק בנושאים אלו, והמחבר מופיע במספר אירועים כדי לקדם אותו."
    ],
    "commentSummary": [
      "המערכת המשפטית בארצות הברית לעיתים קרובות מראה סלחנות כלפי תאגידים, ומאפשרת להם להימנע מעונשים משמעותיים על התנהגות פסולה, בעוד שאנשים פרטיים מתמודדים עם השלכות חמורות יותר על עבירות קלות.",
      "תאגידים מנצלים פרצות חוקיות ומשתמשים בלוביסטים ועורכי דין כדי להפחית קנסות ולתמרן מערכות, כפי שנראה בשימוש של אובר באלגוריתמים כדי להימנע מתשלום שכר מינימום לנהגים.",
      "המורכבות שבהוכחת פשעים תאגידיים בהשוואה לעבירות של יחידים מקשה על מערכת המשפט להחזיק תאגידים באחריות בצורה יעילה."
    ],
    "points": 607,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1737905093
  },
  {
    "id": 42823722,
    "title": "כל אלמנט HTML",
    "originLink": "https://iamwillwang.com/dollar/every-html-element/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42823722",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "הפוסט בבלוג מספק ניתוח של תגיות ותגים ב-HTML באמצעות מאגר נתונים גדול, ומציע להורדה מסד נתונים של SQLite עם שילובים פופולריים של תגיות-תגים.",
      "זה משווה בין גישות שונות לחקר אלמנטים ב-HTML, תוך דיון בנושאים כמו ניתוח HTML, תגיות שהוצאו משימוש, והשימוש בתוויות בטפסים.",
      "הפוסט גם מתעמק בהיסטוריה של XHTML, בסמנטיקה של HTML ובשימוש באלמנטים מותאמים אישית, כאשר חלק מהמשתמשים נזכרים בפרקטיקות עיצוב אתרים ישנות."
    ],
    "points": 408,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1737831746
  },
  {
    "id": 42826536,
    "title": "הטייס הדרום וייטנאמי שנחת עם ססנה על נושאת מטוסים כדי להציל את משפחתו (2019)",
    "originLink": "https://www.historynet.com/maj-buang-lys-daring-feat-to-save-his-family/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42826536",
    "commentBody": "",
    "originSummary": [
      "באפריל 1975, מייג'ור בואנג-לי, טייס דרום וייטנאמי, ביצע בריחה נועזת עם משפחתו במטוס קטן במהלך נפילת דרום וייטנאם. קפטן לורנס צ'יימברס מה-USS מידוויי קיבל את ההחלטה חסרת התקדים לפנות את הסיפון לנחיתת בואנג, ואף השליך מסוקים, מה שאיפשר לבואנג לנחות בבטחה. אירוע זה היה חלק ממבצע \"רוח תכופה\", השלב האחרון של פינוי אזרחים אמריקאים ווייטנאמים \"בסיכון\" מסייגון, ומטוסו של בואנג מוצג כיום במוזיאון הלאומי לתעופה ימית."
    ],
    "commentSummary": [
      "טייס דרום וייטנאמי נחת עם מטוס ססנה על נושאת מטוסים אמריקאית כדי להציל את משפחתו במהלך נפילת סייגון, מה שממחיש את המאבקים האישיים והחוסן במהלך מלחמת וייטנאם. חיילים דרום וייטנאמים רבים נמלטו באמצעות כל כלי טיס זמין, מה שמדגיש את הייאוש והכאוס של התקופה. ה-USS מידוויי, שכיום משמשת כמוזיאון, הייתה מרכזית באירועים אלו, ומשקפת את ההשפעה האנושית הרחבה של המלחמה ואת הסוגיות הגיאופוליטיות המורכבות."
    ],
    "points": 294,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1737852046
  },
  {
    "id": 42828198,
    "title": "בית הקברות של YC: 821 סטארטאפים לא פעילים של Y Combinator",
    "originLink": "https://ycgraveyard.iamwillwang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42828198",
    "commentBody": "",
    "originSummary": [
      "ה YC Graveyard מפרט 821 סטארטאפים לא פעילים מ-Y Combinator, מאיץ סטארטאפים בולט, המדגיש את האתגרים העומדים בפני מיזמים חדשים. סטארטאפים אלה, מ-39 מחזורים ו-50 תעשיות, כוללים מגזרים כמו פיננסים, בריאות, קמעונאות וטכנולוגיה, ומדגימים את ההשפעה הרחבה של Y Combinator. חברות בולטות כמו Blume Benefits, Fileforge ו-Celest הן בין אלה שהפסיקו לפעול, מה שמשקף את האופי המסוכן של מיזמי סטארטאפ."
    ],
    "commentSummary": [
      "YC Graveyard זיהה 821 סטארטאפים לא פעילים של Y Combinator, מה שמדגיש את שיעור הכישלון הגבוה במערכת האקוסיסטם של הסטארטאפים.",
      "משקיעים לעיתים קרובות מעדיפים כישלון מוחלט על פני \"עסק סגנון חיים\" שאינו מתרחב, מכיוון שזה מאפשר להם למחוק הפסדים, בעוד שחלק מהסטארטאפים נרכשים עבור הכישרון או הנכסים שלהם.",
      "הדיון מתעמק בטבע העסקים הקטנים, תפקידי המשקיעים, אתגרי ההצלחה של סטארטאפים וההשלכות הרחבות יותר של הון סיכון, כולל דינמיקות מימון סטארטאפים ופיצוי מייסדים."
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737873432
  },
  {
    "id": 42824562,
    "title": "פקודת 68030 לא חוקית אפשרה בטעות ל-Mac Classic II לאתחל",
    "originLink": "https://www.downtowndougbrown.com/2025/01/the-invalid-68030-instruction-that-accidentally-allowed-the-mac-classic-ii-to-successfully-boot-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42824562",
    "commentBody": "",
    "originSummary": [
      "דאג בראון זיהה באג ב-ROM של ה-Macintosh Classic II שהיה אמור למנוע ממנו להפעיל, אך הוראה לא מוגדרת במעבד Motorola MC68030 אפשרה לו להמשיך. באמצעות אמולטור MAME, דאג גילה שה-Classic II נכשל בהפעלה במצב 32 ביט עקב שגיאת אוטובוס מכתובת לא חוקית, שתוקנה על ידי הוראה לא מתועדת בחומרה האמיתית. ממצא זה מדגיש את תפקידם של אמולטורים בגילוי באגים חבויים בחומרה ואת המורכבות של הוראות מעבד לא מתועדות, כאשר בדיקות בחומרה אמיתית מאשרות את חשיבות ההוראה הלא מתועדת להפעלה."
    ],
    "commentSummary": [
      "פקודה לא מתועדת במעבד MC68030 אפשרה למחשב Mac Classic II לאתחל על ידי עקיפת זיהוי פקודות לא חוקיות, ושינתה באופן בלתי צפוי את הרגיסטר A1.",
      "תגלית זו מדגישה את קיומן של הוראות לא מתועדות במעבדים, בדומה לאלה שנמצאו בארכיטקטורות 6502 ו-x86, אשר יכולות להוביל להתנהגות בלתי צפויה.",
      "הארכיטקטורה של 68030, הידועה באלגנטיות שלה, שימשה במערכות שונות, אך המורכבות שלה בסופו של דבר הגבילה את יכולת ההתרחבות שלה."
    ],
    "points": 269,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1737836981
  }
]
