[
  {
    "id": 42825441,
    "title": "Steam Brick: Ei näyttöä, ei ohjainta, vain virtapainike ja USB-portti",
    "originLink": "https://crastinator-pro.github.io/steam-brick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42825441",
    "commentBody": "",
    "originSummary": [
      "Steam Brick Mod on mukautettu projekti, joka muokkaa Steam Deckiä pienemmäksi ja kevyemmäksi poistamalla näytön ja ohjaimen, jättäen vain olennaiset komponentit. Muokkaus käyttää 1TB OLED Steam Deckiä ja sisältää mukautetun kotelon luomisen 3D-tulostimella, mikä johtaa laitteeseen, joka on noin kolmasosan alkuperäisen koosta ja 24 % kevyempi. Huolimatta sen kannettavuushyödyistä, modilla on rajoituksia, kuten BIOS:in käyttömahdollisuuden puute ja vaikeus määrittää, onko laite päällä, eikä Valve tue sitä virallisesti, mikä aiheuttaa vaurioitumisriskin."
    ],
    "commentSummary": [
      "Steam Brick on muokattu versio Steam Deckistä, jossa ei ole näyttöä tai ohjainta, vaan ainoastaan virtapainike ja USB-portti, ja se on suunniteltu kannettavuutta ja helppokäyttöisyyttä silmällä pitäen.",
      "Se hyödyntää XReal-laseja näyttöön, tarjoten ainutlaatuisen lähestymistavan pelaamiseen ilman perinteistä näytönsuojaa.",
      "Tämä mod on henkilökohtainen projekti eikä Valve tue sitä virallisesti, mikä on herättänyt keskusteluja erilaisista teknisistä kokoonpanoista ja koulutusjärjestelmistä."
    ],
    "points": 734,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1737843313
  },
  {
    "id": 42830646,
    "title": "Se ei ole rikos, jos teemme sen sovelluksella",
    "originLink": "https://pluralistic.net/2025/01/25/potatotrac/#carbo-loading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42830646",
    "commentBody": "",
    "originSummary": [
      "Suuret elintarvikeyritykset käyttävät väitetysti sovelluksia hintojen kiinnittämiseen, käytäntöä, jota kutsutaan \"ahneusinflaatioksi\", koordinoimalla hinnoittelua kolmansien osapuolten datavälittäjien, kuten Potatotracin, kautta.",
      "Tämä ongelma ei rajoitu vain elintarviketeollisuuteen, vaan vaikuttaa myös asumiseen ja muihin aloihin, herättäen kilpailuviranomaisten huomion.",
      "Cory Doctorowin uusi kirja, \"Picks and Shovels,\" syventyy näihin teemoihin, ja kirjailija esiintyy useaan otteeseen sen mainostamiseksi."
    ],
    "commentSummary": [
      "Yhdysvaltain oikeusjärjestelmä osoittaa usein lievyyttä yrityksiä kohtaan, mikä sallii niiden välttää merkittäviä rangaistuksia väärinkäytöksistä, kun taas yksilöt kohtaavat ankarampia seuraamuksia pienistä rikkomuksista.",
      "Yritykset hyödyntävät laillisia porsaanreikiä ja käyttävät lobbaajia ja lakimiehiä vähentääkseen sakkoja ja manipuloidakseen järjestelmiä, kuten Uberin algoritmien käyttöä välttääkseen maksamasta kuljettajille minimipalkkaa.",
      "Yritysrikosten todistamisen monimutkaisuus verrattuna yksilöiden rikoksiin tekee oikeusjärjestelmälle haastavaksi saattaa yritykset tehokkaasti vastuuseen."
    ],
    "points": 607,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1737905093
  },
  {
    "id": 42823722,
    "title": "Jokainen HTML-elementti",
    "originLink": "https://iamwillwang.com/dollar/every-html-element/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42823722",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Blogikirjoitus tarjoaa analyysin HTML-tageista ja attribuuteista käyttäen suurta tietoaineistoa, ja tarjoaa ladattavaksi SQLite-tietokannan suosituista tagi-attribuutti-yhdistelmistä.",
      "Se vertailee erilaisia lähestymistapoja HTML-elementtien tutkimiseen, käsitellen aiheita kuten HTML-jäsennys, vanhentuneet tunnisteet ja nimilappujen käyttö lomakkeissa.",
      "Viesti käsittelee myös XHTML:n historiaa, HTML:n semantiikkaa ja mukautettujen elementtien käyttöä, ja jotkut käyttäjät muistelevat vanhempia verkkosuunnittelukäytäntöjä."
    ],
    "points": 408,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1737831746
  },
  {
    "id": 42826536,
    "title": "Etelä-Vietnamilainen lentäjä, joka laskeutui Cessnalla lentotukialukselle pelastaakseen perheensä (2019)",
    "originLink": "https://www.historynet.com/maj-buang-lys-daring-feat-to-save-his-family/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42826536",
    "commentBody": "",
    "originSummary": [
      "Huhtikuussa 1975 etelävietnamilainen pilotti majuri Buang-Ly toteutti rohkean paon perheensä kanssa pienellä lentokoneella Etelä-Vietnamin kaatumisen aikana. Kapteeni Lawrence Chambers USS Midwaylta teki ennennäkemättömän päätöksen raivata kansi Buangin laskeutumista varten, jopa heittämällä helikoptereita yli laidan, mikä mahdollisti Buangin turvallisen laskeutumisen. Tämä tapahtuma oli osa Operation Frequent Wind operaatiota, joka oli Saigonin amerikkalaisten siviilien ja \"riskiryhmään\" kuuluvien vietnamilaisten evakuoinnin viimeinen vaihe, ja Buangin lentokone on nyt esillä Kansallisessa laivaston ilmailumuseossa."
    ],
    "commentSummary": [
      "Etelävietnamilainen lentäjä laskeutui Cessnalla yhdysvaltalaiselle lentotukialukselle pelastaakseen perheensä Saigonin kaatumisen aikana, mikä kuvastaa henkilökohtaisia kamppailuja ja sitkeyttä Vietnamin sodan aikana. Monet etelävietnamilaiset sotilaat pakenivat käyttäen mitä tahansa saatavilla olevaa lentokonetta, mikä korostaa ajan epätoivoa ja kaaosta. USS Midway, joka on nyt museo, oli keskeinen näissä tapahtumissa, heijastaen sodan laajempaa inhimillistä vaikutusta ja monimutkaisia geopoliittisia kysymyksiä."
    ],
    "points": 294,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1737852046
  },
  {
    "id": 42828198,
    "title": "YC Graveyard: 821 epäaktiivista Y Combinator startupia",
    "originLink": "https://ycgraveyard.iamwillwang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42828198",
    "commentBody": "",
    "originSummary": [
      "YC Graveyard listaa 821 Y Combinatorin, merkittävän startup-kiihdyttämön, inaktiivista startup-yritystä, korostaen uusien yritysten kohtaamia haasteita. Nämä startupit, jotka ovat peräisin 39 erästä ja 50 toimialalta, kattavat aloja kuten rahoitus, terveydenhuolto, vähittäiskauppa ja teknologia, mikä osoittaa Y Combinatorin laajan vaikutusvallan. Huomionarvoisia yrityksiä, kuten Blume Benefits, Fileforge ja Celest, ovat niiden joukossa, jotka ovat lopettaneet toimintansa, mikä heijastaa startup-yritysten korkean riskin luonnetta."
    ],
    "commentSummary": [
      "YC Graveyard on tunnistanut 821 passiivista Y Combinator startupia, mikä korostaa korkeaa epäonnistumisprosenttia startup-ekosysteemissä.",
      "Usein sijoittajat suosivat selvää epäonnistumista \"lifestyle-yrityksen\" sijaan, joka ei skaalaudu, koska se antaa heille mahdollisuuden vähentää tappioita, kun taas jotkut startupit \"ostetaan\" niiden lahjakkuuden tai omaisuuden vuoksi.",
      "Keskustelu syventyy pienyritysten luonteeseen, sijoittajien rooleihin, startup-menestyksen haasteisiin ja pääomasijoituksen laajempiin vaikutuksiin, mukaan lukien startup-rahoituksen dynamiikka ja perustajien palkitseminen."
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737873432
  },
  {
    "id": 42824562,
    "title": "Virheellinen 68030-käsky salli vahingossa Mac Classic II:n käynnistyä.",
    "originLink": "https://www.downtowndougbrown.com/2025/01/the-invalid-68030-instruction-that-accidentally-allowed-the-mac-classic-ii-to-successfully-boot-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42824562",
    "commentBody": "",
    "originSummary": [
      "Doug Brown tunnisti Macintosh Classic II:n ROM:issa olevan bugin, joka olisi pitänyt estää sen käynnistyminen, mutta Motorola MC68030 suorittimen määrittelemätön käsky salli sen jatkaa. Käyttäen MAME-emulaattoria Doug havaitsi, että Classic II epäonnistui käynnistymään 32-bittisessä tilassa virheellisen osoitteen aiheuttaman väylävirheen vuoksi, joka korjattiin todellisessa laitteistossa dokumentoimattomalla käskyllä. Tämä havainto korostaa emulaattoreiden roolia piilotettujen laitteistobugien paljastamisessa ja dokumentoimattomien suorittimen käskyjen monimutkaisuutta, ja todelliset laitteistotestit vahvistavat dokumentoimattoman käskyn merkityksen käynnistymiselle."
    ],
    "commentSummary": [
      "Dokumentoimaton käsky MC68030-suorittimessa mahdollisti Mac Classic II:n käynnistymisen ohittamalla laittoman käskyn tunnistuksen, mikä muutti A1-rekisteriä odottamattomasti.",
      "Tämä löytö korostaa dokumentoimattomien ohjeiden olemassaoloa suorittimissa, vastaavasti kuin 6502 ja x86-arkkitehtuureissa, mikä voi johtaa odottamattomaan käyttäytymiseen.",
      "68030-arkkitehtuuri, joka tunnetaan eleganssistaan, käytettiin monissa järjestelmissä, mutta sen monimutkaisuus lopulta haittasi sen laajennettavuutta."
    ],
    "points": 269,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1737836981
  }
]
