[
  {
    "id": 42427888,
    "title": "OpenERV",
    "originLink": "https://www.openerv.ca",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42427888",
    "commentBody": "",
    "originSummary": [
      "OpenERV'nin TW4 Enerji Geri Kazanım Havalandırma Cihazı, yaklaşık %90 ısı enerjisini geri kazanarak ek ısıtma veya soğutma ihtiyacını azaltırken verimli bir şekilde taze dış hava sağlar.",
      "İki TW4 ünitesini pencere montajı için birleştiren WM12 modeli, beta test aşamasında olup, geleneksel sistemlere kıyasla yüksek hava akışı, sessiz çalışma ve önemli bir yatırım getirisi vaat etmektedir.",
      "Temel özellikler arasında isteğe bağlı HEPA filtreleri, ev otomasyon sistemleriyle uyumluluk, düşük enerji tüketimi ve geliştirilmiş iç mekan hava kalitesi bulunmaktadır."
    ],
    "commentSummary": [
      "OpenERV, açık kaynaklı bir enerji geri kazanım havalandırma (ERV) sistemi geliştirme girişimidir, ancak kullanıcılar, kapsamlı belgelerin eksikliğinden endişe duymaktadır, bu da kendin yap meraklılarını caydırabilir.",
      "Projenin açık kaynak iddiaları hakkında şüphe uyandıran, önemli bir ERV bileşeni olan kurtarma çekirdeği için 3D dosyalarının olmaması, olası bir pazarlama odaklı yaklaşımı düşündürmektedir.",
      "Proje, özellikle kuzey iklimleri için umut vaat ediyor ve yaratıcısı, gelecekteki potansiyel iyileştirmelere işaret ederek, sistemi PassiveHaus enstitüsü tarafından test edilmesi için planlarla geliştiriyor."
    ],
    "points": 697,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1734321310
  },
  {
    "id": 42426284,
    "title": "GitHub Haritası",
    "originLink": "https://github.com/anvaka/map-of-github",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42426284",
    "commentBody": "",
    "originSummary": [
      "Harita, Ocak 2020'den Mart 2023'e kadar olan verileri kullanarak, yakınlık ortak yıldız gözlemcilerini gösteren 400.000'den fazla GitHub projesini görselleştiriyor. Haritanın oluşturulması, kümeleme için Jaccard Benzerliği hesaplamayı, düzen için ngraph.forcelayout kullanmayı ve maplibre ile render etmeyi içeriyor, veriler GeoJSON formatında. Proje, MIT lisansı altında açık kaynaklı olup katkıları ve tasarım önerilerini davet ediyor ve ChatGPT tarafından oluşturulan bir arama özelliği ve ülke etiketlerini içeriyor."
    ],
    "commentSummary": [
      "anvaka tarafından yapılan bir GitHub harita görselleştirmesi, stargazers'a dayalı olarak proje kümelerini gösteriyor ve torvalds/linux gibi benzersiz gruplamaları JavaScript projelerinin yakınında ortaya koyuyor.- Harita, popüler projeler için ideal olmayabilecek Jaccard benzerliğini kullanıyor çünkü projeleri semantik yerine popülerliğe göre grupluyor, bu da daha iyi bir organizasyon için kod gömme yöntemlerinin kullanılmasını öneriyor.- Lisp projeleri için \"Lispaña\" gibi esprili ülke isimleriyle yapılan görselleştirme, projeleri dil ve uygulamaya göre kategorize etmenin karmaşıklığını vurguluyor ve kümeleme yöntemleri ile kullanıcı tercihlerinin etkisi üzerine tartışmaları ateşliyor."
    ],
    "points": 644,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1734300153
  },
  {
    "id": 42425398,
    "title": "Akılsız TV'ler geri dönüşü hak ediyor",
    "originLink": "https://www.makeuseof.com/reasons-why-dumb-tvs-deserve-a-comeback/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42425398",
    "commentBody": "",
    "originSummary": [
      "Akıllı TV'ler, eski yazılımlar ve gereksiz yazılımlar nedeniyle hızlı bir şekilde modası geçmeye eğilimlidir ve kullanıcı verilerini toplayarak gizlilik riskleri oluştururlar.",
      "Dumb TV'ler, ekran kalitesi ve uzun ömürlülüğe odaklanarak on yıldan fazla dayanabilir ve Roku veya Chromecast gibi akış cihazlarıyla eşleştirildiğinde daha özel bir izleme deneyimi sunabilir.",
      "Teknoloji meraklısı tüketicilere hitap etmek için, akılsız TV'lerin ekran kalitesi, boyut ve bağlantı özelliklerinde iyileştirmelere ihtiyacı vardır ve gizlilik odaklı bir alternatif olarak pazarlanmalıdır."
    ],
    "commentSummary": [
      "Akıllı TV'lerin veri toplama ve reklamlar yoluyla üreticilere kâr sağlaması nedeniyle \"aptal TV'lerin\" yeniden canlanması önerilmektedir.",
      "Bazı akıllı televizyonlar internet bağlantısından kaçınarak sıradan televizyonlar gibi çalışabilirken, gelecekteki modeller bağlantıyı zorunlu kılabilir.",
      "Monitörler veya projektörler gibi alternatifler mevcut olsa da genellikle daha yüksek maliyetlerle gelir ve tüketicilerin gizlilikten ziyade fiyat ve özellikleri tercih etmesi nedeniyle aptal TV'lere olan talep sınırlı kalmaktadır."
    ],
    "points": 330,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1734290972
  },
  {
    "id": 42430450,
    "title": "Neden iyi çalışan şeyleri satın almak bu kadar zor? (2022)",
    "originLink": "https://danluu.com/nothing-works/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42430450",
    "commentBody": "",
    "originSummary": [
      "Verimli piyasalar hipotezi, piyasaların doğal olarak verimsizlikleri ortadan kaldırdığını öne sürse de, özellikle teknoloji işe alımı ve ürün kalitesinde her zaman geçerli değildir.- Silikon Vadisi şirketleri, yetenek eksikliği nedeniyle kalıcı verimsizliklerle karşı karşıya kalırken, tüketiciler genellikle ürün kalitesini değerlendirmek için bilinçli kararlar yerine pazarlamaya güvenmektedir.- Dış kaynak kullanımı, Apple ve Amazon gibi şirketlerin satın almak yerine inşa ederek başarılı olduğu durumlarda görüldüğü gibi, kurum içi çözümlere kıyasla memnuniyetsizliğe yol açabilir ve bu durum kültürel normlar ve güven sorunlarının verimlilik üzerindeki etkisini vurgulamaktadır."
    ],
    "commentSummary": [
      "Tüketiciler, kötü tasarım, gizli kusurlar ve ürünlerin kasıtlı olarak uzun ömürlü olmaması anlamına gelen planlı eskitme nedeniyle kaliteli ürün satın alırken zorluklarla karşılaşmaktadır.",
      "Seçeneklerin bolluğu ve gerçek kaliteyi değerlendirmedeki zorluk, tüketicilerin ürün kalitesini doğru bir şekilde yansıtmayabilecek derecelendirmeler gibi yüzeysel göstergelere güvenmesine neden olur.",
      "Bilgi asimetrisi, alıcıların bilinçli kararlar vermek için gerekli bilgiye sahip olmamalarına neden olarak, genellikle yanıltıcı olabilecek satıcı iddialarına güvenmelerine yol açar."
    ],
    "points": 297,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1734352691
  },
  {
    "id": 42427132,
    "title": "ABD'li milletvekilleri, Apple ve Google'a 19 Ocak'ta TikTok'u mağazalardan kaldırmaya hazır olmalarını söyledi.",
    "originLink": "https://www.reuters.com/legal/us-lawmakers-tell-apple-google-be-ready-remove-tiktok-app-stores-jan-19-2024-12-13/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42427132",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ABD'li milletvekilleri, veri güvenliği ve uygulamanın Çinli sahipliği konusundaki endişeleri gerekçe göstererek, Apple ve Google'dan TikTok'u 19 Ocak'a kadar uygulama mağazalarından kaldırmayı düşünmelerini talep etti.",
      "TikTok etrafındaki tartışma, sansür, ulusal güvenlik ve yabancı hükümetlerin iç işlerdeki potansiyel etkisi konularını içeriyor.",
      "Metin, uluslararası ilişkilerde karşılıklılık konusunu, özellikle Çin'in Batılı teknoloji şirketlerine getirdiği kısıtlamalara yanıt olarak, daha geniş temalarla vurgulamaktadır."
    ],
    "points": 295,
    "commentCount": 650,
    "retryCount": 0,
    "time": 1734311313
  },
  {
    "id": 42431090,
    "title": "Çoğu iPhone sahibi, şu ana kadar Apple Intelligence'ta az ya da hiç değer görmüyor",
    "originLink": "https://9to5mac.com/2024/12/16/most-iphone-owners-see-little-to-no-value-in-apple-intelligence-so-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42431090",
    "commentBody": "",
    "originSummary": [
      "Apple'ın 2028'de macOS uygulamalarını destekleyebilecek katlanabilir bir iPad çıkarmayı planladığı söylentileri var.",
      "Bu gelişme, iPad ve Mac işlevselliklerinin yakınsamasını öneriyor ve kullanıcılara daha çok yönlü bir cihaz sunuyor.",
      "Katlanabilir bir iPad'in tanıtımı, Apple'ın ürün yelpazesinde önemli bir yeniliği işaret edebilir ve teknoloji meraklıları ile sektör gözlemcilerinin ilgisini çekebilir."
    ],
    "commentSummary": [
      "Birçok iPhone kullanıcısı, Apple Intelligence'da sınırlı bir değer algılıyor ve bazıları profesyonel ortamlarda yardımcı pilot gibi yapay zeka araçlarını kullanma konusunda baskı hissediyor.",
      "Şirketler arasında rekabetçi kalmak için yapay zeka teknolojilerini benimseme eğilimi artıyor, ancak kullanıcılar genellikle özetler ve e-postalar gibi yapay zeka tarafından üretilen içerikleri yetersiz buluyor.",
      "Apple Intelligence'in piyasaya sürülmesi, kullanıcı beklentilerini karşılamadığı için eleştirilere maruz kaldı ve bazıları, yapay zeka araçlarının şu anda fazla abartıldığını ve çoğu görev için gerekli olmadığını savunuyor."
    ],
    "points": 290,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1734358215
  },
  {
    "id": 42425339,
    "title": "Yarı zamanlı iş nasıl bulunur?",
    "originLink": "https://news.ycombinator.com/item?id=42425339",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42425339",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 277,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1734290419
  },
  {
    "id": 42432151,
    "title": "Xiaomi, Home Assistant için resmi destek sağladı.",
    "originLink": "https://github.com/XiaoMi/ha_xiaomi_home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42432151",
    "commentBody": "",
    "originSummary": [
      "Xiaomi Home Entegrasyonu, Home Assistant platformu içinde Xiaomi IoT cihazlarının kullanılmasını sağlar ve uyumluluk için belirli yazılım sürümleri gerektirir.",
      "Kurulum seçenekleri arasında GitHub, HACS (Home Assistant Community Store) veya manuel yöntemler bulunur ve yapılandırma için bir Xiaomi hesabı girişi ve cihaz seçimi gereklidir.",
      "Entegrasyon, birden fazla hesabı, bir Xiaomi Merkezi Hub Geçidi aracılığıyla yerel kontrolü destekler ve çeşitli bölgelerde mevcuttur, iletişim için MIoT-Spec-V2 kullanır, ancak kullanıcı verilerini açık metin olarak depolar."
    ],
    "commentSummary": [
      "Xiaomi, resmi olarak Home Assistant ile entegre oldu ve bir Xiaomi hesabı gerektiriyor, kullanıcı bilgilerini yapılandırma dosyasında açık metin olarak saklıyor.",
      "Kullanıcılara, entegrasyonun giriş için OAuth 2.0 kullandığı ve şifrelerin uygulamada saklanmadığı için yetkisiz erişimi önlemek amacıyla yapılandırma dosyalarını güvence altına almaları tavsiye edilir.",
      "Home Assistant, esnekliği ve geniş entegrasyon yelpazesi ile övülse de, bazı kullanıcılar gizlilikle ilgili endişelerini dile getiriyor ve Zigbee veya Z-Wave gibi yalnızca yerel çözümleri tercih ediyor."
    ],
    "points": 262,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1734364367
  },
  {
    "id": 42426589,
    "title": "25 Yıl Dillo",
    "originLink": "https://dillo-browser.github.io/25-years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42426589",
    "commentBody": "",
    "originSummary": [
      "Dillo, başlangıçta 1999 yılında Gzilla/Armadillo'dan çatallanan hafif bir web tarayıcısı, Aralık 2024'te 25. yıl dönümünü kutluyor.",
      "Tarayıcı, 2008 yılında GTK 1.0'dan FLTK 2'ye ve ardından 2011 yılında FLTK 1.3'e geçiş gibi birkaç değişim geçirdi, önemli katkıda bulunanların ve alan adının kaybı gibi geliştirme zorlukları yaşadı.",
      "2023 yılında Rodrigo Arias Mallo projeyi canlandırdı ve Mayıs 2024'te 3.1.0 sürümünün yayınlanmasına öncülük etti, devam eden geliştirmelerle birlikte en son sürüm 3.1.1 oldu."
    ],
    "commentSummary": [
      "Dillo, hafif bir web tarayıcısı, minimal bağımlılıkları ve hızlı performansıyla kutlanan 25. yılını işaret ediyor. Modern özellikler olan HTTPS gibi eksikliklerine rağmen, Dillo basitliği ve verimliliği ile, özellikle eski donanımlarda, popülerliğini koruyor. Topluluk, mevcut bakımcısı Rodrigo Arias Mallo'nun katkılarını değerli buluyor ve teknoloji ekosisteminde alternatif, hafif tarayıcıların önemini vurguluyor."
    ],
    "points": 262,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1734303975
  },
  {
    "id": 42425348,
    "title": "Palm’ın CEO’su Steve Jobs’a e-posta gönderiyor (2007)",
    "originLink": "https://twitter.com/TechEmails/status/1868368310024462791",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42425348",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "2007 yılında, Palm'ın CEO'su Ed Colligan, yasal ve etik kaygılar nedeniyle Steve Jobs'un işe alım yapmama anlaşması teklifini reddetti.",
      "Jobs, bir çalışan geçişi nedeniyle Palm'ı bir patent davasıyla tehdit etti ve bu durum, ücret baskısı ve rekabete aykırı uygulamalar gibi sektör sorunlarını vurguladı.",
      "Bu değişim, Palm'ın nihai düşüşüne rağmen etik duruşunun kaydedildiği, teknoloji şirketlerine karşı daha geniş yasal eylemlerin bir parçasıdır."
    ],
    "points": 250,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1734290496
  },
  {
    "id": 42429197,
    "title": "Nokia 5110 – Ölümden Geri Döndü (2022)",
    "originLink": "https://opsbros.com/nokia-5110-back-from-the-dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42429197",
    "commentBody": "",
    "originSummary": [
      "Nokia 5110, dayanıklı bir 2G telefon, SMS ve aramayı destekleyen SIM7600SA adlı bir 4G modülü ile modern bir dokunuşla yeniden canlandırılıyor. Telefonun basit tasarımı ve iki PCB'si (Baskılı Devre Kartları), yeni 4G modülünün entegrasyonunu kolaylaştırarak yenileme sürecini daha basit hale getiriyor. Bu proje, klasik teknolojiyi modernize etme potansiyelini vurguluyor ve genişletilmiş işlevsellik için yeni bir kart tasarımına odaklanacak olan bir sonraki bölümde daha fazla gelişme detaylandırılacak."
    ],
    "commentSummary": [
      "Nokia 5110'un yeniden canlandırılması düşünülüyor, ancak klasik modelleri modern teknolojiye uyarlamadaki zorlukları yansıtan süreç 2022'den beri duraklamış durumda.",
      "Kullanıcılar, mevcut Nokia markalı telefonlardan memnuniyetsizliklerini dile getiriyor, bu telefonları düşük kalite ve yeniden markalanmış Çin modelleri olarak eleştiriyorlar, bu da dayanıklı, basit telefonlar için piyasada bir boşluk olduğunu gösteriyor.",
      "AGM M8 veya Sonim XP3+ gibi alternatifler, modern ağ uyumluluğuna sahip basit işlevsellik için araştırılıyor ve bu da doğrudan cihazlara olan talebi vurguluyor."
    ],
    "points": 221,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1734339130
  }
]
