[
  {
    "id": 42325011,
    "title": "Diátaxis – A systematic approach to technical documentation authoring",
    "originLink": "https://diataxis.fr/",
    "originBody": "Diátaxis¶ A systematic approach to technical documentation authoring. Diátaxis is a way of thinking about and doing documentation. It prescribes approaches to content, architecture and form that emerge from a systematic approach to understanding the needs of documentation users. Diátaxis, from the Ancient Greek δῐᾰ́τᾰξῐς: dia (“across”) and taxis (“arrangement”). Diátaxis identifies four distinct needs, and four corresponding forms of documentation - tutorials, how-to guides, technical reference and explanation. It places them in a systematic relationship, and proposes that documentation should itself be organised around the structures of those needs. Diátaxis solves problems related to documentation content (what to write), style (how to write it) and architecture (how to organise it). As well as serving the users of documentation, Diátaxis has value for documentation creators and maintainers. It is light-weight, easy to grasp and straightforward to apply. It doesn’t impose implementation constraints. It brings an active principle of quality to documentation that helps maintainers think effectively about their own work. Contents¶ This website is divided into two main sections, to help apply and understand Diátaxis. Start here. These pages will help make immediate, concrete sense of the approach. Applying Diátaxis Tutorials How-to guides Reference Explanation The compass Workflow This section explores the theory and principles of Diátaxis more deeply, and sets forth the understanding of needs that underpin it. Understanding Diátaxis Foundations The map Quality Tutorials and how-to guides Reference and explanation Complex hierarchies Diátaxis is proven in practice. Its principles have been adopted successfully in hundreds of documentation projects. At Gatsby we recently reorganized our open-source documentation, and the Diátaxis framework was our go-to resource throughout the project. The four quadrants helped us prioritize the user’s goal for each type of documentation. By restructuring our documentation around the Diátaxis framework, we made it easier for users to discover the resources that they need when they need them. —Megan Sullivan While redesigning the Cloudflare developer docs, Diátaxis became our north star for information architecture. When we weren’t sure where a new piece of content should fit in, we’d consult the framework. Our documentation is now clearer than it’s ever been, both for readers and contributors. —Adam Schwartz",
    "commentLink": "https://news.ycombinator.com/item?id=42325011",
    "commentBody": "Diátaxis – A systematic approach to technical documentation authoring (diataxis.fr)408 points by OuterVale 14 hours agohidepastfavorite101 comments bjackman 10 hours agoAs a non writer I found that even without the details there's just one very important and very basic insight here: You don't have to say everything exactly once. Until being exposed to this idea I always tied myself in knots trying to write one stream of text that serves as THE DOCS. It's impossible to do this well (once you know, it seems very obvious haha). Just realising that you can write the same info in different ways for different readers is very helpful! reply samuell 6 hours agoparentThere is even a lot of potential for communicating more effectively here: By giving 2-3 examples, that describe the same thing from slightly different aspects, you can to some extent overcome the ambiguities of language, by letting the reader figure out the common denominator between those examples, which will be a lot less ambiguous that only telling it from one example. Let me give you two examples more [...] ;) (Related, this is a technique used extensively by writers like king Solomon in the book of Proverbs in the Bible.) reply hitekker 1 hour agorootparentGiving a few good examples also has the benefit of demonstrating the author's own understanding. If the author can't describe the matter in different ways, it shows don't have a feel for \"it\", and they're not grasping it rightly or even touching it at all. I've found that audiences can sense when a speaker is out-of-touch, and will politely ignore them. Separately, I've heard that the Nicene Creed and its ancillaries had the repetitions hardcoded to forestall natural schism/emergent mutations in the generational belief system. reply BlueTemplar 4 hours agorootparentprevAnd two of them should be the most obvious example you can think of, and the weirdest example you can think of. reply elcritch 6 hours agoparentprevI have a friend who's a pastor. As a basic rule of a good sermon he always quoted the old addage: \"Tell them what you’re going to tell them, tell them and tell them what you’ve told them\". reply tgv 6 hours agorootparentThere's more art to it, because there's also an off-putting way of doing that, which frequently shows up in presentations: you're greeted with a powerpoint slide with the topics in bullet points, which the presenter reads out loud, then come the slides with each of those points, also read out loud, and at the end there's a summary that almost copies the first slides, and which --for good measure-- is also read out loud. That makes me want to forget everything that's been told. reply danparsonson 6 hours agorootparentIt's an incredibly common mistake, for the presenter to put up slide after slide that is just a script of what they want to say - then your brain has to choose between listening or reading, to the detriment of both. I have more sympathy with intro and outro summaries, as long as the bullet points are short and delivered one at a time while the speaker expands upon each one. Slides should be a visual aid, not a substitute for presentation. reply ninalanyon 3 hours agorootparentThe best presentation I ever saw was done by a colleague of Mikel Harry's at a Six Sigma conference in Frankfurt. The presenter had no ready made slides but he had an overhead projector, three transparencies, a handful of dry marker pens, and an eraser. As he spoke he sketched charts and diagrams to illustrate his points. If an audience member asked a question he was able to provide an answer in both words and with another sketch. reply HPsquared 2 hours agorootparentThe old ways are the best. reply hamdouni 3 hours agorootparentprevReminds me of Presentation Zen or the 10/20/30 rule which states that “a presentation should have ten slides, last no more than twenty minutes, and contain no font smaller than thirty points.” reply ocimbote 1 hour agorootparentprevThe anecdote doesn't strike me because your friend the pastor said it, but because it's a rule as old as times that every high-schooler was taught. - The introduction should announce the thesis and its development - walk your way towards your thesis - The conclusion should summarize your thesis (and hint at openings towards new grounds) But somehow, everyone seems to forget it and is in awe whenever someone recaps it. reply groby_b 7 minutes agorootparentAnd every high schooler, TedX speaker, and Malcom Gladwell impersonator gets this wrong: It only works if intro and conclusion present a different view on the information, otherwise it's simply boring the audience to death. reply smeej 8 hours agoparentprevThen the challenge becomes recording where each thing is recorded so that when it needs to be updated, you update it everywhere and don't end up with conflicting documentation. reply 7bit 6 hours agorootparentThis. Repeating information is helpful. repeated information that became inaccurate isn't. It's a difficult line to balance reply fmbb 2 hours agorootparentSomeone will trip on the mistake and report the bug and you fix it. reply tjoff 1 hour agorootparentYou dont get a compile error if the documentation is wrong. Chances are you wont notice. And even if it eventually is fixed it is not obvious that the reason for the bug was that the documentation was wrong in one particular place. reply ysofunny 13 minutes agoparentprevexpanding this take perhaps too much ...even the source code itself \"says\", in its own way, the same thing as the documentation, just to a different \"audience\" (the compilers) reply bbminner 3 hours agoparentprevTrue, even when you are writing a scientific publication with a hard page limits (~8 pages), it is advisable to reiterate the core messages multiple times as you add more context and details: = abstract 1) in this paper we show that X holds by evaluating Y against Z = intro 2) the problem of A is important because B, however the X aspect was overlooked; we show that evaluating Y highlights real world challenges, in contrast to Z, that... 3) to sum up, we found that Y is better at Z because X = related work Z approached the problem as..., which improved..., but as we show further, this is not sufficient to achieve... .. and so on - you circle around the main message over and over again in each section. reply postoplust 5 minutes agoprevI use and highly recommend this framework as the starting point for any technical documentation. It helped me learn how to keep the detailed technical explanations out of the how-to documents. Before I learned of Diataxis, my how-to docs were much longer and hard to follow when things go right (because I had lots of, \"if this doesn't work, investigate A, B, C...\"). reply _acco 3 hours agoprevWe just applied this framework to the Sequin [1] docs two weeks ago. It has felt so nice to have a framework. I think our docs flow really well now, and it's been easier for us to add and maintain docs because we know where to put things. The slightly ironic part is that the Diataxis docs themselves are a bit obtuse. It's a little verbose. So it took a couple passes for it all to click. The analogy I gave my team that was helpful for everyone's understanding: Imagine you're shopping for a piece of cooking equipment, like a pressure cooker. The first thing you're going to look at is the \"quickstart\" (tutorial) – how does this thing work generally? You just want to see it go from A to B. Then, you're going to wonder how to use it to cook a particular dish you like. That's a how-to. If you're really curious about anything you've seen so far, then you'll flip to the reference to read more about it. For example, you might check the exact minutes needed for different types of beans. And finally, when you're really invested in pressure cooking and want to understand the science behind it - why pressure affects cooking times, how the safety mechanisms work, etc. - that's when you'll read the explanatory content. Comically, our docs were completely backwards: we lead with explanation (\"How Sequin Works\"). I think that's the natural impulse of an engineer: let me tell you how this thing works and why we built it this way so you can develop a mental model. Then you'll surely get it, right? While that may be technically accurate, a person doesn't have the time or patience for that. You need to ramp them into your world. The quickstart -> how-to -> reference flow is a great way to do that. Then if you really have their attention, you can galvanize them about your approach with explanatory material. [1] https://sequinstream.com/docs PS: If you have any feedback on our docs, lmk :) reply mopierotti 2 hours agoparentI checked out your docs, and I agree that they flow very nicely! So often it seems that docs are either frustratingly vague to the point where it almost seems like the company is embarrassed to admit that their tool is a tool and not a \"transformative synergy experience\" (or similar nonsense), or docs immediately get overly specific without covering \"why this product exists\". Minor note: The only thing in your docs that made me pause was the repeated use of \"CDC\", which I had to google the definition of. (For context, I have implemented \"CDC\" several times in my career, but wasn't familiar with the acronym) reply _acco 2 hours agorootparentAye, thanks! That's very helpful to hear. I just cut back our use of the acronym a ton: https://github.com/sequinstream/sequin/commit/28bfba603da6d2... reply mdaniel 1 hour agorootparentIn case you weren't already aware, most markdown parsers support actual HTML tags in it, and there's CDC that allows being visually succinct, is a11y friendly, and in most browsers is visually distinct to prompt the user there's more content hidden in the hover or long-press https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ab... I'm also aware of https://developer.mozilla.org/en-US/docs/Web/HTML/Element/df... but I think it has more nuance to it and for sure involves having a lot more supporting structure in the document reply _acco 46 minutes agorootparentVery fun – I wasn't aware, thank you! reply ChrisMarshallNY 5 hours agoprevHaving just completed my first (and last, for a while) shipping SwiftUI app, I very much think that documentation has been treated in shabby fashion, in the modern tech scene. I sorely miss the work done by all those great tech writers that Apple fired. Their engineers are terrible documenters. I'm always a bit leery of \"dogmatic\" approaches, though, because they tend to develop a \"priesthood,\" that refuses to bend; even when reality demands it. In my experience, the initial developers of the dogma use it to marvelous effect, but subsequent \"priests\" screw the pooch; sometimes, turning the approach into a curse. Many good ideas have been destroyed by too-rigid applications (What is \"Agile\"?). I see any documentation as having basically two faces: The maintainer, and the user. Each, has drastically different needs, and should probably be addressed by completely different teams. As has been alluded to, in other comments, you can have issues with multiple instances of documentation, falling out of sync (the curse of most wiki-style documentation), but results matter. If the multiple instances can be effectively synced, then the documentation is effective and useful to its consumers. If no one reads the perfectly formatted and synced documentation, it's worthless. On SNL, Phil Hartman[n] used to play The Anal-Retentive Chef. In one skit, he spent so much time prepping, that he couldn't actually demonstrate the recipe. I see a lot of that, in tech. Toolchains and libraries that are absolutely perfect, but are unusable, in practice. Documentation is an amalgam of many disciplines; human nature/psychology, graphic design, information architecture, technical infrastructure, publishing and distribution, etc. I really think it's often treated as an afterthought, in most projects, and I believe that it should be a first-class consideration, at the Requirements stage, onwards. reply dizzant 50 minutes agoparent> Many good ideas have been destroyed by too-rigid applications This is an interesting perspective that I disagree with. You seem to be saying that a general misunderstanding or misapplication of a good idea degrades the idea to a point that \"destroys\" it. On the contrary, I believe there is experience to be gained in practice: either the initial idea wasn't good after all, in which case we're destroying an illusion; or the poor examples serve to refine the idea by clarifying some ambiguity that, interpreted wrongly, leads to failure. Perhaps your argument is that many people may become familiar with the bad implementations and the idea's popularity will decline, depressing demand for refined implementations. This is likely true, but reflects the tragedy of the anticommons, not a degradation in the idea itself. reply ChrisMarshallNY 39 minutes agorootparentWell, what I mean, is that folks invest in the dogma, to the point where they refuse to accept any changes to fit realities, and often believe that they can apply the dogma, in areas, or in a manner, where it is not appropriate. There's an old Swiss Army saying \"When the map and the terrain disagree, believe the terrain.\". People who invest in dogma, refuse to look at the terrain. The map is The Only Source of Truth. I believe that most dogma comes from something that works in one or more contexts, and may actually be highly effective, in other contexts, as long as it is adjusted for context. That last part, is what kills it. People refuse to change, and the dogma gets a bad name as a \"failure.\" You see this constantly. reply ebiester 3 hours agoparentprevI don't think of diataxis as a dogmatic approach, but rather a pragmatic one. You can dive pretty deep into the weeds in how to structure your documentation, but this is a very good training wheels until you find places that leak. reply ChrisMarshallNY 3 hours agorootparentI agree, but I guarantee that it will become dogma. I strongly suspect that few of the originators of dogma considered their work as such. As I have gotten older, I have learned that \"It Depends\" is the only true dogma for almost all aspects of my life. reply pivic 10 hours agoprevI'm a technical writer. Diátaxis is similar to DITA: https://www.oxygenxml.com/dita/1.3/specs/archSpec/base/infor... On the other hand, systems like these might miss out on what users actually need. Diátaxis might work for a long time if technical documentation is only used in a documentation platform. However, if the same information could and should be used in more than one place—for example, in a UI, in a documentation portal, and in a mobile app—there might be need to break up information into smaller pieces in order to assemble them in different ways. This is known as 'content reuse', the practice of using the same content in multiple places. One approach on how to create and edit information for content reuse is described in the 'every page is page one' concept: https://everypageispageone.com/the-book/ If there's resources and time, I always recommend to do UX research at the very start of a project so that one doesn't later feel choked by a severely restricted information model. Nielsen/Norman have done a lot of research in this area and have interesting propositions on how to resolve issues around all of this, for example: https://www.nngroup.com/articles/information-foraging/#toc-w... reply robotomir 8 hours agoparent>Diátaxis is similar to DITA I don't see it. DITA differentiates between topic types such as task, reference, concept, etc., but a tutorial or a solution guide will be a combination of those topic types. Here I believe the focus is on deliverables that are larger than the individual topic. reply euroderf 10 hours agoparentprevGot an opinion on LwDITA ? Or are you deep enough into DITA that the complexity is not an issue ? FWIW if you break up your content into reusable chunks and mark it up (with DITA or Docbook semantics, say), it should be a lot more amenable to being \"understood\" by a LLM... but I have not seen any data on this. reply sixhobbits 12 hours agoprevIt's very popular in tech writing circles and pretty standard now as others have suggested. We do see people try to take it too far though and have literally only these four categories on their docs page, which never works well imo. It's mainly useful for a writer to keep in mind stuff like \"it's a guide so focus on getting to result, not teaching\" but in reality you don't want super hard lines. It's OK to have a bit of tutorial in a guide. reply hobofan 10 hours agoparent> only these four categories on their docs page Only? For many projects having a medium quality version of just one of those would be an improvement. ---- Where the approach hits a wall in practice I think is when there is a lack of interconnection between the quadrants. E.g. for software frameworks, if the guides lack links to the references for specific classes/methods (which you ultimately will have to use), that makes exploring the surrounding context a lot harder. I have a few concrete frameworks in mind where there is a split along the quadrants and that's one of the biggest annoyances about their docs. reply scott_w 6 hours agoparentprev> We do see people try to take it too far though and have literally only these four categories on their docs page, which never works well imo. Are you seeing experienced people cargo-culting or simply beginners to the framework being religious in its application? I distinguish the two because I find that, when there's no other expert, a beginner is better off being dogmatic than trying to \"do the right thing.\" By definition, a beginner does not have the expertise to make this decision. As you gain experience, you'll start to see where you need to deviate from the established rules. Think of it like home-cooking to a recipe book vs being a professional chef throwing things in a pot to feel and taste. reply grumpyprole 11 hours agoparentprev> We do see people try to take it too far though I see it as a useful guide like any methodology should be. But I have worked with someone who insisted the rules should be followed to the letter, literally not a single sentence of explanation in any tutorial. So yes, that is the danger of these systems. reply zahlman 12 hours agoparentprevEh, I've found that doc pages that try to establish really hard lines will still fail, and end up at a high level of quality. I think of it like a programming principle in the \"don't mutate global variables\" or \"write shorter functions\" category: you don't have to get it completely right, but most people really would be better off moving more in that direction rather than away from it. reply chefandy 12 hours agorootparentThe approach works better with dedicated technical writers. It makes sense to have distinct user-focused goals for documents before they’re written, and then just dig into the necessary parts of the software enough to make that happen as needed. When it’s developers doing the docs, they’re approaching it from the other end. They’ve got a chunk of code they need to cover, and reasoning about user needs is pretty difficult from that vantage point. Picking an approach vector when you don’t know the airport. reply red_admiral 9 hours agorootparentprevI think that's a SHOULD in the send of RFC 2119: \"There may exist valid reasons in particular circumstances to ignore a particular item, but the full implications must be understood and carefully weighed before choosing a different course.\" Treating a SHOULD as a MUST even when particular circumstances are against it, is one way to fail at a task. It's like Orwell's last rule, where many people seem to miss that it's the punchline of the whole essay: \"Break any of these rules sooner than say anything outright barbarous.\" reply fudged71 11 hours agoparentprevI recently saw someone praising the scikit-learn documentation, mentioning this page specifically https://scikit-learn.org/1.5/modules/grid_search.html so I took the top section and asked Claude to classify it with this framework: > This piece appears to be primarily an Explanation with some elements of Reference mixed in. This documentation appears to be trying to serve multiple purposes, which according to Diátaxis is not ideal. The mix makes it less effective at both explaining and serving as reference. Following Diátaxis principles, this content might be better split into: 1) A pure explanation section about the concept and importance of hyperparameter tuning, and 2) A separate reference section listing the specific tools and methods available. > This blending of documentation types is exactly what Diátaxis warns against when it says \"Unfortunately, too many software developers think that auto-generated reference material is all the documentation required\" and \"The writer, intent on covering the topic, feels the urge to include instruction or technical description related to it. But documentation already has other places for these.\" > HOWEVER. Let's look at why this integrated approach works well in a User Guide context: > Natural Learning Flow: The documentation follows how people actually learn and use tools: 1) First understand what hyperparameters are, 2) Learn why you might want to tune them, 3) See what tools are available, 4) Get pointed to practical implementation examples > Contextual Knowledge: By integrating explanation with technical details, users can immediately connect concepts to implementation. There's no need to jump between different documentation sections to piece together understanding. > Progressive Disclosure: The documentation starts with fundamental concepts and progressively introduces more complex tools and considerations. This scaffolding helps users build understanding naturally. > Practical Value: By combining explanation with specific tools and methods, users can immediately apply what they're learning. The documentation bridges theory and practice. reply brylie 10 hours agorootparentInteresting use of an LLM to help us write better and more organized documentation. What prompt did you use? What are your thoughts on the outcome? reply 47 9 hours agoprevDiátaxis is a great way to structure documentation, but I think its real value is in simplifying how we think about writing docs. It shifts the focus from trying to cram everything into one ‘perfect document’ to recognizing that different users have different needs. Like, tutorials are for learning by doing, guides are for solving specific problems, reference is for quick lookups, and explanations dive into the ‘why.’ That clarity alone can make one write useful docs. That being said, sticking too rigidly to any system can be a trap. reply 3abiton 4 hours agoparentIsn't the documentation task highly dependent on the goal and prospective users. Or is there a unified paradigm? reply GarnetFloride 2 hours agoprevAs a technical writer, I had been groping my way toward a framework like this myself and this is great. It is great because it gives a simple framework to work with that most people can understand very quickly and the graphic is amazing for referencing. I explain it in a more audience focused way: An explanation is for a prospective customer. A tutorial is for someone who's never used it before. A how-to is for someone familiar with it but doesn't use that particular feature often enough to memorize it. A reference is for people wanting to become an experts on the product. reply hambes 11 hours agoprevI think the graphic used by divio[1] ist so much more intuitive. But seems Diátaxis has more comprehensive documentation on what they mean. 1: https://docs.divio.com/documentation-system/ reply DanieleProcida 10 hours agoparentWhy do you think the version on the Divio site is better - what's more intuitive about it? reply svat 4 hours agorootparentNot the GP, but I agree: • “Most useful when we're studying” and “Most useful when we're working” are clearer (and also more precise!) than abstract (“chunking”) terms like “Acquisition” and “Application”. • Similarly, “Practical steps” and “Theoretical knowledge” are clearer than “Action” and “Cognition”. • For that matter, the “-oriented” suffix in “Learning-oriented”, “Problem-oriented”, “Understanding-oriented”, “Information-oriented” is helpful, compared to the “Learning”, “Goals”, “Understanding”, “Information” abstract nouns. What is common to all three sets of differences is that the former labels (on the older diagram) actually carry with them their semantic category (what kind of difference is being described, namely: (1) when useful, (2) what contents, (3) what's the orientation), while in the newer diagram everything is just abstract nouns. (E.g. “Useful during application” and “Useful during acquisition” would still be an improvement over just “Application” and “Acquisition”, though the older labels are even more direct and clear, without requiring the reader to engage in psychology to think abstractly about terms like acquisition.) Also (separate complaint), whenever I want to tell anyone else about this \"four kinds of documentation\" approach, I always link to the archived https://web.archive.org/web/20200312220117/https://www.divio... which is the latest version that is entirely on a single page. Both the current version on the Divio site and on the Diataxis site seem “overdone”; a prospective reader has to click on “next” several times and it's unlikely they're going to do that. reply DanieleProcida 3 hours agorootparent> Also (separate complaint), whenever I want to tell anyone else about this \"four kinds of documentation\" approach, I always link to the archived https://web.archive.org/web/20200312220117/https://www.divio... which is the latest version that is entirely on a single page. That's a mistake in my opinion. The big compass of four kinds of documentation I eye-catching and memorable, and I am sure it is part of the success of Diátaxis. But what gets me out of trouble in my own work every time is https://diataxis.fr/compass/. It's one thing to have the general idea; it's another to be armed with an effective tool to apply to work. The site doesn't just contain opinions and ideas, it also contains tools, that really are worth using. reply metaphor 9 hours agorootparentprevI can see your attempts to generalize, i.e. Acquisition := Most useful when we're studying Application := Most useful when we're working Cognition := Theoretical knowledge Action := Practical steps ...but in my mind, the older quadrant labels were immediately insightful at a glance. Glad to learn that you've given your system a discoverable name though; for years since that PyCon presentation, I've informally recalled it as \"the idea by that Django documentation guy\". reply _kb 9 hours agorootparentprevNot GP but thought of the exact thing when seeing this - look at the wording on the axes. reply agile-gift0262 12 hours agoprevWe use it at our organisation and ever since we adopted it, our technical documentation is on a whole other level. That, page ownership and periodic reviews of each page by one of the page owners has made our technical documentation the only successful documentation effort that I've seen reply Attummm 58 minutes agoprevThe ideas presented are great, and I can see myself adopting them in the future. However, the tone of the accompanying text feels off-putting, which makes me hesitant to share it. I hope this aspect improves over time reply piterrro 10 hours agoprevI'm a big fan of Diátaxis and I'm using it to build documentation for Logdy: https://logdy.dev/docs/quick-start I'm curious how people see it and whether it's a useful way to document a software product, feel free to leave a comment. So far it proved to be an effective way to communicate how to use the product also through a series of blog posts that present common use cases. Defininitely recommend! reply djaychela 9 hours agoprevI like the idea of this (and have been lucky enough to meet the creator a couple of times at PyconUK - he's a talented and very friendly chap), but I have a reservation about being this rigid about differentiating between the various areas of documentation in this way. During a sprint I was told that the docs I was preparing (not by Daniele, for the record) were mixing modalities and not acceptable because of this. Not pulling rank, but I've been a teacher for 20+ years, and I have a reasonable ida of how to explain things and how to scaffold learning so that people can both get things done and progress with understanding happening as part of that. As long as there's not total rigidity then this is a great tool for deciding how to produce documentation and what each type of document should do. I often see examples in documentation (numpy springs to mind) where the examples could be a lot better chosen rather than 'magic from the sky'. A good, well chosen example can provide a lot of learning while illustrating usage, a corner case or other things to be aware of. reply dsmmcken 3 hours agoprevI feel like I should be writing with the goal that the end reader is actually an LLM. The LLM will be the one spitting out the answers to the actual users via things like co-pilot, but I am not sure how that should change my approach to structure or level of detail in docs. Heavier on the number of code examples? reply Mathnerd314 50 minutes agoparentWell, look at the process of training a chatbot: - first you make a \"raw\" corpus, with all the information needed to produce an answer - then you generate sample question-answer pairs - then you use AI to make better questions and better answers (look at e.g. WizardLM https://arxiv.org/pdf/2304.12244) - can also finetune with RLHF or modify the Q-A pairs directly - then you have a final model finetune once the Q-A pairs look good - then you use RAG over the corpus and the Q-A pairs because the model doesn't remember all the facts - then you have a bullshit detector to avoid hallucinations So the corpus is very important, and the Q-A pairs are also important. I would say you've got to make the corpus by hand, or by very specific LLM prompts. And meanwhile you should be developing the Q-A pairs with LLMs as the project develops - this gives a good indication of what the LLM knows, what needs work, etc. When you have a good set of Q-A pairs you could probably publish it as a static website, save money on LLM generation costs if people don't need super-specific answers. To add to the current top-scoring comment, though (https://news.ycombinator.com/item?id=42326324), one advantage of an LLM-based workflow is that the corpus is the single source of truth. It is true that good documentation repeats itself, but from a maintenance standpoint, changing all the occurrences of a fact, idea, etc. is hard work, whereas changing it once in the corpus and then regenerating all the QA pairs is straightforward. reply pault 3 hours agoparentprevAsk an LLM to write it? reply pastage 12 hours agoprevI often get stuck changing from reference to explanation in the middle of wirintg, so this is a great guide. Having a small How-To example in every reference entry for a API endpoint might be good, but you need to keep them seperate and concise, do not start with explanations. Here is a extract from Ubuntus page about this: > Writing security reference documentation, you will know that you should be producing clear and simple statements of fact. Explanation of a security feature or function, or showing how to use it – those don’t belong here. There is a place for them: a different place. If those things are required, then there should also be a security explanation topic, or a security how-to guide. This immediately makes life easier for the documentation author, who recognises that explaining and showing how-to are also important. https://ubuntu.com/blog/diataxis-a-new-foundation-for-canoni... reply DanieleProcida 10 hours agoparentExamples in reference material are an excellent idea, and not at all in contradiction to the principles of Diátaxis. An example illustrates - like an illustration in any other reference guide - and provides something concrete to help grasp what's being described. That's different from a how-to, talking someone through a problem. reply euroderf 9 hours agorootparentGolang API pages collect all examples into a list at the top. Maybe do the same kind of things for stuff like \"Quick explanations\" and \"Warnings/Gotchas\". But it would get very subjective and potentially very messy and unmaintainable. reply asymmetric 6 hours agoprevDoes anyone have examples of OSS projects using this framework, and having good documentation? I find the framework doesn't really speak to me (as a user, or prospective docs writer), and IME trying it out in communities I'm a part of, it didn't particularly improve the situation, as I had perhaps naively expected. reply f3408fh 6 hours agoparentAll of Canonical's documentation is written with Diataxis. Here are the Ubuntu Server docs: https://ubuntu.com/server/docs reply losvedir 6 hours agoprevOoooh! I've seen this organization before, but didn't realize it was a thing, or had a name. I don't personally like it, as I get confused about where to go. When I saw \"tutorials\" and \"how-to guides\", for example, I had thought those were roughly the same thing and didn't know which to click. And seeing \"Explanation\" separately was even worse because why would I want a guide or tutorial without explanations?? I get \"reference\" as a separate section, maybe, though to my mind the best docs are built around reference with explanations and little code samples and how-tos mixed in as necessary, and maybe a single \"Getting Started\" guide for installation and configuration and stuff like that. reply FigurativeVoid 2 hours agoprevWe have been implementing Diátaxis style engineering documentation. We have \"librarians\" that make sure information is going to the place, and that we aren't creating unnecessary duplication. reply Nathanba 12 hours agoprevI don't agree with it because while I think that it's theoretically correct, the words are too close together. To me \"tutorial\", \"how to guide\" and \"explanation\" are all practically synonyms. I know that when you think deeply about it, there are legitimate reasons for each category but it's just too close semantically that my brain can't see the difference. If I want to know how something works and I see \"tutorial\" and \"how to guide\" I have no idea what to click and I just click on the first thing. reply zahlman 11 hours agoparent>the words are too close together. To me \"tutorial\", \"how to guide\" and \"explanation\" are all practically synonyms. If that set of labels doesn't work for you, there are many other ways that the Diataxis doc attempts to explain the differences. You might find it a useful exercise to seek terms that make more sense to you. Or just to try to understand them in other ways - e.g. via the action/cognition (\"do vs. think\") and acquisition/application (\"at study vs. at work\") dichotomies. There's an entire page devoted to distinguishing tutorials from how-to guides (https://diataxis.fr/tutorials-how-to/). (Note that this is itself classified as \"understanding\" material; as an exercise, you could try to evaluate the writing there to see how it maps onto what is described as \"explanation\", and doesn't map onto how a \"tutorial\" is supposed to work.) But to me, one of the simplest distinctions is that a \"tutorial\" is the sort of thing that you can't do on Stack Overflow. That's because a tutorial involves following a lesson plan that was set by a teacher, who fills in the student's unknown unknowns. On Stack Overflow you must ask a question; a tutorial is material for someone who doesn't yet know what to ask. There are plenty of extraordinarily popular questions on Stack Overflow that ask how to do some simple task. But to work in the format, you have to ask, not simply request help (see also: https://meta.stackoverflow.com/questions/284236). reply Nathanba 8 hours agorootparentCan you see the problem though: If you need a huge page dedicated to explaining the difference between how-tos and tutorials then it's clearly too confusing and not obvious at all. Nobody is going to need a page telling them the difference between sample code and documentation. Those two words are obvious even though yes, sample code is of course also documentation in a sense. reply cmehdy 11 hours agoparentprevIt all seems close because the terms are muddied in our minds by countless poor instructions over the years. Their doc actually explains the difference efficiently though : Tutorials - learning-oriented experiences How-to guides - goal-oriented directions Reference - information-oriented technical description Explanation - understanding-oriented discussion reply Nathanba 8 hours agorootparentBut I want to learn something in all of those examples. I have a goal in all I do. I need technical information in all as well and I want to gain understanding in all of those as well. It really is just a bad way to name these categories. I haven't thought about how to do it better yet, I personally like the ziglang docs where everything is presented as a huge reference document with examples in each section. The only additional thing that is needed is usually something like APIs and executable code. Of course the reference document can also have executable samples like what Stripe does. But somehow I think a dedicated section for example code is legitimate in addition to a long reference. reply red_admiral 8 hours agoparentprevI think they wanted to separate out four different concepts in the territory, needed a name for each one, and so picked four almost-synonyms for the labels on the map. We can read \"tutorial\" in their system as a technical term rather than its everyday meaning, just as \"depression\" has a particular meaning to a psychologist that might not match everyday use. I guess that's still better than labelling them Type I-IV tutorials. reply hebocon 11 hours agoparentprevAre they really so close? The lecture is the explanation. The tutorial/lab is a guided experience (Microsoft's fake Contoso company comes to mind). A how-to guide is what you need when you want to search/chatgpt a solution. Reference material: thesaurus, encyclopedia, owner's manual. Video games have built-in tutorials and yet walkthrough guides are still necessary for tricky puzzles. You check the key bindings as reference. reply Nathanba 8 hours agorootparentYour videogame example shows the problem. Tutorials are effectively just a different form of walkthrough. You are getting walked through the basics. So that's my point, you can't have different words on your website that is supposed to help people gain understanding and then start off by confusing everyone with words that are all so close in meaning. reply skydhash 4 hours agorootparentThe purpose is always the same: To learn. It's how you learn and what your learn for that are different. A tutorial is for getting exposed to something. A guide is for a very specific purpose in something you're already familiar with. An explanation is for a deeper understanding and references are for not relying on memory. They all refer to different things that ultimately falls under the same concept (and intersect with each other). If you're building a system, you should have all of them otherwise, the documentation is lacking. reply hebocon 2 hours agorootparentprev> \"tutorials are just a different form of walkthrough\" Yes, one is focused on understanding (mechanics, lore, UI) and the other is focused on a specific task (do these steps to progress). Diataxis is not inventing these words - it is using them deliberately. You seem unwilling to actually [learn what they mean](https://chatgpt.com/share/6751d9b7-3fd4-800a-8b81-1949069007...). reply ulbu 11 hours agoparentprevhow-to is for configurations. tutorial is for orientation. explanation is for models. reply flowingfocus 8 hours agoprevI recently built a small, free analysis tool that takes public documentation git repos and evaluates the content against this framework: https://app.getdocsy.com/analysis/ reply hebocon 11 hours agoprevMy experience trying to implement this for internal use in a tech-adjacent industry is that \"how-to\" guides dominate because of a company culture of expediency over quality. With time and care, those can be turned into tutorials and explanations. I use Obsidian to embed reference PDFs. The end result is too hyperlinked for most to understand and the all-in-one outdated mega page in OneNote gets passed around instead much to my disappointment. reply InDubioProRubio 10 hours agoprevSo does it track the users-role and reading path + searches? Like, if you searched for topic \"XY\" hop on rail XYZ other user with similar role hoped on. reply gnatolf 12 hours agoprevHow is this related to https://docs.divio.com/documentation-system/ ? Looks incredibly identical. reply zahlman 12 hours agoparentThis was discussed in the thread a couple days ago about board game rulebook design. I had a similar question (https://news.ycombinator.com/item?id=42302038 - although I phrased it more like wondering if Procida had been ripped off) and got some insightful replies. In short: it looks identical because it's substantially his work, that he did while employed there. In fact, he's the one giving the talk in the PyCon Australia video there. reply gnatolf 7 hours agorootparentThank you. reply DanieleProcida 10 hours agoparentprevExplained in https://diataxis.fr/colophon/#origins-and-development. No malfeasance! But I wish Divio would take that down, it's past its sell-by date now, and I think I got quite a few things in it wrong. reply WillAdams 5 hours agorootparentI actually find the contrasting approaches (see discussion elsethread about the terminology used in the diagram) helpful and it's always good to have historical context. I agree that the Divio site would be well-served by directing folks to/acknowledging the newer site (as the newer site does). reply wadefletch 11 hours agoparentprevSame guy reply gavindean90 12 hours agoprevI’ve read about this approach in the past and am curious if anyone has any experience trying to get an organization to buy into it. reply ivanche 12 hours agoparentYup, just do it! Whenever I write a new piece of docs I try to fit it into one of four categories. Whenever I find docs written by someone else and they're all over the place, I message them and say \"Hey this would be much more useful as a how-to\" and link to this site. reply szvsw 12 hours agoparentprevI think this idea is so common now that it is almost the standard for technical documentation at this point even if people don’t know it by that name. reply Vosporos 10 hours agoprevThe Haskell language's documentation team officially recommends using it: https://blog.haskell.org/documentation-best-practices-in-202... reply swyx 9 hours agoprevhere is my alternative system: https://www.swyx.io/documentation-levels i find that the divio/diataxis 2x2 can be -too- complete, which is harmful for earlier stage, less mature open source projects, and also equal weights areas that nobody equal weights in real life. my system takes inspiration from real docs and creates a progression based on project maturity, aka prioritizing just the important stuff at the early stages. - *Level 0: Basic proof of concept* - _Example audience: you/colleagues/hobbyists_ - One sentence description for github headline - README with API docs - goal is to save yourself from looking at source code - *Level 1: v0.x* - _Example audience: greenfield early adopters. Ok with missing documentation, they are here for the idea. can contribute code/docs_ - One paragraph description with more context - could be a sales pitch but also give an idea of when to use you - Feature list/Project Goals - Install + Config Instructions - *Level 2: v1* - _Example audience: brownfield early adopters. Ok with bugs, they have some problem that isnt well addressed. Needs convincing._ - Comparison vs comparable libraries - Problem Statement - what you solve, how the developer/end user is better off with your thing than handwritten. aka Why You Exist - Basic Examples - Live Demos - *Level 3: vX* - _Example audience: early majority user. Wants ease of use, quick wins. Need to be very reliable. Needs content to sell solution to team_ - Project Status badges - Tutorial - Third Party Plugins/Libraries - How-To Guide/Cookbook/Recipes - User/Maintainer Content - Official Blog/Project and Meeting Notes - Talks - 3rd Party Blogs - Video Tutorials - Podcasts - Comprehensive Examples - *Level 4: Production use for multiple years* - _Example audience: expert user. Needs API stability/migration instructions, deep insight on how the project works and how it can solve problems. Needs to customize/adapt for at-scale/weird usecases_ - Growing the MetaLanguage - Origin Story/Naming - Who Uses Us - Logos - Quotes/endorsements/testimonials - Link to production use - Funding - Migration docs from previous versions - Roadmap - Reader-friendly Changelog - Anti-Docs - Helping Contributors - _Example audience: Industry beginner. They may not know any alternatives. You are the entire world to them._ - Explain acronyms, jargon - \"1 to N\" Docs - Different docs for different audiences (eg JS/Android/iOS) - Different languages - Examples - [Vue](https://vuejs.org/) - [Django](https://docs.djangoproject.com/en/3.0/) - some [meta thoughts here](https://jacobian.org/2009/nov/10/what-to-write/) - [React](https://reactjs.org) reply chris_nielsen 8 hours agoprevWhere would ChatGPT fit? reply red_admiral 8 hours agoparentIt can, on a good day, produce several kinds of documentation if you describe what you want. reply chris_nielsen 7 hours agorootparentYeah LLMs ingest all 4 and can conversationally give you all 4. I suppose it’s orthogonal. reply euroderf 12 hours agoprev [–] A frequent post to HN. It seems there is appeal in trying to systematize the entire idea of TC. I'd like to see this extended to three dimensions. reply perlgeek 6 hours agoparentA natural third dimension is language. If your user base is very international, you might need most of these documents in multiple languages. reply euroderf 6 hours agorootparentUser interface language is orthogonal to ebberyting. reply remram 3 hours agoparentprevFor every dimension you add, you double the amount of docs you have to write. reply simplify 12 hours agoparentprevWhat third dimension would you add? reply taneliv 3 hours agorootparentDepth? Like, three line basic how-to vs. one that shows how to (!) achieve something more complex, or not intuitively possible to perform with the tool being documented. Explanations that only tell you why you would not want to use the tool, sort of a laundry list of things that you can't or shouldn't be doing with it, and should be using something else, as opposed to a comprehensive look into how (or why) the tool works, and how it is better than competition, for example. Not sure if that makes sense from a more systematic point of view, but it could easily help structure your documentation: \"The Tutorial\" and below it \"list of additonal advanced and obscure mini-tutorials\". This is not to say anything about the length of each document, but naturally shallower ones could often be shorter. reply euroderf 10 hours agorootparentprevFair question. I've read a couple of critiques of Diátaxis that suggest additional boxes. FAQs and \"Gotchas\" need a \"home box\". So do gists. Maybe a third dimension would be something like \"degree of curation\" or \"need for taxonomy and organisation\" ? FWIW... DITA has concepts, tasks, & references - and AFAICT these map fairly nicely to Diátaxis. reply DanieleProcida 9 hours agorootparentFAQ lists are the equivalent of the box in my garage where I put things when I've been told to get them out of the house, and I can't actually be bothered to put them in the right place. reply riffic 12 hours agoparentprev [–] and I'll upvote it every time it comes up. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "Diátaxis is a systematic approach to technical documentation that focuses on user needs by categorizing content into four types: tutorials, how-to guides, technical reference, and explanation.",
      "This method addresses issues related to content, style, and organization, benefiting both users and creators by enhancing documentation quality and accessibility.",
      "Diátaxis has been successfully implemented in projects like Gatsby and Cloudflare, demonstrating its practical effectiveness in improving clarity and user accessibility."
    ],
    "commentSummary": [
      "Diátaxis is a framework designed to enhance technical documentation by categorizing content into tutorials, how-to guides, reference materials, and explanations, each serving distinct user needs.",
      "This approach is gaining popularity in tech writing as it aims to improve documentation quality by avoiding the pitfall of creating one-size-fits-all documents.",
      "While the framework is beneficial, some experts advise maintaining flexibility to adapt to varying documentation requirements."
    ],
    "points": 408,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1733373336
  },
  {
    "id": 42323953,
    "title": "Bringing K/V context quantisation to Ollama",
    "originLink": "https://smcleod.net/2024/12/bringing-k/v-context-quantisation-to-ollama/",
    "originBody": "Just a moment...*{box-sizing:border-box;margin:0;padding:0}html{line-height:1.15;-webkit-text-size-adjust:100%;color:#313131;font-family:system-ui,-apple-system,BlinkMacSystemFont,Segoe UI,Roboto,Helvetica Neue,Arial,Noto Sans,sans-serif,Apple Color Emoji,Segoe UI Emoji,Segoe UI Symbol,Noto Color Emoji}body{display:flex;flex-direction:column;height:100vh;min-height:100vh}.main-content{margin:8rem auto;max-width:60rem;padding-left:1.5rem}@media (width Enable JavaScript and cookies to continue(function(){window._cf_chl_opt={cvId: '3',cZone: \"smcleod.net\",cType: 'managed',cRay: '8ed649efbfd0e62b',cH: '4L1yxrxKuLI93NYmDhRpdDtpbhQC6SVJdOcw5S3_Neg-1733425328-1.2.1.1-uQoqp5BTBHt50JiNykkAPWT5uFYrY3ue91rjvtYBEPaZJbZ3J6wr8rlLnT2QXMRN',cUPMDTk: \"\\/2024\\/12\\/bringing-k\\/v-context-quantisation-to-ollama\\/?__cf_chl_tk=CRF.W739ceD7Rd9yF4fxyjDsNAvLiVvlQEsNK9FAZqU-1733425328-1.0.1.1-MGsWGiqmTMhs0ILkWk84H9OqkAOn6waIYNXoRVvrUrc\",cFPWv: 'b',cITimeS: '1733425328',cTTimeMs: '1000',cMTimeMs: '390000',cTplC: 0,cTplV: 5,cTplB: 'cf',cK: \"\",fa: \"\\/2024\\/12\\/bringing-k\\/v-context-quantisation-to-ollama\\/?__cf_chl_f_tk=CRF.W739ceD7Rd9yF4fxyjDsNAvLiVvlQEsNK9FAZqU-1733425328-1.0.1.1-MGsWGiqmTMhs0ILkWk84H9OqkAOn6waIYNXoRVvrUrc\",md: \"VCuF972RDR8EuTrdWk7AGLmNVEE0bbQqaSd43qgnCMk-1733425328-1.2.1.1-08nPcVGnLaErOivj9zi6K9yEk5thdWVjO7RTi7CK_4z6mufKx6Q2A2GCeSTjYX718GAW2azHyuDVxwLudy9hUWChG1RNkSAJCrExzJMjrsR8Tug7j7WkTWDLV7MVrmYkAdZHp0vTW0O7QVvXzMmDaIwf7m20NsrNVCMbBl8g7iYcCzsIsh_9rMtTJEF2JOsrQqrGmwknfx7vIrqtU_hAlUM3bciu_vHiMbacy8SuxJCYWohasxrQi5TWqylOF_bueG3_aiWyqCoeK7QpxR5TasQ.aJT5k_GTAmR9RmEaWTcFM9_hFUUlMSpnmyj_LSkUPp63d.gpqx9KWz9EiMOEx86jikD3FzbGOZJwvs25MWA3zQMg5pw5V8yG1QtxYe_TWoOMpCAfAxOX2QWCS_kkpjMO3SZy3zTD3QVNYM5QF2L9.EjD2aeaMbvmnfwvYmCbCZKpX71vZR1dR2Z0kS4ri.My0_XOjwReCkICA9ArJTST40e3QxnCupqsRjWZ7ELSmugCpbn7bditbpCvOClBFA2zrB35GTRj6OqrU.9eVX1lWRbK7XyKVovrlhQnL9OW4o9drsbM6sYku1HMhA8dMqiJSzuSAUfRgLYsL9YQbyB7j_beu2S6EeLD0R1aZ4lAs.uYPcf3rX6lpuk.Ruqd0d6ZeiFKx_KibU3N07Svanb_ZwacPXnagon5taqeqd8kxJpwQThrWX5fnraYNhNzrx25pObu6CcWZk_PgBXc7kiyfSBM8l1qxqLvBtUUy9vaDBzqkfxx.G7iALCsUHIB_QCZWFXY7zvAJQkimWcwJeWSn9BvRTxpEIVRqWpuA8JfXBFO5bR3AnWG03KEKXX3OJn2DuKcr0wtn39TxWn0ClVbywaeoveE2HU4T7HxNgcPEzNeIXl7iRSGebRpHTbmfuoljctxcKKP5w2j2LHtuIsPUG8g0KMT22j7uLUptUWcGsrIqJmAjo0Mu2U3cRmCYEWZRfWPWnlWJ2Ml7gTwl2Eje5h93cSfeE0mS5UDQEd2uime2pow7HDPbQei8qxYTzPCa9RwL7NY6s969UqcJ0x8I5m_Pbbveo2.QGHtRUSzYTeqFfVzVo32GnVgs5kFF0CtAU7ldD1Szrcf4YqxW6G2xiG6JQmyf9lmig7esg6WMDJkaG8ABlIu6NHJuN7MxNgv.gVeiA47R1.QaYVzTb.MCWS2zqiSlUhiAMgJVeIEaxWuutOPh.XheZKcFrq4W5hiBCvfrJoRTrQAZZ.LCHeDe9RFMxsALO2Bpc72jGtUaQ3t6uokseiomSQTHeQLB0H9FXQPMCjJMK1Ozy11gNeUI2XjpnSA1pOBr.aA8KwFQ0FH_dYor6fB_tvbWc0A8UJxlwD9usyNsK7J3G0LjTU5ZxhRGTEBB4TQGmxFEKdH0xi76d8mq1z6IejAcFPVB1RWrDIrUEvD4Mx1sltLxMfV2PFfgTcQOne54iGzT6p0Lg0NfKX0V2SCgNAHBzmZGsi3JsS2.JuFH0cq9k4djQTsC0ikgcqU6You..RFXvXarcJCV7MrqsyEPqcoQWE9ohEyR42bGjAZJkQ9XhzlUQzVNYnrBVNeosl5GImcnF0YJbxtKxXElICDYybrNwr75eUG69KL8hYQ6qNSY_M5V4GO5D649LyGw_YIU3SBoi3tM40uZ0K2_Lkj7GYxzJS5Ii3CDTlPY11.D6D1WPdL8qkLtqdyU3KoEcrO7zz0KSMepiexNPzd1eBF9Hy8t0OzAzQkyZ.1QGJhvd9WziPfw3nCZ1FuK44kr4lNqYfknV.Nl0DUrbqFp3Q8NtpV7jxqiVNoIpF_LB6xwhAksa.wpFry2_kYtdfeNRFksav0KrNfeY2e0O8WrngIJ3nXkSGNhck97uwudP4dqMvuGAEgqAcKYAx9keTJ9JwHHKlN2tGCnMf_YD2SNbzcJY1ZXFkhcdIu6jfX1bpCuiRtSBMUKPXuL2YB055zYUiuJPZ41qZw4uquszThdqZ0T_Sf1bxbDpb_4ZOB5WgIiT1pe.g70N780MDJwXCjdDt.FatuHLcCQ9H3FOKllqnRjHOqBlQhQkn1BiP8ZSs4rEfahxWa7_fkTiJJ99wc4R8JqDGFtikXhy4oc7RO1Hn4G3CnBZsb_kgPqgpm5tKbGD9ArD9jtkqdV7BaB6Uu79Y_fsXSE.CiTmH2soaxrxs68wrvPp_.0Az4bWLk2Eu7C5YYH_n1nDxTFOt1soac9VbOvkYhvLHSj3wnyAyNW4oZzZrG8A0u7jBfsWiDiY.m..ax7l.mboj5WeAynJDhYDN.BDxCPmxP9D9w5rvM7M_Bl58E3ucCrBQ.j.U_9VlHuYN3pDLKyTZkrV7qUXBRqpilUKxGpLLv9cQ5DAYTzhFF.1Ti_XrA6_BkYx.1yVyzLFS3B_cse18_2XQUErLJvvOVSnM716VJMAgZv.tnDHFXhmCdzZBqzEfLtZaGzfccgNEOGQKRq8aSmfZYMSyEMrvDD2mxOV1Vt0kmy4CXLtUomYTjgBjl2Q\",mdrd: \"1CnZQKv4ioTCkk4KmgKf6_CoHV8.Yn4jS0cKYTx4CrQ-1733425328-1.2.1.1-VBj3wmRvmR4xrMyQWyLaAS4o4TizX5lG0xFRaXTxp.igD6DCOdmtpYcW5yhVuIUPmvl_jVkLJ8cJrytZhKAwkvCV.yv3HpgJbsB5rrA9zqTWbbtJ1LARECOnC7OW.slPrfdXXUu9V9rbA8v3z3_tliZD_jjZ6WCgaFj6YBP8._PY336.RXbBcXx3akyP8.X11xz0cK_AFvdigAgiwzuJhVHXUy3Og5t7ZasVwgM6FX7rHlusC._L3Td12t5Rx7yVzx_YYU7ZDLWfLET1VTcnfh2HPDBEI9xPYnfdQ2cvhBMqNq4BKrHZklNDXWc7.ULMLqThxIJ5nsiJ5U5P2bI9YVMgNvM3ZBWS6UCVV6k0lg89IzgxH5tAwLLk8wlsmOvqc1zgDv8mgEo8d8anprJRQlaTf8skwZVMFVDpXUFQ.Aql2xUVgjGIRpKaKe2HcLTlBqvTLXhtRqUnl57NWAsuHVCmpqNpYxqBCC4Qy41BKRsH8fJgtilTKZ12jJX46NQl3grEpHPnI1zKKubervX7ArIh.Ad0wo56.hfXC1Puz9MMQSmVxAsMeYz.VIkGp3eB6adlH9UkJdOl3DwTWK4mRysR5MkY3nNHnDeh3_2uygqSpiKFvOt1BIXtCTM6LmobYZuUQCP2VLYNlNo.QT0bMQQaYGUq4qTtjSECxPRsdVcKps1OJbB8smzTO_j7U1pwFVdfYVJCuDG9er.Q7ziVFKeZEa0iKYg8Uy_7BuZXAqX6y925LSEGdN_4sA8ZPifiqUFhKymO2OmOTyBe3f.XgSXTN5mEmJsYvJFFz02vmD.ljc.YYTLs.25PhEI.2Ogp3M8FdUHnGHE_DmzOiNwJKWrOTpfvA_MtL2UkMMBomw7tXXzTfJBBOVrVMQ9AbzVxq2SoLYn2ZZQP0HGa4JB346TuHKA_mBzFHuT.o5V5Y5ZH85L0S2hatIo12Wxz6R0ghWfm8ApRZnBZ8c09YoEJVn2DGWLsX7mnRgXiaoLZOfmjJIOQDlp_n0YnbGn0LJ9jdEwmGGelEFz6XkESWo_7zHyE.WiF5wtc49IV6su811r8ftZWMiI_X1tY6sTdvpgIUq6HS43D98BvXgwJt_Gjxjn5cpfp0nuBlKuwzbUEUsid.Ucb_tgyu0VWfMBk3S5q0Mcn0NSQOFP3D.1wGpQ0ZyWYeiN78cIazMvQh1ZSR__XaRXl9irqpOdfm7pRmfGPtDA2RTemGcVGEP.byr.cxfhc2631Iog18odB75iNtGHljJ.8WpGySZC6G6tJ0Agwo6M_pCb8h6Ove7tw7J8SIF7MY_ae28.WE3q3YffaygGXCLU1r7O.Q60Q0sQ0_L_yagz.T6cY9A1uxjkwVIUv5kKjqhnozu__EnuY8D_Jilk4_mg1P5wF.gNEffYAsGcxdD2BY3DOCA0rByt47Xdmit1V_Q.6Sgn_tqfIzrpfN_aooE5ev.3lZ1oAkuaUzP1C2JwTM.M4Dq5fq80VY6A1TU8PazYWNRwnq7D01Gon758ziZolw_99RquCVvDjb3Bu8rEGW5rV3AgNAZJQYwMZii0uTz4ESwoXXS_DQ3yvPStLxVb2v3Dt5BwOwHyjH0s7XN_gIVSzHqIF_w_WVC3eouw5VmuU3zMbtkvJFXMAaAWcs.Ckj4QhxEt9MVwH9m.nqeus9BpuzAsAdIlTV_15fc4DxSjTLq9pKaMscPsF6hYVaVpOZBuBefKun0FO99_OBybPXEkNPUjZH5hmWOKoaN5f1d71uCgPyA5UlA6N22qKTV6F_eLhcQaZqctR9kb77r1OdFScD5FlbCRe2eG2ILlP3GDbwpD3AguoYOyNVJwy245do2E6zbiumSqRtb5Kcn.SHKLMXkYH8iYs54k0quEHdDYaTwm3Db5KNfbC7kNWvQ6cz.Xwt.6xDQaYj9sIIloaskg61GDXg06ggPUflvUSw8JOHQ0TpL4oFYMGYVhFs6J68LYVFtI5_ehZWti9e9pG6MaYsZCGltHQLsLV2GxzafOGCAKRj3UCEIEhUWjUW_64YXy_1g3bzeSgQ1HljJ6AhP_lObe1BWFoF4ufTEIS4Uo2GicePcIB3tRL_GWeCDUXutpzf_A3NEczQh7_Q.VuOIwqzy7TbiLtGJ.g7lvw2KaEZ631xjhD42q8EbfZ7oxcG0H069RNhikionNTH85heh_rNJPExQJBRCKGaGEJhVxNIbZAz1YTg2lnB_5ZuOt8_W9oJWN7WKxHpSv6pWGFNzLrZNLkl_L5xB1BPPqb0dn9I_F4ErXE4he.w7vf9XoxfUM1PA1yI9jojaFICJz7thy7bZ5TcKMxGYqRUkpw6wr4qNMeZuvyRLiLWIXXTq8rkuPDG8dnYVCsn1rCMAYtkPy9J7SZMV0KkTAssA\"};var cpo = document.createElement('script');cpo.src = '/cdn-cgi/challenge-platform/h/b/orchestrate/chl_page/v1?ray=8ed649efbfd0e62b';window._cf_chl_opt.cOgUHash = location.hash === '' && location.href.indexOf('#') !== -1 ? '#' : location.hash;window._cf_chl_opt.cOgUQuery = location.search === '' && location.href.slice(0, location.href.length - window._cf_chl_opt.cOgUHash.length).indexOf('?') !== -1 ? '?' : location.search;if (window.history && window.history.replaceState) {var ogU = location.pathname + window._cf_chl_opt.cOgUQuery + window._cf_chl_opt.cOgUHash;history.replaceState(null, null, \"\\/2024\\/12\\/bringing-k\\/v-context-quantisation-to-ollama\\/?__cf_chl_rt_tk=CRF.W739ceD7Rd9yF4fxyjDsNAvLiVvlQEsNK9FAZqU-1733425328-1.0.1.1-MGsWGiqmTMhs0ILkWk84H9OqkAOn6waIYNXoRVvrUrc\" + window._cf_chl_opt.cOgUHash);cpo.onload = function() {history.replaceState(null, null, ogU);}}document.getElementsByTagName('head')[0].appendChild(cpo);}());",
    "commentLink": "https://news.ycombinator.com/item?id=42323953",
    "commentBody": "Bringing K/V context quantisation to Ollama (smcleod.net)206 points by mchiang 17 hours agohidepastfavorite28 comments smcleod 17 hours agoShout out to everyone from Ollama and the wider community that helped with the reviews, feedback and assistance along the way. It's great to contribute to such a fantastic project. reply octocop 5 hours agoparentshout out to llama.cpp reply lastdong 2 hours agoprevGreat project! Do you think there might be some advantages to bringing this over to LLaMA-BitNet? reply satvikpendem 16 hours agoprevWhat's the best way to use Ollama with a GUI, just OpenWebUI? Any options as well for mobile platforms like Android (or, I don't even know if we can run LLMs on the phone in the first place). reply zerop 1 hour agoparentMany are there, apart from what others mentioned I am exploring Anything LLM - https://anythingllm.com/. Liked the workspace concept in it. We can club documents in workspaces and RAG scope is managed. reply qudat 15 hours agoparentprevFor hosting a web gui for ollama I use https://tuns.sh It really convenient because it's just an SSH tunnel and then you get automatic TLS and it protects your home IP. With that you can access it from your mobile phone, just gotta require a password to access it. reply minwidth0px 2 hours agorootparentI wrote my own UI[0] that connects over WebRTC using Smoke.[1] [0] https://github.com/minwidth0px/gpt-playground and https://github.com/minwidth0px/Webrtc-NAT-Traversal-Proxy-Se... [1] https://github.com/sinclairzx81/smoke reply satvikpendem 15 hours agorootparentprevI'm running OpenWebUI via Docker via OrbStack, it also automatically provides TLS and works pretty well. reply vunderba 3 hours agoparentprevAs far as open source goes, I'd probably recommend LibreChat. It has connections for ollama, openai, anthropic, etc. It let's you setup auth so you can theoretically use it from anywhere (phone, etc.). Fair warning, it's relatively heavyweight in so far as it has to spin up a number of docker instances but works very well. https://github.com/danny-avila/LibreChat reply sadeshmukh 16 hours agoparentprevA lot of the UIs, including OpenWebUI have the feature to expose over LAN with users - that's what I did to use my GPU while still being on my phone. Not entirely sure about native UIs though. Also, I normally use Groq's (with a q) API since it's really cheap with no upfront billing info required - it's a whole order of magnitude cheaper iirc than OpenAI/Claude. They literally have a /openai endpoint if you need compatibility. You can look in the direction of Google's Gemma if you need a lightweight open weights LLM - there was something there that I forgot. reply huijzer 13 hours agoparentprevI have Open WebUI on a Hetzner instance connected to Deep Infra. Works on mobile by turning the web page into an app. I find the web framework that WebUI uses quite bloated/slow, but apart from that it does work reliably. Price at Deep Infra is typically about $0.04 per month even when actively asking lots of questions during programming. reply smcleod 16 hours agoparentprevI personally use a mix of Open WebUI, Big AGI, BoltAI, AnythingLLM on the desktop. The mobile space is where things are really lacking at the moment, really I just end up browsing to Open WebUI but that's not ideal. I'd love a iOS native client that's well integrated into Siri, Shortcuts, Sharing etc... reply rkwz 12 hours agoparentprevIf you’re using a Mac, I’ve built a lightweight native app - https://github.com/sheshbabu/Chital reply antirez 8 hours agorootparentThat's very cool, finally a native app that runs fast. Thanks. reply rkwz 7 hours agorootparentThanks for the kind words :) reply magicalhippo 10 hours agoparentprevAa a Windows user, who just wanted something bare bones for playing, I found this[1] small project useful. It does support multi-modal models which is nice. [1]: https://github.com/jakobhoeg/nextjs-ollama-llm-ui reply seb314 4 hours agoparentprevFor running llms _locally_ on Android, there's \"pocketpal\" (~7tok/s on a pixel 7 pro for some quant of llama 3.2 3B). (Not sure if it uses ollama though) reply paradite 12 hours agoparentprevI built a custom GUI for coding tasks specifically, with built-in code context management and workspaces: https://prompt.16x.engineer/ Should work well if you have 64G vRAM to run SOTA models locally. reply throwaway314155 11 hours agorootparent> Should work well if you have 64G vRAM to run SOTA models locally. Does anyone have this? edit: Ah, it's a Mac app. reply gzer0 7 hours agorootparentM4 Max with 128 GB RAM here. ;) Love it. A very expensive early Christmas present. reply paradite 9 hours agorootparentprevYeah Mac eats Windows on running LLMs. My app does support Windows though, you can connect to OpenAI, Claude, OpenRouter, Azure and other 3rd party providers. Just running SOTA LLMs locally can be challenging. reply wokwokwok 15 hours agoprev [–] Nice. That said... I mean... > The journey to integrate K/V context cache quantisation into Ollama took around 5 months. ?? They incorrectly tagged #7926 which is a 2 line change, instead of #6279 where it was implemented, which made me dig a bit deeper and reading the actual change it seems: The commit (1) is: > params := C.llama_context_default_params() > ... > params.type_k = kvCacheTypeFromStr(strings.ToLower(kvCacheType))params.type_v = kvCacheTypeFromStr(strings.ToLower(kvCacheType))It took 5 months, but we got there in the end. ... I guess... yay? The challenges don't seem like they were technical, but I guess, good job getting it across the line in the end? [1] - https://github.com/ollama/ollama/commit/1bdab9fdb19f8a8c73ed... [2] - since https://github.com/ggerganov/llama.cpp/commit/bcc0eb4591bec5... reply meesles 14 hours agoparentAuthor describes why it took as long as it did in the post, so I don't think they're trying to be disingenous. Getting minor changes merged upstream in large projects is difficult for newer concepts since you need adoption and support. Full release seems to contain more code[1], and author references the llama.cpp pre-work and that author as well This person is also not a core contributor, so this reads as a hobbyist and fan of AI dev that is writing about their work. Nothing to be ashamed of IMO. [1] - https://github.com/ollama/ollama/compare/v0.4.7...v0.4.8-rc0 reply smcleod 14 hours agorootparent> this reads as a hobbyist and fan of AI dev that is writing about their work Bingo, that's me! I suspect the OP didn't actually read the post. 1. As you pointed out, it's about getting the feature working, enabled and contributed into Ollama, not in llama.cpp 2. Digging through git commits isn't useful when you work hard to squash commits before merging a PR, there were a _lot_ over the last 5 months. 3. While I'm not a go dev (and the introduction of cgo part way through that threw me a bit) there certainly were technicalities along the way, I suspect they not only didn't both to read the post, they also didn't bother to read the PR. Also, just to clarify - I didn't even share this here, it's just my personal blog of things I try to remember I did when I look back at them years later. reply guywhocodes 10 hours agoparentprevThis is par for Ollama, look at the log_probs issues/prs and you get an idea of how well Ollama is run. Ollama is IMO a model downloader for llama.cpp so you can do roleplay with ease. reply yard2010 2 hours agoparentprev\"Judge not, that ye be not judged\" reply smcleod 13 hours agoparentprev [–] I'm going to be generous here and assume you didn't bother to actually read the post (or even the PR) before writing a snaky, non-constructive comment, but skimming through your HN comment history this appears to be on-brand. reply wokwokwok 4 hours agorootparent [–] I'll be generous and just say, maybe people should just use llama.cpp and not ollama if they care about having nice things, if merging support for existing features is that difficult. It seems like it's probably a better choice overall. That said, I'm sure people worked very hard on this, and it's nice to see it as a part of ollama for the people that use it. Also: > Please don't comment on whether someone read an article. \"Did you even read the article? It mentions that\" can be shortened to \"The article mentions that\". https://news.ycombinator.com/newsguidelines.html reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [],
    "commentSummary": [
      "The integration of K/V (Key/Value) context quantization into Ollama was a collaborative effort between the Ollama team and the community, taking approximately five months to complete.",
      "Challenges were faced in merging the feature into the project, highlighting the complexities of contributing to large-scale projects.",
      "The project underscores the dedication of hobbyists in AI development and includes discussions on various usage methods, such as GUI (Graphical User Interface) options and mobile compatibility, with tools like OpenWebUI and LibreChat being recommended."
    ],
    "points": 206,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1733362830
  },
  {
    "id": 42328971,
    "title": "Next stop: Miami",
    "originLink": "https://waymo.com/blog/2024/12/next-stop-miami/",
    "originBody": "Back to all posts December 5, 2024 Next stop: Miami Waymo One Author:The Waymo Team Share on Twitter Share on Facebook Get ready for a touch of magic in the Magic City. We're excited to announce that Waymo One will be expanding to Miami! While Miami is known for its sun and fun, the city is also an emerging hub for innovation. Waymo’s autonomous driving technology offers an opportunity to provide safer, more accessible, all-electric mobility to Miami’s residents and tourists. In early 2025, we’ll begin reacquainting Waymo’s all-electric Jaguar I-PACEs to Miami's streets. Through our new fleet partnership with Moove, a global leader in innovative mobility solutions, we’ll work to open our doors to riders in 2026, offering our ride-hailing service via the Waymo One app. Our previous road trips to the Sunshine State’s challenging rainy conditions have been invaluable in advancing our autonomous driving capabilities and we’re honored to return and bring our service – which already provides over 150,000 trips per week across Phoenix, Los Angeles, San Francisco, and Austin – to the people of Miami. We'll first collaborate with our fleet partner Moove in Phoenix, where they'll begin taking on the management of our fleet operations, facilities, and charging infrastructure. This strategic partnership is designed to maintain and enhance the clean, consistent experience that our riders have come to expect and rely on. In both Phoenix and eventually Miami, Waymo will continue to offer our service through the Waymo One app, and remain responsible for validation and operation of the Waymo Driver. “We are excited to partner with Moove in Phoenix and later Miami, bringing together their mobility-focused fleet management experience with our growing Waymo One service,” said Ryan McNamara, Vice President of Operations at Waymo. “Together, we will provide safe, seamless trips for riders, and scale faster and more cost-effectively over time, with safety continuing to lead the way.\" \"Ride hailing has transformed urban mobility over the past 15 years, yet the core experience has largely remained unchanged,” said Ladi Delano, Co-founder and Co-CEO at Moove. “Waymo’s safe, reliable, and convenient Waymo One service leads in autonomous technology, and together, we’re driving a major shift in urban mobility. Moove is proud to partner with Waymo, bringing the operational expertise to make this transformation possible.\" “Fully autonomous driving technology offers a safe and convenient option to the people of Miami. I’m so pleased to welcome Waymo to our city,” said Francis X. Suarez, Mayor of Miami. “Waymo’s commitment to sustainability with their all-electric fleet is the perfect mobility option to our city as we continue to prioritize low cost, clean energy.” ¡Hasta pronto, Miami!",
    "commentLink": "https://news.ycombinator.com/item?id=42328971",
    "commentBody": "Next stop: Miami (waymo.com)183 points by ra7 3 hours agohidepastfavorite210 comments fngjdflmdflg 3 hours agoThis is important if nothing else because Miami sees much more rain than SF and Phoenix: Miami: 57 in. (https://www.ncei.noaa.gov/access/us-climate-normals/#dataset... SF: 25 in. (https://www.ncei.noaa.gov/access/us-climate-normals/#dataset...) Phoenix: 7 in. (https://www.ncei.noaa.gov/access/us-climate-normals/#dataset...) reply ethbr1 2 hours agoparentAlso relevant, when it rains in Miami during the summer, it pours. As in, zero visibility for 15-30 minutes, then it's past. So if it can handle Miami tropical rain, it should be okay with all sorts of normal rain. Out of curiosity, what's Waymo's current production sensor suite mix? I'd assume lidar and radar would also be very unhappy with the surrounding space suddenly being ~10%(?) liquid water droplets. reply nilstycho 2 hours agorootparentFar less than 10%. During a heavy downpour, by volume, about one part in a million is liquid. In a cubic meter of heavily rain, there are only a few tens of raindrops. reply deepsun 53 minutes agorootparentYep, but what matters for radar/lidar is the projection. I mean what percentage of 1 _square_ meter (not cubic meter) is occupied by droplet projections. Or, in radial terms, what percentage of \"Solid angle\" is occupied by rain droplets. reply naming_the_user 1 hour agorootparentprevImagine if it were 10%, though. During the time it took for a droplet to fall 1 metre, you’d have 10cm of water on the floor. I reckon it’d feel quite heavy. reply CasperH2O 1 hour agorootparentprevLiDAR sensors, like for example from SICK can have multiple 'layers' of sensors, which combined with various algorithms can handle rain pretty good. reply ibejoeb 1 hour agorootparentprevNot just visibility in the rain, but diminished or fully obstructed visibility due to ponding and full flooding. Then there are the physical navigational problems associated with that. They probably shouldn't be driving though a foot of sea water. reply diggan 1 hour agorootparentprev> So if it can handle Miami tropical rain, it should be okay with all sorts of normal rain. I feel like a lot of \"How well does it handle rain?\" comes down to how the roads are built and maintained (Huge puddles, proper drainage, etc) rather than about the car itself, as the car you could test by blasting it with water from different directions and amounts. reply alwa 1 hour agorootparentThere’s also the question of how other drivers handle the rain. And I have to imagine it’s nontrivial to, on a test range alone, permute the full range of different surfaces’ handling characteristics under different precipitation conditions. I wonder whether, like many human drivers, Waymos might be wont to pull over and wait out the short-but-extreme Miami squalls. reply porphyra 1 hour agorootparentprevLidars perform very well in the rain [1]. [1] https://ouster.com/insights/blog/lidar-vs-camera-comparison-... reply david-gpu 2 hours agorootparentprevI would expect service to be canceled while it is pouring down. Do we have reasons to believe that they have the ability to ride safely during heavy rain? I haven't been keeping up. reply RivieraKid 2 hours agorootparentThey can handle heavy rain, see time 6:00: https://youtube.com/watch?v=Bm1A3aaQnh0 From their August 2023 blog post: > During this past winter season in California with its record rain, high winds, and thunderstorms, we were able to maintain 99.4% fleet uptime reply 1024core 2 hours agorootparentHow does it make out lane markings? Or is it all just GPS-based? reply AlotOfReading 2 hours agorootparentLocalization is primarily based on visual registration, i.e. matching the current surroundings to the closest data in its map. Lane markings are based on map data and what it's able to see in real-time. reply RivieraKid 1 hour agorootparentprevMaybe similarly how humans do it. reply mikepurvis 39 minutes agorootparentHumans do it super badly in a heavy rain/snow though. We're basically blind and just toodle along following the guy in front and hoping for the best. A machine driver should not accept these conditions. reply david-gpu 2 hours agorootparentprevThank you, that was fascinating. reply tialaramex 2 hours agorootparentprevIf it's too dangerous for humans to drive (regardless of whether they do anyway, humans do all manner of things which are unacceptably dangerous) then I don't expect Waymo to offer service even if they believe they technically could have the Waymo driver [their software] continue to deliver service. reply marcosdumay 1 hour agorootparentThe weather becomes too dangerous to drive because of mechanical (lost of adherence) problems way sooner than humans have sensorial problems anyway. So if it's too dangerous for people, it's also too dangerous for computers. reply ecesena 2 hours agoparentprevInteresting random fact: when it rains, waymo turns on the windshield wipers reply jayd16 2 hours agorootparentThey would probably have to go out of their way to disable the auto-wipers, no? reply tshaddox 1 hour agorootparentThey definitely go out of their way to make significant modifications to their vehicles. reply falcor84 2 hours agorootparentprevIs this relevant? Are any of its cameras/sensors behind the windshield? Or are there wipers directly on the external cameras? reply ecesena 2 hours agorootparentI think it's just for passengers' experience reply phantom784 1 hour agorootparentProbably also a legal requirement to run them during rain, even if it's not actually needed for the self-driving cars to work. reply stemlord 2 hours agorootparentprevPlenty of south florida rain is not helped by windshield wipers. Anyway I wonder if waymo sensors actually have better visibility in such conditions than people do reply hn_throwaway_99 1 hour agorootparentI think the comment you are replying to is implying that it's a bit funny/weird that the wipers turn on, because there aren't any sensors that are looking out the window to see. (As others pointed out, it could just be default auto-wiper functionality, and of course passengers still like being able to see out the window, even if they aren't controlling the vehicle). reply pengaru 2 hours agorootparentprev> Interesting random fact: when it rains, waymo turns on the windshield wipers The jaguar i-pace does this independent of the waymo use case. reply rdsubhas 1 hour agorootparentThe interesting part here is... the Waymo has no reason to. There is no driver. All cameras and sensors are outside. It's just for not freaking out the passenger :) reply Fricken 1 hour agorootparentWaymo has wipers on it's LIDAR dome https://www.reddit.com/r/oddlysatisfying/comments/6biyr8/way... reply pengaru 1 hour agorootparentprev> The interesting part here is... the Waymo has no reason to. There is no driver. All cameras and sensors are outside. It's just for not freaking out the passenger :) We have very different thresholds for what's interesting. The platform provides this feature out of the box, why would waymo go out of their way to disable it. Obviously potential occupants would appreciate seeing out the windshield if it's raining, why that is interesting escapes me. reply dgfitz 1 hour agorootparentprevMy 2011 Mazda also did this. reply Grazester 23 minutes agorootparentCars dating back to 2008 if not earlier. It can also be annoying/doesn't work very efficiently reply bushbaba 2 hours agorootparentprevRain + lidar = challenges reply ecocentrik 1 hour agorootparentprevI'm guessing you've never tried driving in a tropical rainstorm. It's as bad a driving in heavy fog. Sometimes you only really have visibility of a few feet. reply 0xbadcafebee 1 hour agorootparentThe.... driverless car... doesn't look out the window.... reply drewg123 1 hour agoparentprevWhen I took Waymo in Phoenix, I booked a ride from a suburban hotel to a restaurant in a strip mall. One of the things I noticed was that I was picked up far away from the entrance of the hotel (eg, not under the overhang that protects from sun and rain, where every Uber has picked me up and dropped me off). I recall thinking that it was good there was no weather in Phoenix b/c I had to walk far enough I'd have gotten soaked in a decent rainstorm. Have they changed this? reply dannyobrien 1 hour agorootparentOne thing I've noticed about the SF deployment is that it's slowly gotten better at this. At first it was very cautious about where it would pick you up/drop you off, but now it offers much closer options (from a menu -- a bit like Uber at airports). I suspect this might be something that is human-added from data collected in past trips. reply tortilla 1 hour agorootparentprevAlso Waymo will not pick you up on private streets. I live in a small community with a private street and I have to walk to the nearest public one (2 mins). reply ecocentrik 1 hour agoparentprevThe rainfall can pose serious visibility risks that will be as much of a challenge as picking up and dropping off customers on a rainy day. Extreme high tides do still flood some roads on Miami Beach with brackish water, which isn't something you want to drive through in an electric car. On the less challenging side, the city has zero snow, no road ice to worry about. reply RivieraKid 2 hours agoparentprevWaymo can handle heavy rain, see time 6:00 here: https://youtube.com/watch?v=Bm1A3aaQnh0 reply OnlineGladiator 2 hours agorootparentAnd yet I regularly get stuck behind a Waymo in SF when there's just a little bit of fog. reply bbor 2 hours agoparentprevGood point! Though also worth mentioning that they're already in Atlanta, which gets ~50in (and 59in so far this year, despite the mind-bending \"first October without rain in recorded history\") reply newfocogi 2 hours agorootparentI think they've announced they're headed to Atlanta in early 2025. So they may be testing there, but I don't believe they are at GA in GA :) reply fngjdflmdflg 2 hours agorootparentprevGood point, I guess I missed when that happened. Looking at some news sites and Waymo's blog, it seems that they are testing in Atlanta and will start accepting customers in 2025.[0] >It currently operates fleets of driverless cars in San Francisco, Los Angeles, Austin, and Phoenix. It also plans to launch a robotaxi service in Atlanta in an exclusive partnership with Uber.[1] [0] https://waymo.com/blog/2024/09/waymo-and-uber-expand-partner... [1] https://www.theverge.com/2024/12/5/24313346/waymo-miami-robo... reply simpleintheory 3 hours agoprevI think the most interesting part is that the article says that Waymo's handing its operations to Moove. It seems like Waymo's trying to become a software provider while having other companies handle the capital-intensive parts. reply xnx 2 hours agoparent> having other companies handle the capital-intensive parts. Waymo definitely wants to outsource the areas where they don't have special expertise (i.e. Waymo is 100x better at driving, but not 100x better at washing and vacuuming cars). I'm not sure how capital-intensive regional operations are. The vehicles are definitely the largest capital expense. This is more like an AirBnB property owner hiring a cleaning service. reply hwc 1 hour agorootparentAlso, contracting out the menial labor makes Waymo's labor practices look much better. They can tell their engineers that all employees make a living wage and get excellent health insurance. When the actual labor is done by part-timers with no health insurance making not much over minimum wage. reply ra7 2 hours agoparentprevThe pivot has already happened. They’re handing over Austin and Atlanta to Uber, and now Phoenix and Miami to Moove. The only places they will continue to own operations for at least the next year are SF and LA. reply bloomingkales 44 minutes agorootparentPivot to what exactly? reply ra7 34 minutes agorootparentTo owning just the self driving stack and not the physical operations of running a robotaxi service. reply kieranmaine 2 hours agoparentprevThis seems much more scaleable. Car share services (eg. Evo in Vancouver) seem like good partners as they already have the fleet management services and a recognizable (and hopefully trusted) brand. I'm not sure about other car share services work, but in the case of Evo they have existing relationships with the cities that make up Metro Vancouver. I wonder if this would ease rollout as you'd already know all the required people to talk to within municipal government? reply AlotOfReading 1 hour agorootparentB.C. in particular went out of their way to ban autonomous vehicles a few years back, so I'm sure waymo's in no rush to talk to local partners there. reply kieranmaine 23 minutes agorootparentThat is very unfortunate. I'm confused why they wouldn't want to get involved in trials and investigate all the benefits. Do you know the rationale behind the decision? reply ttul 1 hour agorootparentprevUgh, don’t remind me of the lost decade or so during which the local taxi lobby captured the regulators and prevented the entry of Uber. It wasn’t until the provincial government was about to be blown away anyhow that they cashed in their chips in a few ridings where the majority of cab owners live… I have no doubt that BC may be a nice place to live for a variety of reasons, but it will be the last place to have autonomous vehicles. reply Workaccount2 3 hours agoparentprevCompared to software, hardware sucks. Mother nature OS is by far the worst to develop for. reply lnsru 2 hours agorootparentIt does not suck! Hardware just barely works. I design motherboards for industrial computers for living. Last gem: radio module draws 5 amps while transmitting instead of specified 2 amps. Trust nobody! reply bickfordb 2 hours agoparentprevSeems smart. They'll continue to have all the leverage since they own the tech and will offload all the operational risk reply taneq 2 hours agoparentprevCapital-intensive, or labour-intensive? If I were a provider of 'special smart sauce' that goes on a common piece of equipment, I'd be trying to focus on making it so I could provide the sauce rather than dealing with all the real-world issues that come with all the real-world people using the saucy equipment. reply ethbr1 1 hour agorootparentDepends. Chick-fil-A grew into a pretty big business by vertically integrating outside of just selling sandwiches to Waffle House. So sometimes it's worth owning sauce distribution too. ;) reply Rebuff5007 1 hour agoprevI'm so curious about how the internal dev teams feeling about all this scaling. Four cities across 3 states -- surely there are differences in road signs, lane markings, emergency procedures, etc. Let alone the sheer volume of data of doing hundreds of thousands of miles ever week! Massive kudos to them if they are able to do all this without things being aflame on the inside... reply Hasu 1 hour agoparent> Four cities across 3 states This is actually a scale up to five cities across four states: > ...which already provides over 150,000 trips per week across Phoenix, Los Angeles, San Francisco, and Austin Which of course only adds to your point! reply joshjob42 48 minutes agorootparentActually they Miami would be #6. They are also starting to operate in Atlanta early next year along with Austin. So 6 cities across 5 states. reply Fricken 58 minutes agoparentprevSundar Pichai recently claimed Waymo plans to be in 10 cities by the end of 2025. reply whamlastxmas 1 hour agoparentprevMy understanding is they have to make extremely detailed maps of where they operate and at great expense, and everything sort of breaks when anything changes. So lots of work indeed! reply ra7 32 minutes agorootparentYour understanding is wrong. They work perfectly well when road features change and the cars are able to update maps in real time. See https://waymo.com/blog/2020/09/the-waymo-driver-handbook-map... reply threeseed 1 hour agorootparentprevWaymo doesn't rely on the maps to operate. It just helps with redundancy in case it's unable to see. And it's just a matter of the cars driving through each of the streets and working with local authorities. reply dyauspitr 1 hour agorootparentprev>everything sort of breaks when anything changes What is “your understanding” based on? reply mg 2 hours agoprevour service – which already provides over 150,000 trips per week across Phoenix, Los Angeles, San Francisco, and Austin Interesting. That's about 8 million rides per year. I wonder how close they are to being profitable? As soon as they are getting close to being profitable, they will probably scale this up super fast. I don't know how much Google invested into Waymo so far. Something like $10B? If they at some point make $10 per ride, they would only need something like 50 million rides per year to justify that investment with a p/e ratio of 20. To go from 8M rides to 50M in 5 years they would have to increase their capacity by 50% per year. Might be possible? reply avrionov 2 hours agoparentThe number of trips increased 10x from Sep 2023 to August 2024. https://www.sfchronicle.com/california/article/waymo-robotax... reply ezfe 2 hours agoparentprevProfitable from an operations perspective? Surely close since they charge the same order of magnitude as an Uber/Lyft and have fewer than one driver per vehicle (monitoring the vehicles). reply mg 2 hours agorootparentWe have to add the deprecation and maintenance of the car. Plus I guess they need high resolution maps? Not sure if that is a significant cost factor. reply marcosdumay 1 hour agorootparentOn the other hand, they certainly have a much better vehicle utilization than the other ride-app companies. They cars are cooperating in covering an area, not competing for the rides there. reply bbor 2 hours agorootparentprevI mean, they're Google -- I'm guessing they're pulling out their \"pointcloud of the entire world\" for this one. The first point is a great one, tho; rideshare companies exist by offloading as much cost as possible onto their employees, and even then barely make it work. Plus, at least some of the Waymos are super-fancy Jaguars -- tho it looks like roughly 20K Jaguars to 65K Chrysler minivans, according to Wikipedia. Still, they're all brand new vehicles; even with bulk discount, that can't be cheap. reply jeffbee 2 hours agorootparentWaymo does not have 85k cars lol. In their latest CPUC report they only have 480 cars in California and that is their biggest market by far. If they had 85k cars and only 175k rides per week that would be the worst business in the history of businessing. reply yellowstuff 1 hour agorootparentIt looks like they contracted to buy \"up to\" 20,000 Jaguars: https://www.theguardian.com/technology/2018/mar/27/waymo-sel... Pretty effective press release! Nothing in it is untrue, but it's obviously misleading even to careful readers. reply jeffbee 2 hours agoparentprevJust a few hours ago Sundar Pichai said it's 175k/wk https://youtu.be/kZzeWLOzc_4?t=926 reply oblio 1 hour agoparentprevGoogle has invested and also drawn external funding. From what I've seen in the last 15 years since founding the lower bound for their cost seems to be higher than $12bn and I can only imagine expenses will only accelerate. reply bbor 2 hours agoparentprevI imagine it's hard to quantify \"profit\" with such a research-driven org. It's like penciling out the profitability of the metaverse after years of $XX billion dollar losses. In general I get the sense that Waymo is more of a diverse investment than a pure ride-hailing play; for example, as of 2020 they were working for Volvo, Chrysler, Jaguar, and Nissan[1], presumably for $$$. It's also worth remembering that Zoox exists (Amazon's more futuristic self-driving car play, no steering wheel at all), and has not at all gone the way of Alexa/the Dodo bird (yet). I expect them to make a big splash sometime in the coming decade, personally. That is, of course, assuming they survive regulatory capture by Tesla, which would need a miracle or an unfair advantage to beat these two at this point, even if they finally follow the science on the need for LiDAR. Another big unknown is how the electorate will react to self-driving cars becoming more than a novelty; Elon Musk is absolutely correct that a backlash of some kind is inevitable even if the safety stats pencil out, IMHO. Trusting a machine is kind of inherently creepy - see Prof. Weinersmith's lectures on the topic: - https://www.smbc-comics.com/comic/decisions - https://www.smbc-comics.com/comic/fsd - https://www.smbc-comics.com/comic/self-driving-car-ethics [1] https://www.forbes.com/sites/davidsilver/2020/06/29/waymo-an... reply sixQuarks 1 hour agorootparentWow, I can’t believe you think Tesla needs a miracle to beat not only Waymo, but Zoox. This is laughable. Are you not aware of FSD version 13 that just came out in beta? An early tester did the exact same pickup and drop off at the same time of day between Tesla and Waymo yesterday. Tesla took 15 minutes while Waymo took 40 minutes. Watch for yourself. Tesla is going to destroy Waymo, they can’t compete https://youtu.be/CfX8Lu9MHa0?si=cOYWNXjPiYP9R6L_ reply teractiveodular 4 minutes agorootparentAnd what makes you believe 13 will finally have decent FSD when the previous 12 attempts using the same hardware did not? reply rsanek 1 hour agorootparentprevin what markets is tesla able to drive autonomously without any driver in the seat? from what I've read, none. reply timmg 3 hours agoprevI wonder when they will be able to provide service in northern cities (that get snow). Once they can do that -- and (I guess) can prove profitable -- they could expand non-stop across the country. reply asdasdsddd 56 minutes agoparentThey've been testing in Michigan for a while. I guess the only problem is that you can only test this stuff in a third of the year. reply schiffern 3 hours agoparentprevAnyone know the timeline for Waymo expanding to northern areas outside urban centers? Or are these underserved populations forever stuck waiting hours for an Uber that still cancels half the time? reply mlyle 2 hours agorootparentIt's got to be the lowest priority; population density improves economics and utilization. Not to mention that it's hard enough to drive in a city with snow, compared to all the other kinds of situations that can manifest outside of urban centers. reply comte7092 2 hours agorootparentprevAt the end of the day that isn’t a technical problem but a unit economics one. Removing the driver from a taxi doesn’t bring down costs that much. Self driving cars aren’t going to change the uber/taxi model at a fundamental level. They have a finite fleet that they need to deploy. Urban centers mean that fleet utilization is high, and relatively less time and miles are spent driving with no one on board. In rural areas with little demand they will sit empty or have to drive empty for many more miles to their pickups. It just isn’t profitable to use your fleet that way no matter what you do. reply danans 35 minutes agorootparent> Removing the driver from a taxi doesn’t bring down costs that much The average pay for a gig driver $18/hr. So for your typical 15-minute ride, that adds $4.50 to it. Let's say that 15 minute ride is 10 miles. Average. Uber rates are about $1.50 a mile, so that ride is $15. Therefore, the driver costs almost a third of the cost of the fare. Waymo's operational cost per mile, however, should be much lower than a regular driver because they will pay lower bulk rates for energy (already much cheaper because it's mostly off peak electricity instead of gasoline) and maintenance (standardized vehicles with highly controlled driving patterns and pre-negotiated repair contracts). reply Philpax 2 hours agorootparentprevHmm, I'm not sure about that - fully autonomous taxis wouldn't be subject to the limitations of human drivers in terms of availability / reliability / endurance. You could ostensibly leave a few taxis around to service otherwise underserved areas and have them run without having to secure a driver each time. That being said, there is still the cost of maintenance and cleanup, but that can be mitigated (the taxis for five towns could drive to one centralised depot, maintenance can be scheduled to maximise operational time, and eventually all of this can be automated, too) I don't know if that's how things will work out just yet, but it seems like a possible future based on Waymo's current operational strategy. reply comte7092 2 hours agorootparent> You could ostensibly leave a few taxis around to service otherwise underserved areas and have them run without having to secure a driver each time. I think you’re dramatically overestimating how much of a barrier obtaining a driver is here. The primary cost is opportunity cost of the capital that isn’t being utilized. Not having to have a driver doesn’t somehow make it so you can infinitely provision a fleet. reply 0xB31B1B 2 hours agorootparentprevTheres a bunch of factors that will mess with your intuition here: 1) ride hail demand as significant spikes in usage during morning and evening rush hours AND it has a fairly strong seasonal trend depending on geo. 2) Insurance is also a big expense and for large operations like this is priced per mile or per operating hour, having more deadhead time means a higher loss to insurance. 3) People are very sensitive to wait times AND reliability. The desire to use the service drops a ton when wait times are greater than 10 minutes or if you're consistently not able to find a ride. Could waymo support less dense suburbs now? Maybe at certain off peak hours, but the economics and product experience are difficult. reply skybrian 2 hours agorootparentprevThey won’t have to pay for the driver when idle, but owning cars ties up capital and the fewer rides they do, the longer it takes to pay off. This isn’t specific to cars - all capital equipment works that way. Lower utilization is sometimes unavoidable, but it still means less revenue which can be the difference between a profit and a loss. How much this matters depends on the price of the car. We don’t know how much a Waymo costs, but they’re probably not cheap. To be profitable with lower utilization, they’ll need to work on reducing how much each car costs somehow. reply xnx 2 hours agorootparent> To be profitable with lower utilization, they’ll need to work on reducing how much each car costs somehow. Definitely. Their custom vehicle had optimizations for cost, but seems to be on hold due to tariffs. Waymo also has the option to drop prices lower than Uber/Lyft when vehicles are unutilized, though they still need to stay above their per-mile depreciation and operating costs. reply comte7092 1 hour agorootparent> Waymo also has the option to drop prices lower than Uber/Lyft when vehicles are unutilized I think that’s an unproven assumption. There’s certainly reason to believe it to be true of course, but uber and Lyft are already capturing upwards of 50% of the fares for each ride, and that’s without the capital costs on their books. Removing the driver from the equation can’t lead to much more than that 50% (realistically much less) margin. Going from charging $10 to $5 isn’t going to make rides suddenly materialize. Especially in rural areas there are just times that people aren’t going to be looking to go anywhere, and wait time becomes far more of a factor that raw costs. reply jsnell 43 minutes agorootparent> There’s certainly reason to believe it to be true of course, but uber and Lyft are already capturing upwards of 50% of the fares for each ride, That's not true. If you check Uber's Q3 financials, gross bookings for \"Mobility\" were $21B while revenue was $6.5B. That's way lower than 50%. reply kieranmaine 2 hours agorootparentprevRemoving the driver does allow for single occupant models that could be significantly cheaper (reduced materials, smaller battery - assuming they'll all be EVS). It will be interesting to see how things develop once the driver is no longer required and cost is the most important factor (after safety). Exciting times! reply comte7092 2 hours agorootparentTaxis today are already far far larger than they need to be for two people. Logistically you need the flexibility of having more seats available. If you’re in a rural area and need to transport a family are you going to send 4 vehicles separately? Ironically it’s probably urban areas where single occupancy vehicles make the most sense, given that there’s always going to be sufficient demand to allow for more specialization in vehicles for different use cases. reply xnx 2 hours agorootparent> If you’re in a rural area and need to transport a family are you going to send 4 vehicles separately? Probably still years off, but Waymo will probably have a library of vehicles ranging from 2 seats to 20. reply david-gpu 2 hours agorootparentprevWe already have single occupant vehicles that are low cost and fun to use: bicycles and e-bikes. They are very popular in areas where safe infrastructure is available. reply triceratops 1 hour agorootparentprev> Removing the driver from a taxi doesn’t bring down costs that much A driver's salary costs as much as a new car. Every year. reply sixQuarks 1 hour agorootparentprevI can’t believe the level of ignorance I’m seeing in these comments. The driver is THE overwhelming cost of a taxi/uber. What are you talking about? Your problem is you’re not seeing past the costs of a Waymo vehicle with all its sensors and LiDAR, plus all the costs of keeping high definition maps updated, and having teleoperaters on hand. Tesla doesn’t have those costs. Their FSD version 13 already drives close to a Waymo of not better in some circumstances. its a done deal, Tesla has won this game reply duped 2 hours agorootparentprevI think ultimately the solution to this problem is the same as it was for electrification and telco: government funded mandates to provide service to populations where it's otherwise uneconomical. One interesting thing today is that CoL can be as high in rural areas as urban areas in the same state, partly because the additional costs of things that don't scale (mostly transportation and healthcare). But we've given up on government helping people, apparently. reply ndileas 1 hour agorootparentThat is indeed one solution to this \"problem\". However, maybe people who live in the sticks should just accept the tradeoffs that come with rural life? If you want next day delivery and taxi service maybe you should live in a place that has those? Not every service has to serve all people in all places and times equally. The government should absolutely not be mandating service levels across the whole US. reply asdasdsddd 54 minutes agorootparentprevPeople are clowning on you, but I think rural airport rides would be huge for waymo. reply timerol 2 hours agorootparentprevSF in 2015 (with passengers 2021), Phoenix in 2022, Miami in 2025. Northern urban centers are probably a decade out, let alone areas outside urban centers. There are a lot of cities in the Sun Belt to expand to first. reply IshKebab 1 hour agoparentprevBased on what I saw in SF they're still pretty limited to noob-level driving. I expect driving difficulty will be way more of a barrier than snow. reply AlotOfReading 1 hour agorootparentIf twin peaks and downtown are your definition of \"noob-level driving\", what's normal difficulty? Mumbai rush hour? An active war zone? reply dyauspitr 1 hour agorootparentprevDriving in SF alone means it’s above mid tier in most other places. reply whimsicalism 1 hour agorootparentprevstrong disagree reply mavhc 3 hours agoparentprevAssuming they stop relying on hd maps, or map everywhere reply foobarian 3 hours agoprevNot from Miami, so I wonder (based on news etc.) if flooding is ever an issue for traffic in and around the city? reply Quinner 2 hours agoparentFlooding is absolutely an issue, during the rainy season (third of the year) localized flooding is quite common. Some streets are partially flooded on an almost daily basis, something human drivers are used to but I imagine will pose a new challenge to waymo. reply jitl 3 hours agoparentprevIt is during and after a hurricane. I wouldn’t recommend taking a robotaxi during a storm though. reply danielvaughn 2 hours agoprevI’m sure they know much more than me and have thought this through, but it feels like Miami is an absolutely awful choice. Traffic is notoriously chaotic there. I’ve driven in LA, Chicago, NYC, Philadelphia, SF, Miami, etc. It’s by far the worst place to drive, moreso even than Manhattan. reply s1artibartfast 1 hour agoparentWhy do you think that makes a bad market for a driverless car? If driving is miserable, that means lots of people that dont want to do it. If traffic is chaotic, that means a good place to improve their software. reply ecocentrik 1 hour agoparentprevMiami is a challenging place to drive for most Americans with drivers from dozens of different countries on the roads at any given time, very bad traffic that makes drivers impatient and sometimes aggressive. Driving in Manhattan was way more chaotic than anything I experienced in Miami but that was back in the days of yellow cab dominance and those bastards made full use of their bumpers as offensive implements. reply rddbs 1 hour agoparentprevThe unique difficulties of driving in Miami might be the reason this is a good choice, not the reason it’s a bad one. reply 1024core 2 hours agoparentprevBut have you driven in Boston? reply mankyd 56 minutes agorootparentNah. I live in Boston. I strongly prefer public transit, but I'll take driving here over most other cities, any day of the week. The _road layout_ is awful, but drivers are pretty cooperative on the whole. Certainly more than my years driving in DC, for instance. Granted, you need to be commmital here: if you put on your turn signal, drivers will generally make space for you to get in - briefly - but you need to be quick to take advantage of the gap. I could see Waymo being too slow to the draw for this, based on what I've seen online. reply whimsicalism 1 hour agorootparentprevboston driving is so much better than SF+LA driving because at least what the drivers do there makes sense reply oblio 2 hours agoparentprevIt's probably based on where public administrations are supportive. Isn't Florida notorious for being car centric? One more lane, bro, one more self driving car company, bro... :-) reply jeffbee 2 hours agoprevThere were three things in Waymo's latest CPUC filing that interested me. First, through the end of August, Los Angeles still irrelevant. Over 85% of their California rides were still in SF. Second, ridership in SF doubled in 90 days without a significant expansion in either vehicles or trips per service hour, but they had the cars out on the road more hours every day. Third, the geographic concentration of their rides is extreme, with a large fraction of trips starting near either the Ferry Building or Fisherman's Wharf, which suggests that it is popular with and useful to tourists. reply simonw 2 hours agoprev\"... we’ll work to open our doors to riders in 2026\". I guess it takes a while to set up for a new city! reply entropi 2 hours agoprevI feel like at this point someone needs to take a step back and think about the general vision and overall goals of this whole fully automated ride-hailing service thing. I mean, what is the exact problem that's being solved here? I don't mean \"problem\" like \"solving the technical problem of making a car move autonomously in a chaotic city\" sense. I mean what is the need that's being addressed here, exactly? Ride-hailing workers were already often working for less than minimum wage. They were also handling most of the maintenance and customer relations aspects of the work, for basically free. Are these sexy cutting edge tech firms with eye-watering budgets and even more eye-watering valuations really going after whatever these people were making? If the problem is efficiently moving people around in a city; well to be honest I find this premise a bit ridiculous. Call me a European, but I find the idea that moving 1-2 people in private vehicles on roads being superior than public transit -preferably on rail- simply absurd. Is the idea of living and moving around in a city full of autonomous vehicles actually appealing to anyone? I personally find the whole idea completely disgusting for a number of reasons. What is the goal here? Am I missing a grand vision? What is there to get excited for? Sorry if this post has been a rant-y one. I feel like I am really missing the point of most of these things. reply onlyrealcuzzo 2 hours agoparent> If the problem is efficiently moving people around in a city; well to be honest I find this premise a bit ridiculous. Call me a European, but I find the idea that moving 1-2 people in private vehicles on roads being superior than public transit -preferably on rail- simply absurd. Much of the US like Huston and Miami is extremely lacking in public transit, and will likely never build the infrastructure. > Ride-hailing workers were already often working for less than minimum wage. ~50% of your fare goes to the driver. reply bluGill 1 hour agorootparentHuston is in fact building transit. They have a large spread out city which makes it a hard problem, but if you carefully choose where you look you will find people living there who don't have a car and just rely on transit and don't notice any loss of lifestyle. reply nunez 26 minutes agorootparentHouston is adding bus routes, and even those are hotly contested in city hall. The city tried to expand the very limited light rail we have but the vote for that failed. We live in a super walkable part of Houston and still need cars to go to many places outside of (and even within) the Inner Loop. A 10-min journey in a car takes 45+ mins by bus, and that's assuming peak schedules and buses that arrive on time. I actually tried to do the no-car thing for a few weeks. It definitely impacted my lifestyle for the worst. The gym I go to is 10 mins away by car. It's a 45 minute journey by bus. I needed to walk 15 minutes to the nearest bus stop (despite being next to two well-trafficked cross streets). When the bus finally arrived, I needed to pay with cash because METRO didn't have Apple Pay set up at the time (early 2024) and while you could use the Q Ticketing app, it doesn't have a Watch app and I didn't bring my phone. The bus didn't show on two occasions. The next buses were 45 minutes away. All of this is, again, in the most walkable, public transit covered part of Houston. I also lived in NYC for a long time. There, getting anywhere was a 10 min walk to a train station, swiping you MetroCard (Apple Pay these days), taking the train and walking a bit to your destination. The only places that were inconvenient to get to by train alone were deep in Queens, Brooklyn or the Bronx; for those, you'd take the bus, which usually ran every 10 mins. reply entropi 2 hours agorootparentprev> Much of the US like Huston and Miami is extremely lacking in public transit, and will likely never build the infrastructure. I am not trying to be a contrarian here, but I fail to see how that is an answer. I feel like what you say boils down to \"since we are not solving the problem at hand in a good way, we decided to solve it in a worse way\". > ~50% of your fare goes to the driver. Yet these ride-hailing companies who receive whatever is remaining after the meager pay of the rider and other costs only recently started to make actual profits. And even though it feels like the prices for customers increased a lot over the years, these companies are not exactly printing money. reply palmtree3000 1 hour agorootparent> since we are not solving the problem at hand in a good way, we decided to solve it in a worse way It's a different \"we\". Rephrased: since Houston's government is not solving the problem at hand in a good way, Waymo decided to solve it in a worse way reply comte7092 1 hour agorootparentprev*50% of your fare goes to the driver, as well as paying for fuel, vehicle maintenance and depreciation, insurance, etc. Without a driver those other costs don’t go away. reply onlyrealcuzzo 33 minutes agorootparentIt's ~75% going to the driver if you count the driver's expenses as money that goes to the driver: https://www.hyrecar.com/blog/how-much-does-uber-take-from-dr... reply CobrastanJorji 1 hour agoparentprev> Ride-hailing workers were already often working for less than minimum wage. That's the problem. People want taxis. Taxi drivers are both underpaid and also expensive. Removing the driver is a very expensive research process, but once you've done it and rolled out the solution nationally, you're saving a lot of money. And you're also creating a huge moat against competition. Say Google \"finishes\" self-driving cars, stops needing to spend nearly as much money on researching/developing the software, and mostly has figured out scaling. It's now far cheaper for Google to drive around than Uber. They can easily charge less than basically everyone who isn't willing to spend billions developing self-driving cars. reply marcosdumay 1 hour agoparentprev> I mean, what is the exact problem that's being solved here? There are people that will pay you to give them a ride from point A to point B; Google has developed a cheaper and more scalable way to give people a ride from point A to point B. > Ride-hailing workers were already often working for less than minimum wage. And now Google made them way more productive, what leads to some combination of higher wages, lower prices, and higher profits. The government there has a moderate amount of control over the proportion, it's not clear to me what values it will pick. > If the problem is efficiently moving people around in a city Nah, it's certainly not. But if you solve that one, Google will be forced to pivot into efficiently moving people into and out of a city, and they can add a lot of value there. reply RivieraKid 1 hour agoparentprevHere are some benefits: - Lower costs in the long-term. In the future it should be cheaper than owning a car. - Lot of space that is currently being used for parking will be freed up. - Convenience. It's a better experience than Uber and it will be a better experience than a manually-driven car. One example is when I want to drive to place A, take a 3 hour hike to place B and then drive home. reply fhub 17 minutes agorootparentLiving in SF as a family of four with both adults working from home... Owning 1 car and using Waymo/uber/lyft/e-Bike is already significantly cheaper than owning 2 cars. reply NoLinkToMe 2 hours agoparentprev1. The global Taxi market is one that does a quarter trillion dollar revenue per year. 2. the biggest cost component is labour. The biggest safety component is labour. The biggest service component is related to labour. 3. if you cut down cost of labour, make it more safe than before, and provide a quiet and private ride allowing private calls, conversations, music, you can beat other market participants So yes it's commercially interesting and that's all it needs to be. As for efficient and sustainable transport, there are certainly criticisms to be had. But these must be addressed via regulation, in my view. You can't expect taxi companies to disappear. You can add a tax to fuel to encourage a transition to electric. You can put a tax on noisy cars to encourage silent ones. You can put a tax on size, to encourage 1-person taxi pods for 1 person which will be 80% of the self-driving taxi fleet, and encourage 100% utilisation of self-driving busses for a small portion of the fleet. But you can't expect companies to simply not do business in the taxi industry because cars are imperfect from a sustainability/transport point of view. I'm not sure what's disgusting to you. reply sixQuarks 1 hour agorootparentIt also expands the market. Currently bus riders can’t afford to take Ubers but would prefer to. People that would rather take Ubers than walk or bike, and people who would rather give up their car and do uber full time. This will all be possible with low cost autonomous transport reply triceratops 1 hour agoparentprev> moving 1-2 people in private vehicles Eliminating the driver opens up so many options: 1. Vehicles designed expressly for 1 or 2 people, so they take up less space 2. Dynamic mini bus routes that can run all hours of the day 3. Dynamic car pooling reply caadxv 53 minutes agoparentprevThe grand vision is to erode the middle class entirely, have undocumented immigrants work in agriculture and automate the rest. Who can afford a Waymo ride in that scenario is an open question, but perhaps the tech overlords dream of having a tiny \"elite\" and a robot army that subjugates the farm workers, in which case Waymo will no longer be required. reply rangestransform 10 minutes agorootparentuber drivers deserve to be eroded entirely if their occupation literally costs lives compared to an autonomous vehicle reply ipdashc 1 hour agoparentprev> Is the idea of living and moving around in a city full of autonomous vehicles actually appealing to anyone? I personally find the whole idea completely disgusting for a number of reasons. Assuming they're safe and cheaper than current Ubers/taxis? Yeah I'd be fairly okay with it. I don't think it's necessarily ideal, but I definitely can't relate with \"completely disgusting\", personally. Public transit is nice and all but walking to and then waiting around at bus stops (especially in bad weather), squeezing into a crowded bus or train, stopping at intermediate stops, making transfers... there's definitely downsides. I don't use Uber/Lyft/Waymo often but I have to admit walking outside and having a climate-controlled, comfortable ride right there, which takes you straight to where you're going, is pretty nice. If it cost less and was more eco-friendly I'd probably use it more; we'll see if they can tackle that. reply falcor84 2 hours agoparentprevAs I see it, the biggest goal is safety - self-driving cars seem to reduce accidents per distance driven by at least one order of magnitude. reply bluGill 1 hour agorootparentCitation needed. I've seen claims like that, but none of them from a source that stands up to scrutiny. Most such claims come from the people promoting self driving cars and so they have reason to \"lie with statistics\". Those who have unbiased data (ie governments) are not talking about it from what I can see. I personally am significnatly safer than the average driver. This comes solely down to me not drinking alcohol and thus I never drive while drunk. The typical driver also isn't under the influence and thus is significantly better than the average. (I also try to follow other safety practices, but I'm not sure if I'm really better - I'm aware of and pay attention to one thing which makes me better - but what am I not aware of that others are doing?) reply rangestransform 2 hours agoparentprevAt least for me the goal is to have me seated, heated/cooled, separated from smelly hobos and showtimes, not breathing in crack smoke, not breathing in brake dust in subway tunnels, not breathing in other peoples diseases. Anyone who tells me my individual wants are disgusting will not get my vote. For society, building rail infrastructure in the US is so eye watering expensive and time consuming that transporting everyone by electric AV might actually be an easier way to decarbonize transport. reply jmyeet 2 hours agoprevThat's an interesting choice for several reasons: 1. Literally nobody in Florida can drive. Nobody indicates. People run red lights. They speed on the hard shoulder to overtake someone else who is speeding slightly less; 2. There's a lot of things that come down to timing, like when the bridges are up on the Venetian and over the Miami River. You can also get trains blocking the entire of downtown; 3. It seems like there's constant rerouting for closed roads, typically due to contruction; 4. Inclement weather. High winds and flooding. Biscayne Boulevard is often called Lake Biscayne. 30 minutes can be the difference between Miami Beach being dry and every road being 1 foot deep in water (not an exaggeration); and 5. What will be the covered area? I guess Phoenix and LA sprawl too but what constitutes \"Miami\" goes south, west and north pretty far. I mean there's no break between Miami, unincorporated Miami-Dade County and Fort Lauterdale. reply 0xbadcafebee 1 hour agoparentYeah, I dunno if the team understands just how crazy Miami driving is. Maybe they'll restrict it to Downtown, Miami Beach, the Grove, etc to limit the chaos? reply bedobi 2 hours agoprevImagine if instead Miami built MetroRail extensions to the beach and everywhere else it should go, increased TriRail frequency and express services, built a real network of fully segregated greenways etc etc. It would turn transport nightmare into transport heaven. We don't need more cars on the streets of Miami or the I95... reply onlyrealcuzzo 2 hours agoparentWell that would cost Miami taxpayers hundreds of billions of dollars, and this costs Miami taxpayers nothing. It would also take decades. This will be happening next year. Build all the transit you want. You need something for the next 30 years while you're doing that. reply bedobi 1 hour agorootparentno it would save miami and the state and the federal government billions trirail frequency increases can be done overnight a greenway network can also be built quickly and cheaply metrorail extension would cost more but still less than it costs to build and maintain roads but they are too busy spending billions building even more car infra which will only make traffic and congestion even worse reply vel0city 1 hour agorootparent> trirail frequency increases can be done overnight Increasing the frequency can't necessarily be done overnight, unless they actually have the spare rolling stock just sitting around along with all the workers needed to operate and maintain the increased usage and the spare budget to cover the increased operations costs. Otherwise, they need to find the money to procure the rolling stock, actually place the order, wait for the rolling stock to be built/delivered, hire the people to operate and maintain it, etc. reply bedobi 1 hour agorootparentyeah, all of which can be done overnight reply vel0city 56 minutes agorootparentYou can get expansions in funding approved, solicit bids from multiple firms to make the trains, analyze and approve the bid, get a factory to make potentially several to dozens more trains, ship them across the country (or potentially internationally), hire and train a lot of workers, in less than 24 hours? reply bedobi 17 minutes agorootparentyou're just being obtuse in the realm of infrastructure investment, all of that is overnight vs eg the yet another additional bridge to nowhere they're currently building that is taking decades and costing billions but tell you and every other frothing at the mouth motorist what, enjoy sitting in traffic reply onlyrealcuzzo 1 hour agorootparentprev> no it would save miami and the state and the federal government billions Have you ever looked at the local budget of a US transit authority? They typically lose $2+ per passenger trip, and get bailed out by the federal government. Mass transit is not going to save Miami any money for decades until ridership approaches Hong Kong levels. Unless you count passing on expenses to the Federal government as savings, and even then, it's still decades out. reply kemotep 1 hour agorootparentWith car usage on most roads free of charge at use and maintenance also footed largely by the Federal Government, it probably comes out cheaper long term to invest in rail. And every car off the toad makes driving more pleasant for everyone who stays. reply bedobi 1 hour agorootparentprevlol the idea isn't to make money off transit, it's to save money on roads roads cost more than transit - a LOT more, and motorists aren't paying anywhere near the cost of road construction and maintenance, they're (quite literally) free-riding subsidized trips on the taxpayer traffic also destroys productivity, public health, life expectancy etc etc so costs money in many more ways than motorists not paying for them reply onlyrealcuzzo 52 minutes agorootparent> and motorists aren't paying anywhere near the cost of road construction and maintenance, they're (quite literally) free-riding subsidized trips on the taxpayer So are public transit riders. And to a worse degree. What's your point? We should magically spawn mass transit systems overnight and force everyone to ride them? By the way, I'm a fan of mass transit, and live somewhere in the US - specifically - where that's a viable option. It just isn't a viable option in ~80% of the US, and even if those areas start doing everything right to be mass transit viable (no indication of that), it still takes decades. Rome wasn't built in a day. reply bedobi 33 minutes agorootparent> So are public transit riders. And to a worse degree. What's your point? that this is wildly incorrect. roads cost more than transit. a lot more. and road users are wildly more subsidized than transit users. > We should magically spawn mass transit systems overnight yes > and force everyone to ride them? you won't have to when the choice is between sitting hours in traffic vs a fraction of the time on efficient transit and greenways. people are not stupid. > It just isn't a viable option in ~80% of the US this is Miami, not middle of nowhere Iowa > Rome wasn't built in a day so it's correct of Miami to continue to \"invest\" in even more roads to nowhere, like yet another new highway bridge across the bay? that will take decades to complete and cost billions, and cause MORE traffic? like no lol just build the effing transit and greenways and traffic will go down and the government and people alike will save billions instead (and their time, and lives) reply davidcbc 1 hour agoparentprevBut then a rich person might have to share a ride with a poor person and we can't have that reply bluGill 1 hour agorootparentThat doesn't follow. Nobody has said we will force the rich out of their limos. Some of the rich will chose to use transit though. There is a group of rich people who got that way by being cheap and that group will use transit if possible just because it is cheaper. They don't care about sharing rides with poor people at all. There is a group of people who appear rich - they live in mansions, drive limos. They are also in dept up to their eyes and one wrong move will put them out on the streets. reply whimsicalism 1 hour agoparentprevpoint to point transport is nice. trains are ridiculously expensive nowadays. US governments largely can't do large infra projects anymore reply bedobi 1 hour agorootparentthey can, they just malinvest in roads that only increase traffic and make things worse and cost even more instead of transit which saves money reply whimsicalism 1 hour agorootparent> that only increase traffic Increase traffic of people successfully getting from point a to point b, that is what induced demand is. > instead of transit which saves money Oh yeah, I'm sure saving on that California HSR project that has been in design since 2008. reply BWStearns 2 hours agoprevI am morbidly curious to see how Waymos interact with the Good Vibes Only crazies. Miami is definitely going to be hard mode for self driving. reply tsunamifury 2 hours agoparentHaha that’s nothing compared to its hometown of San Francisco. People attack, destroy, burn waymos here. Let alone extreme hills and visibility issues. Miami will be comparably far simpler. reply deadbabe 2 hours agoprevIt will be a showdown of man vs machine in the city with the worst drivers in the nation. Interesting times. reply timerol 2 hours agoparentDid you know that almost every city believes this about their local drivers? I've gotten it in LA, Boston, NYC, DC, SF, Philly, Atlanta, and Austin. Adding Miami to the list. reply BWStearns 2 hours agorootparentHaving lived in most of those cities and in Miami I can say Miami is definitely the most dangerous driving I've seen. And my car insurance company certainly seems to agree. reply 0xbadcafebee 1 hour agorootparentMost Americans don't understand that Miami is full of expats from the caribbean and latin america, some of whom may be here illegally, and so can't get a driver's license. They also may have grown up in places where they didn't get a drivers license or learn the rules. So they literally aren't supposed to be driving and never learned how. Because they can't legally drive a car, they buy a beater second-hand for cash, and it's never inspected, and of course falls apart and causes accidents. Add to that the crime in general, and yeah, insurance is $$$$$, and lots of crazy driving. (It's a minority of people, but enough that it creates more extreme outlier events than in most states) Not to mention The Ticket Clinic, a private service to pay a small fee to get out of traffic court. I probably had 10 different traffic violations thrown out, for $80 a pop, when I grew up there in the 00's. reply Quinner 1 hour agorootparentprevLA Drivers aren't that bad, driving just is awful there because the amount of traffic. NYC Driving is an absolute pleasure compared to Miami driving. I have what should be an easy ten minute commute and every day I am avoiding an accident due to a driver doing something crazy you would almost never see in another US city. This is exacerbated by the dysfunctional government which is happy to let developers do whatever they want without regard to impact on traffic flow, while doing no investment in infrastructure itself. I'm generally pro-growth, and I think California goes too far with its restrictions, but living in Miami has caused me to gain some appreciation for the reason behind some of what California does. reply kemotep 1 hour agorootparentprevIn my experience it is a State wide problem. I95 seemed to be a speed minimum of 95 if you didn’t want to get run off the road by everyone else for going too slow. I-4 (Daytona to Tampa, through Orlando) had over 400 deaths caused by traffic accidents one year. More than 1 death per mile of road. I don’t think 75 was any better, of course it was rough in Atlanta too, but still. My experience with Florida driving was not a great experience for the few years I lived there. reply deadbabe 44 minutes agorootparentIn Florida it is common to see cars drive at speeds in excess of 100mph. reply maybelsyrup 2 hours agorootparentprevYes, that’s true, but in this case they’re all actually wrong. I’ve driven or lived in all of those cities, and they’re all placid next to Miami. It’s not even close. reply lopkeny12ko 3 hours agoprevJaguar discontinued the I-PACE and presumably does not manufacture them anymore. It must be the case that Waymo is cannibalizing their fleet capacity from other markets for every new city launch. reply jitl 3 hours agoparentWaymo has a zillion I-PACE vehicles in storage/prep and 2 new models in the pipeline. reply poniko 2 hours agoparentprevWaymo is changing to a Hundai iqonic 5, especially made for them. In the meantime they have brought up all Jaguar they could. reply jeffbee 2 hours agoparentprevJaguar did not manufacture the I-Pace at all. It was made by Steyr, who also built a ton of them for Waymo. reply dangus 3 hours agoparentprevI can’t imagine that they would have any major difficulties installing their equipment on any other vehicle. And they also probably have every little default finding I-PACE vehicles that have gone unsold or are unwanted. reply SubiculumCode 1 hour agoprevQuestion: Do Waymo rides ever get on a freeway within their operating territory? reply ra7 1 hour agoparentNot yet. Freeway rides are open to employees only for now, so I'd imagine it's pretty close to being available to the public. reply oblio 1 hour agoprevReminder that cars reshaped urban environments and generally for the worse, and self driving cars have a very solid chance to do the same thing: https://m.youtube.com/watch?v=040ejWnFkj0 If you have an hour, highly recommended video. A bit too doomerist but the threat is there. Keep in mind that it's not just about tech (which can be amazing), but also about social aspects, money and politics (which can be atrocious and generally override morality and technology). reply seeingfurther 3 hours agoprevMiami probably has some of the worst, most lawless drivers in the country — it's like a free-for-all out there. Makes me wonder if Waymo picked Miami as a kind of stress test for their self-driving tech. If they can handle the chaos there, they can probably handle just about anything. reply itchyouch 3 hours agoparentI'd imagine NYC to be worse than Miami. Miami seems to share enough similarity in warm weather to SF to be a similar enough use case to expand while providing slightly different driving conditions to be able to dip ones toes in to the driving habits of a different city. reply filoleg 2 hours agorootparentAbsolutely agreed. Not even just because of the weather imo, but because of the actual driving experience here itself. I’ve lived and been driving for nearly 15 years in various large cities (SF, ATL, Seattle, Portland, LA, etc.), both cars and motorcycles, and NYC (where i currently live) is the only place in the US I absolutely refuse to ever drive (or ride) in. Not just because it isn’t as necessary here due to public transit usefulness (which is also true), but also because driving here feels like entering a warzone. Narrow roads and parking, drivers being extremely on the edge and leaving a few cm distance max between each car in traffic, constant honking, having to make very dangerous maneuvers on the daily just to get somewhere, and just the cutthroatness of the whole thing here. I genuinely believe that NYC will end up being the final frontier for Waymo, after all the other places in the US (aside from those with extreme snow conditions). reply 15155 3 hours agorootparentprevNYC is unique in that you have no choice but to do extremely dangerous things to actually operate in traffic at all in most scenarios. Streets, alleys, etc. are blocked or are narrowed by vehicles and a myriad of other possible obstructions, all of which could be concealing pedestrians. reply wil421 3 hours agorootparentprevWarm yes but SF doesn’t have many thunderstorms and afternoon downpours. reply dangus 3 hours agorootparentprevYeah, bad drivers are easy for self-driving to deal with. You just drive defensively and avoid the objects. It’s the snow and other sensor obstructions that make things difficult. reply jitl 3 hours agoparentprevBig +1. Here using the turn signal is iffy because some drivers see that as a sign to speed up to try to overtake. I’ve had a few close calls where I check my mirrors, everything is safe for a lane change, turn on the blinker, and the guy in the left lane floors it from 5 car lengths back to cut me off. Sigh. The Waymo driver is very passive and defensive so I imagine it will be quite slow compared to an Uber who is willing to fight to make turns etc. reply bpodgursky 3 hours agoparentprevMiami car insurance fraud rings are going to have a fun trying to trick Waymo into rear-ending them. Wonder if it will work. reply rwmj 3 hours agorootparentWould you want to commit insurance fraud against a vehicle that is covered in cameras? reply bpodgursky 2 hours agorootparentYes. The game is that you start to pull out for a right turn, and then brake unexpectedly and get the person behind you to tap your bumper, while they are looking for oncoming traffic to the left. Then you take your car to a \"friendly\" repair shop that overcharges for a new bumper (or claims to replace it) and split the payout. There's nothing illegal about braking suddenly, the collision is always the fault of the person behind you legally, so there's no personal risk. reply Rebelgecko 2 hours agorootparentWhen I've been in Waymo, they've never drove so fast that they don't have time to brake if the car in front of them does. And they can multitask - while looking for oncoming traffic to the left they can still watch the car in front of them reply fixprix 2 hours agoprev [–] Waymo is cool, but I have no idea how it is going to compete with the tsunami coming that is CyberCab. Tesla will be mass producing this smaller, cheaper vehicle like nothing else. Covering the entire country with self driving vehicles. I don’t know how Waymo can possibly compete with that. Their deployment by city is slow, their hardware is expensive, slown to produce, and not purpose built for self driving. reply tomp 2 hours agoparentThe bigger question is, how can Tesla with it's non-working \"full self driving\" compete with Waymo's working actual self-driving. reply sixQuarks 1 hour agorootparentHow about this? Tesla’s latest FSD beat Waymo by 30 minutes. Same route and same time of day. https://youtu.be/CfX8Lu9MHa0?si=cOYWNXjPiYP9R6L_ reply magicalist 20 minutes agorootparentThis is literally just a video of getting somewhere midday in LA via highway vs surface streets? Waymos don't drive on highways in LA yet (just in the bay area, I think?) reply ra7 1 hour agorootparentprev> Same route and same time of day. Just a small difference: one of them did it without a driver. reply maverickmax90 1 hour agorootparentprevWhat's your source for this claim? Please consider sharing sources before making baseless claims. I've seen this exact comment multiple times. You need to check your sources. You might be living in a bubble. reply rurp 29 minutes agorootparentLiterally the company selling FSD doesn't think that it's actually fully self driving. They strongly imply that it is in their consumer marketing, and have done so for many years, but any time Tesla interacts with regulators or the legal realm they are adamant that the system isn't level 4 or 5, and the human driver is 100% responsible for handling any and all mistakes. reply asdff 1 hour agorootparentprevI’ve seen teslas full self driving drive me on surface roads, on the highway, and even navigate the lot, find parking, and park the car. In what way is it non working at this point? Waymo doesn’t even do highway. reply RivieraKid 1 hour agorootparentBut not with a sufficient reliability and safety. You need that to do what Waymo does. Waymo could do highways 15 years ago, right now they use highways in autonomous mode but only with employees or empty, so they will presumably launch soon. Imagine 2 drivers, one does something dangerous every hour, the other every 1000 hours. If you observe them for one hour, they may appear identical to you. Yet, one is 1000x better. reply ra7 1 hour agorootparentprev> In what way is it non working at this point? Because you're in the driver's seat supervising at all times? If it worked fully autonomously, you would be in the backseat. reply PittleyDunkin 1 hour agorootparentprevIt's not \"full\" self driving despite their advertisements (which shouldn't even be legal to use). It can't handle basic weather or bad drivers or confusing road markings. Granted, neither can many humans. But the bar should be many times higher if the operators are relieved of liability. reply danans 1 hour agorootparentprev> I’ve seen teslas full self driving drive me ... > In what way is it non working at this point? It's killing people: https://www.theverge.com/2024/10/18/24273418/nhtsa-tesla-ful... reply seanmcdirmid 1 hour agoparentprevI don't see a taxi service from Tesla yet, while I've rode in a waymo in SF, so it is hard for me to see how Tesla is winning in the auto-taxi segment yet. Maybe their bet pays off and they dominate, or maybe waymo keeps expanding while Tesla keeps talking about vaporware, who knows? reply rurp 34 minutes agoparentprevSure, right, it should be operational by 2017 at the latest, according to the Tesla CEO. reply Charlie_Black 2 hours agoparentprevDo you believe Musk's timeline estimates? reply threeseed 1 hour agoparentprevWaymo doesn't make the cars. Geely does. And they make the same number of cars each year that Tesla does. Also deployment by city exists because each state will have different regulations. reply oblio 2 hours agoparentprev> Waymo is cool, but I have no idea how it is going to compete with the tsunami coming that is CyberCab. Tesla will be mass producing this smaller, cheaper vehicle like nothing else. Covering the entire country with self driving vehicles. Don't fall for the hype. reply sixQuarks 1 hour agoparentprev [–] You are exactly right. Look at how you’re getting downvoted. It’s so disappointing that this so-called tech community is so deranged because of their hatred of Musk so much that they’re not willing to look at the facts. If it was any other company doing what Tesla is doing with their self driving, the comments here would be completely different. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "Waymo One is set to expand its autonomous, all-electric ride-hailing service to Miami in 2026, using Jaguar I-PACEs.",
      "The expansion is in partnership with Moove and follows successful tests in Miami's challenging weather conditions.",
      "This move aligns with Miami's emphasis on sustainable and clean energy transportation, and the service will be accessible through the Waymo One app."
    ],
    "commentSummary": [
      "Waymo is expanding its driverless car service to Miami, a city with challenging driving conditions, as part of its strategy to scale operations in various cities.- The expansion raises questions about Waymo's ability to handle Miami's unique challenges, including frequent flooding and aggressive driving behaviors.- Waymo partners with local companies to manage operations, focusing on its self-driving technology to address high costs and safety issues of human-driven taxis, aiming for a more efficient urban transportation solution."
    ],
    "points": 183,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1733411653
  },
  {
    "id": 42329005,
    "title": "Federal Court Says Dismantling a Phone to Install Firmware Isn't a 'Search'",
    "originLink": "https://www.techdirt.com/2024/12/04/federal-court-says-dismantling-a-phone-to-install-firmware-isnt-a-search-even-if-was-done-to-facilitate-a-search/",
    "originBody": "Anonymous Coward says: December 4, 2024 at 12:32 pm I see it was an iPhone 6, which is vulnerable to the checkm8 exploit. That’s probably how they hacked it. Any phone XS or newer is safe, for now… Reply View in chronology Make this comment the first word Make this comment the last word",
    "commentLink": "https://news.ycombinator.com/item?id=42329005",
    "commentBody": "Federal Court Says Dismantling a Phone to Install Firmware Isn't a 'Search' (techdirt.com)173 points by hn_acker 3 hours agohidepastfavorite81 comments rayiner 3 hours agoThe article’s headline is rather misleading (I assume unintentionally), because it omits that the actual seizure and data access was done pursuant to warrants. Only the repair and firmware update was performed during a donut hole when one warrant had expired before another was granted. Here, the government obtained multiple, time-limited warrants to search the device, but was unable to get into it. They sent it to be repaired. After the warrant extension expired, the repair guy fixed it and updated the firmware. (The record doesn’t say what version the firmware was, but it seems like it was standard firmware, not some special forensic firmware.) The next day, the government again obtained a warrant. Only after doing so did the government perform the search. In this unusual situation, it’s reasonable to conclude that the device repair wasn’t a search. The seizure and the data access were both performed pursuant to a warrant. The only part that wasn’t covered by the warrant was just fixing the device in a seemingly conventional way to get it working again. Original decision here, pages 3-4 has the relevant facts: https://s3.documentcloud.org/documents/25423841/no-disassemb... reply chefandy 2 hours agoparentI agree that most readers won’t really ‘get it’ by reading the headline, and appreciate your useful addition so we all can get some context without the click, but in defense of the author, I think writing layperson-accessible headlines for technical legal articles is often impossible. Having attempted to make interfaces and applications that made raw legal data useful for laypeople, including with NN summaries and such, if there’s a meaningfully better solution, I sure couldn’t find it after a few years of work. For the same reason reading case law doesn’t effectively help laypeople represent themselves in court, you need context and background knowledge to make sense of legal concepts. (If you’ve ever seen an overconfident ‘sovereign citizen’ cite opinions in court while representing themself, you’ve seen why. And while most are obviously under-educated for the task, they’re probably not unintelligent and they clearly put a lot of effort into it.) To people used to reading legal texts and familiar with the trajectory of decisions in this space, the headline makes sense, and I think that’s probably the best you can do. Trying to construct a headline that’s representative while also giving laypeople the background and context they need to make sense of the topic becomes way too long to be a headline long before it accomplishes it’s goal. reply psunavy03 14 minutes agorootparentThere's a huge gray area between \"not understanding the law\" and \"being competent to litigate a case in court.\" It is entirely possible for non-lawyers to understand the gist of the law at a high level. And thus it's not acceptable to tolerate misleading headlines about legal decisions any more than it is to tolerate misleading headlines about any other decision. And God knows I've seen enough of them about other issues that are within my realm of professional expertise. The problem is that our system as currently set up does not incentivize reporters working a \"beat\" for years where they develop enough domain expertise on a field to report on it competently. If we had actual senior legal reporters, senior national security reporters, senior tech reporters, and so on, they would have enough knowledge of those fields to effectively write for laypeople. reply pc86 2 hours agorootparentprevSovereign citizenry and misquoting admiralty law in your hearing about driving without valid registration or saying the court doesn't have jurisdiction because the flag has gold fringe on it is so close to mental illness it's hard to assign concepts like \"smart\" or \"dumb\" to it. reply notjulianjaynes 1 hour agorootparentIn the past I have considered pursuing litigation pro se because it is very difficult to find an attorney willing to take a public records case on contingency. The stereotype that anyone who represents themselves in court must be a soverign loon or think they're Will Hunting is one reason I did not do so. It is not ideal, but neither is not having access to the justice system due to not having a bunch of money to burn. reply potato3732842 32 minutes agorootparentI represented myself pro se in a civil matter that really should have been in small claims but was in superior court because of the remedy being sought by the plaintiff. It went fine, ended in settlement in my favor. reply EvanAnderson 54 minutes agorootparentprevI would love to know the origin of the \"gold fringe\" bit, specifically. I remember hearing about that in the 90s. reply pc86 47 minutes agorootparentIt has something to do with (incorrectly believing) what laws apply to what court based on the type of flag. This is from memory so may be wrong but I seem to recall it being basically if there is gold fringe, the court is in/part of a different jurisdiction, and the procedures are different, and as such the (actually correct) procedures the judge and prosecutors follow are viewed as incorrect by the SC. reply c22 26 minutes agorootparentprevhttps://starspangledflags.com/did-you-know-what-gold-fringe-... reply ronsor 1 hour agorootparentprevSovereign citizen activities basically have no correlation with intelligence or political views. It's such a strange category of weirdness. reply potato3732842 29 minutes agorootparentSome people like to portray petty mostly victimless lawlessness as sovereign citizen shenanigans as a means to discredit the reasoning that lead to those people to decide not to follow the law. Not everyone who doesn't get a building permit or a fishing license is a sovereign citizen. reply pas 22 minutes agorootparentprevBy what definition of intelligence? :) It seems like a waste of time at best. But have any sovereign citizen got what they wanted at the end of any kind of proceeding? It seems like a very bad strategy to solve their own selfish problems. (DUI, speeding, not paying taxes, going against gun regulations, etc.) And this strategy is usually coming from being unfortunately so tragically misinformed that they cannot help but reject the boring standard model of reality for a bouquet of conspiracy theories. reply sandworm101 44 minutes agorootparentprevIt isnt mental illness. Having incorrect beliefs is different than being insane. But it is a mental heath issue that leads people to adopt these beliefs. Be it flat earth, Qanon or Sovcit, people under stress will reach out to conspiracy theories in an attempt to regain a sense of community and control whilst thier lives are otherwise going off the rails. The beliefs are the symptom, not the disease. With sovcit specifically, there is also a rational layer. Many people think the law some sort of elite club where mastery of a secret language can allow one to escape legal scrutiny. This comes from TV and the news that never explain the nuance of legal practice. They arent insane, just very incorrectly educated. Rosa parks was not insane. She knew she was breaking the law. The rational sovcit thinks themselves the next Rosa Parks, but mistakenly believe that means they cannot be arrested. Rational but wrong. reply pas 16 minutes agorootparentHow can you think you're breaking a law that does not apply to you? > They arent insane, just very incorrectly educated. Well, they can be both. The test of insanity is to see what happens as they are faced with the usual adversity that comes with these beliefs. Are they capable of learning or keep doing something that every sane person recognizes will certainly lead to ruin (or at least failure)? reply JumpCrisscross 32 minutes agorootparentprev> people think the law some sort of elite club where mastery of a secret language can allow one to escape legal scrutiny pc86 didn’t say sovereign citizenry is mental illness per se. They said it’s indistinguishable from mental illness if pursued all the way to a hearing. At that point, enough flags have been intentionally ignored to validly cross into delusion. reply sandworm101 11 minutes agorootparentBut i would say they are very distinguishable. The man who drives as 85mph because the spiders are chasing him is insane. The man who drives as 85mph because facebook told him that the state lacks jurisdiction over roads painted with yellow lines is not. The incorrect behavior (speeding) is identical but the overall situation is very distinguishable. reply JumpCrisscross 10 minutes agorootparent> man who drives as 85mph because facebook told him that the state lacks jurisdiction over roads painted with yellow lines This is a stretch, but possible. It breaks when that man is pulled over, cited, given the opportunity to research or consider another viewpoint, and then shows up in court to plead that case. That’s invisible-spiders levels of delusion, and while it may not be caused by a chemical or physical problem in the brain, it’s indistinguishable from it. reply throwup238 2 hours agorootparentprevThe author probably didn’t come up with the headline, the editor did. It’s one thing if the Office of Legislative Counsel tries and fails to come up with a succinct one liner, it’s another when an editor driven entirely by clickbait economic incentives does it. The latter rarely even try to be accurate. reply dcrazy 1 hour agorootparentIt’s Techdirt. The author and editor are the same person. reply chefandy 1 hour agorootparentprevCan you propose a more appropriate one? I can’t think of one that is still headline length. reply Bjartr 50 minutes agorootparent\"Federal court says merely repairing a seized device isn't a search\" I think that's a bit better reply autoexec 4 minutes agorootparentIs it a \"mere\" repair when they crack open your device swap out the main board and replace the firmware? Imagine that their \"search\" turned up nothing? You'd still be left unable to get your device back intact or unaltered. Should the government be able to swap out hardware components and install whatever firmware they like on them without a court order? People have their own reasons for selecting the hardware that they do and for not installing certain firmware. Should the police be able to install firmware that isn't official? \"merely repairing\" seems misleading given what this allows for. weaksauce 6 minutes agorootparentprev“federal court decides that repairing a phone’s firmware during a period of lapsed warrants is not an unconstitutional search” maybe? reply pc86 2 hours agorootparentprevI do sometimes wish articles had information in the byline about who wrote the headline as well as just the article, or that it became standard practice for authors to write the headlines as well. reply throwawaycities 1 hour agorootparentprevI’ve attending 1,000’s of arraignments, motion calendars and pleas. In all my experience I’ve seen 2 pro se defendants pull the “I’m a sovereign” spiel. Credit to them they both turned what should have been a 5 minute hearing into at least 15 minute circuses refusing to even announce their names for the record. Both were threatened with being held in contempt before the Judges passed on their cases and made them wait to hear the other matters on the docket. Truly fascinating & unusual events and people, I think if you draw a vin diagram mental illness and Dunning-Kruger Effect these folks would be the overlap. reply chefandy 1 hour agorootparentFor sure. I think part of it is what happens when Dunning-Krueger strikes someone confident and charismatic enough to teach their ill-conceived ideas to others who find the idea appealing enough to take it and run with it. A runaway bullshit train. Eventually it becomes widespread enough to become “conventional wisdom” to to some groups and most people don’t question conventional wisdom imparted by people they trust. It seems a lot of conspiracy theories work that way. reply rayiner 2 hours agorootparentprevYes, I wouldn’t know how to explain all that in a headline either! Unfortunately the word “misleading” has multiple connotations—I wasn’t saying the author was trying to deliberately mislead, but rather that the reader shouldn’t conclude too much based on the headline alone. reply chefandy 1 hour agorootparentSure, that makes sense. Additionally, whether something is misleading had as much to do with the person reading it as the person writing it. reply stonemetal12 2 hours agoparentprevIt doesn't seem misleading to me just overly technical for no reason. Something like \"Court Says Repairing Seized Phone isn't a Search\" conveys the same meaning with fewer technical details, but is a little no duh. To me that is just as click bait-ish, because I would want to know who was dumb enough to try that as a defense, or wonder what the actual situation was. reply thayne 2 hours agorootparentWas it just a repair, or did they install custom firmware? It isn't really clear from the article, and that seems like it would make a big difference. reply BurningFrog 1 hour agoparentprevSince I had to look it up: pursuant: in accordance with (a law or a legal document or resolution). \"conversations that they wiretap pursuant to court order\" reply jerf 3 hours agoprevAs the article says, it is probably a reasonable ruling, because it isn't a search. What you have to watch out for is the legal two-step, where they do something like \"install a firmware on the phone\", which isn't a search, and then, oh gosh, the firmware just happened to sit there and flash all the contents of the phone on the screen because that's what the firmware does, we didn't actually search the phone, it just voluntarily dumped all its contents to the screen, so that wasn't a search either, so no search occurred. reply LPisGood 3 hours agoparentThis makes sense, and I actually believe that it isn’t a search. It is definitely a _seizure_ though and I do wonder how often these two things are distinguished in law. How often do the police raid a place and confiscate filing cabinets but not look through them. reply rayiner 3 hours agorootparentThe seizure was done pursuant to a warrant too. There’s an argument that, once the warrant extensions expired, keeping the device in police custody constituted a continuing seizure. But it doesn’t seem like the defendant made that argument (or at least the court didn’t address that argument) reply giantg2 2 hours agorootparentUsually one has to petition/request the return of seized items. So it's not unusual that something is still held until requested. Usually instead of fixing what they have, they tend to destroy it. reply koolba 3 hours agoparentprevDoes that mean that wiping the firmware or Secure Enclave would not constitute destroying evidence? How about installing firmware that will wipe the Secure Enclave on boot? Especially if the secondary step of turning on the device is done by the seizing authorities. reply fwip 3 hours agorootparentNo, the judge would not be okay with that. In the same way, shredding all your incriminating legal documents into a fun jigsaw puzzle for the cops to put together is also illegal. reply toast0 1 hour agorootparentI mean, having firmware that securely wipes your phone in case it's used by an unauthorized party is a reasonable and desirable feature. It's not generally illegal to set that up. Same with destroying documents. Having a retention period and destroying documents which have PII and could be used for identity fraud is a good practice. It's not generally illegal to do that either. Where you get into trouble with the courts is when you have a specific obligation to retain or transfer information and you destroy it instead. reply ortusdux 2 hours agoparentprevI guess I can understand the argument that picking a lock does not count as a search, but the second you open the door... reply qup 2 hours agorootparentLike removing the doorframe and putting in your own new door that doesn't lock, then walking inside reply thayne 1 hour agorootparentprevWhat if picking the lock damages the lock? reply tiahura 2 hours agorootparentprevis when they got the warrant reply ortusdux 2 hours agorootparentI guess that is the question. If the police are confident that they will have a warrant in 30 minutes, can they have a locksmith unlock the door while they wait? reply BobaFloutist 56 minutes agorootparentI would say no, because the whole point of the warrant is to remove the police's judgement from the equation. If they're taking action based on their expectation that they'll get it, that's kind of an end-run around the stated purpose. reply gnfargbl 2 hours agoparentprevAh, but standard firmware doesn't do that; the agency performing the action would need to have developed custom firmware which \"just happened\" to show the information when installed. Courts tend to see through those kinds of shams. reply wbl 2 hours agoparentprevNo that would be a search. Judges really don't like having these games played. reply jerf 2 hours agorootparentA sane judge, yes. A judge searching for a fig leaf, perhaps not. Call me cynical if you like. It won't bother me. reply wbl 1 hour agorootparentThe judge can just grant the warrant if they want. PC is a low bar. reply btilly 3 hours agoparentprevYou and I disagree on reasonableness. The government is here deliberately planning to take advantage of a seizure to damage someone's personal possessions. The right of that person to be secure in their possessions therefore should require a higher standard from the government than is required for mere temporary adverse possession after a seizure. reply rayiner 3 hours agorootparentThe government had a warrant to seize the device. It got multiple warrant extensions trying to get into the device. They determined it needed a logic board replacement. The warrant extensions expired while that was being done. But the government got a warrant to then actually access the data. I fail to see how this doesn’t satisfy even a high standard of reasonableness. reply fitblipper 1 hour agorootparentWhy do you feel that info is relevant? If my driver's license expired yesterday and then I get pulled over while I'm driving to the DMV today to get it renewed, should I not get a citation? Just because they had permission before and after their actions took place doesn't make it ok if they didn't have permission at the time of the action. To say otherwise seems to be begging for abuse of a loophole. I guess that's why they had to claim the action wasn't one a warrant was required for... reply rayiner 17 minutes agorootparentIt’s relevant for the same reason it’s relevant in your driver’s license example. You drive somewhere while your license is valid. Then you replace the car battery, which has died. Then you renew your license, and drive somewhere else. Have you done anything wrong? No, because you need a license to drive the car, not to repair the car. Same thing here. The government needs a warrant to seize the device or search for information on the device. Does it need a warrant to repair a broken device that it has properly seized, before then getting a warrant to search the device? reply toomuchtodo 2 hours agorootparentprevI agree with this perspective, but think we're going to hit tension between right to repair and hardening devices against threat actors who have physical access to your device. Apple's move with the inactivity reboot timer is a step in the right direction, but a mode or option to wipe or otherwise destroy all my data if tampering is detected (device is opened) would be welcome (even if it means one is then unable to repair the device). Replacing one's device will always be cheaper than any prolonged interaction with US law enforcement or the US judicial system. reply taneq 3 hours agoparentprevBreaking down the door of a house isn’t a search. Activating an autonomous drone in front of the house which then enters through the door of its own volition and records everything it sees in the house isn’t a search. And if I make a chomping motion in the air near a donut and it decides to enter my mouth while I’m chomping then I haven’t illegally taken a bite of the donut. reply nyeah 2 hours agorootparentI sense irony here, but I'm American so it's hard to be sure. reply taneq 2 hours agorootparentI dunno if irony is exactly the right word (but that's a complex discussion and probably any call would be category-error-ish anyway) but I was aiming for a Simpsons reference. :D reply julianeon 2 hours agoprevIt seems like the writing is on the wall. There will be some Official Ruling that you can't do this (probably antiquated 20th century) thing because that constitutes an Unlawful Search or whatever. Thank you to the Constitution for protecting our freedoms, etc. Meanwhile, there will be a much more powerful way to achieve that goal using a smartphone, which is 100x more subtle and effective, which will be legal because technically it doesn't cross the big red line. There will be some arcane logic here that only a lawyer could love, but it will amount to 20th century technique = banned, 21st century cellphone technique = fine. So everyone will do that. It'll just get more pronounced over time. reply wbl 2 hours agoparentLook at Katz to see the opposite. reply salawat 1 hour agorootparentI second this. That kind of trickery is absolutely obvious to the judiciary, and as of yet Katz hasn't been overturned, even if it has been at times pointedly ignored. reply WaitWaitWha 2 hours agoprevCouple of notes on this: 52 devices could mean a phone, a tablet, and 50 USBs, SD cards, and such. The problem with loading firmware to permit is the potential damage to the evidence and the potential to imply that the evidence was planted. The vast majority of the cell phone hacking involves loading material into at least into memory and often modify the boot load sequence. This is how all that I worked with (e.g., Cellebrite, Magnet, MSAB, Oxygen, AccessData) function. damage: I have toasted devices by hooking them up to forensic tools, mobile phones and more. planted evidence: There have been several challenges to this (I think US v. Ganias), and let's not forget the Casey Anthony trial where they argued that the forensic tool CacheBack reliability. Not surprisingly, F/LOSS tools are better defense for this than black-box commercial ones. The more complex the evidence collection, the more likely damage can occur, or planted evidence can be argued. reply radicaldreamer 14 minutes agoprevThis was an iPhone 6, so I assume that the logic board change enabled brute force passcode searches. This was fixed in a subsequent update to the secure enclave, so this is less likely to work on the latest devices. reply hn_acker 3 hours agoprevThe full title is: > Federal Court Says Dismantling A Phone To Install Firmware Isn’t A 'Search,' Even If Was Done To Facilitate A Search reply dhx 1 hour agoprevIs this ruling effectively that it's irrelevant whether or not a warrant existed to modify the iPhone 6 because in this case, there is no loss to the claimant from that modification having been made? How much would an old second hand broken iPhone 6 that needs repair sell for? ... not much. Yet the repair carried out has seemingly significantly increased the value of the iPhone 6. The only argument that otherwise comes to mind is an iPhone 6 with an old and very specific version of firmware could be more valuable due to rarity and people are transacting them for $20,000 on eBay because of that firmware version's ability to be rooted. Yet an eBay confirms this is seemingly not the case. Perhaps though there is a non-insignificant cost to buying and selling 20 or 50 iPhone 6's off eBay before finding one with an old enough firmware version installed? reply Sparkyte 1 hour agoprevIt isn't, but it should be illegal to repair or modify something you do not own without the consent of the owner. You wouldn't rent an apartment only to put 10k renovations into it? I mean lets be real that is practically illegal. reply renecito 2 hours agoprevI'd guess that's the criteria to make government mandated backdoors legal. reply mindslight 3 hours agoprevIndependent of the legal nuance being worked out here, it is quite fucked up that the government can just demolish your entire digital infrastructure and then keep the pieces indefinitely. Imagine if they applied the same standard to your dwelling itself. \"Sorry you can't live here for the next few years because a crime might have been committed. Go buy another house. Or not, we don't care\". reply sidewndr46 1 hour agoparentWhat'd really be a shame is if the police could just show up one day and blow up your house. And then just leave https://www.denverpost.com/2020/03/11/colorado-swat-house-de... reply mindslight 42 minutes agorootparentI don't get the point to this reflexive whataboutism. Yes, that dynamic exists and it is bad too. (I referenced that event in a follow up comment, thanks for providing a specific link) And at least that event had some condemnation in the media, as opposed to the routine destruction of digital personal lives escaping criticism even on techdirt. reply readthenotes1 3 hours agoparentprevMaybe you haven't heard of civil forfeiture? https://en.m.wikipedia.org/wiki/Civil_forfeiture_in_the_Unit... reply mindslight 2 hours agorootparentI don't know why you would think that might be a possibility given the venue we are on. Government has also demolished people's actual homes in the course of \"crime fighting\" and then refused to pay/fix them as well (that notorious case in Colorado comes to mind). But surely you can see there is still a distinction between things that happen infrequently, often with limited scope, or still at least with some semblance of a legal process, and what happens routinely to people accused of \"digital crimes\". It should go without saying that I think all of these dynamics are terrible, and in dire need of reform. But at least civil forfeiture and \"qualified\" (née sovereign) immunity are getting talked about, while the totalitarian approach to personal digital infrastructure isn't getting so much attention. reply Pxtl 3 hours agoprevSo if the government bugs your car and home but doesn't turn the bug on, is that a search? reply ezfe 2 hours agoparentNo, and there's actually an analogy: phone taps. The \"bug\" is already installed, they just need the warrant to turn it on. reply Clubber 2 hours agoparentprevYes and I believe if you remove it, they can charge you with theft. reply rolph 2 hours agorootparent[0] Is It Considered Theft if You Remove a Law Enforcement G.P.S. Tracking Device from Your Automobile?[2020] https://www.wimmercriminaldefense.com/is-it-considered-theft... reply yieldcrv 1 hour agoprevnah, appeal. reviving it involved modifying someone’s personal property. I like that this is in the 9th circuit so I think the defendant and this country’s subjects will get a favorable ruling people ask me how much I want to make: enough to take any cases through federal appeals court reply btilly 3 hours agoprevWhat happens if we take this as precedent? Dismantling a safe to facilitate a search, isn't a search. So it's allowed, even if the safe is left damaged. Tearing a house apart to facilitate a search, isn't a search. So it's allowed, even if the house is left damaged. Disassembling a car to facilitate a search, isn't a search. So it's allowed, even if the car never runs the same later. Meanwhile you'll find me in the corner that reads the 4th Amendment as follows: The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized. I think that if the result of a seizure is the potential permanent damage of my property, then my right to be secure in my possessions should be defended by demanding a higher standard from the government than that required for a mere temporary possession after a seizure. That principle applies just as much to electronics as it does to any physical item. reply Dylan16807 2 minutes agoparentIf you want to get a close analogy, they already used a warrant to seize the safe/house/car, and already searched it a couple times and still have possession, so that makes a pretty big difference. reply modernpacifist 2 hours agoparentprev> The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized. If they have a search warrant then a judge has, from a legal perspective, determined that the request/search is reasonable. So while you have the right to secure against unreasonable cases I think it is a reasonable trade off that those security mechanisms/processes/etc should either be removed by yourself or you should expect them to be removed for you. reply sidewndr46 1 hour agorootparentI don't know what fantasy world you live in but the police don't ask you to remove your security mechanisms yourself. Your likely to catch a charge for destruction of evidence if you do that along with a bunch of other related charges reply yapyap 3 hours agoprevFederal court is stupid, reply throwawaycities 2 hours agoprev [–] This will be great legal precedent for the courts to extend to implanting neuralink style chips in your brain - although a neuralink chip may facilitate a future search and seizures (pun intended), the installation of the chip itself is neither a search nor a seizure; therefore, the 4th Amendment does not apply reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "The iPhone 6 is susceptible to the checkm8 exploit, which is a known security vulnerability.",
      "Devices such as the iPhone XS and newer models are currently not affected by this exploit, indicating improved security measures in later models."
    ],
    "commentSummary": [
      "A federal court decided that dismantling a phone to install firmware does not qualify as a \"search\" if data access is conducted with a valid warrant.- The government faced challenges accessing a device, leading them to send it for repair and firmware update, with a new warrant obtained before the actual data search.- This case underscores the complexities in legal interpretations and the difficulties in crafting clear headlines for technical legal matters."
    ],
    "points": 173,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1733411893
  },
  {
    "id": 42324059,
    "title": "VectorChord: Store 400k Vectors for $1 in PostgreSQL",
    "originLink": "https://blog.pgvecto.rs/vectorchord-store-400k-vectors-for-1-in-postgresql",
    "originBody": "VectorChord: Store 400k Vectors for $1 in PostgreSQL Introducing VectorChord: The successor to pgvecto.rs, designed for enhanced performance and scalability +2 Ce Gao with 2 co-authors ·Dec 5, 2024· 6 min read We’re pleased to announce our new vector search extension for PostgreSQL, providing a highly cost-effective way to manage large vectors. Using VectorChord, you can achieve a QPS of 131 with 0.95 precision on 100 million 768-dimensional vectors for the top 10 queries. This setup costs only $250 monthly and can be hosted on a single machine. This means you can store 400k vectors for only $1, allowing you to save significantly: 6x more vectors compared to Pinecone (storage optimized instance) and 26x more than pgvector/pgvecto.rs for the same price. In the monthly cost comparison for storing vectors, based on MyScale benchmark data, the chart highlights how VectorChord emerges as an affordable option, priced at just $247 for storing 100 million vectors. In contrast, Pinecone, despite its optimized storage, costs $1,600 per month, while Qdrant is priced at $4,374. pgvector/pgvecto.rs has a considerably higher cost of $6,580. https://github.com/tensorchord/VectorChord PermalinkHNSW’s problem As the successor to pgvecto.rs, VectorChord has gained valuable insights from its predecessor. While many vector databases or extensions (including pgvecto.rs) perform well with datasets of around 1 million, they often struggle when scaling up to larger sizes, such as from 10 million to 100 million. Traditional HNSW-based vector databases face specific challenges with larger datasets: Long index build time: It typically takes over 2 hours to build an index for 5 million records. High memory requirements: Storing a dataset of 10 million vectors can require as much as 40GB of memory. PermalinkVectorChord’s solution: Disk-friendly IVF+RabitQ VectorChord employs IVF (Inverted File Index) along with RaBitQ[1] quantization to provide fast, scalable, and accurate vector search capabilities. This method compresses 32-bit vectors into compact bit representations, significantly reducing computation demands. Most comparisons are conducted using these compressed vectors, while full-precision calculations are reserved for an adaptive reranking phase applied to a smaller subset, ensuring both speed and recall are preserved. Many people think that IVF has a less favorable recall/speed tradeoff than HNSW and involves many configurations for optimization. However, it's a complex issue, and we’ll explain it briefly now, with a detailed post on the topic coming later. PermalinkIVF vs HNSW A significant portion of the time taken by vector search algorithms is dedicated to distance computation. To enhance speed, it's essential to minimize distance comparisons as much as possible. The original IVF struggles in this area, usually necessitating a scan of 1% to 5% of the total vectors, which is considerably higher than what HNSW requires. However, RabitQ presents an innovative approach that allows for the compression of a 32-bit vector into just 1 bit. While this compression results in some loss of precision, it greatly reduces computational requirements. With the fast scan optimization, we can achieve calculations that are over 100 times faster than traditional vector distance computations. You might wonder about the recall. We can rerank additional vectors to enhance the recall rate, and full precision distance computation is only necessary during the reranking phase. RaBitQ guarantees a sharp theoretical error bound and provides good empirical accuracy at the same time. This is why IVF can be faster than HNSW. Here are some initial benchmark results for the GIST dataset, which consists of 1 million vectors in 960 dimensions. With equivalent recall, VectorChord's QPS could be twice that of pgvector. More details will be provided in the Benchmark section. PermalinkExternal Index build The original IVF method typically needs to scan 1–5% of the dataset, which can be slow. By using RaBitQ and fast scan optimization, VectorChord aims to speed up calculations by cutting down the number of full precision vectors that need to be fully compared. This approach helps create a stable and scalable vector search system that works well with the PostgreSQL storage system. As a result, users can use physical replication and other PostgreSQL features along with VectorChord. Built on IVF, VectorChord allows KMeans clustering to be conducted externally (such, as on a GPU) and easily imported into the database. We performed tests to measure indexing and insert time on an AWS i4i.large instance, which has 2 vCPUs, and 16 GB of RAM. The dataset used for this test was GIST 1M. We inserted 700,000 vectors, built the index, and then added another 300,000 vectors. After warming up the system, we performed queries using a single thread. During this process, we evaluated both the index build time and the insert time. Here are the results: VectorChord takes 186 seconds to build the index by utilizing a separate machine for KMeans clustering, making it 16 times faster than pgvector. Additionally, the insert time is also 14 times faster than that of pgvector. As we know, indexing is the most resource-intensive part of vector databases, requiring significant computation and increasing the demand for CPUs and memory. By utilizing a more capable machine to build the index and then importing it to a smaller machine for querying, it becomes possible to support billions of vectors on a single machine. PermalinkBenchmark We conducted additional experiments to assess performance and costs more thoroughly using the LAION 5M and 100M datasets. PermalinkLAION 5M We had an experiment using the LAION 5M dataset, and the results were encouraging for Vectorchord. It consistently achieved higher queries per second (RPS) compared to other platforms. While many databases struggle to maintain a balance between speed and accuracy as recall increases, Vectorchord managed to remain efficient even at higher recall levels. This characteristic could make it a suitable option for applications needing both quick responses and precision. The experiment utilizes the Myscale single thread benchmark, and we conducted it on an r6a.xlarge machine, which features 4 vCPUs, 32GB of memory, and 200GB of EBS storage. The parameters set for the experiment include an nlist of 8192, a shared buffer of 28GB, JIT disabled, and an effective I/O concurrency of 200. We ran the experiment twice without prewarming. The machine we used, an r6a.xlarge, costs around $165.56 per month, while the Zilliz Performance 4CU is priced at approximately $460 per month. Notably, we achieved comparable performance in the Top 100 on the LAION 5M dataset. PermalinkLAION 100M, on a single machine Furthermore, due to its disk-friendly indexing, increasing a single machine's disk capacity can proportionally enhance the maximum number of vectors VectorChord can hold, potentially allowing for storage of 1 billion or more. To assess scalability, we performed experiments on the LAION 100M dataset (768 dimensions) using an AWS i4i.xlarge instance, which is an economical configuration priced at $250 per month. It features just 4 CPUs and 32 GB of memory, with 937 GB of SSD used to store the 100 million vectors. In this setup, we achieved a QPS of 16.2 @ recall 0.95 for the top 10 results and 4.3 @ recall 0.95 for the top 100 results with a single-thread query. Here are the impressive results: While maintaining a recall greater than 0.95, we also assessed the multi-thread QPS on this 4-vCPU machine. In this scenario, as the number of requested threads rises from 1 to 8, the QPS for vector queries can increase linearly. This indicates that VectorChord demonstrates excellent scalability. PermalinkSummary VectorChord is a new PostgreSQL extension designed for efficient vector search. It allows users to store 400,000 vectors for just $1, significantly cheaper than competitors. By utilizing IVF and RaBitQ quantization, VectorChord optimizes search speed and memory usage, making it suitable for large datasets. We offer cloud-managed services for VectorChord at PGVecto.rs Cloud. Our platform simplifies deployment and management, enabling you to scale your vector database solutions with ease and efficiency. If you have any questions about VectorChord, please feel free to reach out. We're here to assist you! You can either open an issue in our repository or email us at vectorchord-inquiry@tensorchord.ai. https://github.com/tensorchord/VectorChord PermalinkReferences [1] Gao, Jianyang, and Cheng Long. \"RaBitQ: Quantizing High-Dimensional Vectors with a Theoretical Error Bound for Approximate Nearest Neighbor Search.\" Proceedings of the ACM on Management of Data 2.3 (2024): 1-27. PostgreSQLDatabasesvector databaseMachine Learninglarge language modelsAIllmopenaiOpen Source Written by Ce Gao I am an AI infrastructure software engineer, and my current focus is on pgvecto.rs, a vector database implemented in Postgres. I am an AI infrastructure software engineer, and my current focus is on pgvecto.rs, a vector database implemented in Postgres. Follow Jinjing Zhou Follow Junyu Chen Follow Published on pgvecto.rs Scalable Vector Search in Postgres. Revolutionize Vector Search, not Database. Scalable Vector Search in Postgres. Revolutionize Vector Search, not Database. Follow Share this",
    "commentLink": "https://news.ycombinator.com/item?id=42324059",
    "commentBody": "VectorChord: Store 400k Vectors for $1 in PostgreSQL (pgvecto.rs)148 points by gaocegege 16 hours agohidepastfavorite36 comments _mmarshall 1 hour agoThe cost to store a static set of 400k 768-dimension vectors is also $1 a month on Datastax's AstraDB. However, for that $1, AstraDB replicates the data 3x instead of storing it on a single machine. Here is a link to the cost calculator. Note that the calculator includes cost of ingestion, but the article only mentions storage costs, not ingestion costs: https://www.datastax.com/pricing/vector-search?cloudProvider... Disclaimer: I work on vectorsearch/AstraDB at DataStax. reply VoVAllen 1 hour agoparentIt's hard to compare the cost with the Serverless pricing model, as write and read have extra costs. On the pricing page, datastax costs $4000 to write 100M 768-dim vectors. And 10M query will cost $300, which is only 4 QPS. As comparison, VectorChord can achieve 100 QPS on $250 instance. reply whakim 3 hours agoprevCould you talk about how updates are handled? My understanding is that IVF can struggle if you're doing a lot of inserts/updates after index creation, as the data needs to be incrementally re-clustered (or the entire index needs to be rebuilt) in order to ensure the clusters continue to reflect the shape of your data? reply VoVAllen 2 hours agoparentWe don’t perform any reclustering. As you said, users would need to rebuild the index if they want to recluster. However, based on our observations, the speed remains acceptable even with significant data growth. We did a simple experiment using nlist=1 on the GIST dataset, the top-10 retrieval results took less than twice the time compared to using nlist=4096. This is because only the quantized vectors (with a 32x compression) need to be inserted into the posting list, and only quantized vector distances need more computations. And the quantized vector computation only accounts for a small amount of time. Most of the time is spent on re-ranking using full-precision vectors. Let's say the breakdown is approximately 20% for quantized vector computations and 80% for full-precision vector computations. So even if the time for quantized vector computations triples, the overall increase in query time would be only about 40%. If the data distribution shifts, the optimal solution would be to rebuild the index. We believe that HNSW also experiences challenges with data distribution to some extent. However, without rebuilding, our observations suggest that users are more likely to experience slightly longer query times rather than a significant loss in recall. reply marcyb5st 11 hours agoprevAwesome work! But aren't the comparisons missing ScaNN [1, 2]? I think it's the overall SOTA [3] at the moment regarding vector indexing. [1] https://github.com/google-research/google-research/tree/mast... [2] Also available on something like AlloyDB on GCP: https://cloud.google.com/alloydb/docs/ai/store-index-query-v... [3] https://ann-benchmarks.com/glove-100-angular_10_angular.html Disclaimer: Working for Google, but nowhere close to Databases. reply VoVAllen 9 hours agoparentI'm the project lead for VectorChord. I have tested ScaNN on AlloyDB Omni but have struggled to achieve reasonable recall on the GIST 1M dataset, with results peaking at only around 0.8. The limited documentation makes it challenging to understand the underlying causes of this performance. Additionally, I couldn’t find any performance benchmarks for ScaNN integrated with PostgreSQL, particularly in comparison to pgvector or its standalone. The publicly available metrics focus exclusively on query-only indexing outside of the database. On our side, we’ve implemented the fastscan kernel for bit vector scanning, which is considered as one of ScaNN’s key advantages. reply marcyb5st 8 hours agorootparentThanks for the explanation! Really appreciate it and it makes perfect sense. reply estebarb 5 hours agoprevIt would have been nice a comparison with pgvectorscale, which uses binary quantization and StreamingDiskANN. reply dmezzetti 3 hours agoprevThis looks like an interesting project. Though it's worth noting that the license is AGPL. So if the idea is for this to take over for pgvecto.rs, it's an important data point for those building SaaS products. It will make pgvector the only permissively licensed option, given it has the same license as Postgres. reply rkuzsma 7 hours agoprevWould you be willing to speculate on how VectorChord's ingestion and query performance might compare to Elasticsearch/OpenSearch for dense vector and sparse vector search use cases, particularly when dealing with larger full text data sets (>5M records)? reply VoVAllen 7 hours agoparentIn the LAION-5M benchmark, we’ve compared our performance against ElasticSearch and OpenSearch. However, comparing ingestion performance is more challenging due to differences in architecture. Both ElasticSearch and OpenSearch, like most vector databases, use the concept of shards. Each shard represents a separate vector index, and queries aggregate results across these shards. Larger shards lead to faster queries but come with higher resource requirements and slower update speeds. It’s also worth noting that ElasticSearch has implemented RaBitQ support for HNSW. So it's difficult to compare without running actual benchmarks. However, ElasticSearch typically requires at least double, if not triple, the memory size of the vector dataset to maintain system stability. In contrast, PostgreSQL can achieve a stable system with far fewer resources—for example, 32GB of memory is sufficient to manage 100 million vectors efficiently. From my perspective, it would be faster in query comparing to ElasticSearch due to the extensive optimizations. And much much faster with the updates (insert and delete) due to using IVF instead of HNSW. reply 7qW24A 13 hours agoprevThe “external index build” idea seems pretty interesting. How does it work with updates to the underlying data (e.g., new embeddings being added)? For that matter, I guess, how do incremental updates to pgvector’s HNSW indexes work? reply VoVAllen 13 hours agoparentThe IVF indexing can be considered into two phases, computing the centroids (KMeans), and assigning each point to the centroids as the inverted lists. The most time-consuming part is at the KMeans stage, and can be greatly accelerated with GPU. 1M 960dim vec can be clustered in less than 10s. We did the KMeans phase externally, and the assignment phase inside postgres. The KMeans part depends only on the data distribution, not on any specific data. So we can do sampling on the data, and inserting/deleting the data won't affect the KMeans result significantly. For the update, it's just a matter of assigning the new vector to a specific cluster and appending it to the corresponding list. It's very light compared to inserting in hnsw reply tarasglek 10 hours agoprevI am still waiting for a good pattern for using multivector embeddings like ColBert and ColPali in postgres. I get that its fun to optimize single vector stuff, but multivector is that happy middleground between single vector and reranker that seems to be only validated in specialized exotic search dbs like Vespa reply jonathan-adly 4 hours agoparentI would like to throw our project in the ring that solves this problem: https://github.com/tjmlabs/ColiVara 1. Uses half-vecs, so you cut down everything by half with no recall loss 2. Uses token pooling with hierarchial clustering at 3, so, you further cut down things by 2/3rd with <1% loss 3. Everything is on Postgres and pgvector, so you can do all the Postgres stuff and decrease corpus size by document metadata filtering 4. We have a 5000+ pages corpus in production with <3 seconds latency. 5. We benchmark against the Vidore leaderboard, and very near SOTA You can read about half-vecs here: https://jkatz05.com/post/postgres/pgvector-scalar-binary-qua... Hierarchical token pooling: https://www.answer.ai/posts/colbert-pooling.html And how we implemented them here: https://blog.colivara.com/ reply __jl__ 4 hours agorootparentI really like the idea of ColPali and products building on it but I am still unsure about the applications for which it makes most sense. We mostly deal with reports that are 80-90% text, 10-20% figures and tables. Does a vision first approach makes sense in this context? My sense is that text-based embeddings are better in mostly text contexts. Layout, for example, is pretty much irrelevant but plays into vision-based approaches. What is your sense about this? reply jonathan-adly 4 hours agorootparentSo - the synthetic QAs datasets in the Vidore datasets are exactly like that 90% text, 10% charts/tables. OCR + BM25 is at ~90% NCDG@5 which is pretty decent. ColPali/Ours is at ~98%. It is a small upgrade, but one nonetheless. The complexity, and the cost of multi-vectors *might* not make this worth it, really depends on how accuracy-critical the task is. For example, one of our customers who does this over FDA monographs, which is like 95%+ text, and 5% tables - they misses were extremely painful - even though there weren't that many in text-based pipelines. So, the migrations made sense to them. reply VoVAllen 9 hours agoparentprevThere's no easy way to index ColBert multi-vectors in a scalable way that I know of. Vespa seems to rely heavily on binary quantization, which can cost a lot in recall loss. And for most cases, using ColBert as a reranker is good enough, as the pgvector example you posted. reply tarasglek 9 hours agorootparentSeems like like doing a proper relational 1:N chunk:multiple-vectors foreign key, binarization and a clever join or multistage CTE would get us pretty close to useful. I am ok with it being less efficient as the dev ux will be amazing. Vespa ops (even in their cloud) are a complete nightmare compared to postgres reply tarasglek 10 hours agoparentprevLooks like that there is recent work to make a pgvector example for this https://github.com/pgvector/pgvector-python/blob/master/exam... reply gaocegege 16 hours agoprevHey everyone! We’ve developed a new PostgreSQL extension that supports 400k vectors for just $1. Check it out! reply curl-up 11 hours agoprevDoes this mean you won't support pgvecto.rs anymore? reply VoVAllen 10 hours agoparentI'm the project lead for both projects. We're still in the process of supporting all the function from pgvecto.rs in VectorChord (int8, more than 2000 dim vec, etc.). We'll provide the migration docs for pgvecto.rs users to VectorChord. User will have better experience with VectorChord due to better integration with postgres storage system. We will stop supporting pgvecto.rs early next year when everything on VectorChord is ready. reply nextworddev 12 hours agoprevWhat dimension vectors are we talking here reply jesperwe 12 hours agoparentFirst paragraph of tfa mentions \"768-dimensional vectors\" reply jasonkester 12 hours agoprev [–] In five pages of text, we never get to learn what a Vector is (in this context), why we’d want to store one in pgsql, or why it costs so much to store them compared to anything else you’d store there. For an example of how you can communicate with domain experts, while still giving everyone else some form of clue as to what this hell you’re talking about, check out the link to the product that this thing claims to be a successor to: https://pgvecto.rs/ That starts off by telling us what it is and what it does. reply lja 10 hours agoparentThat's because this product isn't for you then. My team has been evaluating vector databases for years and everything on the VectorChord page resonated with me. We run one of the world's largest vector databases and we'll likely benchmark vectorchord to see if it lives up to its promises here. reply thelittleone 7 hours agorootparentDo you have a blog per chance? Or any recommended reading on pre processing / data chunking strategies to improve results? reply VoVAllen 6 hours agorootparentI recently came across a project that looks promising: [WordLlama](https://github.com/dleemiller/WordLlama?tab=readme-ov-file#s...). It appears to be well-suited for semantic chunking, though I haven’t had a chance to try it out yet. reply gaocegege 10 hours agorootparentprevHi, we’re here to help if you need assistance (via GitHub issue, Discord, or email). Could you let us know the scale of your vectors—are they 1B or 10B? reply lja 10 hours agorootparent10B, feel free to email me luke@ the domain in my profile. reply redskyluan 3 hours agorootparentprevMaybe check this https://zilliz.com/pricing Yan easily store 1B data into Zilliz Serverless and the cost is incredible cheap reply lja 2 hours agorootparentZilliz gave us a near 6-figure a month quote for our database. reply Raed667 8 hours agoparentprevAnd every hosting provider doesn't start by teaching you what is HTML reply curl-up 10 hours agoparentprev [–] So they should start every one of their posts, on that same site, with a summary of what is available on the homepage? reply jasonkester 2 hours agorootparent [–] Wow. It never occurred to me that this might be anything but the landing page of a product. The title here, the presentation on the page itself. Everything screams \"landing page\". I had to go back on a desktop browser to see the word \"blog\" in the url bar, and mentally shift those graphics and little islands of text around until I can view it from that lens. If it's really just a sub-product of the main product that they're talking about, then yeah, it makes more sense in that context. But my answer to your question would still be \"Yes\". Absolutely. If you're a product, the job of your blog is to convince people coming off the street that they need your thing, even if they didn't realize it yet. Step one of that process is to not bounce them back to the street without any idea what they're looking at. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "VectorChord is a new PostgreSQL extension designed for efficient vector search, capable of storing 400,000 vectors for just $1, making it more cost-effective than competitors.- It utilizes IVF (Inverted File) and RaBitQ (Random Bit Quantization) techniques to enhance search speed and memory efficiency, making it suitable for handling large datasets.- VectorChord outperforms alternatives like Pinecone and pgvector in terms of both price and performance, offering scalable vector search with improved speed and precision for applications needing quick and accurate responses."
    ],
    "commentSummary": [
      "VectorChord has introduced a PostgreSQL extension that allows storing 400,000 vectors for a cost of $1, highlighting a cost-effective solution for vector storage.",
      "Comparisons with Datastax's AstraDB reveal differences in replication strategies and associated costs, sparking discussions on performance and update handling.",
      "The project plans to integrate features from pgvecto.rs and eventually phase out support for it, with users exploring the potential and limitations of VectorChord in vector database management."
    ],
    "points": 148,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1733364105
  },
  {
    "id": 42324263,
    "title": "Bitcoin is over $100k",
    "originLink": "https://www.tradingview.com/symbols/BTCUSD/",
    "originBody": "\"Stepping Stones to Success: A Target-by-Target Market Roadmap\"Traders, ladies and gentlemen of all ages, gather around! Let’s take a moment to appreciate what’s unfolding before us. Today, I’ve uncovered a *hidden pattern*—a revelation that could shift the game for many of us. The candlesticks, as always, speak the truth, and as I’ve said before, their sign Long by The_ForexX_Mindset Updated 16 hours ago 14814878",
    "commentLink": "https://news.ycombinator.com/item?id=42324263",
    "commentBody": "[flagged] Bitcoin is over $100k (tradingview.com)134 points by WheelsAtLarge 16 hours agohidepastfavorite293 comments deanmoriarty 16 hours agoI couldn’t care less about crypto, but just for fun I bought 1 BTC in 2016. Still own it, and likely will never sell, but boy I wish I bought a lot more instead of my index funds, skipping one monthly contribution in VTI back then would have mostly set me up for life instead of just having a nice but inconsequential $100k bonus in my portfolio :-) Congrats to the people who held through thick and thin, I speculate (my own opinion) that we will likely not see 80% drawdowns anymore due to all the institutional money that flew in, just “standard” 40-50% dips. Fantastic to witness, an asset class out of thin air. Cheers to the next 10X in 8 years, $1M in 2032! reply huijzer 12 hours agoparent> inconsequential $100k bonus in my portfolio It seems we are truly ducking poor here in the EU. My parents have been running a farm for 40 years in the Netherlands and they’re doing well financially. Still, $100k is not inconsequential for them! reply benterix 11 hours agorootparentI don't think Americans are that much different in that respect from Europeans in general: https://www.bankrate.com/banking/savings/emergency-savings-r... One fourth have no savings at all. European stats are similar: https://www.statista.com/statistics/1221416/households-witho... reply JohnTHaller 1 hour agorootparentprevNearly half of folks in the US have no way of paying an unexpected $1,000 expense. $100,000 isn't inconsequential to the majority of the world. reply deanmoriarty 1 hour agorootparentIs this true? The few net worth government statistics I can find from a quick google search point at median net worth, excluding house equity, to be significantly higher than $1k, so I wonder what I am missing. Is the implication that a person with $100k in their 401k still cannot get shell out $1k in an emergency? Totally happy to be educated. Would love to see some data, as anecdotally, living in the Bay Area, I cannot at all relate to your comment given the massive amount of wealth virtually anyone I know has. People routinely drop $1k on a couple of mid-tier restaurant dinners around here (restaurant prices show that, a drink these days is $25, crazy), which I do understand is an outlier. Thanks. reply csomar 12 hours agorootparentprevFor most of the world, $100k in savings is simply beyond reach. So no, you are definitely not ducking poor in the EU. reply piva00 9 hours agorootparentprevHN is a bubble of very rich folks compared to the vast majority of the global population. It's easy to fall into the trap of how people here talk about money, like a US$ 150k salary is too low, or like having less than US$ 300k in savings makes you poor. Just remind yourself this place is an extreme outlier whenever you hear someone here treating life-changing sums of money for 90-95% of the global population as \"inconsequential\". reply lifty 10 hours agorootparentprevThe world is split into two kids of people: the ones that have managed to take advantage of the massive financialization of the world, and the ones who haven’t. reply PawgerZ 1 hour agorootparent> the ones that have managed to take advantage of the massive financialization of the world This group is further split into two kinds of people: Those who had an opportunity to take advantage of the massive financialization of the world, and those who weren't afforded that opportunity. reply tim333 2 hours agorootparentprevThe world was even more divided in the past. When I went to China in 1983 the GDP per capita per year was $285. Even adjusted for inflation they were poor. No more really. Trade and the internet have leveled things up. reply sandos 11 hours agoparentprevI cry every time I think about the fact that I managed to CPU-mine 50 btc, and sold it for nothing. Still, I did get a payout from the mtgox disaster and its a decent amount really, considering I put in less than 100$ from the start. Just far from life-changing amount, more like \"ok, this gets us a nice vacation trip!\"-money. reply pas 8 hours agorootparentI still have the postcard from Japan from the legal proceedings! There's a ton of things I could regret. BTC price going up makes the counterfactual very easy to imagine in rough outlines, and thus more and more appealing. But that's a fool's errand. There's absolutely no guarantee that in all the alternate timelines where you had not sold you would be better off now. Even with all the extra money. Windfalls tend to cause problems for lottery winners for example. reply theshrike79 10 hours agorootparentprevI mined a bit over 2 BTC, sold them when it hit $200. Bought a pair of headphones that broke in 3-4 years. If I had saved them, I could pay off my mortgage now. reply piva00 9 hours agorootparentI mined 12 BTC from my gaming computer dual-booting between Linux/Windows that I also used for SETI@Home and Folding@Home, I ran the miner just for fun as I thought it was another distributed system doing computations and was fascinated by that concept at the time. They were lost when I had to re-install Windows to play games and formatted the whole hard drive. I don't think much about it because it's so long ago but I'd have enough money to start realistically considering to retire... reply ganeshkrishnan 15 hours agoparentprevI had couple of bitcoin from 2013. Sold most at 10k and held on to one at 50k. I was absolutely super duper sure, 50k was the top. reply pacomerh 13 hours agorootparentHa, this is my story, except I thought 20k was the top. reply kamaal 4 hours agoparentprev>>Congrats to the people who held through thick and thin, I speculate (my own opinion) that we will likely not see 80% drawdowns anymore due to all the institutional money that flew in, just “standard” 40-50% dips. Fantastic to witness, an asset class out of thin air. There was some person who invested $30 everyday in BTC since 2017, and has $1 million right now. The tweet had gone viral on Twitter. BTC bull/bear cycles have taught a lot of people many things about regular investing. Like what this person did is called DCA(Dollar Cost Averaging). >>>>Cheers to the next 10X in 8 years, $1M in 2032! Seems like showing up everyday is all there is to success. Mostly. Every once in a while, someone makes it big due to luck/help. But showing up everything is all. reply thunky 47 minutes agorootparent> There was some person who invested \"Invested\" is a generous way to put it. https://www.investopedia.com/articles/basics/09/compare-inve... reply paulpauper 11 hours agoparentprevCongrats to the people who held through thick and thin, I speculate (my own opinion) that we will likely not see 80% drawdowns anymore due to all the institutional money that flew in, just “standard” 40-50% dips. Fantastic to witness, an asset class out of thin air. they said exactly that in 2018, 2021, and 2022 too reply paxys 16 hours agoprevImportant to remember that while income and wealth inequality is at record highs, the trillions of dollars injected into the economy are still floating around among the top. People are getting more and more creative with investments (see luxury watches, sneakers, trading cards, collectibles, meme stocks all seeing a significant bump in value in recent years). Bitcoin's price is simply another symptom of this. What I find new about this recent bull run is that the usual \"crypto will upend global financial systems/crypto will change the world\" hype is conspicuously missing. All the \"Blockchain startups\" have basically disappeared. NFTs are worthless. There is little/no VC money going into the space. I think people are finally coming to terms with the fact that it is a speculative investment and nothing more. reply purple_ferret 15 hours agoparent> the usual \"crypto will upend global financial systems/crypto will change the world\" hype is conspicuously missing That hype is nothing compared to the current hype, the idea that the US Government is going to buy a significant amount of Bitcoin to create a \"strategic\" reserve. Every hype cycle gets bigger and bigger even as past ones never amount to anything reply fixprix 15 hours agoparentprevBitcoin is a store of value. Nothing more or less. DAOs and NFTs were just distractions trying to ride the wave. The fundamentals remain strong. It really hasn't changed much in 15 years. The Hacker News comments certainly haven't either. Salty as ever. reply nadermx 15 hours agorootparentBy definition store of value means \"its ability to purchase other assets in the future without rapidly losing its purchasing power\" yet bitcoin has in instances halved it's value. So, no not a store of value. reply fixprix 12 hours agorootparentMeaningless point. All stores of value fluctuate in value relative to each other. Homes and stocks go through periods of doubling and halving in value. Its the entire reason why diversification across asset classes is fundamental to managing your finances. reply XCSme 15 hours agorootparentprevHow exactly does BTC store any more value than an NFT? reply Empact 14 hours agorootparentFungibility is one of the important properties of money. So a non-fungible token has less ability to accrue monetary value. https://en.wikipedia.org/wiki/Money#Properties reply stouset 11 hours agorootparentThis is hysterical because four years ago everyone was clamoring on about how the non-fungability of NFTs was the secret sauce to why they’d accrue monetary value. reply dns_snek 11 hours agorootparentTaking arguments from the most delusional crypto bros at the time and trying to sell them as something that \"everyone\" was saying about NFTs in general isn't a way to engage in good faith discussion. Some NFTs/art might appreciate in value, but most NFTs/\"art\" are worthless on the open market. reply jdenning 15 hours agorootparentprevSupply & demand? reply echelon 15 hours agorootparentprevIt's the \"chosen one\". reply Mithriil 15 hours agorootparentprevEnergy wasted to secure the chain reply XCSme 15 hours agorootparentI can also waste energy by leaving my light on, I don't think that stores any value... reply colecut 11 hours agorootparentwhat does snark buy you reply dmarcos 15 hours agorootparentprevIf audit your life I'm sure I'll find stuff I consider wasteful. The same if you audit mine. reply ActorNightly 15 hours agorootparentprevBitcoin is a speculative asset like a stock. reply fixprix 12 hours agorootparentBitcoin has maintained its fundamentals for 15 years. People place value on mature things. Lindy’s law. It’s fair to speculate Bitcoin will be around for a long time to come. reply dmarcos 15 hours agorootparentprevThe SEC doesn't consider BTC a security, so not \"like a stock\" reply wmf 15 hours agorootparentLegally it's a speculative commodity like gold but that difference is not important to most people. reply throwaway657656 15 hours agorootparentprevAnd companies have intrinsic value. They don't just pointlessly consume resources. reply dmarcos 15 hours agorootparentNothing has intrinsic value. Subjective theory of value. Some find BTC valuable as a store of value hence it has value. reply talldayo 15 hours agorootparentprevNot all speculative assets are neccesarily securities. Bitcoin's value fluctuates in a way that makes it's store of value absolutely resemble a stock, albeit with fewer legal protections and guarantees. reply dmarcos 15 hours agorootparentBTC is volatile but one can argue has more guarantees than stocks. There's no counterparty risk. No company that can go bankrupt or entity that can fail. BTC is property. reply benchmarkist 15 hours agorootparentprevBitcoin is actually just a bunch of numbers. Whatever value you think you're storing with it is always denominated in fiat which is very ironic. reply aryan14 15 hours agorootparentYou could say any currency is just a bunch of numbers, the US dollar isn’t backed by gold anymore and hasn’t been for a long time. The question is more like: Would you let everyone dictate the value of a currency and leave it decentralized? Or would you rather a government controlled centralized currency. It’s preference and opinion at the end of the day reply ConspiracyFact 15 hours agorootparentThe dollar is backed by the fact that you can pay any debt with it and (if you’re a US citizen) have to pay your taxes with it. reply dlubarov 13 hours agorootparentI'm not sure people care much about the debt repayment thing? If I rack up a bill at a bar, I can technically force them to accept a sack of pennies as repayment, but most people use digital payments like credit cards. At that point it doesn't really matter if my bank account holds USD, GBP, BTC or any other liquid asset, as long as the payment infrastructure can handle any necessary conversions. reply benchmarkist 12 hours agorootparentThere are no assets for digital currencies so the words you're using to describe it are ontologically nonsensical. It's numbers, binary sequences, in databases. The only thing that makes it all work is your belief and faith that the numbers mean something other than the electricity and infrastructure necessary to maintain the databases. The only real assets in the entire scheme are the computers and power plants with the spinning dynamos necessary for maintaining the illusion of \"value\". This is why the masses are always dazed and confused. Your water and food are full of poisons but the numbers in databases are what get the most airtime. Bitcoin is the purest distillation of fiat currencies because there is no longer any actual physical manifestation of it anywhere other than whatever paper key you keep on you as a reminder that there is a database with some numbers which you and those like you collectively believe to be \"valuable\". reply fixprix 11 hours agorootparentThe fact that it is not physical makes Bitcoin more valuable. Why? Because I can store millions of it in my pocket. I can move millions around the world in less than an hour. 24/7. No banks or approvals or intermediaries required. I can keep it in my own custody safety. It is easy and fast to exchange. It is easy to validate its authenticity. The supply is fixed and near impossible to dilute. Etc.. Etc.. that is why Bitcoin is valuable. It’s valuable because it stores value with all the important properties I listed above. Those properties are intrinsic to Bitcoin. Say that for any other asset. If you’re worried about civilization crashing and Bitcoin becoming worthless. Fair enough, you should diversify into guns and toilet paper. reply benchmarkist 11 hours agorootparentWell, with toilet paper I can wipe my ass. Even a dollar bill will do the trick but I'm not sure what I can do with a number in a database disconnected from the spinning magnets that make it functional. I'm not here to convince you that bitcoin is worthless because clearly there are enough people who think it is worth more than $100k so you'd be better off convincing those people to offer you services in exchange for bitcoins instead of arguing with a random stranger about the collapse of civilization. reply tasuki 10 hours agorootparent> Well, with toilet paper I can wipe my ass. Even a dollar bill will do the trick Wait, are you saying dollars are good because you can wipe with them? I think you're in full agreement with the person you're replying to! reply benchmarkist 55 minutes agorootparentMy point is that Bitcoin is no different from fiat. In fact, it can't be anything but fiat because it has no physical representation. reply fixprix 12 hours agorootparentprevGreat for the government, terrible for anyone holding dollars. The government continues diluting the dollar to pay its debt. reply fixprix 12 hours agorootparentprevAll of our assets are denominated with depreciating dollars. It’s nice because our assets always look like they’re going up. Of course a big part of that is just the dollar going down. reply benchmarkist 11 hours agorootparentMoney is a meme, there is no value it can measure other than whatever delusion people collectively agree to call \"value\". reply ConspiracyFact 9 hours agorootparentThe US Dollar is quite the meme! If you’re a US citizen and you have an income in any currency whatever, you have to acquire US Dollars to pay taxes with, or else you’ll eventually wind up in jail :) reply eric_cc 5 hours agorootparentMoney based on violence. reply ConspiracyFact 49 minutes agorootparentYes, and…? In a stateless society, how would the landed deal with squatters? Couples therapy? reply testfrequency 15 hours agorootparentprevnext [5 more] [flagged] fixprix 12 hours agorootparentCase in point, you just replied with the most salty comment ever. reply andreygrehov 15 hours agorootparentprevI don’t think “crypto is unregulated” still a thing. Why do you say so? reply kortilla 12 hours agorootparentNorth Korea makes significant money through crypto because it’s not possible to regulate at the international level. The US gov has put a lot of effort into controlling the exchange to USD, but that doesn’t put the brakes on the ability to pay anyone in the world with BTC regardless of sanctions. reply pixxel 12 hours agorootparentprevYour salty comment just helped wArM tHe PlANeT. reply josu 15 hours agoparentprev>Bitcoin's price is simply another symptom of this. Bitcoin is not the symptom, Bitcoin is the answer. People are not longing Bitcoin, people are exiting the dollar, the euro, the yuan... reply paxys 15 hours agorootparentYet the dollar is at record highs, and commodities are at record highs, and the stock market is at record highs, and real estate is at record highs, and Bitcoin is at record highs. So who is hedging what exactly? reply olddog2 15 hours agorootparentLook at a chart of purchasing power adjusted USD over the past 100 years and tell me its at record highs. All fiat currencies go to zero. BTC does the opposite using number go up technology. reply tasuki 10 hours agorootparentprev> Yet the dollar is at record highs, and commodities are at record highs, and the stock market is at record highs, and real estate is at record highs, and Bitcoin is at record highs. I'm not even sure what this means and what you're trying to say. One can compare two things, say bitcoin and dollar. Dollar is at record lows compared to bitcoin. It's at record lows also compared to the stock market, commodities, real estate, etc. reply csomar 12 hours agorootparentprevIf commodities are at record highs, then the dollar is at record lows. Just because other currencies are inflating more, doesn’t mean the USD is getting stronger. reply panarky 12 hours agorootparentprev> the dollar is at record highs Compared to what? Other government currencies? reply ur-whale 12 hours agorootparentprev> Yet the dollar is at record highs The SingleFamilyHome/USD pair begs to differ reply josu 15 hours agorootparentprevLet's revisit this in 10 years. reply ManuelKiessling 3 hours agorootparentprevIf people don't care about the dollar, then why is \"Bitcoin is over $100k\" a headline? You know why it is a headline? Because the $ symbol in the headline is what people ACTUALLY care about. You don't even need to ask people: simply watch what people do, and you will learn what they care about. And what they do is they buy nice things, like Lamborghinis, yachts, homes — and they do so using US dollars. reply josu 2 hours agorootparentWhat about the gold? We use dollars to measure that too. reply nadermx 15 hours agoparentprevI just struggle to see it's utility reply latchkey 14 hours agorootparentMy favorite response on this: https://news.ycombinator.com/item?id=26238410 reply ajkdhcb2 15 hours agorootparentprevIt is scarce, novel, transferable, passed critical mass of popularity long ago, uncensorable to some degree for now. That's all that's needed, it makes it better money than perhaps anything else reply wyldfire 15 hours agorootparentprevIts utility is similar to that of cash. But unlike cash it's (1) less fungible (2) much easier to transport (3) harder to secure from theft and/or destruction * (4) value is more volatile than USD/EUR/CAD/AUD (5) incredibly resource intensive to maintain (and growing!). It's not an equity, it's a currency. The Bitcoin network is nigh \"indestructible\" as long as some folks still consider it useful. This delivers credibility towards the faith required to support some value. If its value dropped by 99% tomorrow (maybe from aggressive global legislation and cooperation among governments), it would still function (but perhaps primarily maintained by sanctioned countries). I think there's significant pros and cons to cryptocurrency in general and Bitcoin specifically. As the emission rate continues to decrease, I suspect its value will stay relatively high relative to what it is now. EDIT: I said in (3) above that it's harder to secure bitcoin from destruction (than cash) but in some ways it's remarkably more robust than cash. You can make as many copies of the keys securing your bitcoins as you like (and/or use multi-sig). Your home burning down would destroy cash, but if you have a backup your bitcoins are preserved. However this is in tension with \"secure from theft\". reply Empact 14 hours agorootparentPerhaps most importantly, unlike cash, it can't be printed, and unlike gold, its supply is not responsive to price. reply wyldfire 14 hours agorootparent> it can't be printed New coins are minted with every block. But perhaps you mean to suggest that it's \"stable\" or \"predictable.\" The emission rate of bitcoin is predictable - but this is predicated on the stability/predictability of the community of miners/stakers. It seems extremely irrational now, but if something were to change such that the community decided to drastically increase or decrease the block reward, they could indeed do so if they found consensus. > its supply is not responsive to price. While this is probably true, the value of mining equipment is directly related to the exchange rate of bitcoin (and perhaps its recent rate of increase/decrease). This doesn't impact supply, but it does impact the network OpEx. reply dlubarov 13 hours agorootparentWell, not just predictable but hard capped at 21M, about 19.8M (or ~94%) of which have already been mined. So in some sense, inflation tax can't exceed ~6% over all time. (I don't think it's a sustainable model, as security essentially decays over time, unless fees become extremely high which doesn't seem like a great outcome either. But that's another matter...) reply Empact 12 hours agorootparentThere are a few answers to the long-term security budget: 1) We could maintain fees through compression, that is, by making each on-chain transaction representative of many off-chain transactions. This is beginning to happen with the lightning network, and other technologies are in the works to advance this concept. 2) Mining will become more integrated with other industrial and residential processes, which will reduce the cost of security, from a compensation standpoint. Think bitcoin miner water and space heaters in many homes, etc. 3) It's also likely that in the future institutions that rely heavily on bitcoin will voluntarily subsidize security to some extent, for the same reason they invest in vaults for other instruments. Personally I'm planning to start running a lottery miner at home just for the fun of it. reply dlubarov 2 hours agorootparent(2) is interesting, but I'm not sure if resistance heaters will remain common in the long term, as heat pumps become more widely available? Also this seems like a sort of free-electricity scenario (mining with electricity that was going to be used anyway), but I'm not sure free electricity would reduce mining costs? Wouldn't hardness adjust so that it then becomes all about hardware CapEx (assuming amortized CapEx remains significant)? I figure mining costs are around 1% of the market cap, and can't go that much lower without serious security risks. So the ecosystem needs to fund that in some way, whether it's through inflation, fees, or donations. With fees, I also worry they'll be too unpredictable. Like there might be enough demand to justify $20B/year in fees, but it's a function of supply as well, and if scaling solutions like Lightning Network work \"too well\" (with people rarely needing to settle on-chain) we might end up with way lower fees. reply ethagnawl 14 hours agorootparentprev> Its utility is similar to that of cash. In the USA, spending cash doesn't require ~30 minutes of validation or a capital gains report. reply Empact 14 hours agorootparentTransacting bitcoin via the lightning network is instant. Capital gains is a matter of policy and is likely to change at some point as bitcoin succeeds. reply ConspiracyFact 15 hours agorootparentprevShow me an economy that only uses bitcoin and doesn’t depend on cashing out to one fiat currency or another and I’ll allow that it’s a currency. reply OrigamiPastrami 15 hours agorootparentEl Salvador. reply paulryanrogers 15 hours agorootparentprevSomewhere between tulips and gold. reply XCSme 15 hours agorootparentBoth are pretty, though. reply paxys 15 hours agorootparentprevWhat is the utility of a baseball trading card or a piece of art sitting in a bank vault? reply Gigachad 15 hours agorootparentprevThere’s “utility” in enabling crime and being able to move massive amounts of wealth fairly easily. reply cypherpunks01 13 hours agorootparentThere's utility in being able to move both small and large amounts of value fairly easily. Moving value has high utility for criminals and non-criminals alike. There's utility in remittances, in protecting value from unlawful seizure, and protecting value from incompetent bureaucrats hyper-inflating your national currency. reply xyzzy4747 15 hours agorootparentprevIt definitely has utility but it is at the same time overhyped IMO. Some examples of utility: 1. Cross-border transfers without needing permission from banks or identification 2. A fungible digital asset you can hoard and nobody can physically take from you if you secure the keys. 3. If you are a business in a gray or black market industry, you can accept payments from customers online without needing permission from payment processors. Many types of businesses are effectively banned by the banking system. 4. It provides a way to obfuscate your wealth which can help protect against asset seizures. Similar to #2. reply jonahbenton 15 hours agorootparentThese are all true but far and away the dominant use case is long term (10+ year) store of value/dollar inflation hedge- which sometimes implies #2, but many entities are happy to hold on exchanges. Total BTC market cap at $2T- would guess from how relatively little transaction activity there is that at least $1.5T is due to this use case. reply ajkdhcb2 15 hours agorootparentprevIt isn't fungible at all since every coin has a history which in some cases makes it unspendable, so it is highly risky to accept transfers without a third party chain analysis report, otherwise i agree reply throwme_123 15 hours agorootparentReport which you don't get from centralized exchanges. So you have to trust them and they should somehow be liable for the provenance of what they sell to you. Probably most CEX don't allocate UTXOs upon buying, but only for withdrawals reply ajkdhcb2 15 hours agorootparentI am aware of a couple of cases where people received flagged coins from centralised exchanges and had a lot of issues reply LightHugger 14 hours agorootparentprevThere is a lot of utility in bypassing the credit card company cartel which have been abusing their position to create a pseudo government to shut down or kill the value of (maybe to make them easier to buy out?) targeted businesses. Or in some cases impose the christian ideology of the owners upon entire countries, most recently japan. reply puzzlingcaptcha 13 hours agorootparentAh yes, I remember when BTC was going to supplant Visa/Mastercard... 12 years ago. reply LightHugger 11 hours agorootparentCryptocurrency when not being used for speculation or investment nonsense has already successfully provided a pressure release valve for abuse by the credit card cartels. It still sucks, and isn't very convenient or good for most transactions or safety. But it works! It would be more ideal to just regulate the credit card companies properly but that appears to be beyond current government bodies. reply testfrequency 15 hours agorootparentprevIt’s because there isn’t any reply atlgator 13 hours agoparentprevAn important point, whichever way you want to interpret it, is that you can now buy Bitcoin exposure via ETFs like IBIT. Those didn't exist in the last run. The upside is they enable more liquid investment, especially to non-native investors (e.g. those that don't know what a crypto wallet is). The downside is it could drive speculation or allow manipulation by big banks and hedge funds. reply huijzer 12 hours agoparentprev> it is a speculative investment and nothing more. Mostly yes. The only true value I see is that Bitcoin is the new Swiss banking. So if you don’t trust your government then you get yourself some Bitcoins. I realized this while reading a book about Swiss banking. It also used to involve elaborate schemes to preserve client privacy. reply klipt 11 hours agorootparentI imagine the Swiss also made lots of money from having account holders die without ever telling anyone their secret key. Just like many bitcoins got irrevocably lost on broken hard drives. reply soramimo 15 hours agoparentprevDon't forget the funding of North Korea and organized crime. reply xur17 15 hours agorootparentLike USD? reply talldayo 14 hours agorootparentAh, the ultimate whataboutism. No, not like USD. That's actually somewhat the problem, and why KYC is pushed so hard despite being so unpopular. reply rsanek 12 hours agoparentprevluxury watches are way down since their peak in early 2022 https://watchcharts.com/watches/price_index reply paulpauper 13 hours agoparentprevImportant to remember that while income and wealth inequality is at record highs, the trillions of dollars injected into the economy are still floating around among the top. People are getting more and more creative with investments (see luxury watches, sneakers, trading cards, collectibles, meme stocks all seeing a significant bump in value in recent years). Bitcoin's price is simply another symptom of this. this makes sense. price inflation is out of control . it's like everything is being inflated in the name of scarcity reply eric_cc 15 hours agoparentprevnext [5 more] [flagged] throwawayq3423 15 hours agorootparentWhat denial? It is an excellent way to gamble or launder money. That's not changed, but it's not expanded either. reply eric_cc 15 hours agorootparentBitcoin is the only sound money in existence. It will slowly devour fiat currency over time and humanity will benefit. There are quite a few similarities to the fall of monarchies. reply tim333 1 hour agorootparentIt's good in some ways - value goes up, independent of governments - but bad in others - too unstable in value for day to day transactions, wages, mortgages and the like. reply kortilla 12 hours agorootparentprevGold is basically the same. The only upside to bitcoin is that it works over the internet so it’s much faster to trade reply monero-xmr 15 hours agoparentprevCrypto VC is booming! What the heck are you talking about reply throwawayq3423 15 hours agorootparentBesides an exchange, what company is doing well right now in the crypto space? reply aryan14 15 hours agorootparentPolymarket, Bitrefill, Stake reply throwawayq3423 15 hours agorootparentGambling, money laundering, and more gambling. This is just a repeat of all the companies that promised people could get rich using them, then the price collapsed and they all died. reply aryan14 15 hours agorootparentQuestion was asking for companies doing well that weren’t exchanges. reply throwawayq3423 1 hour agorootparentTrue, I had just responded to another comment with this so I had a chuckle. > What denial? It is an excellent way to gamble or launder money. That's not changed, but it's not expanded either. reply throwme_123 15 hours agorootparentprevLess money laundering than cash obviously reply throwawayq3423 1 hour agorootparentThere is no such thing as an all cash startup. reply paxys 15 hours agorootparentprev2 out of the 3 companies you listed have nothing to do with crypto. reply tim333 1 hour agorootparentPolymarket and Stake use crypto on the backend to facilitate the gambling. It's actually quite functional for that speaking as someone who's used Polymarket. reply throwawayq3423 1 hour agorootparentYes, both only legal because of their offshore status. Mainstream adoption seems farther away due to this recent price spike. The money is attracting the wrong people, as it usually does. reply monero-xmr 15 hours agorootparentprevL1 blockchains, Monad being a recent success. But blockchain = finance. That is what the use case for blockchain is. Anything will be either platforms to host financial assets, the assets themselves (interesting tokens), or applications to trade / lend / lever up on assets. It's protocolized, open-source finance. reply bakugo 15 hours agoparentprev> the usual \"crypto will upend global financial systems/crypto will change the world\" hype is conspicuously missing. All the \"Blockchain startups\" have basically disappeared. NFTs are worthless. There is little/no VC money going into the space. All of those people pivoted to AI. reply amazingamazing 15 hours agoparentprevWhy does it matter if income inequality is high? Poorly hid envy it looks like. reply throwawayq3423 15 hours agorootparenthttps://en.wikipedia.org/wiki/French_Revolution reply amazingamazing 15 hours agorootparentNeat, how about something from this century? And the French Revolution is more complicated than rich people getting richer. reply ks2048 15 hours agorootparentI don’t think we’re real close to a “French revolution”, but an executed CEO today could be a symptom of the situation. (Of course, we don’t know the motive yet. But just the online discourse around it is telling). reply ks2048 14 hours agorootparentTo follow-up on my comment of “online discourse” about this: the Facebook post from the company (…deeply saddened…) has 20.6K laugh emojis vs ~4k in sympathy related) reply throwawayq3423 15 hours agorootparentprevGo to South Africa and tell me if it feels safe. Specifically the rich areas. reply amazingamazing 15 hours agorootparentFunny you say that - I was just in Johannesburg- which neighborhoods are you referring to? reply throwawayq3423 1 hour agorootparentI didn't go to Johannesburg because my friend had gotten car jacked the week before. In my 4 months in cape town I was the only member of my friend group that didn't get mugged (most with guns). But Clifton and Camps Bay were super nice. One late night I made a sandwich for the security guard my friend's neighborhood had to hire to stand outside with a kalashankof at night, he was grateful. Compare that to other more poor African nations, there isn't 1/1000 the tension in the air as there is in SA. The reason for that is the extreme difference in wealth tied to racial tensions. reply ks2048 15 hours agorootparentprevBecause money is power. If you believe in democracy, then extreme inequality is extremely un-democratic. (Note, there is, IMHO, a happy middle-ground: some amount of tolerable inequality, resulting in some amount of tolerable un-democratic-ness) reply pontifier 15 hours agorootparentMoney isn't power. Power is power. Money can sometimes be used like power, but not knowing the difference is a recipe for the situation we find ourselves in now. Money is only powerful as long as it's useful. When the pitchforks come out, dollar bills won't stop them. reply pixelatedindex 15 hours agorootparentprevBecause you need the disposable income to buy speculative assets. This means that the rich get richer. reply amazingamazing 15 hours agorootparentnext [5 more] [flagged] throwawayq3423 15 hours agorootparentRead some history, bad things tend to happen when a permanent underclass is cut off from ever-expanding wealth. reply amazingamazing 15 hours agorootparentOk, where are the bad things from this century caused directly from rich people getting richer and nothing else? And moreover - tell me how your prosperity harms the poorest in the world and what you’re doing to reduce that gap between you and them. reply pixelatedindex 14 hours agorootparent> where are the bad things from this century caused directly from rich people getting richer and nothing else? Tell me you’re oblivious to the world around you without telling me you are oblivious. Are you arguing that income inequality is good? Or that it’s simply nothing to worry about? Because I agree with neither. reply throwawayq3423 1 hour agorootparentNot trying to make assumptions, but it appears he is trying to lean into the \"greed is good\" line of thinking where vices are actually spun to be virtues. Not only does it allow you to avoid empathy for your fellow man, it allows you to excuse your own excesses as necessary (or even good) reply prng2021 15 hours agoprev$1k, $10k, $100k. Watching this nonsensical hype at every stage left me in disbelief. Funny thing is after all these years I’m finally realizing there’s no reason whatsoever why it couldn’t hit $1M, $1B, or go back to $1. Anytime we see a dollar symbol we assume something has value like a traditional asset, tied to tangible or measurable things like material costs, a company’s quarterly earnings, etc. But cryptocurrencies are totally different. This thing’s dollar value per unit wildly fluctuates literally hourly, because it’s based purely on human emotion and speculation. reply Empact 14 hours agoparentThere is an upper limit on the aggregate value of money - somehow related to the amount of stored value in the economy. On the other hand, there is no lower limit on the value of a dollar. If bitcoin reaches $1B it will be through some combination of dollar depreciation and bitcoin appreciation. https://www.fiatmarketcap.com https://assetmarketcap.com reply JeremyNT 5 hours agoparentprevThe amount of money flowing into it has been a real shock. I too played with bitcoin many years ago, mining on my CPU. Like a sucker I got rid of it because it clearly was not useful at its stated purpose. Why have we created an economy where this kind of speculation is rewarded so highly, while it contributes nothing back to society? It's nonsensical. But once you accept that finance is kind of ridiculous (and completely decoupled from any meaningful work in the real world), you can see that there is no limit to how high it can go. reply jhrmnn 55 minutes agorootparenthttps://en.wikipedia.org/wiki/Tulip_mania - this one lasted only 3 years though reply skwee357 11 hours agoprevI'm failing to understand the proposition behind bitcoin. From what I remember, the amount of BTC is finite, so eventually we will run out of new BTCs, and by then, most will be held by big institutions and some individuals who didn't want to sell, and it will become yet another luxury commodity like diamonds or gold. Hence, the entire premise of \"Bitcoin is the future of money\" is kind of stupid, unless it's money for the ultrarich/lucky, because it's not available to the common folks. And even if it was available to the common folks, how do you expect to live in a world where your currency changes value drastically from day to day? Isn't that a characteristic of a defaulted state/currency? But let's say it's not the money of the future, but rather a speculative investment that is \"not tied to greedy institutions\". How does one sell 10 BTC and cash it out, bypassing the \"greedy banks\"? Last time I checked, most reputable exchanges are somewhat regulated, and in any way, getting a sudden $1M won't go unnoticed by the government. So yes, I am failing to understand the premise of bitcoin. It seems to fail on both as the currency of the future, as well as unregulated investment instrument. reply ArtTimeInvestor 11 hours agoparentit's money for the ultrarich/lucky Ok, so let's say you buy 1 Bitcoin today and then we end up in that future. Now 21 million minus one ultrarich lucky guys hold one Bitcoin and one stupid poor guy (you) holds one bitcoin? Or would it make you part of the ultrarich lucky club? reply skwee357 10 hours agorootparentSorry, I'm not sure if I understand your question/statement. What I wanted to say, is that in its current form, bitcoin IS money for some ultrarich people who have enough of it AND are able to access a commerce world where you can actually buy stuff with it without converting it to fiat currencies. Because last time I checked, I can't buy milk with BTC in my local supermarket, but I bet I can buy some luxury/illegal thing that cost absurd amounts of money (for the common folk) with BTC. Therefor, the mantra of \"Bitcoin is the future of money\" that's being pushed by BTC/crypto enthusiasts, is false. It MIGHT be a form of money for people who have lots of it, but not the common folk, doing everyday purchases. reply ArtTimeInvestor 10 hours agorootparentthe mantra of \"Bitcoin is the future of money\" that's being pushed I don't see that mantra used in the context of Bitcoin's market cap. In the concept of value, the aspects of Bitcoin that are relevant is that it has a broad ownership strucure, is finite in supply, is easy to store, validate and transfer. reply nicholasbraker 10 hours agorootparentThe whole \"BTC is the future of money\" ship has sailed a long time. reply ArtTimeInvestor 9 hours agorootparentI wouldn't say so. As the financial system is set up right now, Bitcoin has a lot of potential to reduce friction. For cross-country payments as well as for buying coffee: Speed, fees, finality. But the lightning network will have to mature first. We will see if the global financial system evolves faster than the Bitcoin ecosystem. I would expect Bitcoin's ecosystem to evolve faster. reply talldayo 2 hours agorootparentThe fact that Bitcoin's blockchain is unusable without unofficial, unreliable and slow L2 chains is kinda evidence that it doesn't have much potential left. If you're a serious country considering using Bitcoin, why even use Lightning at all when you could use a fundamentally better-designed currency? Why invest in Bitcoin if it's already breaking? reply ArtTimeInvestor 1 hour agorootparentIt is only unusable for small transfers. Considering it is at only 10% of the Gold market cap - which is even more unusable for small transfers - I think it would even have a lot of potential left without L2s. As for Lightning being unreliable and slow - I don't see a technical reason for it to stay this way. What do you consider a \"better-designed currency\"? reply eric_cc 5 hours agorootparentprevYou can onboard to Bitcoin with $10 in USD and use it to buy groceries. reply valval 6 hours agorootparentprevWhat on earth are you saying? Money is money for some ultra rich people who have enough of it. reply omnimus 11 hours agoparentprevIts a tradable financial asset. You are indeed right that it cannot be money. As finance people were saying from the very start. The whole point of money is that its possible to influence its price. reply tmikaeld 11 hours agoparentprevThat's the irony of it all isn't it - since it's bound to traditional currencies for it's valuation, it's essentially the same thing as a traditional currency except you can't inflate it by printing more of it. It is \"digital gold\" at this point. reply miohtama 10 hours agoparentprevIt's not about luck. I run one of the early Bitcoin exchanges in 2013. We had users from 200 countries, mostly common folks with small amounts. Everyone had a change to make 1000x. Bitcoin has been mostly widely available asset in the world. reply skwee357 10 hours agorootparentWhen I said luck, I meant people who were among the first to either mine or buy (at an affordable price) whole Bitcoins and held them until this day. It's fine that common folk can buy fractions of BTC, but these amounts won't change their lives. And anyone who can afford to buy >= 1 BTC today, is already wealthy (or stupid). reply fragmede 11 hours agoparentprevThe banks are in on it this time. You can buy crypto on Fidelity, starting with as little as $1. Whether that's better or worse than buying SP500 or QQQ or Tbills on their platform is for you to decide. So pay your taxes on $10 million, you'll still have 5 left. reply xtracto 4 hours agorootparentSo, the question one has to ask is, why aren't banks and \"serious\" institutions now behind bitcoin? If it is a scam/fad/etc? The story of Cryptocurrencies reminds me a bit of Linux: \"it was a cancer to society\" until it was not. And now everyone is adopting it and corps have fucked it with their \"open core\" offerings. I myself think that the use case of \"trustless store and transfer of value\" has a LOT of more attraction to what detractors see. reply skwee357 10 hours agorootparentprevBut that's the point I'm making. BTC was \"advertised\" as either the money of the future, which it is not, or an investment instrument that allows you to bypass government restrictions, which again, it is not, at least not for the common folks. At this point, it's just a very volatile investment/speculation instrument. reply eric_cc 5 hours agorootparent> BTC was \"advertised\" as either the money of the future, which it is not You keep casually dismissing it as money. Give it about 2 years and you’ll realize you were incredibly wrong about this take. Between country adoption, lightning, infrastructure, integrations - bitcoin is already there now but it will become undeniable in roughly 2 years time. reply cesarb 5 hours agorootparent> Give it about 2 years and you’ll realize you were incredibly wrong about this take. [...] but it will become undeniable in roughly 2 years time. I recall reading similar statements more than 2 years ago... reply WheelsAtLarge 15 hours agoprevIf you are feeling regret, don't. Very few people anticipated such a significant increase. Any profit is a good profit. Even investments that seem highly promising can end up in bankruptcy. This is one of the few that managed to succeed. reply evantbyrne 15 hours agoparentNaw man not everything is luck. People have been talking about $100k Bitcoin for what feels like forever now. When the stock market rolled back two years of gains and Bitcoin moved similarly, those who understood what they were looking at made big plays. What happens long-term now that it has hit that mythical price point is less clear. reply Gigachad 15 hours agorootparent“People have been talking about” a lot of things that never happened. If this price was truely guaranteed, then investors would have bought in as soon as the information became available. reply cypherpunks01 13 hours agoparentprevBitcoin's not had to file for bankruptcy so far. And CEO never assassinated. But you never know, crazier things have happened. reply ArenaSource 1 hour agoprevWhy all this negativity against Bitcoin? It is one of the best instruments for speculating on the extent of human idiocy. reply genghisjahn 15 hours agoprevIt’s way higher than I ever thought it’d be. I sold mine at $800 so maybe I’ve got some sour grapes here, but all this reminds me of the book “Devil Take The Hindmost.” reply Ekaros 9 hours agoparentI got something like 30k XRP for free. Then I traded that for one BTC and got 300. I could now have 100k, but oh well I never was true believer. And I am still too sceptical even with stock market... reply TacticalCoder 11 hours agoparentprevYou're talking about mania that lasted, at the very most, three years. Is it really that intellectually honest to compare tulips, which can be grown everywhere, by anyone, with \"something\" that has been designed, on purpose, to have a diminishing issuance rate? Satoshi made it very clear, in the very first Bitcoin block, that Bitcoin was a middle finger to politicians ever printing more money to bail out the banks. I see Bitcoin has the \"anti tulip\". reply genghisjahn 4 hours agorootparentHousing went up for a long time and then what happened in 2008? That wasn’t a 2-3 year mania. Everyone thought houses were “safe as houses.” The stock market rally in the 90s went up until it didn’t in the .com crash. I’m not comparing btc to tulips, I’m comparing it to things that went up a lot and then went down fast. And if you come back with “btc is different” I’ll respond with “that’s what everyone says about everything else before it crashes.” reply xnx 15 hours agoprevWhatever your theory of Bitcoin is, it has to incorporate that its 50% price increase is directly tied to the US election outcome. reply tofuahdude 15 hours agoparentI'm curious what you'll \"blame\" the next 50% price increase on. reply xnx 14 hours agorootparentNo telling what the next big move will be caused by. Feb 2024: +50%. Approval of Bitcoin ETFs in the United States Nov 2024: +50%. US election results ??? ????: ???%. ???? reply ur-whale 12 hours agorootparent> ??? ????: ???%. ???? BTC used as El-Salvador style sovereign wealth reserve reply owens99 15 hours agoprevCongrats to the everyone who had the conviction to hold Bitcoin all these years. reply jpatters 6 hours agoprevMakes me really wish I could find that wallet I mined 50 bitcoin into from my laptop back in 2009 and then got bored of because they were essentially worthless. reply TheBruceHimself 15 hours agoprevI just don't understand why you'd choose Bitcoin over gold. Gold, like Bitcoin, was criticized for just being a stupid store of value, but that wasn't completely true as it undoubtedly had some utility in the economy. Worst case comes and the market crashes, you know there's at least someone somewhere buying. What does Bitcoin get you over gold? The same \"it's scarce and therefore valuable\" narrative so you can store your wealth there, but it's not got the intrinsic value of gold. If the market crashes, you can't sell Bitcoin to someone to make jewelry or false teeth. If you want to argue that people could theoretically discover a lot more gold or bring in an asteroid one day full of it, okay, but then why not just by land then? Even better than gold, there's a potential for some income too. Or why not just go with something that's equally as scarce like vintage wine? You literally can't make anymore wine of a particular year; it's inherently scarce. reply bufferoverflow 14 hours agoparentThere are many reasons to choose BTC over gold: - easy to transmit - easy to store (but both gold and BTC are dangerous to store at home from the security standpoint) - easy to buy and sell - BTC is actually limited (capped). There's no practical limit to the amount of gold. You're always one tech breakthrough away from gold becoming very common - read the history of aluminum, they used to make jewelry out of it. - impossible to counterfeit. Even banks struggle to detect counterfeit gold - gold for payments is completely impractical, BTC has Lightning network that seems to work. - BTC is programmable reply joegibbs 15 hours agoparentprevBut how much of the price of gold is its intrinsic worth? A fake gold ring made of some alloy can look and feel almost exactly the same as a real one, but as soon as you find out that it isn't real gold it suddenly loses 99% of its value - maybe it's not magnetic or it is slightly the wrong shade, but the value of gold isn't assigned for not reacting to magnets. Only 11% of gold is for industrial purposes, so I think that if the thousands of years of cultural association of gold with wealth suddenly disappeared and people decided it was a bad investment, then it would be basically worthless. reply ur-whale 12 hours agorootparent> its intrinsic worth There is no such thing as \"instrinsic worth\". There's only supply and demand. Why there is demand for a certain good is a many-colored and complicated affair. reply Nathanba 11 hours agorootparentthere is intrinsic in the context of where we are as humans, that's why saying that there is intrinsic worth is correct. Humans need to eat, intrinsically. I guess partially it depends on whether the word 'intrinsic' still applies. reply BlueTemplar 11 hours agorootparentUsing that definition, air too has intrinsic worth. But I'm skeptical about the usefulness of this definition. reply Nathanba 8 hours agorootparentit's the only useful definition because what else would ever be useful just for its own sake? There has to be a reference point and the moment you have one, it's technically not intrinsic anymore. So we can't do that. reply BlueTemplar 7 hours agorootparentIt's not because a word exists that it makes sense to use it. The (scientific) word æther exists too, but you would only use it in a historical context. reply csomar 12 hours agoparentprevYou can’t store $100m of gold in your brain and transit through an airport with just a sneakers in your backpack. If you happen to need this, you’ll realize how revolutionary bitcoin is. reply aryan14 15 hours agoparentprevWell if you need to send someone a sum of money instantly anywhere in the world for no fees, it’s kind of unrealistic to meetup with gold bars reply TMWNN 15 hours agorootparentIndeed, when I wanted to send $2000 across the US-Canada border in 2021, I found to my surprise that doing so with BTC within Coinbase was the cheapest option. reply aryan14 15 hours agorootparentYep, even coinbase is stretching it to be honest since it’s still a centralized exchange, but still miles better then traditional options reply Mithriil 15 hours agoparentprevTo follow up on the idea. It HAS a physical tie: it is the energy spent to run the chain, which is, however, backward to gold being a material. And it's not to the advantage of the owners, but of the miners. I can easily see a catastrophic scenario out of this: a downward spiral of value happens for XY reason, and then a halving happens. That makes the mining of it suddenly highly costly, which makes it uninteresting, or less and less profitable to mine, which renders the chain slower and less popular, etc. However, I think that the popularity of Bitcoin is still on the rise, and we won't see such a downward spiral before many halvings (20 years? That's a lot of GWh lost to useless computing...) reply audleman 10 hours agorootparentYou're forgetting about difficulty adjustment. Every time mining gets more expensive large number of miners drop out. This causes the difficulty target to drop. The remaining miners then start mining more blocks and profits rise. As a system it has built-in economic incentives to keep in in homeostasis. reply ipaddr 15 hours agoparentprevBitcoin offers portability by not having to store gold. Rapid price changes. One is more stable and the other more lucrative. reply from-nibly 15 hours agorootparentThe last two things are descriptions of the markets of those things not the things themselves. reply ipaddr 15 hours agorootparentAgreed. Bitcoin is worthless unless you dig random characters. You can't eat it or wear it and it isn't used in industry. The same can be said about money or cash. reply zild3d 7 hours agoparentprevas an extreme example consider holocaust survivors who managed to escape with jewelry or gold as a \"store of value\". Then those who managed to escape but the family member with the gold did not. With bitcoin, it could be written down or even committed to memory by your entire family reply DickingAround 16 hours agoprevTINA = There is no alternative... to stocks. Lot of people lost money on long term bonds. Short term bonds are at least better than cash. Stocks are supposed to be about investing in an asset. I guess there is kind of an alternative out there. reply asenna 8 hours agoprevWhy is this post flagged? reply pm2222 15 hours agoprevSounds like btc is good for large amount of transfer as relatively low cost but not really ready for day to day expenses like gas/grocery. Yes? reply Trasmatta 15 hours agoparentPeople gave up on using BTC as an actual currency long ago. It's solely an investment vehicle now. reply stackingsaunter 11 hours agorootparentYeah, so how can you explain I use it for daily payments here in El Salvador, buying groceries, coffee and pupusas? I need to use fiat maybe once a week, otherwise I pay with bitcoin for everything reply littlecranky67 11 hours agoparentprevAnd it never will be. There is simply no point to register/log every expense at every gas station in a global, distributed ledger. Actual payments will be done with Layer-2 protocols, such as Lightning or Liquid, which are kind-of separate networks and protocols, but yet rely on the BTC network. The idea that everyone will run custodial BTC/Lightning wallets is also rubbish. In the future, there will be institutions that do what banks do today: Give out accounts, which are non-custodial wallets like your todays online banking, and settle transfers with other banks in bulk by doing actual BTC onchain transactions. Average Joe in 2040 will not run his own wallet but use an external service provider - just as Joe is not a member of the SWIFT transaction network, he will not be settling debt with BTC transactions but rather have an \"account\" and pay with whatever L2/L3 technology we will come up with. It will be like in the gold-standard days. You had the right to exchange your paper dollars for gold, but no-one ever did. Yet every transaction was backend by gold, just as every L2/L3 transaction will be backed by bitcoin, though no onchain transaction will happen. reply aryan14 15 hours agoparentprevYou’re right, but that’s not what BTC was designed for. You could use something like Litecoin, Solana, maybe even Ethereum if you’re willing to pay the fee. reply rhplus 6 hours agorootparentLiterally the first sentence of the Bitcoin paper states that it was designed for peer to peer cash transactions: https://bitcoin.org/bitcoin.pdf reply ajkdhcb2 15 hours agorootparentprevThe whitepaper shows it was intended to be \"peer to peer electronic cash\". It did clearly fail at that goal since it has none of the privacy of cash and so on. reply aryan14 15 hours agorootparentHow did it fail at being P2P e-cash? You can use bitcoin completely/as anonymously as cash if you wanted to, the same way you’d have to put in a bit of effort to have a completely anonymous cash transaction. Monero (XMR) which is a fork of bitcoin, is much closer to actual cash reply ajkdhcb2 15 hours agorootparentMonero is fine. But how can you even use bitcoin anonymously now? Even wasabi and samourai wallet are shut down as far as i know. Seems highly risky to use any tool like that since i dont know what the consequences will be in the future. Joinmarket? I'm sure it is possible but it is error-prone, takes so much effort, time and fees that i see it as a failure reply polotics 13 hours agorootparentwell you can use Bisq right? reply ajkdhcb2 7 hours agorootparentI have used it, but i dont see how it is related to being able to transact privately. As soon as you do anything linked to your name with those coins puchased on bisq, the whole batch is linked to your identity reply stackingsaunter 11 hours agorootparentprevLightning is private reply ajkdhcb2 7 hours agorootparentNot based on everything ive read. Happy to be shown evidence of otherwise reply OkayBuddy44 14 hours agorootparentprevArguably, that's exactly what it was designed for. There was a very contentious split many years ago now (Bitcoin Cash vs Core fork) regarding this point. Until then, it was taken for granted that block size would continue increasing in proportion to transaction volume in order to facilitate such use. This was Satoshi's expectation, and there was little-to-no discussion otherwise. Quite suddenly, a few powerful, well-positioned people (with conflicting interests in the form of their Lightning side-chain solution) conspired to form a consensus of limiting on-chain transaction bandwidth via astroturfing and comprehensive censorship. Whether they were responsible visionaries with the foresight to avert disaster using a novel solution, or spiteful saboteurs driven by greed and power, is up to the reader. Un/fortunately, they were very successful. reply max_likelihood 15 hours agoprevI wonder how much of the price action is due to debt funded purchases through MSTR and other leveraged ETFs (e.g. BITU, BITX)? reply throw101010 14 hours agoparentHave a look at the daily volume of trading for Bitcoin, these financial tools are a very small part of this... we are talking $50-100 billions daily. It does contribute, but in terms of scale way less than what you seem to suggest... arguably I would guess that these days the announcements of big purchases move the market more than the actual purchase itself. reply xyzzy4747 16 hours agoprevI remember when people used to first talk about Bitcoin on HN back in early 2011 or so. The price was only $2 then. Congrats to anyone who had some and held onto it this long - personally I sold off mine in 2015 (big mistake in hindsight). reply ArtTimeInvestor 11 hours agoparentbig mistake in hindsight Will you repeat it? reply paulpauper 12 hours agoparentprevfrom $5 in 2011 to $500 was a 100x return, and still 200x too early, crazy reply Uptrenda 15 hours agoprevI was there, anon... I was there 11 years ago when the $100k Bitcoin was proposed... One had only to outstretch their hand and all the Bitcoins would be yours. But the coins, it seemed, had a will of their own. The fearful and the weak were the first to fall to its power. I watched grown men cry out as their fortunes vanished in an instant, lost to the abyss of forgotten passwords and the fiery maw of exchange hacks. “It is but numbers on a ledger,” they said at first, dismissive of its allure. Yet the numbers grew, and their hearts darkened with greed. I remember the great split—the Hard Fork Wars. Brothers turned against brothers, chains rent asunder, each claiming to be the true heir of Nakamoto's vision. But it was a war without banners, fought not with swords, but with hash rates and cryptographic fire. Many were the tokens that fell, discarded like the leaves of autumn, their worth reduced to naught. I saw the rise of the altcoins, a thousand pretenders clamoring for a place in the sun. \"To the moon!\" they cried, their banners bright and hopeful. But most found only ruin, their holders wandering the barren wastes of forgotten wallets, muttering of rug pulls and false prophets. Then came the age of DeFi, and the people rejoiced, for they thought they had found a new power—a magic to rival the centralized lords of old. But it was a perilous path, anon, filled with cunning contracts and exploits that devoured the unwary. I saw kingdoms built on leverage crumble in a single night, their rulers cast out into the dark. And the NFTs! Ah, the NFTs… Each token a promise, a glimpse of eternity, they said. Men and elves alike paid dearly for these fragments of art and culture, yet many were cursed to hold only shadows, their treasures mocked by the uncaring markets. Through it all, the Bitcoin endured, its ledger immutable, its purpose unyielding. But even it was not free from the grasping hands of fate. I remember the fall of Mt. Gox, the poisoned chalice of FTX, and the whispers of whales who moved the tides unseen. Each event a lesson, each loss a tale of hubris and folly. Now, anon, as we stand upon the precipice of a new cycle, the wise and the weary tread cautiously. For the Bitcoin, though a gift, is also a burden. Those who seek it must be strong of will and sharp of mind, lest they too fall prey to its power. I have seen the rise and fall of many. I have borne witness to fortunes made and lost, dreams forged and shattered. And still, the blockchain spins, unending, unyielding, like the great Eye ever watching. Beware, anon. For the world of crypto is not for the faint of heart. It is a realm of shadow and light, where one must navigate with care, or be consumed by the fire of their own greed. reply animex 13 hours agoprevTo think I had 17 BTC at one point :-) reply equasar 16 hours agoprevNot surprised. They're minting Tether USD out of thin air to inflate the price, so it's no shock. reply echelon 16 hours agoparentHow? And why isn't that being shorted? Any prediction of when this will come crashing back down? reply lmm 15 hours agorootparent> How? People say Bitcoin is worth $100k but what they actually mean is it's worth 100,000 \"USDT\", because that's the thing you can actually exchange for it. Are those 100,000 \"USDT\" worth $100k? Well, maybe. Tether claims every USDT is backed by a US dollar. It just can't tell you where they are or let you audit them. But they're there. Honest. > And why isn't that being shorted? How would you short it? Especially given that most crypto trading platforms are going to go bankrupt when it does crash. reply wmf 15 hours agorootparentTether is bad but these aren't correct arguments against it. 1. You can easily sell BTC for 100K actual USD and ACH it out on a regulated exchange like Gemini. 2. You can easily sell USDT for actual USD on (IIRC) Kraken. 3. Technically you can short USDT via various means but you won't be able to collect any profits. reply lmm 15 hours agorootparent> 1. You can easily sell BTC for 100K actual USD and ACH it out on a regulated exchange like Gemini. 2. You can easily sell USDT for actual USD on (IIRC) Kraken. You can until you can't. As long as people think 1 \"USDT\" is worth $1, and as long as the amounts you're selling aren't too big, it stays afloat. > 3. Technically you can short USDT via various means but you won't be able to collect any profits. How? If my thesis is that USDT is going to collapse and bring down the whole cryptocurrency ecosystem, what can I buy to express that and profit on it? reply wmf 15 hours agorootparentI'm going to be deliberately vague because I really really discourage shorting Tether but you can investigate perpetual swaps and defi lending. reply lmm 14 hours agorootparentBut those are things that only exist in the crypto ecosystem. The counterparty risk is all wrong-way. Like yes, I can sign a contract with Coinbase that says they will owe me a lot of money when Tether collapses. But when Tether collapses it's probably going to take Coinbase down with it. reply wmf 14 hours agorootparentThat's what I'm saying. You can't collect the profits. reply tofuahdude 15 hours agorootparentprevIf I sell a bitcoin on Coinbase, Kraken, or any of the other highly regulated exchanges, I am sure as shit getting USD and not USDT, which does not exist on the bitcoin chain. reply wmf 15 hours agorootparentprevTether appears to be too big to fail in the crypto world and now crypto is too big to fail in the White House so if you short you are the one who will lose. reply thinkingkong 16 hours agorootparentprevOn the contrary. Your way better hedge was polymarket not hitting 100k prior to the election. reply monero-xmr 16 hours agoparentprevThe Tether Truthers never fail to spread their conspiracy. HN should just admit it got crypto 100% wrong. reply wmf 15 hours agorootparentTether admitted they loaned USDT against BTC collateral and they allowed the collateral to be delivered later (basically T+2 settlement). When the order book is shallow this is basically free market manipulation. It's not clear how much loaned USDT exists vs. regular USDT and what effect this has had on the price. reply wbl 15 hours agorootparentNot in the crypto world. Failure to deliver is rare in the exchange world but someone out there would run the long con against Tether for that. reply testfrequency 15 hours agorootparentprevBias much? reply aryan14 15 hours agorootparentprevLove the username reply owens99 14 hours agoprevWhy is this post flagged? reply cypherpunks01 14 hours agoparentBecause people on the site don't like the topic reply TacticalCoder 11 hours agoparentprevYup why is flagged? The discussion seems civilized. It looks like there aren't too many people comparing something that was designed, on purpose, with a fixed supply curve using a diminishing issuance rate and which exists since 16 years with \"tulips\", a mania that lasted 3 years (and everybody could grow tulips anywhere they want). I stand my case: Satoshi made it very clear with his message in Bitcoin's genesis block that his invention was a gigantic middle finger to politicians bailing out banks by ever printing more money. Bitcoin is the antithesis of tulips. Bitcoin is the \"fuck you\" to QE / fractional reserve banking / helicopter money / physical bills printing / bonds issuance / etc. And, so far, it's working. reply deadbabe 16 hours agoprevWhy hell does this keep going up? Can you pretty much just buy at any point in time and be guaranteed a 10x return? reply csomar 16 hours agoparentIf you hold long enough and the chain keeps working, then probably yes. However, this 10x return is guaranteed against the dollar and not real value. The gov. is committed to devaluing currency over a long period of time. reply cconroy 15 hours agorootparentThis is definitely true but btc buys you more of almost anything else too (btc/X): X is one of s&p500, housing, gold, etc. except maybe $nvda or $tsla. For example the btc chart in dollars looks the same as in gold. reply npoc 11 hours agorootparentprevNo - it's quite reasonable to project bitcoin increasing in value (not price) 100x from here. reply Mithriil 15 hours agoparentprevA part of the valuation comes from miners who gets their returns cut by half every ~4 years. They have an interest in having the price (at least) double by then. reply wmf 15 hours agorootparentI have an interest in having the price of my house double every four years but I can't just wish that into reality and neither can miners. reply fragmede 13 hours agorootparentHow much work have you put into having the value of your house double every four years? How many people are invested in your house appreciating like that? If your house appreciates, do a bunch of bankers and hedge funds also get rich along the way? How many politicians have you taken to lunch and on ski trips with the proceeds from the last time you sold half of your house when the price doubled? reply xvector 12 hours agorootparentFuck, when you put it this way, I shouldn't have sold at $20k. reply deadbabe 15 hours agorootparentprevSo how do they do it? How do they just keep doubling the price? reply latchkey 14 hours agoparentprevMichael Saylor has been doing it for years now (and is also part of the reason why this is going up). https://saylortracker.com/ reply efficax 15 hours agoparentprevbubbles go up and up and up… until they don’t reply jdenning 15 hours agorootparentBut it has been a bubble and popped/crashed/recovered 4(?) times now - it seem fair to start considering it as a cycle rather than a bubble. I don’t know much about crypto or finance, so maybe I’m completely wrong reply prawn 15 hours agorootparentI wonder if it is something about it feeling like the digital future. As long as the future never arrives, there's always some potential? Other bubbles were pegged to more well-defined trends? reply stackingsaunter 11 hours agorootparentThere's nothing future about bitcoin. It exist today, works well today, you can use it for payments, buy a house and in some places pay off your debt or credit card. reply pontifier 14 hours agorootparentprevAnything held in Bitcoin is one misplaced key, or hacked wallet, or broken algorithm away from being worth precisely zero. reply npoc 10 hours agorootparentWith power comes responsibility. You want to own something? You need to be capable of keeping it safe. If not entrust it to someone who is and hope they don't steal it. The same goes for everything in life. The fiat banking system has demonstrated what it does when we trust it with our fiat money. It steals it (through zero-reserve banking aka infinite debasement). With bitcoin I can audit the wallet they hold for me at any time (public keys) and know that they can't debase it. reply thrance 15 hours agoparentprevRemember that this is a zero-sum game, for every winner that made it big, they are thousands more that had to pay up for their success. reply Ekaros 9 hours agorootparentIt is really negative sum game. As there is constant drain from mining, in buying and then operating equipment. Lot of that is not recovable and do not actually improve anything. reply Mithriil 15 hours agorootparentprevI don't believe it is zero-sum.. Or at least, not rigourously. I feel the Market Capitalization of BTC must have been bootstrapped at some extent. It seems impossible to me that the sum total of what people have paid to have their BTCs to be more than $2.02T. In other words, the value the market gives it has given value to BTC out of nowhere. reply YZF 13 hours agorootparentEach transaction has a buyer and a seller. So in that sense it is a zero sum game. However the total market cap can go up and down and create value out of nothing (just like stocks). reply robjan 13 hours agorootparentprevMarkets are not a zero sum game. When the price goes up, it goes up for all holders. reply tobyhinloopen 11 hours agorootparentThe price goes up (or down) because someone bought a stock at that price... For every buy, there's one sell. For every win, there's a loss. reply robjan 5 hours agorootparentA transaction is zero sum, the market is net positive. For the market to be zero sum, the market cap would have to be constant. If I buy something from someone for $1 then sell it to you for $2, I gained a dollar and you own a share that's worth $2. reply cesarb 4 hours agorootparent> If I buy something from someone for $1 then sell it to you for $2, I gained a dollar and you own a share that's worth $2. It's easy to see that this is nonsense: I could buy a widget from someone for $1, then turn around and sell it to my brother for $10000, does that really mean the widget is now magically worth $10000, and we doubled our collective holdings? No, what actually happened is that we together still have that same $10000, plus a worthless $1 widget. reply robjan 4 hours agorootparentOnce again, the trade is within the context of a market and the market values the \"widget\", Apple Stock, Oz of gold or whatever as whatever people are willing to pay for it. That's how markets work. Individual Opinions are largely irrelevant. reply thrance 9 hours agorootparentprevAnd when you sell, it goes down for everyone. I don't consider you richer until you cash out your bitcoins for real money. reply xenospn 15 hours agoparentprevWe haven’t run out of greater fools just yet reply eric_cc 15 hours agoparentprevnext [3 more] [flagged] stopping 15 hours agorootparentCould you elaborate on this a bit more? reply jdenning 15 hours agorootparentNot OP, but I assume they are arguing that all fiat money is inherently unsound reply Mistletoe 16 hours agoprevCongrats Bitcoin! You just can't overestimate the power of one really good idea. https://bitcoin.org/bitcoin.pdf reply paulryanrogers 15 hours agoparentWill people see it as good in hindsight? When coal plants have dumped more waste in the air and oceans, just to drive the value of these tulips? reply Mithriil 15 hours agorootparentBTC is not sustainable, that's true. However, the world is now aware of decentralized ledgering tools, and other projects have worthwhile technologies and use cases. I just wish they would drop the energy consuming ones... reply rvz 15 hours agoprevThe problem with the anti-crypto absolutists is that they just watched Bitcoin and the entire crypto industry go up once again and they did nothing but complain. They are real quiet today. No where to be seen this time and probably sulking that they ended up on the wrong side of the trade. (again) Well done to those who did not listen to their cope. reply zahlman 15 hours agoprevNothing ever seems to come of discussing this topic on HN - just the usual cycle of people arguing with each other over whether BTC \"ought to\" (by what ontological principles?) be worth what it is (or, for that matter, anything at all), or what social impacts it has, etc. None of that has anything at all to do with the current spot price. That's just an excuse to \"debate\" the topic again by pulling out the same old arguments. Several other submissions intended to report the same simple fact were flagged and killed. Why not this one? reply jaredklewis 13 hours agoparentWell I mean, is there anything to discuss about the spot price itself? Stocks, bonds, and other assets also regularly reach round, base 10 values, and I can't think of any substance in these events generally worth discussing. Bringing out the usual flame wars seems as good a move as any. reply echelon 16 hours agoprevHere we go again... Hopefully this pulls competition away from the space I'm in and back into crypto. The last time crypto crashed, crypto folks flooded into generative media and we kind of became associated with them. I'm just trying to make tools. reply z2 16 hours agoparentIf crypto has this much staying power despite the crazy hype, any AI winter would appear to be a long ways off! reply colesantiago 15 hours agoprevIt is still a pyramid / ponzi scheme. Sell while it is still high. reply some-guy 16 hours agoprevIs there way to quantify how much of the economy these days is \"bullshit\" (purely speculative assets), and if we are at peak bullshit now as a percentage of total economic activity? reply robjan 13 hours agoparentFor traditional stocks, you can use the PE ratio and other fundamentals to see how detached the market is from reality e.g. https://www.multpl.com/s-p-500-pe-ratio reply WiSaGaN 14 hours agoparentprevUnless you see gold as bullshit as well. I think it should now be consensus that Bitcoin isn't acting as a transaction tool, but as a store of value, just like gold. There are pros and cons when comparing it to gold as a store of value. But the main thing that keeps up the \"value\" of Bitcoin is just the belief that \"it is a store of value\" itself. As long as people continue to believe this, it doesn't need to have traditional value. This is the same as gold. Bitcoin in this sense is even more pure, because gold still has some industrial and consumer uses, while Bitcoin has zero. This belief may or may not persist in the foreseeable future, but it is what it is now. Thinking this is \"bullshit\" just doesn't really matter. reply throw101010 14 hours agorootparentI'll add that if gold wasn't so impractical to transfer, store and verify we would most likely still be using it as a currency way more frequently (even in our inflatuonist systems, it would likely be seen as a more sound money). Bitcoin improves a lot on all of these properties while introducing other properties (open/public network, borderless, public ledger, etc.). Its supply/issuance has also been much more stable than Gold ever was (and ever will be if we're to believe the predictions of giant mines and even future asteroid mining). reply xyzzy4747 15 hours agoparentprevThe entire economy outside of agriculture and real estate is basically \"bullshit\", if you really think about it. The ratio of bullshit to everything else seems to increase over time, though, as a general trend. It's probably correlated to technology. reply gmays 15 hours agorootparentReal estate can be speculative as well. A better way to state that might be \"things outside of productive assets and services\" are increasingly speculative. The bright side of this that has me excited is what seems to be a growing sense of optimism about the future, driven by AI entering the public conscious, Space X's \"rocket catch\" etc. There seems to be a growing belief that the future can and will be better, more so than a decade ago. reply BlueTemplar 10 hours agorootparentYou seem to be very confident about your memory of a decade ago. And wasn't the first SpaceX rocket retrieval even more impressive, and a decade ago ? EDIT : Yep, in 2015. (And today, a rocket beat a record : doing its 24th flight and retrieval.) reply paulryanrogers 15 hours agorootparentprevThis seems reductive. Things do get more abstract, yet there is a spectrum of naunce: oil, vehicles, clothing, etc. reply xyzzy4747 15 hours agorootparentFor countless millennia, humans didn't need anything more except food, some very basic tools, a place to live, and other humans. You could argue that everything since then is layers and layers of bullshit. Bitcoin is just another one. reply Ekaros 9 hours agorootparentHumans did also need fuel(wood mostly). Often this was reasonably easy to get. But still involved labour. As such storage of energy that can be released at will do have value think of coal, oil and gas. These as such are not \"bullshit\". Water might be other one. But now that is cheap enough, even with desalination. reply paulryanrogers 14 hours agorootparentprevI'm arguing the general point is shallow and not useful. IMO BitCoin is designed to fail as a currency with it's mining costs, and a bad idea as an investment since exchanging it is such a house of cards. Never mind that holding any significant quantity invites dangerous people with wrenches. reply sampullman 15 hours agorootparentprevIf agriculture is required, so is shipping. I'm not so sure about real estate. reply mbil 15 hours agorootparentprevAgriculture and real estate would not exist in their current forms without the mammoth apparatus of the entire economy surrounding them. Maybe you mean food and shelter are the only non-bull parts of the economy. Nomadic bands might find them bullshittish. And grain stores require soldiers to guard them, soldiers require weapons, weapons require metallurgy, mining, surveying, transport, etc. Pretty soon there’s a whole lot of something but I don’t know that it’s bullshit. It feels more like layers of increasing abstraction away from the source of the value: energy. reply xyzzy4747 15 hours agorootparentEven with nomads, they had territory they could live in or not live in, based on the existence of other tribes. I was clumping that in with real estate. Even animals do this (for example wolves). And obviously in the feudal system land was a big deal. And yes technological arms races exist but they are often power games between governments, although in some cases a tribe could become a genocide victim if nobody wants to participate in the military effort. So in that case I agree it's maybe not bullshit, but it depends on the behavior of the neighbors. Energy is a free source of energy from the sun plus it gets stored for free in various ways (such as vegetation). So that doesn't really have to be factored into the discussion. reply ericra 15 hours agoprev [–] Honestly, this is just repulsive. Crypto has brought nearly zero benefits to society and has made income inequality even worse. Not to mention the environmental impact. I don't see how any reasonable person can celebrate this. Ask yourself who is benefiting most from this. reply stackingsaunter 11 hours agoparentJust because you don't see the benefits, it doesn't mean they are not there. You don't know how bitcoin affected people's life and how they use it. reply throwme_123 15 hours agoparentprevYou can't be more wrong. If anything, from my personal experience, \"crypto\" brought financial resources to minorities, especially PoC in the US. Some of them would never had that chance in the traditional world if you identify to that cause. reply aryan14 15 hours agoparentprevDecentralization helps a lot of people who may be under government pressure/being monitored, for example if you’re an anti-government russian journalist, you’d ideally use crypto as they would be able to freeze your assets. Lots of citizens of sanctioned countries aren’t able to use their credit/debit cards to shop online outside of their country, paying with crypto or even using something like a SolCard fixes that. It’s also generally convenient, there’s no other realistic and accessible way to transfer any sum of money, whether $10 or $10M, for a $2 fee nearly instantly. reply eric_cc 15 hours agoparentprev [2 more] [flagged] wmf 15 hours agorootparent [2 more] [flagged] eric_cc 15 hours agorootparent [2 more] [flagged] aryan14 15 hours agorootparent [–] Adding onto this: BTC also has a limit on top of the release schedule, there is a limited amount of BTC that can ever be minted/in circulation. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [],
    "commentSummary": [
      "Bitcoin's recent surge past $100k has reignited debates on its value, with discussions focusing on its role as a speculative asset versus a store of value.",
      "The rise has prompted conversations about wealth inequality, the environmental impact of cryptocurrency, and its potential as a decentralized financial tool.",
      "Despite mixed opinions, Bitcoin's growth continues to draw attention, with predictions of further increases and warnings about its inherent volatility."
    ],
    "points": 134,
    "commentCount": 294,
    "retryCount": 0,
    "time": 1733366514
  }
]
