[
  {
    "id": 42398952,
    "title": "Gukesh becomes the youngest chess world champion in history",
    "originLink": "https://lichess.org/@/Lichess/blog/wcc-2024-round-14-gukesh-becomes-the-youngest-world-champion-in-history/cDggdNZw",
    "originBody": "Community blogsBlog topicsLiked blog postsLichess blog Eng Chin An WCC 2024 Round 14: Gukesh Becomes the Youngest World Champion in History Lichess12 Dec 202426148,589 viewsEnglish (US) ChessAnalysisChess PersonalitiesOver the boardTournament GM Gukesh D pressed a slightly better endgame for a long time against GM Ding Liren, who blundered unexpectedly into a losing king and pawn endgame. Lichess is providing a live stream for every day of the world championship. Make sure to tune in to our Twitch or YouTube channels for live stream coverage with our hosts GM Felix Blohberger and IM Laura Unuk, joined by a rotating panel of guests. Today's round was covered by our hosts GM Felix Blohberger and IM Laura Unuk and guest GM Ivan Cheparinov. The annotations by GM Yannick Gozzoli can be found at the bottom of the article. Schedule Stream Match Score Recap GM Ding Liren once again had to defend a pawn-down endgame against GM Gukesh D after he was slightly better out of the opening. Ding chose to liquidate quickly into the pawn-down endgame and after a long struggle, he blundered abruptly as he allowed a rook trade into a losing king and pawn endgame. Clips https://www.youtube.com/watch?v=KrQ0W0f2qEs More clips at the bottom of the article. A Long Endgame Squeeze and a New World Champion The transfer of the crown Photo: Eric Rosen For the second time in the match, Ding tried 1. Nf3, signaling his intention to sidestep major opening theory. After Gukesh’s principled 1...d5 reply, Ding played in the style of the hypermodernists, who eschewed pawn central control in favor of piece central control, by playing a fianchetto. As Gukesh continued to play classically with 2...c5 and 3...Nc6, Ding finally put a pawn in the center with 4. d4, and White found himself playing the Reversed Grünfeld — the Grünfeld Defense but from the White side. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#7 A tale of ... Photo: Eric Rosen ... two storms Photo: Eric Rosen It seemed clear that Gukesh was not at all surprised by Ding’s choice as he kept playing quickly, responding to the Reversed Grünfeld with a very concrete idea: clarifying the central tension with 5...cxd4. Following Ding’s 6. Nxd4, Gukesh once again shocked the world with another opening surprise and near-novelty: 6...Nge7!?. While a very strange-looking move, Gukesh’s idea was clear: to get rid of one pair of knights by playing 1...Nxd4 2. Qxd4 and then 2...Nc6 to gain a tempo on the queen. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#12 6...Nge7, where have I seen that before? Photo: Eng Chin An Ding allowed Gukesh’s plan and put a pawn in the center, which was Stockfish’s recommended move. Gukesh followed through on his plan and, continuing to play quickly, went for 9...d4, gaining space and again showing that he was in deep preparation. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#18 Deep preparation Photo: Eng Chin An Ding responded logically with 10. e3, challenging Gukesh’s grip on the center. After the central tension was resolved and Black’s bishop made its home on d4, it became obvious that White had a slight advantage as his light-squared bishop had a wide scope. Meanwhile, Black’s bishop was hemmed in by its own pawns, one of the key positional themes of the match. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#23 Is every game a French? Photo: Eng Chin An Ding then proceeded to develop his dark-squared bishop while also gaining a tempo on Black’s dark-squared bishop. Said tempo did not matter too much as Black could afford to lose a tempo because White was already quite underdeveloped. With Gukesh’s bishop making it way to d4 once more, Gukesh’s central control looked quite powerful and ensured that he would never be significantly worse. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#30 The final stand Photo: Eng Chin An With 16...e5 and Black’s light-squared bishop now having the potential to develop, Ding had to act quickly if he wanted to gain any kind of advantage. 17. Qd2! and 18. Nd5! were two good moves that helped Ding further his goals, but Gukesh was alert and played the momentum-shifting and well-timed 18...b5! pawn break. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#36 Time to bail out? Photo: Eng Chin An A long, almost-forced computer line may have given White a nominal advantage with chances to play on, but at that point, Ding must have felt that there was not much left to play for, so he initiated a sequence of mass liquidation that started with 19. cxb5. Following 22...Rb8, the position looked very equal and the game looked to be heading toward a draw. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#44 Maybe there's more to play for? Photo: Eric Rosen However, as is frequently the case in such positions, there are a lot of ways for both sides to falter — and if not outright blunder, there are a lot of ways for one side to make the draw that much more difficult to achieve. Unfortunately for Ding, Gukesh’s rapid activity meant that he had to contend with a strong b4 pawn, which was able to freeze White’s queenside pawn majority. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#50 There is definitely more to play for. Photo: Eng Chin An After Ding’s 26. a4, it was evident that Ding wanted to defend a 3 vs. 2 rook (+bishop) endgame just as he did in yesterday’s round — except that with the addition of bishops, the position becomes slightly tougher to defend. Practically speaking, such a decision cannot be faulted because if one were to keep material parity with a move such as the engine’s 26. Rd3, matters could quickly get out of hand, especially with time trouble looming. Going into a 3 vs. 2, as long as the worse side’s defensive technique is up to par, can be a much better and more pragmatic choice. Having said that, Ding definitely did not want to have to make this decision after he was slightly better just a few moves ago. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#51 Ding was not looking forward to defending such a position. Photo: Eng Chin An A few more “pretend” moves were played before the basically inescapable 3 vs. 2 rook + bishop endgame was on the board — there were other possibilities, of course, but the way both sides were playing, it was apparent they were both heading toward that position. On move 32 and with 22 minutes for 8 moves left, it was time to see if Ding would be able to hold the position. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#63 Gukesh squeezed and squeezed. Photo: Eng Chin An ... And hold the position he did not. If one were to replay the game with engine analysis turned on, one would be under the false impression that Ding always had the draw in hand and mere perfunctory moves were being played. Such is surely not the case, though, and we again refer the reader to our stream of the event to follow all the twists and turns of this endgame. Indeed, Ding's blunder came about because of the tension, though of course his fellow elite chess players, such as our guest commentator Ivan Cheparinov, were critical of his blunder. https://lichess.org/study/embed/LtsCRK9D/YaARFAYu#109 Gukesh could not contain his excitement! Photo: Eng Chin An First he paced. Photo: Eng Chin An Then he shook hands. Photo: Eng Chin An Then he took it in. Photo: Eng Chin An And he cried. Photo: Eng Chin An And finally he cheered! Photo: Eng Chin An Annotations by GM Yannick Gozzoli https://lichess.org/study/LF4x850G/HCFmWifD#0 Press Conference Ding remained as gracious as ever in defeat. Photo: Eng Chin An Gukesh's childhood dream of becoming the world champion has been fulfilled! Photo: Eng Chin An Some memorable quotes: GM Ding Liren: I think I played maybe my best tournament in the year. I could be better but considering yesterday's lucky survive it's a fair result to lose in the end. No regret. I will continue to play. GM Gukesh D: Firstly I would like to say a few words about my opponent. We all know who Ding is and, you know, he has been one of the best players in history for several years. To see him struggling, to see how much pressure he had to face and the kind of fight he gave in this match. It shows what a true champion he is. This match, champions they always step up to the moment. Obviously in the past two years he hasn't been in great shape, but he came here. He was obviously struggling during the games, he was probably not at the best physically. But he fought in all games. He fought like a true champion, and I'm really sorry for Ding and his team. They put on a great show. I would like to thank my opponent first. This couldn't have been the same without my opponent. I'm just living my dream! I will have to prepare my speech first. With the kind of emotions I'm feeling right now I'll say something stupid! I just looked at Vishy Sir and Magnus and thought it would be really cool to be there one day. I wouldn't change a single thing about my career. I can't thank them [my parents] enough. Prediction We predict that Gukesh will win this match. More Clips https://www.youtube.com/watch?v=G2yhXrTrz8k https://www.youtube.com/watch?v=hOwMH2KwWrU MastodonGitHubDiscordBlueskyxYouTubeTwitch Lichess is a charity and entirely free/libre open source software. All operating costs, development, and content are funded solely by user donations. Discuss this blog post in the forum More blog posts by Lichess 11 Dec 2024 WCC 2024 Round 13: Gukesh Misses Some Chances As Ding Defends Tenaciously GM Gukesh came close to winning against GM Ding Liren, but Ding defended well and the game ended in …9 Dec 2024 WCC 2024 Round 12: Prescient Ding Makes His Own Destiny GM Ding Liren bounced back after yesterday's loss against GM Gukesh D with a very accurate game.8 Dec 2024 WCC 2024 Round 11: Ding Blunders a Piece in a Complicated Slugfest After GM Gukesh D and GM Ding Liren played a fighting opening with a lot of twists and turns, Ding, …7 Dec 2024 WCC 2024 Round 10: A French-Like London An interesting moment marked what was otherwise a very solid game from both GM Ding Liren and GM Guk…",
    "commentLink": "https://news.ycombinator.com/item?id=42398952",
    "commentBody": "Gukesh becomes the youngest chess world champion in history (lichess.org)529 points by alexmolas 5 hours agohidepastfavorite222 comments seanhunter 4 hours agoThat was a absolutely horrible finish to a really exciting championship if you ask me. For anyone who doesn't know, there was a lot of drama because Gukesh was playing amazingly coming into this (eg winning the gold medal on board 1 at the olympiad in crushing style) and Ding had been playing terribly. Then there were 13 games of back and forth with stalwart defending and imaginative computer preparation by both sides, playing a lot of fresh chess and both of them going for the most critical and challenging moves in each position. Ding was playing a lot better than a lot of people had expected and the previous game had been one of the best games in a world championship for a long time. Everything was tied going into the last game of the classical portion and the \"bar room consensus\" was that since Gukesh was so young and doesn't focus at all on the faster forms of chess (rapid and blitz) and is therefore much lower rated than Ding in those formats, that if this game was a draw then Ding would be a substantial favourite in the ensuing tiebreaks. The final game was a complex struggle, with Ding keeping everything in lockdown with the white pieces so as not to give Gukesh a ghost of a chance. Most of the pieces had been traded and it was the most drawish of drawn endgames. Gukesh was up a pawn, but they both had a rook and bishop and all Ding had to do was hang on to his pieces and keep them well away from the enemy king. On the stream I was watching IM David Pruess had just been asked by someone in chat whether Gukesh could win and he said \"1% chance\". Then all of a sudden Ding made 3 bad moves in a row. The first two were just poor endgame technique, putting his rook and bishop both on bad squares too close to the enemy king, then the real blunder. Completely inexplicably he traded off the pieces. Now he was in an endgame that was just dead lost. After 14 games of 4+ hours each It had gone from being a dead draw with him a big favourite in tie breaks to all over in a few seconds. reply ANewFormation 1 hour agoparentThis really misses the key drama of what happened in the last game. Ding had a perfectly safe position where he could try to squeeze Gukesh pretty much endlessly with basically 0 risk. He then, completely inexplicably, went down a forced line which led to the final phase of the game. In this phase the position was drawn with perfect play, but that is completely irrelevant because it is really tough to play. And more importantly in this phase, Gukesh was the side pressing to win with all sorts of interesting ideas. Ding, by contrast, left himself in a position where he's now going to be tortured for hours, has 0 chance of winning, and a single lapse of concentration means you lose. And that's exactly what happened. Engine evals are really misleading in these sort of positions because it says it's completely equal, which it objectively is, but white/Ding will lose that position with some degree of regularity, while black/Gukesh had 0 losing chances. So in practical terms equality is not really correct. reply tomatovole 1 hour agorootparentIs there a metric I can look at in engine evaluations to determine when a situation is \"risky\" for white or black (e.g., the situation above) even if it looks equal with perfect play? I've always been interested in understanding situations where this is the case (and the opposite, where the engine favours one side but it seems to require a long, hard-to-find sequence of moves. Playing out the top lines helps if equality requires perfect play from one side. reply jawarner 1 hour agorootparentYou can measure the sharpness of the position, as in this paper section 2.3 \"Complexity of a position\". They find their metric correlates with human performance. https://en.chessbase.com/news/2006/world_champions2006.pdf reply nilslindemann 1 hour agorootparentprevThe metric is to play the position against Stockfish. If you draw it again and again, it is trivial, otherwise, not so simple :-) reply esfandia 1 hour agorootparentprevMaybe the difference between the eval of the best move vs the next one(s)? An \"only move\" situation would be more risky than when you have a choice between many good moves. reply fernandopj 27 minutes agorootparentThat's it exactly. Engines will often show you at least 3 lines each with their valuation, and you can check the difficulty often just from that delta from 1st to 2nd best move. With some practical chess experience you can also \"feel\" how natural or exoteric the best move is. In the WCC match between Caruana and Carlsen, they were at one difficult endgame where Carlsen (the champion) moved and engines calculated it was a \"blunder\" because there was a theoretical checkmate in like 36(!) moves, but no commentator took it seriously as there was \"no way\" a human would be able to spot the chance and calculate it correctly under the clock. reply Leary 1 hour agorootparentprevhttps://live.lczero.org/ reply fernandopj 22 minutes agorootparentThis is great, but I think that % is about the \"correctness\" of the move, not how likely it is to be played next. reply hilux 40 minutes agorootparentprevNot really – that's the point, engines, for all their awesomeness, just do not know how to assess the likelihood of \"human\" mistakes. reply EGreg 54 minutes agorootparentprevYes, it’s called Monte Carlo Tree Search (MCTS used by AlphaZero) instead of AlphaBeta search (which is what classical chess engines used) reply elcomet 28 minutes agorootparentThose are tree search techniques, they are not metrics to assess the \"human\" complexity of a line. They could be used for this purpose but out of the box they just give you winning probability reply xmprt 27 minutes agorootparentprevNot the mention the time trouble that Ding left himself in once again. This time Gukesh ended with almost a full hour over Ding. When you put yourself in a tough position, no matter how drawish it is in theory, you need to have enough time to figure out the ideas of the position and with only 10 minutes left and 30 seconds per move, you might slip up and make a quick move when you really needed to think harder. reply systemvoltage 1 hour agorootparentprevChess engines should come with another metric bar: \"The twitchy-ness\" of the position aka the gradient of primary eval metric as you pareto the possible moves from best to worst. The stronger this gradient, the more risky it is to play, and more changes to make a mistake. reply staunton 1 hour agorootparentThis ignores the question how hard it is for a human to find the best (or a \"good enough\") move. It's easy to find games with 10 \"only move\" 's in a row where even a beginner could easily have played all if them. reply __s 1 hour agorootparentSure, but it's a start on adding nuance to eval beyond minmax reply Sesse__ 1 hour agorootparentprevThis is not a new request; many people, including engine authors, have suggested it throughout the years. The problem is that it's seemingly very hard to reliably quantify something like this and propagate it throughout the game tree. reply JoshTriplett 32 minutes agorootparentprevhttps://news.ycombinator.com/item?id=42401469 reply 8note 1 hour agorootparentprevengines arent great at that. they spot the beat move, and if you dont do it, it keeps spotting that same great move until your opponent notices it. reply hilux 42 minutes agoparentprevI disagree completely. In the eyes of some modern fans, the popularity of engines and eval bars has reduced chess to an intellectual and computational exercise. It's too easy to say \"bad moves\" and \"blunder\" when Stockfish is giving you all the answers! In reality, chess is a fighting contest between two flesh-and-blood humans. And that's what we see throughout this exciting match, and in this final game. Gukesh won because of his greater fighting spirit throughout the match, which is as it should be. (Similar to how Ding played the daring move ...Rg6 in the final game of his match against Nepo.) reply benatkin 9 minutes agorootparentThat isn't how most appreciate sports. People are hoping for the contenders to be at the top of their game towards the end of the championships. Nobody says \"Hey, at least this has a human touch! I'm sick of basketball video games.\" if the NBA finals are relatively boring one year. I think maybe \"that was a absolutely horrible finish\" got interpreted as saying that the win wasn't well earned. That's not how I saw it at all. reply MrMcCall 4 hours agoparentprevGukesh took him into the deep water the entire time, putting every possible strain on Ding's energy and reserves. It was the unrelenting pressure of an 18yo badass that cracked Ding, whom I truly feel sorry for. He is a great player and a very, very nice human being. What is crazy is that Gukesh has only been playing chess for a little more than 11 years. ETA: And Ding fought like a lion! reply awongh 2 hours agorootparent\"only 11 years\"... that seems like a lot to me, although reading further down in the thread it seems like it might take twice or three times as long to get to a very high level. Do people in the chess community measure players by number of years playing? Are there expectations of how long it takes to get to a certain level? (besides world champion) reply neaden 2 hours agorootparentIt's hard to put it in numbers since high level chess players start very young, it's basically considered impossible to become a titled player learning chess as an adult, with a slight exception for high level players from similar games transferring over. So becoming the youngest champ and becoming the champ in the shortest time are very similar. For comparison Magnus started playing chess at 5 and became WC at 22. reply ANewFormation 1 hour agorootparentIt's 100% possible to become a master starting as an adult, but it requires a certain sort of person - you're looking at thousands upon thousands of hours of difficult work paired alongside endless frustrations, obstacles, seriously low emotional lows the game can cause (think about how Ding feels right now, even if it wasn't a game for the title), and more. The idea of becoming a master, especially as an adult, is far more appealing than the reality of it for most people. reply awongh 1 hour agorootparentprev5-22- so 17 years instead of 11. Quite a difference! Can any of that be put down to advances in training tech that wasn't around when Magnus started playing? reply ANewFormation 1 hour agorootparentIn spite of claims to the contrary there is luck in chess. Your form (and your opponents') varies significantly over time, the outcome of competitive opening prep, or even just how well you're sleeping. The stars really aligned for Gukesh in countless ways, his form and openings hit when and where they needed to, and he was left playing a very out-of-form world champ who wasn't even in the top 20 in the world. I suspect his record (world champ at 18) will remain intact for many decades yet to come. He attributed much of his success to God, and even as an agnostic - I'm inclined to agree! Notably he's still nowhere near the strongest player in the world - he's not even the strongest Indian! The world championship in chess can be an odd beast at times. reply BurningFrog 2 hours agorootparentprevGukesh is born in 2006, so he started playing at 7. reply mindfulmark 3 hours agoparentprevDisagree. Gukesh was constantly putting pressure on Ding to find defensive moves and Ding finally made a mistake. The fact that it happened when it did just makes it even more dramatic. We know from the other matches that Ding is capable of finding them, and the fact that he didn't just highlights that they're both human, both under extreme pressure and that it's not just mindless computation. reply seanhunter 3 hours agorootparentI'm not sure we disagree at all. Gukesh's strategy throughout the match was to constantly ask difficult questions and the surprise really was that Ding didn't fold earlier. reply codeulike 2 hours agorootparentSo why call it a horrible finish? reply seanhunter 2 hours agorootparentBecause as a chess fan and just as a human being my heart goes out to Ding Liren who seems like a genuinely likeable and nice human being who has been open about the tremendous struggle he has had with mental health etc since winning the world championships. To pull himself out of a hole that deep and play really great chess for 13 and 9/10s matches and then lose it with a blunder at the last second is awful. And I say that as 100% someone who wanted Gukesh to win from the beginning, which is a result I think is great for chess and I think is “objectively correct” in the sense that he has played better chess and has been (apart from Magnus Carlsen and his compatriot Arjun Erigaisi who is also a complete monster) the story of the chess world for the last year. reply lacksconfidence 2 hours agorootparentprevBecause the ending was pretty meh. All this excitement, and then Ding just flubs up an end game that most super gm's should be able to draw against stockfish. The best finale's are often when two players at their best duke it out, and one comes out on top. This was simply not Ding's best. reply mindfulmark 2 hours agorootparentprevI guess I was just disagreeing with your opening sentence, the rest was spot on. reply cyrillite 3 hours agoparentprevIt felt much more like forced error than unforced error or, thematically, the closest thing I’ve seen to a milling strategy in chess. Just make them keep drawing until they’re out of ideas. reply thom 1 hour agorootparentIt was a forced error in the sense that Ding forced that exact endgame for no real reason and then fluffed it with 10 minutes on his clock plus increment. What's incredibly sad is that Ding clawed his way back into the match in game 12 by doing exactly what you describe - he created a horribly cramped position, refused to release the tension, and eventually Gukesh ran out of good moves and lost without any egregious blunders. reply wavemode 1 hour agorootparentprevI disagree. There were forced errors in this match, yes. But this final game's endgame wasn't an example of that. Ding collapsed of his own accord. reply taneq 2 hours agorootparentprevI'm explicitly not a chess player but this reminds me of Dave Sirlin's \"Play To Win\" where he starts by explaining that if doing a thing makes you not lose, you do that, and then eventually by definition you win. reply pharrington 1 hour agorootparentThat kinda works for fighting games, since draws are rare, as the players need to either double KO or timeout with the same exact amount of health. Chess is very different in theres (at least) 3 ways to draw, and it's very easy to fumble a won position into a draw. reply fsckboy 2 hours agorootparentprevchess has a lot of draws, and plenty of drawish strategies. Playing to not lose will not at all lead to winning. reply chongli 2 hours agorootparentYes and if all you can do is draw in the world championship then you’ll be in trouble when the faster time controls are brought in to resolve the match. reply seanhunter 2 hours agoparentprevIf anyone’s interested in what a GM’s thought process on the game looks like there’s a really great recap here which was produced without engines [1] https://youtu.be/97RZHG2rcbc?si=O41BRi2EC8Ryu0v2 [1] With the intention of trying to as honestly as possible replicate the situation for the players where obviously they have to think for themselves and don’t have access to an engine while playing. reply 8note 1 hour agorootparentyou can also take a look at anish giri's recaps: https://youtu.be/EQDpuPzps88?feature=shared he streamed watching most of the openings, and kept his own eval bar on the side, occassionally checking his lines against strong engines reply fasdfdsava 4 hours agoparentprevWow great synopsis. Sounds like Ding just ran out of mental stamina just before buzzer. reply the_clarence 3 hours agoparentprev> imaginative computer preparation Are people training AIs to play in the style of the people they're going to play against so they can practice? reply Fade_Dance 3 hours agorootparentNo, they use chess engines to find interesting lines of play that the opponent presumably is not prepared for. Say, an odd move that looks weak, but a few moves later is back at even, and the player that pushed down this line is now prepared to play on from there (with perhaps further traps laid ahead), while the opponent is somewhat in the dark and has to analyze the situation correctly. reply optimalsolver 2 hours agorootparentHas anyone tried playing one of these \"chess engines\" against a human? We may have an opportunity to cut out the middleman here (no pun intended). reply neaden 2 hours agorootparentTo be clear the high level chess engines are so far above the best humans that there isn't a point anymore. reply 8note 1 hour agorootparentprevi think theres something interesting for chess engines to cut out a middleman. the players have \"seconds\" who are doing things like finding and picking prep for the players to memorize. currently, theyre GMs/super GMs who are somewhat playing against each other, but i think you could train an AI look at lines for ones that the opponent might miss, or that would trip them up reply Fade_Dance 30 minutes agorootparentWeirdly enough, that's a thought that I'm having in financial trading as far as using AI for idea generation. At first glance, charting the future possible moves of a chess game is just a huge branching tree, but humans (and engines that don't have the power to fully brute force the game) use filters to trim the tree. Some lines are dead ends, even though they may play out for a while (sacrifice both rooks and the game is over, no need to follow those branches). There is also a sort of heat map and gravity to some of the lines, in that there are likely directions that players will travel in (paths where you don't give away too many pieces, where the king isn't exposed, etc). Machines can help highlight specific areas where there are branching points that lead in many viable directions (these are the critical decision-making points in a game of chess), that are deceivingly hidden behind lines that look dead for a while. It would output a sort of heat map, and the search could even be tweaked for certain variables, such as for number crunching complexity (if the opponent is a bit weak there) or pathways into brutal end-game scenarios (if the opponent is weak there). This is a microcosm for the real world as well. Lines through time have reflexivity and can reinforce each other. A geopolitical situation can reinforce an economic situation which then feeds back into the political situation. Take something like inflation which tends to do that. But when humans normally look at the world, they see in a sort of normal distribution that is oversimplified. It's commonly understood that humans downplay the left and right tail risks (as explained by Taleb), but it's more nuanced than that. It's more like the chess game, in that there are these hot spots of complexity and interesting situations throughout the forward probability distribution. Some of these hotspots are deceivingly hidden, because only one multiple possible situations unfold do they feed back into each other and create something emergent. Back to an arena like trading, participants tend to track each possibility line independently of one another, which makes sense because humans are siloed and specialized to some degree. Technology like machine learning has the ability to synthesize this data and spit back out hot spots, just like in the chess example. The short-sighted conclusion that most will have is to say \"Great! Let it give me a list of trades, and then we can back-test it.\" when I'm pointing out is that there is a lot of value when it comes to idea generation and efficiently mentally traversing the future probability space. Spending your time focusing on interesting places. Maybe a traitor would look at an implied outcome distribution and realize \"Hey, I think that this little part of the curve is underpriced. Maybe I should hedge this specific outcome, because I have exposure to the inputs that feed into this underpriced emergent possibility.\" Of course, the trading example is also an abstraction from the raw real world, but it's a bit more close to reality than the chess example. Really, I think that this approach to using machine learning as a tool could be applied to many areas. Even more creative areas could potentially benefit from it. reply vunderba 1 hour agorootparentprevAre you serious? https://en.wikipedia.org/wiki/Deep_Blue_versus_Garry_Kasparo... reply bamboozled 2 hours agorootparentprevHas anyone tried playing one of these \"chess engines\" against a human? Million times a day ? reply michaelt 1 hour agorootparentprevNormal, regular chess engines are sometimes called AI. Or at least they were back in 1997. And people have certainly made themed variants of these chess engines, which purport to simulate certain famous chess players. Right now you can visit https://www.chess.com/play/computer and play a Hikaru-themed chess engine - or a MrBeast-themed chess engine. I don't know how deep the simulation goes, though - they might all just be the same engine with a different difficulty setting and a different icon. reply bonzini 1 hour agorootparentThe bots are tuned differently to be a bit more tactical or more positional, and they have an opening book that follows the preference of the chosen player. reply manojlds 34 minutes agoparentprev> imaginative computer preparation by both sides There was almost no preparation from Ding side. It was very weak. reply zmgsabst 4 hours agoparentprevI think it was thematic of the match: The whole time, Ding had failed to seize advantages and been low on time — something criticized by GM Hikaru Nakamura. In this final game, those two things caused him to blunder in a complex endgame seeking a tie against Gukesh who had nearly an hour of advantage on the clock and been relentlessly pressing the whole match (and continued that pressure, into the endgame). That’s a strategy, not mere misfortune. And personally, I’m glad it was decided in the match rather than tie-breaks. reply TeeMassive 3 hours agoparentprevThat's the most exciting and well written description of a chess game I've ever read! reply paulsutter 2 hours agoparentprevChess really baffles me Most of the more sophisticated people I know are completely disinterested in sports. Not that they dislike sports, it just never occupies their mind. Sports is a purposeless activity for kids Chess is different from sports in only one way: the loss of very intelligent capable people who could be helping to create the future. Chess is even more tragic than the olympics. reply chongli 1 hour agorootparentI'll take smart people playing chess any day over those people choosing to go into the tech industry where they spend all their time building addictive products that drive ad impressions. I'd love it if they put their talents to work by going into medical research, chemistry / materials science, or even political science and try to take meaningful steps towards making the world a better place. That route seems to be a lot less popular these days and obviously compensation has a lot to do with it. reply not_kurt_godel 1 hour agorootparentprevIntelligent people who create the future must choose that path for themselves. Chess isn't preventing people from making that choice. If chess didn't exist, most chess players would probably just be playing some other game instead of STEM careers or whatever your definition of creating the future is. Also plenty of very strong chess players do ultimately wind up pursuing other career paths. And then there's also the fact that a good number of the top chess players have shown themselves to be highly dysfunctional people who are unfit for the professional world such as Bobby Fischer and Vladimir Kramnik. reply paulsutter 1 hour agorootparentThe stereotype of the absent-minded professor is a great illustration of how norms view the world. What WE see as focus, norms see as .. not conforming? Focus is crucial. To be great at chess you need to focus on it. To be great at creating the future you need to focus on it. By definition you can’t focus on both If you aren’t sacrificing, you aren’t focusing. I’m not saying you need to sacrifice everything else. But definitely you need to choose very carefully. ps. Creating the future is easy to define. Look at OpenAI, Starship, Optimus, mass scale photovoltaic manufacturing in China. Someone had to make those happen and it took focus reply 11101010001100 1 hour agorootparentNevermind all that we learned from teaching chess to a computer. Ya a total waste. reply nileshtrivedi 37 minutes agorootparentWe literally had a chemistry Nobel Prize winner crediting chess for making him curious about thinking and intelligence and ultimately to find DeepMind. reply fooker 1 hour agorootparentprevNot everything has to have a purpose. That most of the society thinks so is a failure of our systems. reply vunderba 40 minutes agorootparentprevYawn. This banal criticism has been leveled against chess and really the pursuit of any game since the dawn of recreational activities. https://en.wikipedia.org/wiki/Paul_Morphy reply wbl 1 hour agorootparentprev\"To play chess is the mark of a gentleman. To play chess well is the mark of a wasted life\" reply crdrost 57 minutes agorootparentprevHonestly this sounds like a knock-on effect of the US's constant erosion of the glue of community. Church attendance down, sport attendance down, theater attendance with friends down, it's all the same. Social norms can change this -- the Netherlands has a very similar culture to the US, But one thing people asked me while I was doing my M.Sc. there was just, \"what is your sport?\" ... and I got asked it enough that I eventually got one, and then for a good period of time I managed to completely kick my obesity, until I moved back to the American Midwest. The introvert/extrovert axis also plays a role in what sort of \"sport\" is right for you, of course, and many of your sophisticated friends still hit the gym or jog etc. -- those are just sports for introverts in my view. Sport time is not, time that could have been better spent elsewhere. It's like how cleaning the sink isn't time that could have been better spent elsewhere -- if you don't have a clean sink, you'll pay the interest in terms of \"ugh what's that smell [...] oh it was the standing water in this bowl\" and \"crap I don't have a clean glass, hm, I wonder if I can just buy compostable cups on Amazon so that I don't have that problem...\" etc. So as an extrovert, I can go once a week to play soccer with friends in a small league, or, just hear me out, I can get lonely and then do what I do when I get lonely, which is pop on Physics Stack Exchange and answer physics questions so that I can feel Of Use. You pay the interest either way. Chess-time also is no great loss for the world. The top-level world chess community is something we have numbers for -- 17k titled players, 2k grandmasters, 4k international masters beneath that. They are pursuing something that exactly fits the nerdy way that their brain works -- memorize openings out to 20 moves deep, obsessively study and re-study their failed games to understand why the computer thinks they lost and how they might make better mistakes in the future, and for them it HAS to be competitive and they HAVE to have that immediate feedback of trying a new idea in the same narrow niche of ideas that they became a super-expert-in, against another top player who can punish their new mistakes. It's just not a set of transferable world-changing skills. It's like, my brother became single-mindedly obsessed with pool in High School. This persists even though he now runs a small company operating a strip mall. This was just his thing, he loves that there is no upper bound to how much control he can have over the cue and the balls, using the spins of each to control the layout, and precisely planning a course through a 9-ball break and setting himself up for a clean sweep through the game. There was no world in which some \"world-changing create-the-future\" lifestyle, would have felt as much of a glove fitting his hand to him, as this did. And it is no great loss for the world that he found the glove that fits his hand. It's not like the strip mall would have become an American retail empire rivaling Amazon, if only he had spent his nighttime hours working on the mall instead of on his life passion. For comparison, probably most of the people in the bottom 10% performance bracket at Google are being told and pressured \"you need to do more, more, more, you're gonna get fired if you keep those low numbers up\" and at 180k employees, that amounts to 18k people that, unlike top chess players, probably _could_ flourish and do better in some smaller scrappier company, but because America doesn't have a social safety net to speak of, they feel like \"well I got the dream 6-figure job, I better hold onto that until my knuckles are white because if I got fired, Bay Area rent and cost-of-living could bankrupt me in 3 months.\" And that's literally just one megatech company, not even talking about the world of people Graeber argues are doing \"bullshit jobs\" etc. etc. reply nomilk 4 hours agoprevI was struck by Ding's thoughtfulness, objectivity and humility when asked how he felt after the match (while clearly utterly dejected): > How do you feel? > I think I played my best tournament of the year. I think it was a fair tournament in the end. I have no regrets. > Any message for fans? > Thank you, I will continue to play, I hope I can show strength like this time. Gukesh was equally as objective, humble, and gentlemanly in victory. These attributes are what makes chess and its superstars so appealing. reply rob74 3 hours agoparent> These attributes are what makes chess and its superstars so appealing. I would say that what you just described is usually called \"sportsmanship\" and is pretty common in most sports (with exceptions of course, but at least most would agree that it's an ideal worth aspiring to) reply cenamus 2 hours agorootparentA lot of exceptions sadly. But with the amount of neuroticism you see with top athletes that's to be expected I suppose reply eitally 42 minutes agorootparentI disagree. I think what you're saying are \"a lot of exceptions\" are primarily going to be in what are historically referred to as \"revenue sports\" in the US -- football & basketball -- and also in individual sports where personal marketing is key to financial success (e.g. sponsorships). I don't see it as unexpected for there to be big egos and boisterous personalities in sports where individuals are hugely rewarded for personal success. From an athlete's point of view, creating a commercial persona is almost as important as performing at their best on the field/track/bike/pool/course/etc. reply MrMcCall 4 hours agoparentprevAbsolutely. Nepo and Magnus seem to be cut from a different cloth, although Magnus has never had a moment where he could demonstrate whether or not he can be humble, because he has always just crushed. Anish Giri kind of took a shot at Magnus (with respect to his retiring from classical chess) in his early commentary with Petr Leko a few days ago. People are funny, and one doesn't usually get to be where Ding and Gukesh are without having a bit of an edge to their personality. That's what makes Ding and Gukesh so special to me. reply ummonk 3 hours agorootparentMagnus doesn't usually direct his frustration at others (except in the infamous Hans Niemann game) but he has been known to storm out of interviews after some of his bad losses. reply wongarsu 2 hours agorootparentHe sometimes lets the chess speak for itself /s reply robertlagrant 3 hours agorootparentprevEveryone looks humble compared to Hans, though. reply MrMcCall 16 minutes agorootparentHe certainly has created a bit of buzz. reply ignoramous 4 hours agorootparentprevYou are quite the Chess enthusiast; I enjoy reading your comments! reply hbn 5 hours agoprevFor being the headline, they sure hid his age pretty well. Not at the opening paragraph nor end of the article, nor photo captions near the top or bottom. cmd+f \"years\" 0 results cmd+f \"age\" 0 results And scanning for numbers is useless since most of the article is chess moves written out. reply bmacho 4 hours agoparentFor someone who has complained a LOT about this information not being readily available, you haven't put it here for us either. reply Salgat 2 hours agorootparentYou bothered to comment but didn't bother to help either. Here, I'll do it, Gukesh is 18, Ding is 32. reply beepboopboop 1 hour agorootparentDo didn’t reply to the OP so I had to look one thread deeper reply neofrommatrix 1 hour agorootparentprev18. The answer is 18. reply gnaman 5 hours agoparentprevfor anyone wondering hes 18 reply Jorge1o1 4 hours agorootparentthank you! reply wongarsu 3 hours agorootparentprevFor context, legendary Magnus Carlsen was 23 when he first became world champion. Ding Liren, the other finalist and previous winner, is 32. The title holder before Magnus was Anand who first won the title at age 31 (or arguably 38, depending on your stance about the PCA). Kramnik before him was 31. Legendary Garry Kasparov was 22. It's normal for the champion to get his first win in his early 30s. Getting it in your early 20s is how you become famous beyond the chess world. Doing it with 18 is seriously impressive. reply Certhas 3 hours agorootparentThe comparison to others comes with a caveat though. The best player in the world is not participating in the current WC format. reply 12345hn6789 37 minutes agorootparentprevWhy wasnt Magnus in this tournament? Surely this would be impressive if the headline was: Youngest champion ever beats current best chess player. Instead it's new champion crowned after legendary chess play does not partake in said competition reply vlovich123 12 minutes agorootparentSame reason it was Nepo and Ding last time. Combination of he wants to give other people the ability to compete for it, him not having the same interest for what it takes to prepare for such a tournament, and FIDE refusing to adjust the format to make for what he thinks would be a more interesting tournament. reply dhosek 3 hours agorootparentprevSo my son has 7 years to set a new record. (I’m not really expecting that, of course.) reply boringg 4 hours agorootparentprevSeems like its not that big of an accomplishment relative to the way the headline makes it (obviously a big personal accomplishment). I figure 18 year old chess should have the mental abilities and maybe experience at that point to be able to rise to the top... reply zanellato19 3 hours agorootparentHAHAHA Only an HN comment could call the youngest person ever to do something would be said to \"not that big of an accomplishment\". How would you change that headline? reply smus 2 hours agorootparentNot nearly as big of an accomplishment as that guy reducing latency by 3.7% on the legacy microservice at work reply dtquad 2 hours agorootparentprevTo really put it in perspective right now is the hardest and most competitive chess era in history thanks to computer-aided practice and international popularity. reply chatmasta 2 hours agorootparentIt’s not the most competitive world championship though, since Magnus opted out of playing it. If previous champions had similarly opted out of defending their championship at the age of 30 then maybe the average age of champions would have trended downward and this wouldn’t have been the first 18 year old champion. reply borski 3 hours agorootparentprevHe’s only been playing chess for 11 years. That’s very impressive. reply jstanley 1 hour agorootparentprevYou think materially everyone over the age of 18 who plays chess ought to be good enough to be world champion? reply robertlagrant 3 hours agorootparentprev18 is young. It's impressive. reply nottorp 4 hours agorootparentprev... but you can infer from the HN post title that it's unusual. reply boringg 3 hours agorootparentAgreed. I think all the people who don't like my take i offer this. Blasting a headline like that typically implies like a 13-14 year old. This is impressive but its not some massive upset - 18 is a grown adult for all intents and purposes (brain still developing true…) reply willy_k 49 minutes agorootparentNo one said very young. Youngest is a comparison, and having 6 years on the previous youngest is massively impressive. reply boringg 31 minutes agorootparentIs it though? You can play so many more games now with computational aid and speed up your learning rates. I'm impressed but this isn't the same as coming from another era -- this feels like technology pushing the learning rate for younger people. reply roughly 1 hour agorootparentprevAll intents and purposes not requiring the brain, then. Which one is chess? The only people who consider 18 year olds fully grown adults are 18 year olds. reply nottorp 4 hours agoparentprevI suppose in the usual lichess watchers bubble, everyone knows who Gukesh is and how old/young he is :) reply lxgr 2 hours agoparentprevThe article seems geared towards people at least already somewhat invested in either chess or the world championship, given that it's on a chess website and everything. That said, click either name in the article and you'll land on their respective Lichess profile, which prominently features their age. reply pjmlp 4 hours agoparentprevMy point exactly. reply nsmog767 4 hours agoparentprevcame to the comments to try and find the answer, still don't see it lol reply nashashmi 3 hours agorootparentsomeone answered it 1 hr ago: 18. reply offbymuch 3 hours agoprevRemarkable to watch the reactions in real-time, of both players and fans from India at the moment the decisive move is played. https://www.youtube.com/live/5-uuDuGQLQA?t=14497s. Only started following chess due to the covid shutdowns, much for fun from a fans point of view than I had imagined it would be. Having the computer evaluation at the side really helps novices like me to know what's going on, interestingly a case of superior computer players helping as mere mortals to appreciate the game. reply roughly 51 minutes agoparentThat’s a fantastic video - to see both of them see it in real time is incredible. The visible emotion from both is really something. reply gwd 2 hours agoparentprevWow, that's a really fun video -- thanks! reply silveira 2 hours agoparentprevWow. Thanks for this links. This is amazing. reply MrMcCall 4 hours agoprevWow. What a match. Been watching with my son, a chess lover since we started watching the Magnus-Fabi match. Now, my son loves his chess club and has retired me from playing :-) Two thoughts: 1) Gukesh took Ding into the deep water the entire time. Few people realize how draining chess is, especially at that level for this time control. It's beyond gruelling. Only programming is more difficult ;-) 2) Gukesh had an extraordinary advantage. His mental health and resilience over the course of the match were a testament to it. And, then, his graciousness, thankfulness, and humble joy demonstrated the Way. It was That which Gukesh first thanked in his post-match interview with GM Mo. It was how he first began each game. And That was the difference. That said, being 18 didn't hurt either :-) reply chairmansteve 2 hours agoparent\"Only programming is more difficult....\". Programming is definitely easier for me. In chess, my ego gets in the way. I hate to lose. reply linguistbreaker 2 hours agorootparentWriting good prose can be similarly taxing. reply zem 1 hour agorootparentway more imo reply BurningFrog 2 hours agorootparentprevProgramming is easy. There is no opponent! reply runekaagaard 16 minutes agorootparentRust's borrow checker? reply rossdavidh 1 hour agorootparentprev...although that means you can't wear your opponent down. The computer will always still be there, not doing what you want, no matter how long you draw things out, it will never screw up and start working because it's tired. But I agree that programming is (usually) easier than chess, certainly at these levels. reply vlovich123 1 hour agorootparentWhen you’re programming it’s an open book exam where the opponent is reality. You have all sorts of resources available to you and even the computer itself can help you find problems in your solution and you generally have as much time as you need. Chess is a closed book exam where your opponent is another human and you have a fixed amount of time to answer questions and managing that is as as important as asking and answering questions. The question asked is who prepared better and who understands the game better and playing the man is a better strategy typically than playing reality (ie they often make suboptimal moves to try to screw up preparation ideas). Different kinds of taxation but programming would generally be easier because there’s not as much pressure. reply veidelis 1 hour agoprevFirst of all, I have the greatest respect for the two individuals who played their hearts out in this event. Personally, I'm on the side which thinks that this format is a total stagnation. Maybe the new no-increment under 40 moves is an improvement, but overall it does not count. I agree with Carlsen that the format has to be drastically changed to determine who is the better player. Much more games, shorter games. Fischer said a long time ago that chess is dead. Considering how deep some of the variations go into theoretical territory, I can surely relate. Magnus has also expressed that it's very hard to find novelties. I'm also totally on the side that Fischer Random (chess 960) has to be included in this tournament. I believe that ultimately it will happen - sooner or later. Magnus also said that he thinks that his match with Caruana was of extremely high quality - those 14 games were all draws. I totally understand why Magnus didn't want to defend his title. On the other hand I can't comprehend how FIDE let this happen because a lot of people don't think of current tournament as high as they maybe should be, just because Magnus is not participating. That's a shame. Not on Carlsen, not on chess. On FIDE. reply MP_1729 49 minutes agoparentReally funny people complaining about classical chess, I don't know which games they have been watching. Nepo Magnus game 6, Nepo Ding many many games, Nepo Caruana draw on round 14 of candidates. ALL OF THEM WERE TERRIFIC GAMES. I don't understand what people mean by stagnation reply Halian 1 hour agoparentprevI think something like game/30 would be better, but I’m not terribly edumacated on the intricacies of classical chess time controls. reply alex1138 5 hours agoprevAt 18, this is no small thing. Kasparov was 22, I don't see Gukesh's record being broken for a long while reply ourmandave 4 hours agoparentWith 12-year-old GMs running around it's hard to know how long. https://en.wikipedia.org/wiki/Chess_prodigy reply philipwhiuk 4 hours agorootparentThere's a decent gap between GM and world champion to be honest. reply wongarsu 3 hours agorootparentBut also a big gap between 12 and 18, so who knows reply epolanski 3 hours agorootparentprevAbsolutely, a huge one. But still, chess is a game that favours young people that have more energy and can calculate more, and that peak is achieved in one's late teens. reply frakt0x90 1 hour agorootparentprevThere's also a decent amount of controversy around really young GMs. Basically that their parents game the system by choosing official tournaments with burnt out GMs with low ratings so they can get their norms easier. Mishra recently had a lot of backlash from top GMs with those types of accusations. If that's true, those players will likely never reach the top ranks, but who knows. reply david-gpu 4 hours agorootparentprevThose statistics blow my mind. For reference, Bobby Fischer became a GM at fifteen. reply verbify 4 hours agorootparentOnline and computer chess have changed things. 12 year old kids generally can't travel to tournaments, but they can play against other strong players or against the computer online. Fischer lived in New York, and therefore could play in the Manhattan Chess Club. reply MrMcCall 4 hours agorootparentYes, they amass thousands upon thousands of games at a very young age. I did the same programming my C64 in 8th-10th grades. The hours just fly by, doing what you love. One other factor is that 3500-level chess engines are freely available for anyone with the net to analyze every situation, every move. And then there are the streamers like Hikaru who teach chess so brilliantly. He is a true one-off, to be that top-level and able to live-comment his own blitz games. It is an underappreciated and completely unique talent, and enlightening for the chess afficianado. reply bmacho 4 hours agorootparentprevYes, they didn't know this back then that it was possible. If they had known, they would have certainly made Fischer a GM much much sooner reply DevX101 2 hours agoparentprevWe're still relatively early in the chess engine era and there was an explosion of new young talent discovering chess in the covid years. I expect to see more young chess prodigies. reply keybored 3 hours agoparentprevDidn’t Kasparov say that he doesn’t consider this a World Chess Championship since the best player isn’t playing? reply mythz 4 hours agoprevI enjoyed the entire match and was surprised to see Ding putting up such a good fight given his poor form going into the match and Gukesh's great form after leading India to gold at the Olympiads. Ding was inconsistent at times but had moments of brilliance where he played like an engine, unfortunately he also exhibited poor time management throughout the match and failed to capitalize on his chances where he instead seemed content to play for draws whereas Gukesh would take every opportunity to play on, even when it would require taking a slight disadvantage. Unfortunately the last game was lost more than it was won, as Ding was looking for every chance to draw where he gave up a pawn in order to trade queens and a pair of rooks to go into an equal pawn down end game, which he eventually blundered under time pressure. It's a common sentiment in chess that to get a draw you have to play for a win, ultimately Gukesh's tenacity to keep games going and applying constant pressure eventually rewarded him as history's youngest Chess World Champion. reply FactolSarin 5 hours agoprevWhat is the deal with Gukesh's last name? It's officially listed as just D on his FIDE profile. I asked a couple Indian coworkers who said it was probably just being abbreviated for being long, but honestly it's not that long of a name and Gukesh isn't from the same region as them. I've read elsewhere that Telugu speaking people don't really use last names. reply __rito__ 2 hours agoparentGukesh's last name is Dommaraju. It's his family surname. He is a Telugu person by birth, but he grew up in Chennai, Tamil Nadu. In the state of Tamil Nadu, people often take their father's given names as their last names, and always write it in abbreviation. Indian last names often disclose caste, and due to a widely influential movement in TN (see [0]), most people of TN gave up using caste-based surnames, and switched to solely using father's names. But, the father's name is often written as the first letter of that name, and the person is called like that in official places, too. Among friends, colleagues, teachers, etc., only the given name ever is used. As Gukesh grew up in Chennai, he used his last name like that. His parents also use one name only. Anecdote: my distant cousin, a Bengali, also grew up in TN. His parents also Tamilized his name. His name was, say, Rama Dass, and he went by and put his name as D. Rama, or Rama D. When their family moved back to Bengal, his name was Rama Dass again. Srinivasa Ramanujan's given name was Ramanujan, and Srinivasa was his father's name. [0]: https://en.wikipedia.org/wiki/Periyar reply meta_x_ai 12 minutes agoparentprevAs a South Indian My name (in public school records) till I was age 21, was .I was forced to pick the last name for passport purposes and typically i either have the option of attaching my dad's name or my dad's town name. My wife, didn't even do that and when she migrated to US, she wasLNU (short for Last Name Unknown). While applying for greencard we decided it was too much of a hassle for her and she attached her father's name reply matrix2596 3 hours agoparentprevYes. I am Telugu and family name is usually not written or called out. So he would usually write D. Gukesh or Gukesh D. Most people also have a sort of middle name for example D. Gukesh Kumar. Middle name is spelled and used for calling together with main name. reply alephnerd 5 hours agoparentprev> What is the deal with Gukesh's last name In Tamil Nadu, an initial is often used in the surname due to the Periyar/Dravidian movement in the 20th century. Furthermore, plenty of people in Tamil Nadu historically didn't even use surnames. Gukesh is Telugu, but his family are Chennai natives. Chennai becoming part of TN instead of Telugu-speaking Andhra Pradesh was very politically charged in the early days of India. reply FactolSarin 4 hours agorootparentAh, so it's an anti-caste thing? reply devsda 3 hours agorootparentNot everything in India is/have to be about an individual's caste at all. The most plausible and likely explanation is that it is just shortened initials of surname for convenience. Typically indian teachers have a habit of turning surname to initials to deal with multiple students having same names. Those names tend to be sticky and students just refer themselves with initials in such contexts. I'd be very much surprised if his official government IDs have initials and not surname. reply alephnerd 3 hours agorootparent> I'd be very much surprised if his official government IDs have initials and not surname Not necessarily. He's from TN. Initials are fairly common. reply alephnerd 4 hours agorootparentprevHistorically yes. But in 2024 it's just a naming convention now. Being Telugu in Tamil Nadu, they probably adopted Tamil naming conventions to make life easier. States in India are basically different countries, and the existing state borders for most states don't make sense. reply benatkin 4 hours agorootparentReminds me of falsehoods programmers believe about… https://github.com/kdeldycke/awesome-falsehood reply atulatul 3 hours agorootparentThis is good. reply __rito__ 2 hours agorootparentprevMy distant cousing, a Bengali, named, say, Rama Dass, also grew up in Tamil Nadu. His name was Tamilized to D. Rama or Rama D.- even though Dass was a family surname. > States in India are basically different countries, and the existing state borders for most states don't make sense. No. Huge oversimplification there. It's not definitely like oblasts of Russian Federation. Although they are not close like OR and ID. reply alephnerd 1 hour agorootparent> No. Huge oversimplification there I mean culturally and administratively. Heck, in my ancestral state, non-natives cannot purchase land. > It's not definitely like oblasts of Russian Federation It absolutely is. Heck, my ancestral state (HP) is a merger of 3 entirely distinct ethnic communities (Lower Himachalis who are the same community as in Jammu division, Upper Himachalis who are closer to Garwhalis and Kumaounis in Uttarakhand, and Changtang Tibetans in Lahaul/Spiti/Kinnaur who should be merged with Ladakh) with no rhyme or reason because it was a bunch of Himalayan hill states that where conquered by the Sikhs, Nepalis, and later British in the 19th century and merged into Punjab, and this has caused political deadlock. This is a common situation all over India. There's no reason that Purvanchal is lumped with Awadh, that Rayalseema is lumped with Kosta Andhra, or Barak Valley is lumped with Assam. My Pahari family has no traditional culture in common with a Gujarati from Saurashtra or a Bihari from Bhojpur. These ethnic (and linguistic) differences do impact internal mobility outside of Tier 1 cities. India has been very successful thanks to it's diversity, but most states still hold colonial era borders which exacerbate regional inequalities by giving regional interests an ethnic or even religious tinge (eg. Seemanchal and Bihar). reply __rito__ 29 minutes agorootparentYou took an extreme example (HP). But only a handful states in India have that restriction where outsiders are not allowed to buy land. There are many all-India services and people are transferred all across India. Many work in different states than those of their home state. Same Constitution, same legal framework. Same religion. I think if you go deeper you will notice the unifying characteristics rather than superficial differences among states of India. And while I differ with you on Indian states being very far aways from different Russian states in terms of similarity/differences, I definitely agree with your opinion that Indian state borders don't make much sense. reply leosanchez 16 minutes agorootparentprev> that Rayalseema is lumped with Kosta Andhra, They share a common language ? reply xdennis 4 hours agoparentprevWikipedia says his full name is \"Gukesh Dommaraju\". reply jedberg 57 minutes agoprevSince there seem to be a lot of chess nerds in here, I have a question. Why didn't Fischer chess ever take off? A lot of comments in here amount to \"he went slightly off book and it was amazing!\". Wouldn't Fischer chess take the game to a whole new level, making it so that all the opening books are useless and the midgame requires much more improv? reply judofyr 11 minutes agoparentMany different reasons: 1. The biggest one is probably that there is already so much interest and depth in regular chess. \"Everyone\" focuses on it, so that's what your friends know and where you can find competitions and community. This leads to a chicken-egg problem where it hard to kick it off. It's basically like another board game. 2. Some opening positions in Fischer chess are quite awkward: The pieces are on squares where it takes a while for them to come into proper play. This can make the opening phase quite unsatisfying to play. You need to make a lot of extra moves before you actually get into the interesting parts. It's not necessarily more \"fun\" to play this way than regular chess. There's also some positions which are much better for white (although it's on average more balanced I believe) 3. IMO, regular chess is easier for lower-rated players. The choice of openings don't matter so much (either way the game is decided by someone hanging a piece), and it's a lot easier to follow existing games. In Fischer chess it can be even harder to know \"okay, what do I do?\", while in regular chess there's both general principles and systems to follow. This means that most newer players keep being exposed to regular chess instead of Fischer chess. > Wouldn't Fischer chess take the game to a whole new level, making it so that all the opening books are useless and the midgame requires much more improv? Magnus Carlsen is promoting and advocating for Freestyle Chess (same game as Fischer chess, but with different name): https://www.freestyle-chess.com/. Maybe it'll take off. reply hilux 38 minutes agoparentprevIt still might - that is an ongoing debate at the top of the chess world. For instance, Magnus Carlsen, the world number one by rating, is a fan of Fischer chess aka Chess960. reply MP_1729 48 minutes agoparentprevBecause tradition is incredibly important. reply amrrs 3 hours agoprevIt was quite sad to see Ding lose at the end. But it's been a very tough year and half or so. Precisely since he won the championship. I was quite sad at the way some very top players spoke of him. But the way he came back and almost took the game to tie breaks was unbelievable as a Ding fan. At the end of the day, it's generational shift that chess is witnessing. Almost written in destiny that it all started with candidates about how Alireza played against Gukesh and where it is now! reply krishnasangeeth 3 hours agoprevIMHO Gukesh is a great role model for everyone. Determination and humility shining right through. Though I really like Ding, it just felt that Gukesh was pushing more for a win in all the games and probably deserve this slightly more. Now hope that Magnus comes back into Candidates and we we have a Gukesh vs Magnus match in 2026. reply vlovich123 1 hour agoparentThe way that the game has been played and FIDE ignoring his feedback about format makes me think that’s unlikely. Magnus has been fairly critical about the quality of play in many games and that the play has been boring. He’s also talked about the importance of making space for the next generation of talent to have something to strive for because of how dominant he still is. reply ken47 2 hours agoprevIt seems like Team Ding's strategy was to survive until tie breaks, where he would have been the favorite. Given Ding's form, they probably didn't believe he could reliably win games in classical versus an in-form Gukesh. As such, Ding went for draws in multiple games with clearly superior positions that someone like e.g. Magnus Carlsen would have played out and won. I'm sure they regret that strategy now. reply gizmodo59 5 hours agoprevWhat a match! It was sad to see the blunder by Ding. Reminded me of Nepo dropping pieces in the tie-break last time. But its a great sportmanship by Ding as he said its a fair outcome given all the games they have played. reply nilslindemann 1 hour agoprevI am not happy with this result (quite the blunder deciding this match) and in general who played for the crown here. Ding is not in the top for a while now and Gukesh has rarely played in Top GM tourns. The silent champ (Magnus) is still around, winning tournaments. \"World champion\" currently means \"some lucky Top GM\" and not \"the undisputed number one\". reply nilslindemann 1 hour agoparentOk, admittedly, in blitz and rapid Ding is quite close to the top. reply thom 1 hour agoprevFor anyone that wants to test their mettle, the FEN of the key position in this game was: B7/8/4b3/4kp2/5Rp1/6P1/1r6/6K1 w - - 16 55 Give yourself 10 minutes and 30 seconds increment as White and see if you can hold against Stockfish on maximum difficulty. reply selectnull 5 hours agoprevIt was painful watching Ding Liren blunder the rook and realize what he had done. reply ceronman 5 hours agoparentIt was. But he had 9 minutes vs more than an hour for Gukesh. The entire match has been Ding defending miraculously, I thought it was a matter of time before he eventually failed. The fact that it happened on the last moves of the last game, it's definitely hard for Ding, but fair for Gukesh IMO. reply ronald_raygun 5 hours agorootparentWell it sounds like an instance of \"your keys are always in the last place you look, because then you stop looking\" reply timerol 2 hours agorootparentThis was game 14, they were tied almost the whole way, and this was the only time Gukesh won with the black pieces. Before the match, the expectation was that Gukesh would take an early lead and never look back, with the match ending before game 14. This morning, the expectation would be that Ding would make an easy draw with white (as he has done in 5 of his games as white already, winning the other), and it would go to tiebreaks. Having the championship decided by a decisive final classical game is pretty rare. The last time it happened was 2010. reply qup 4 hours agorootparentprevThe match was more than one game reply nebulous1 4 hours agorootparentprevOverall I agree, the entire match seemed to be Ding defending. Gukesh kind of failed to capitalise the whole way through though. wrt the time, this is kind of a bread and butter endgame. Ding shouldn't have blundered here with 10 minutes on the clock. Highly unlikely he would have blundered this two years ago. reply selectnull 5 hours agorootparentprevAgree completely. reply chilmers 4 hours agoparentprevAmazing to watch Gukesh as well as he realised the opportunity. At first confusion and disbelief, then excitement, joy and nervousness as he tried to calm himself down and take the win. reply MrMcCall 4 hours agorootparentAnd the graciousness to keep his joy in humble reserve, knowing how much Ding would be crushed. Truly a young man of God. reply fernandotakai 5 hours agoparentprevi felt for ding, even though i was cheering for gukesh. i was so sure it was going to go into tiebreaks. reply selectnull 5 hours agorootparentI was looking forward to rapid, wanted more drama. In the end, Ding deservedly lost. He was constantly low on time; managed to play excellent in losing positions for the whole match but it took only a single mistake to lose the crown. One can do miracles only a few times before it fails. reply justhw 3 hours agoprevHere's a really good explainer video of the blunder at the end. https://youtu.be/FJU4BXsZCvg?si=qC961oYH3wkB6Vyk&t=925 reply benatkin 11 minutes agoprevsurprised guke.sh isn't taken reply teleforce 1 hour agoprevMoral of the game, don't ever put white bishop in the white coner, or black bishop vice versa in the end game because it can be forced to sacrifice. reply laydn 5 hours agoprevTerrible time management from Ding Liren in the most critical game of the match, leading to a very simple blunder. Painful to witness. reply trey-jones 5 hours agoparentApparently poor time management throughout the match, though I didn't see every game. It sounds like he was lucky to survive 6-6. reply epolanski 3 hours agorootparentHe wasn't, Ding has played some terrific chess during this tournament. But honestly both players lack an end game killer instinct. reply tech_ken 4 hours agoprevWhy would you spoil match 14 for me like this T_T reply coldpie 4 hours agoparentYou're not the first to say this here, and I've been trying to think if there's a good solution to the problem. The headline could be something like, \"Chess world championship winner declared.\" But I'll be honest, I probably wouldn't have clicked on it without the \"youngest\" hook, which is exactly the problem you're talking about. I don't know. Tough problem :) reply wavemode 1 hour agoparentprevI empathize. The first thing I did when I opened my eyes this morning was watch a recap of the game, since I knew something somewhere (social media, reddit, youtube, etc) would probably have a headline that would spoil it. reply SubiculumCode 4 hours agoparentprevThe solution is to stay off the computer, or at least news websites. Sports scores always get pushed into your face from unexpected locations reply sourcecodeplz 1 hour agoprevCongratulations Gukesh! Amazing run, truly living a dream. reply epolanski 3 hours agoprevIt's quite surprising what the brain can do to people under stress. Everybody, even chess amateurs knew that the rook trade was a blunder instantly, yet pressure can play such terrible jokes. reply univalent 3 hours agoprevTwo of the most humble, kind, professional players. And a great match. reply sumodm 2 hours agoprevFYI: Gukesh is 18 yrs old and the youngest World Champion. He is also the 18th champion, in its 138 years history. reply hu3 4 hours agoprevDid Magnus not compete? reply dentemple 4 hours agoparentTo add a little more color... Magnus, in recent years, has been expressing his dislike for chess under classical time controls, seeing it as a battle of prep vs prep at the SuperGM level rather than skill vs skill. He doesn't seem to be enthusiastic about doing that prep anymore, and that seems to have been a factor in his decision to no longer fight for the WC title. reply elevatedastalt 2 hours agorootparentNo, he has been expressing his dislike for the format of the WCC. He has no major issues with Classical time controls. reply CSMastermind 4 hours agoparentprevNo, he retired from the championship circuit last year which is why Ding was champion in the first place. He had concerns over the format and FIDE was unwilling to make changes. We're in a bit of a weird spot in chess right now because Magnus is still the consensus best player even though he's not the official champion. reply N-Krause 4 hours agoparentprevNo, he did not compete in the last one either. I suspect, the results would have been different if he had. reply thom 4 hours agoprevWell, Ding's prediction was right, it wasn't a short draw. Horrible end to a another pretty disappointing cycle. Ding's game 12 win to tie the match was a positional masterpiece but it ultimately seems fitting that his blunder decided the result. Hope he gets a long break from classical chess and finds his way back to enjoying the game. reply MrMcCall 4 hours agoparentDing has nothing to be ashamed of. He fought like a true warrior. He was a great champion, with class and brilliance. I just don't think he was physically as strong as he could be, and that affects one's ability to think as they must at that level. All said, tho, it was definitely Gukesh's time, and being 18 has some serious benefits in terms of recovery and stamina. reply thom 1 hour agorootparentI don't think 26. a4 was fighting like a true warrior, it was more giving up half your kingdom in the hope that your opponent will then accept a peace treaty. reply jansan 1 hour agoparentprevGame twelve was a masterpiece. Vishy Anan was commenting live and he (of course being biased towards Gukesh) said things like \"This is horrible to watch\" and \"I just do not see a defense\" at least ten moves before the end of the game. What gave Gukesh the win at the end was not only Ding's blunder, but Gukesh's mentality to never give up. He showed the same in earlier games when he several times refused to draw and tried to somehow win even with very slim chances. Today it paid off. reply trey-jones 5 hours agoprevSpoiler alert! I was planning to watch the recap without knowing the outcome, but I'm not that invested. Congratulations to the new champion. reply ainiriand 2 hours agoprevAt least they could mention the age... reply excalibur 1 hour agoprevWhy would you loudly proclaim \"youngest world champion in history\" in the headline and then never mention his age at any point? I clicked the article specifically looking for the answer to \"how old is he\" and was thoroughly disappointed. Author is fired from journalism permanently. reply deadbabe 3 hours agoprevMust be amazing getting started off in life with such an amazing title out of the gate reply fernandopj 2 hours agoparentHe didn't become a Master yesterday to say \"out of the gate\", in his eyes he's been playing chess seriously for \"all\" of this life, and professionally for half of it. It's a weird thing to say to someone who overcame so much while still young. He wasn't given anything \"out of the gate\". reply neofrommatrix 1 hour agoparentprevYou should read about the amount of sacrifices he and his parents did. Chess is very expensive if you want to be a professional and progress to the GM title. reply SubiculumCode 4 hours agoprevSo does Magnus unretire? reply papercrane 4 hours agoparentI don't think so. He's still active, he just wants to play tournaments and not championships. reply zwnow 5 hours agoprevnext [17 more] [flagged] leosanchez 5 hours agoparent> Ah yes, chess, the game where people love to remember sequences. You can remember openings. From the middle game, you have to \"play\". reply kamaal 4 hours agorootparentI once randomly typed 'How to think like a chess grandmaster' or something to that effect in YouTube. And it was interesting how the whole they went about playing. There are patterns. Like how to start(openings), endgames. Like patterns of movements well defined. You just have to read enough books, and play enough games to have them hard burned into your memory. They are not really thinking the way an ordinary person imagines. By and large a chess GM is database of chess games. And most of your moves are these. Second part is having a strong internal monologue, which is basically a way of saying to oneself(silently)- 1. What happens if I make this move? Where is my game headed? Where is the opponent's game headed? 2. Does my move fit in to the patterns I already know? 3. Are my pieces in trouble? How do I save them? Or should I? 4. If I make these series of moves I can make check mate the opponent in k moves. 5. Which move do I make to take this opponent's piece? 6. Are there an obvious traps I can spot? etc etc. Like a never ending monologue/internal chatter. What if I do this, or What if I do that? What are knowns, unknowns? Same questions now from the opponents perspective. Like you need to develop these skills. And the ability to work this fast. There are already broad moves that are supposed to be made. Like you move the horses as early as you can. You don't get stuck in piece traffic jams. The rook is supposed to be a endgame piece. White gives you an edge, as you can move that horse first, castling etc etc. Mostly its reading a lot, and talking to oneself while playing a lot. reply bmacho 4 hours agorootparentAny specific video(s)? reply zwnow 5 hours agorootparentprevListening to chess event commentators it's all sequences reply eterm 4 hours agorootparentOutside of the opening, Chess players tend to call them combinations, and it's not really memorisation as such, it's pattern recognition, and it's a very difficult skill to master. Outside of the opening, it's not rote memorisation, it's a mix of pattern recognition and calculation. You have to spot familiar patterns, but from a \"distance\", and calculate whether the differences in your specific instance are crucial or not to the pattern. Chess is incredibly difficult. reply zwnow 4 hours agorootparentYea played myself for a while but didn't want to remember 300 openings for both colors. Chess is only fun if both people are equally bad at it. reply sigbottle 3 hours agorootparentI never understood this complaint outside of pure snark. Over the years I've noticed many games have pretty bad tendencies, simply because they've floated to the top through what essentially amounts to luck (also modern games have \"balance changes\" that often push novelty + profit over actual fun). However, most bestselling games always have that one core part that's pure beauty, and that's what people keep coming back to. If you don't like opening theory, that's fine. There's plenty about chess to be enjoyed outside of memorizing theory. I play chess tactics or alt gamemodes exclusively because of this. Not planning to be a chess professional. But the creativity is vast in this space. If we want to make better games, first start by breaking down the core parts that are good and the core parts that are bad, then iterating on it, just like how many disciplines (both scientific and artistic) operate. reply bluGill 4 hours agorootparentprevYou don't need to remember 300 openings. Remembering openings is the most straight forward thing to study - you just need to remember them and then select in game as your opponent gets a choice as to which of those 300 you are playing as well. That is hard to do in practice, but it is easy to explain. For most people you are better off ignoring all that though. Instead you should train tactics and endgames. Both are easy enough to explain, but it isn't useful to just memorize them. You have to see when they apply even though there are other unrelated pieces on the board. You have to see when they apply even though the pieces are in slightly different positions from what you studied. You have to see how they will apply after complex sequence of moves even though they don't apply yet. reply oneeyedpigeon 4 hours agorootparentprevYou should probably pick one or two openings and focus on those rather than trying to learn every opening right from the beginning. Like almost every game, chess is more fun when the two players are equally matches. Playing online (chess.com or lichess.org) lets you play an opponent who is perfectly matched to your level. reply kamaal 4 hours agorootparentprev>>Chess is incredibly difficult. Its not exactly difficult. Or more precise, It can appear difficult as people don't show how the work is done. You see this even among the Math people as well. It appears as pure magic. But in reality its mostly understanding what the axioms and rules are. Then starting at some point, and making the most smallest atomic change possible to a thing and seeing it its consistent with the rules. Else move to making new change(s) and test if it works/consistent with rules. This can resemble working down trees of changes. At the end its basically having the patience to sit for hours, and then days full of such hours- And then work things on paper(paper work). At the end you will find yourself with lots of paper work, basically trees of decision branches, that you made while making small changes. Think of it like a trial of large change log. And forks. When people see this from the outside, they only see the start point to end result, not all the decision trees. So there is a tendency to imagine the Math guy thought up a perfect solution in exact number of steps. The paper work is hidden and it all looks like pure magic. When it comes to chess, more top people need to come out and show how they are working through their decisions. Their prep work, their though log etc. Long story short, they are showing you a magic trick, like a excellent display of sleight of hand. Once you see the practice and the trick is revealed it doesn't appear as difficult. reply philipwhiuk 4 hours agorootparent> Its not exactly difficult. Or more precise, It can appear difficult as people don't show how the work is done. What is difficulty other than priori repetition of a sequence? Anything difficult can be trivialised to this requirement. reply kamaal 3 hours agorootparentExactly. I also believe a lot of these magic like fields in the current era sound so 'meh' largely because the mechanical processes behind achieving results is revealed. >>What is difficulty other than priori repetition of a sequence? Its not easy, but its not where it was either. Only a decade or two back these things were restricted to nerds and was somewhat like rare occult knowledge. You had to be part of some club to even participate. While you still need to practice a lot to work in the upper level in competitions and all. It no longer has a magic like appeal. reply gosub100 3 hours agorootparentprevI had to quit because I found it extremely frustrating. I could hardly ever win. And when I did it was from massive blunders, not from anything I did. I never had an issue with losing in other games, I'm not a competitive type that has to win. But chess made me feel like I had the illusion that I could win but in fact it was almost never possible. I also hate the characteristic that if you make one mistake you lose. You can never recover, whereas in tennis or basketball or something you can be ahead and behind and still have a chance. Chess is like that board game Operation, you make one bad move and it nullifies everything you did before that moment. reply umanwizard 4 hours agorootparentprevThey’re coming up with those on the fly, not repeating them from memory. reply HarHarVeryFunny 5 hours agorootparentprevThey are just showing alternate reasonable lines of play - some of what the players are calculating mentally. reply oneeyedpigeon 5 hours agorootparentprevOf course it's all sequences—any turn-based game is—but they're certainly not all \"remembered\". reply rybosworld 2 hours agoprev [–] This was a great match overall, with a very dramatic/surprising end. But I disagree with other comments that are describing the overall championship in a favorable light. To me, this was some of the most boring chess I've watched. Ding was certainly trying to force draws in every game, which makes for some very unexciting lines. It's been suggested that Ding felt he had better chances in rapid formats, so forcing draws makes sense in that light. But it led to some extremely uncreative chess imo. Reminds me of many of the Magnus vs Fabi games in 2018. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "GM Gukesh D became the youngest world champion in the 2024 World Chess Championship by defeating GM Ding Liren in Round 14.",
      "The match was notable for Gukesh's strategic play and deep preparation, capitalizing on Ding's blunder in a king and pawn endgame.",
      "Lichess provided live coverage with commentary from GM Felix Blohberger, IM Laura Unuk, and guest GM Ivan Cheparinov, highlighting the event's significance and emotional moments."
    ],
    "commentSummary": [
      "Gukesh, at 18, became the youngest chess world champion by defeating Ding Liren, showcasing his determination and skill.",
      "The match was intense, with Ding initially favored due to his rapid and blitz skills, but Gukesh's pressure led to Ding's critical blunder.",
      "The chess community is speculating on future matches, particularly in light of Magnus Carlsen's absence from the championship circuit."
    ],
    "points": 530,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1734010163
  },
  {
    "id": 42397550,
    "title": "Timemap.org – Interactive Map of History",
    "originLink": "https://www.oldmapsonline.org/en/history/regions",
    "originBody": "Project Community News My App My maps History Maps",
    "commentLink": "https://news.ycombinator.com/item?id=42397550",
    "commentBody": "Timemap.org – Interactive Map of History (oldmapsonline.org)527 points by agilek 9 hours agohidepastfavorite102 comments klokan 4 hours agoHi HN! I’m Klokan, one of the creators of TimeMap. It’s exciting to see this project here — thank you for the interest and support! We just launched TimeMap on Product Hunt: https://www.producthunt.com/posts/timemap If you find what we’re building valuable, an UPVOTE there would mean a lot. Stanford University recently hosted an event to introduce TimeMap to the world, which you can check out here: * Recording on YouTube: https://www.youtube.com/watch?v=VZspMtwYI98 * Event page: https://events.stanford.edu/event/the-future-of-history-disc... The talk dives into how TimeMap was built, including our use of Linked Data, OpenHistoricalMaps, LLM pre-processing, indexing algorithms, and more. It also highlights amazing partner projects like Pelagios, TimeMachine, and our amazing partner institutions such as the David Rumsey Map Collection, British Library, ETH Zurich and many others. TimeMap has been a dream project of mine for years — I’m thrilled to see it coming to life and would love to hear your thoughts or feedback! For context: I’m also the founder of OpenMapTiles.org, a MapLibre.org board member, author of GDAL2Tiles, and contributor to other open-source projects. Currently, I’m serving as the CEO of MapTiler.com. Looking forward to the discussion, and thank you for taking the time to check this out! reply bhupy 2 hours agoparentThis has been a dream project of mine too, so happy to see that it exists. One thing that I've also wanted was to be able to reason about the total timeline using the Holocene calendar[1] instead of the standard BC/BCE AD/CE timeline. It makes it easier to internalize how long ago (or how recent) certain civilizations were without having to do the wrap-around math in one's head. Would be nice to be able to maybe toggle that view. [1] https://en.wikipedia.org/wiki/Holocene_calendar reply abe94 1 hour agoparentprevThis is something I've wanted to see for years - thanks so much for building this - is there a way to suggest edits? Perhaps a way to link a wikipedia account in order to create an article? It would also be cool to have filters of pre history, Hunter Gatherer, Early Farming, Bronze age and so on! reply egorfine 4 hours agoparentprevHi! It's done beautifully but there are some... inconsistencies. Is there a process to provide feedback and correct errors on the map? reply klokan 4 hours agorootparentYes! Please just use the \"Feedback\" button on the side of the interface - after you zoom the map and select time - then you can annotate, and it gives us most relevant context to your feedback reply mcswell 1 hour agorootparentI don't see the \"Feedback\" button. I'm using the Vivaldi browser (based on Chromium, I think). Most of the place names are clickable, with the notable exception of Israel (both Judah and Samariah) around 900 BC, and for Israel (the united monarchy) around 1000 BC. The mouse cursor changes shape, but nothing happens if you already have the Wikipedia panel open; if it's not already open, you get a blank panel. Broken link? Israel/Samaria should probably point to https://en.wikipedia.org/wiki/Kingdom_of_Israel_(Samaria), Judah to https://en.wikipedia.org/wiki/Kingdom_of_Judah, Israel/united to https://en.wikipedia.org/wiki/Kingdom_of_Israel_(united_mona.... reply egorfine 4 hours agorootparentprevCool! If I look up the \"Grand Duchy of Lithuania\" on wikipedia, the years for the state do not match the data on the map. Is it because the data is disputed, or Wikipedia is wrong or there is a bug on the Timemap? reply 4gotunameagain 3 hours agorootparentprevWhere is the Feedback button ? It is not shown in my map. There is a mistake, The \"Northern\" is missing from the Republic of Northern Macedonia. reply ikurei 3 hours agorootparentThe map doesn't go that close to the present. \"Northern\" was added to the name in 2019, before it was just Republic of Macedonia. > \"The Prespa agreement of June 2018 saw the country change its name to the \"Republic of North Macedonia\" eight months later.\" - https://en.wikipedia.org/wiki/North_Macedonia reply 4gotunameagain 2 hours agorootparentThe UN recognised name before the Prespa agreement was \"former Yugoslav Republic of Macedonia\". https://en.wikipedia.org/wiki/Macedonia_naming_dispute reply grahamj 3 hours agorootparentprevYes I'd like to report the error of Taiwan being labeled \"Republic of China\" reply dewey 1 hour agorootparentTake a look at what is written on a Taiwanese passport. reply hosh 2 hours agorootparentprevThat is in dispute and depends on which party is in power, by the year. Until general elections were opened up in the late 80s, it was definitely the Republic of China. reply Trmpos 26 minutes agorootparentWhich party in power ever changed the constitutional name? It's always been the Republic of China. reply singularity2001 3 hours agorootparentprev\"inconsistencies\" that's a friendly way to put it. The data is severely lacking for the world before the bronze age collapse. Upside: it can only get better over time. reply moralestapia 3 hours agoparentprevThank you Kiokan, I've been looking for something like this since High School. They way history is taught misses a lot of the context that only makes sense when you put it into a map like this one. If you could somehow \"open source\" at least the data side of this, I'd be glad to contribute. I have a bunch of history books from ancient latino civilizations. reply okok3857 1 hour agorootparentYou may be interested in OpenHistoricalMap: https://www.openhistoricalmap.org, which anyone can contribute to (you can read much more about it here: https://wiki.openstreetmap.org/wiki/OpenHistoricalMap). Edit: I didn't realize at first but from other comments it sounds like TimeMap actually pulls data directly from OHM. reply carderne 6 hours agoprevThere's a great big coffee table version of this [1]. As always though, I wish there were a way to show not just which \"nation\" ostensibly controlled an area, but what _people_ were actually there: what languages, cultures and gods actually held sway in each of these areas and times. [1] https://www.dk.com/uk/book/9780241226148-history-of-the-worl... reply WillAdams 5 hours agoparentArguably the ultimate commentary on that aspect of history and politics is to take T.E. Lawrence's original map showing his suggestion for dividing up the Middle East based on linguistic groupings and factional differences and religious factions and interactions and to then overlay it with any more recent map. reply sofixa 3 hours agoparentprev> As always though, I wish there were a way to show not just which \"nation\" ostensibly controlled an area, but what _people_ were actually there: what languages, cultures and gods actually held sway in each of these areas and times That is pretty hard to do, because nationalism wasn't really a thing before the 19th century in Europe. So how do you identify 18th century people living in Wallonia under the HRE or Netherlands, speaking French and being Catholic? What are they? How would they identify themselves? Or people born in Thessaloniki/Salonika/Solun in the Byzantine Empire in the 9th century, being Orthodox and Slav? Or people speaking Polish but considering themselves German in post-WWI disputed territories? Or Baltic Germans living in Russia for generations? Or the family in Macedonia where 3 brothers considered themselves Bulgarian, Greek and Serbian respectively. Depending on the point in time, locality and even individuals, people would identify with their religion, main language, local area, monarch, nation state first. Or a combination of all of the above. How would you represent that sort of wild variety on a 2D map? reply carderne 2 hours agorootparentThat’s kind of my point. That’s the interesting stuff (the fact that Macedonia at some point nominally controlled Kyrgyzstan is much less interesting imo) but it’s much too complex (and unrecorded) to convey in a satisfying way. reply sofixa 2 hours agorootparentAnd it was rarely clear enough on the ground, let alone in the little available data. Just in the first quarter of the 20th century there were a ton of conflicts all over Europe to try to clarify borders based on different interpretations of identity based on culture/religion/language/history. reply WillAdams 1 hour agorootparentA notable observation from a lecture which touched on linguistics I attended: >Europe was once linguistically a borderless continuum of languages which gradually transitioned from Romance languages in the south to the Germanic languages in the north. (that is a rough paraphrasing from uncertain organic memory) This a bit facetious, and greatly simplified (the actual discussion in the lecture was far more nuanced), but it does speak to linguistic archaeology in an interesting way --- two notable books on this: https://www.goodreads.com/book/show/1831667.The_Horse_the_Wh... https://www.goodreads.com/book/show/166433.Empires_of_the_Wo... reply carderne 1 hour agorootparentI enjoyed Empires of the Word, will have a look at the other book you recommend. reply sofixa 59 minutes agorootparentprev> >Europe was once linguistically a borderless continuum of languages which gradually transitioned from Romance languages in the south to the Germanic languages in the north. Eh, not really true. Not only is that missing slavic languages, there are edge cases like Romania and Albania, which are surrounded by Slavic speakers. There's also Greece, and even more wild, Hungary which is from an entirely separate language family alltogether. reply WillAdams 5 hours agoprevIt is surprisingly difficult to study history chronologically when one gets beyond the scope of a given text/item due to overlap. When I was still reading to my children in the evening, after running through all the standard texts (Narnia, _The Hobbit_, _The Lord of the Rings_, Susan Cooper's _The Dark is Rising_, H. Beam Piper's _Little Fuzzy_, &c.), I decided I wanted to read biographies to them, in chronological order, starting in as far back in history as was possible --- that was a surprisingly difficult list to put together (arguably because I missed texts such as: _Isaac Asimov's Biographical Encyclopedia of Science and Technology: The Lives and Achievements of 1195 Great Scientists from Ancient Times to the Present Chronologically Arranged_), so we did a dry run of just American Presidents --- this worked quite well, and I found it expedient to read an \"adult\" biography to pair with a children's one so as to anticipate and answer questions which came up during the reading. Unfortunately, my wife's job schedule changed and we stopped this at Truman, but it was very helpful in improving my understanding of the ebb-and-flow of American history. EDIT: Interestingly, this has been posted about here in the past on multiple occasions, but none of them yielded any prior discussion AFAICT: https://news.ycombinator.com/from?site=oldmapsonline.org It would be really interesting to see this paired with a dataset such as: https://www.explorehere.app/ From: https://news.ycombinator.com/item?id=42381612 reply Karawebnetwork 4 hours agoprevGoing back in time to the Americas doesn't allow you to see much detail. If you're curious to find out, you can visit this website, which gives a detailed account of native lands: https://native-land.ca/ reply ks2048 4 hours agoparentSome people may be surprised at the level of historical detail that has been discovered, particularly for the Maya who left written records. for example, https://en.wikipedia.org/wiki/List_of_kings_of_Copán reply MiklerGM 6 hours agoprevCool, I wish the project all the best! Making an interactive historical atlas is a great idea but the path is not an easy one. We did a similar project and closed it about 5 years ago https://maps.chron.ist/ Had multiple iterations, and put a lot of effort into finding and drawing the maps. Later we found some support from the community and they promised to provide us with verifiable and trusted map sources... The source code is available here https://github.com/chronhq reply dbspin 5 hours agoparentIt's fascinating to see how much more (and more accurate) data your project comprised, but how much better the interface is for this one. Perhaps they can leverage the data you collected for a best of both worlds approach. reply klokan 4 hours agoparentprevWow - have not seen this one yet. Looks great! reply k0ns0l 4 hours agoparentprevWow, this is awesome! reply k1kingy 7 hours agoprevFor New Zealand in particular, the flags that are used through history are wildly inaccurate. It's missing the initial flag used before the Union Jack was officially adopted. And the signalling flag that is on there between 1907-1947 was never an official flag and was only kind of used between 1899-1902 before the current flag (Union Jack in the corner with the red Southern Cross stars on a blue background) was adopted in 1902. reply robin_reala 7 hours agoparentApparently nothing happened in Australia before 1788 too. reply joren- 7 hours agoprevPerhaps also of interest: A more curated example of a local initiative can be found here: https://kaart.gentgemapt.be/. This combines historical maps of a city in Belgium with information on local heritage. reply trevoragilbert 58 minutes agoprevThe interaction is really great and I love the premise. But it seems to be missing a huge amount of information from pre-1000BC that gives the impression nothing happened/there are no people there. reply jaysonelliot 5 hours agoprevExcellent UI and very fun to explore, although North America is conspicuously blank before 1607. Hopefully more sources can be added to this to fill that out. reply klokan 4 hours agoparentThanks. Great to hear that you like the user interface... It is indeed super hard to collect or create better data. We were considering cooperation with indigenous lands non-profit https://native-land.ca/ that would be amazing! Do you know of a better source? If you have tips for how to improve or data - please - post it via \"Feebdack\" button on the edge of the website for area and selected time... To make this project well is super hard. reply ks2048 3 hours agorootparentWikipedia has plenty of good information. I left this link in another comment, but for example, https://en.wikipedia.org/wiki/List_of_kings_of_Copán reply crazygringo 3 hours agoprevI absolutely love this and have wanted something like this for so long. A feature request: in addition to dragging the timeline smoothly across years, could there also be a step button that jumps to the next (or previous) change in the visible area? Because if I'm looking at the US in 1623, my main question is, OK, so what happened next? I want to click a button and find out. And maybe even put a bold outline or something around the new border(s). Having to scrub the timeline, overshoot, go back, now I can't remember what it looked like before, did I go too far? Is not the optimal UX for education. Like it's really cool to get the grand sweep of centuries, but not if I want to read the map over time like a story. Not to take away from the phenomenal achievement that this already is! Just to make it even better. reply pcthrowaway 3 hours agoparent> A feature request: in addition to dragging the timeline smoothly across years, could there also be a step button that jumps to the next (or previous) change in the visible area? I think this is especially important, because some areas may have changed several times within the same year. reply petargyurov 9 hours agoprevOh my god, I've been wanting to create something like this for a while. Gonna play around with this and report back! Looks amazing so far. reply Freak_NL 8 hours agoprevThe dates and sovereignties seem in order, but the map is modern no matter how far you go back. The boundaries shift, but the coastline remains in its 2024 state. This means historical seas are missing, and present-day polders are present in the middle ages, etc. reply bigtones 8 hours agoparentYou can change maps to many older maps under the \"Explore Maps\" option on the home page of the site. it seems you can either explore maps or history, but not both at the same time. reply maartenscholl 3 hours agoprevCurious about the differences between this map and the Europa Universalis IV extended timeline https://steamcommunity.com/sharedfiles/filedetails/?id=21741... ? I get the the latter is a videogame and is likely altered to be more fun to play, but I wonder how accurate their historical research is. reply mezod 58 minutes agoprevThere seems to be an obvious mistake which is that Catalonia is shown as part of Spain. /joke great job! :D reply iefbr14 6 hours agoprevHere is a nice one of the Netherlands. https://www.topotijdreis.nl reply permo-w 2 hours agoprevThis is a really cool idea; however, unfortunately, for me anyway, the UX is hampered on mobile by the lack of pinch zoom, and on PC by the lack of ability to scroll the time bar. Still usable, but would be fantastic if either feature was fixed. Great app otherwise. reply CrociDB 5 hours agoprevThanks, I just spent two hours exploring the history of Europe while I should really be working. reply klokan 5 hours agoparentYeh. We have made it... in such case the project has successfully addictive UX :-) reply egorfine 6 hours agoprevHow beautiful is this project exactly if it presents quite an inaccurate data? I'm not talking about minute details. For instance, lookup wikipedia for \"Grand Duchy of Lithuania\" and note the active years of that state in all its different phases. Then compare with what this map shows. reply perfunctory 5 hours agoparentCould you give an example? Like a specific year when the map is not accurate? reply Freak_NL 4 hours agorootparentLots of things are missing. The kingdom of Frisia (6th to 8th century CE) is completely absent. reply ivan4th 4 hours agorootparentUrartu is missing as well: https://en.wikipedia.org/wiki/Urartu reply soco 7 hours agoprevDoes it work in Firefox? Not here... Suggestion 1: you could show the name of bigger entities also in the corners of the screen - now you must scroll up to Italy to see that the green region is the Roman empire. Suggestion 2: I expected to be able to drag the timeline left and right. Dragging the cursor over the screen edge for the next time period makes you unwillingly jump a few hundred years. reply k1kingy 7 hours agoparentWorking fine for me on FF. Once or twice the timeline stops working, but clicking around a bit brings it back. reply someothherguyy 7 hours agoparentprevWorks in larger resolution for me fine, issues on smaller viewports. reply aembleton 7 hours agoparentprevIt does here. FF 133 on OSX reply evanletz 3 hours agoprevI could spend all day long on this site. History is so fascinating and there's infinite rabbit holes to go down, so being able to visualize everything on the same timeline is awesome. Also linking to an embedded Wikipedia is super smart! reply barbazoo 1 hour agoprevI love the visualization of early human presence over time. Good job! reply gorfian_robot 3 hours agoprevleaving the first people's areas blank (presumably due to lack of information) still perpetuates the story that those areas are't worth talking about until they were discovered/settled/conquered/etc by 'civilization' reply butz 3 hours agoprevIt would be even more interesting to display OpenStreetMap state, as it was on selected year. Of course, this should start only when OSM was launched, I'm not asking for someone to map all the world from old aerial photography. reply MapNavTom 6 hours agoprevYou can vote for TimeMap on Product Hunt today: https://www.producthunt.com/posts/timemap reply mentalgear 4 hours agoprevLooks great, but this bug keeps from enjoying it: On firefox/macos/desktop, clicking on a POI on the map opens the sidebar but then redirects the whole page to the wikipedia entry. reply RandomWorker 4 hours agoprevHonestly there is so much more to North America than just Maya for decennia's. You can review the indigenous people territories back centuries ago. There are some really good organizations that are tracking this. https://native-land.ca/ I don’t know much about USA/Australia and New Zealand but I can imagine they have similar recourses. reply GiorgioG 7 hours agoprevAll the nitpicking here is insane. Can we all just appreciate the work that went into this? reply otabdeveloper4 7 hours agoparentHistory is by definition nitpicking. History without nits picked is called \"ideology\" or \"myth\". reply GiorgioG 5 hours agorootparentCall me crazy but I've never seen 'nitpicking' in the definition of history: https://www.merriam-webster.com/dictionary/history reply oskarkk 2 hours agorootparentGP meant that researching history necessitates doubting every claim, and never taking what any historical source says at face value. reply egorfine 6 hours agoparentprevImagine you are holding a very, very nicely done history textbook. Excellent illustrations made with love, excellent typeface, high quality print, packaging, etc. Except it's all totally wrong. Could you appreciate the work that went into this? reply GiorgioG 1 hour agorootparentFeel free to participate if you feel that strongly about it: https://www.oldmapsonline.org/en/community reply red1reaper 1 hour agorootparentprevYes, I could appreciate it. reply GiorgioG 5 hours agorootparentprevIs it really \"all totally wrong\"? reply egorfine 5 hours agorootparentNot totally but I have noticed some glaring inconsistencies reply elaus 2 hours agoparentprevI'm also puzzled by many of the comments that are (for HN standards) exceptionally angry and dismissive. Yeah, apparently the data is incomplete and there are some errors/disputes. But that will always be the case when processing huge amounts of data in a way that's never done before. I'd hope we could provide more helpful feedback (what _exactly_ is incorrect and what is the source of the correct information). Edit: upon closer inspection I found many of the comments originating from the same users, so maybe it's just a very passionate topic for a small but vocal group. reply mavhc 7 hours agoprevhttps://www.openhistoricalmap.org/ is the OSM like version reply klokan 5 hours agoparentThe TimeMap is in fact loading the data from OpenHistoricalMap on the deep zoomlevels (streets) so if you edit OpenHistoricalMap roads and houses it will be displayed there. See Lille for example - and play with timeline here: https://www.oldmapsonline.org/en/history/regions#position=13... You will see directly how the town center has developed, fortifications, railways or highway... damn cool! :-) reply uneekname 2 hours agoparentprevI love OHM! Some places are impressively well-mapped, for example NYC. reply Bengalilol 6 hours agoprevAmazing initiative ! I see that recent 'changes' to some territories are not taken into account. I bet this is because you take the history path with global consensus. Great work ! reply jalopy 6 hours agoprevThis is awesome. Love this idea. What a great way to make history more alive. I've only spent ~30s with it so far but I hope to find ways to contribute to it (content and code/different visualizations) reply jalopy 6 hours agoparentDigging in a bit more: Love this explainer of how it's done - https://www.maptiler.com/story/oldmapsonline/ reply phyzix5761 3 hours agoprevI spent half an hour on the site exploring different civilizations and time periods. Very fun! reply codethief 5 hours agoprevI have always wondered whether anyone had ever put together a chronological list of maps of the world, and wow, it's even better than I imagined! reply Tommix11 3 hours agoprevTypo discovered - Swedish King's name is Karl IX not Kerl IX reply PerseusLynx 6 hours agoprevI have been looking for a map like this for a while and even considered creating one. Really nice job! I cannot verify the actual historical accuracy but it looks great. reply loughnane 6 hours agoprevLove it. One suggestion is to have cities only appear when they were founded. Looking at Ireland it felt off seeing limerick Dublin and cork in 4000 bc. reply jl6 6 hours agoprevHow cool would it be if the timeline could switch to a log scale and show prehistory too, with morphing continent shapes? reply nashashmi 6 hours agoparentPrehistory is less certain. And doesn’t fall in category of history of people which I think this map is meant to show. reply keithalewis 5 hours agoparentprevAnd, like, a LARPing mode I could use while sitting in my mom's basement that would automagically post every brain fart I had to HN. That would be totally cool! reply SamBam 5 hours agoprevI spent forever trying to drag the year slider, until I realized it wasn't a slider but a text box. reply mdavid626 5 hours agoparentYou can drag the red dot on the timeline. reply joaquincabezas 3 hours agoprevthis is really cool! I have a ruler from metermorphosen.de and some posters and cardboards from museums. I will share it :) reply t8sr 8 hours agoprevThis is amazing, but crashes with a 500 every 30 seconds. reply Petros_S 3 hours agoprevLove it!!!! Really cool way of reading history. reply h1fra 7 hours agoprevVery nice. I wish cities' names changed with the period (and disappear when they were not even a thing) reply gus_massa 7 hours agoparentThey may appear as a \"ghost\", or perhaps a \"premonition\". I may be useful to compare the locations. reply egorfine 8 hours agoprevThis is incredibly educational. reply marcusverus 6 hours agoprevSimilar to geacron.com--love it! Bookmarked. reply iammjm 8 hours agoprevVery cool and works well (Edge 64-bit 131.0.2903.86 / win10) reply btiwaree 7 hours agoprevlove this! Works well in FF 133.0 (aarch64). reply bibelo 8 hours agoprev [–] Love the concept Clean and clear design Slider does not work though reply buzzardbait 8 hours agoparent [–] Works for me reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [],
    "commentSummary": [
      "TimeMap.org is a newly launched interactive historical map project featured on Product Hunt, developed by Klokan using Linked Data and OpenHistoricalMaps to visualize history.- The project collaborates with prestigious institutions such as Stanford University and the British Library, aiming to improve historical understanding through user feedback and community contributions.- Users can explore historical maps, suggest timeline adjustments, and request data accuracy improvements, enhancing the project's development and accuracy."
    ],
    "points": 527,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1733994748
  },
  {
    "id": 42391443,
    "title": "Mysterious New Jersey drone sightings prompt call for 'state of emergency'",
    "originLink": "https://www.theguardian.com/us-news/2024/dec/11/new-jersey-drone-sightings-state-of-emergency",
    "originBody": "View image in fullscreen Sightings of drones, similar to the one pictured, began in mid-November. Photograph: Richard Newstead/Getty Images New Jersey New Jersey drone cluster sightings prompt call for ‘state of emergency’ Lawmaker called for a ‘limited state of emergency’, while 21 mayors asked governor to enact statewide action Ed Pilkington Thu 12 Dec 2024 05.44 EST Share The mysterious reported sightings of drone clusters in the night skies over New Jersey and other parts of the US north-east has prompted frustrated outbursts from Congress members, triggering calls for a limited state of emergency to be declared over the region. Jon Bramnick, a Republican state senator in New Jersey, has demanded a ban on all drones until the mystery is solved. ABC’s Action News reported that he called for a “limited state of emergency … until the public receives an explanation regarding these multiple sightings”. Concern about unexplained drone sightings began in mid-November as isolated postings by local residents on social media. The issue has steadily risen up the political food chain, bursting this week on to the stage of state and federal authorities. Clusters of unidentified drones spotted in New York and New Jersey Read more On Wednesday, the governor of New Jersey, Phil Murphy, held a briefing call with the US homeland security secretary, Alejandro Mayorkas, as well as representatives in Congress and state police to discuss the drone reports. He emphasized there was “no known threat to the public at this time”. Also on Wednesday, the House subcommittee on counter-terrorism, law enforcement and intelligence held a hearing on the subject. Robert Wheeler, an FBI official in charge of investigating the matter, confirmed to the hearing that the agency still had no explanation for the sightings. When asked whether the public was at risk, Wheeler replied: “Are we concerned there are nefarious intentions that could cause either an actual security or public safety incident? There’s nothing that is known that would lead me to say that, but we just don’t know. And that’s the concerning part of it.” 2:47 Mysterious clusters of drones over New Jersey baffle FBI – video He told Congress members that more than 3,000 sightings had been phoned in to a tip line set up by the FBI last week, but so far there had been no breakthrough. The admission that the country’s pre-eminent law enforcement agency remains essentially clueless about the mystery underlines the confusion that continues to swirl. It is not known whether a group or individual might be behind the phenomenon, or whether any credible issue even exists – there has been speculation that the flurry of activity might merely amount to confusion over sightings of regular planes or be the product of social media distortions. Sightings have been made in eight New Jersey counties. Mayors in 21 towns across the north and center of the state have written a joint letter to Murphy calling for statewide action. Concerns have focused on drones spotted near the Bedminster golf course of president-elect Donald Trump, as well as sensitive infrastructure including electric transmission sites, rail stations and police departments. Recently sightings have spread to parts of New York City and over the suburbs of Philadelphia. Nicole Malliotakis, a Republican Congress member representing Staten Island and parts of Brooklyn, told the House hearing that drones had been reported over the Verrazzano-Narrows Bridge, close to US military bases. “They are flying over sensitive infrastructure, and the fact that we don’t know what they are, or who’s behind them, or what they’re doing is very concerning to me, particularly in a post-Chinese spy-ballon world,” she said, according to a report in the local Morristown Daily Record. On Wednesday, the Pentagon responded and addressed the baseless claims from one Republican New Jersey congressman that the drones were from an “Iranian mothership” lying off the coast of the state. US military bosses do not believe the drones or other craft are coming from “a foreign entity or adversary”, the deputy Pentagon press secretary, Sabrina Singh, told reporters. “There is no Iranian ship off the coast of the United States, and there’s no so-called mothership launching drones towards the United States,” she added. The United States Northern Command also issued a statement. “USNORTHCOM conducted a deliberate analysis of the events, in consultation with other military organizations and interagency partners … at this time we have not been requested to assist with these events,” it said. Explore more on these topics New Jersey Drones (non-military) news Share Reuse this content",
    "commentLink": "https://news.ycombinator.com/item?id=42391443",
    "commentBody": "Mysterious New Jersey drone sightings prompt call for 'state of emergency' (theguardian.com)403 points by anigbrowl 21 hours agohidepastfavorite713 comments rozab 4 hours agoPeople would do well to keep in mind the episode of drone hysteria which happened at Gatwick airport in 2018. Hundreds of sightings were reported over a period of several days, shutting down the airport completely. It was a massive media event, camera crews from every outlet were at the airport, but none ever photographed a drone. None of the radar systems at the airport, nor the military anti-drone systems sent later on, ever picked up anything. In this article, a professional drone photographer describes mistaking a helicopter for a drone: > But when he opened up the image on his computer, ready to send to his editors, he realised he’d made a mistake. The image did not show a drone. It was a helicopter hovering 10 miles away; between the darkness and the distance, his eyes had played a trick on him. “If I’m making a mistake – and I fly drones two or three times a week – then God help us, because others will have no idea,” he said. He called police to retract his reported sighting. https://www.theguardian.com/uk-news/2020/dec/01/the-mystery-... reply jerf 3 hours agoparentThe real story here is the apparent... and I use this term very, very deliberately... fecklessness of all the relevant authorities. Apparently... again, a deliberate choice... nobody has the authority to figure out what is going on, or nobody has the motivation, or nobody has the technical capability, or something like that. I'm not sure what the problem is, exactly, and that is in some sense now the dominant problem. How can there be no clue by now? Your sort of post is relevant in the first few days of the story. But if this was the case, with all this attention on it, it should already have been determined. But authorities aren't even floating this as a theory. Basically all they're doing is shooting down (pun somewhat intended) every theory. That there is this much confusion, days later, is itself now the most important aspect of the story. And we're getting up to where there are international consequences to this sort of issue, too. If we can't figure out what these drones are in a week, how can we be trusted to defend Taiwan or other allies in a world where \"drone swarm\" is slowly but quite steadily moving its way up to the #1 most likely attack vector? At some point it stops mattering if maybe it is just helicopters miles away being misidentified, at some point that becomes even worse in some ways than other answers, as it gets hard to claim we're going to be totally awesome at defending you against drone swarms if we can't even figure out in less than two weeks whether or not there are drones in our own airspace. I don't know what's going on and am not pushing any particular theory. I've got a lot of things in my probability matrix but none of them particularly make any sense at all, which means I'm missing something critical. (Which is hardly a surprise.) reply pjc50 3 hours agorootparent> nobody has the authority to figure out what is going on, or nobody has the motivation, or nobody has the technical capability Well .. SNAFU? This is basically what I'd expect. In these kind of cases there's a steady stream of crank reports from the public which are 100% false positives. The authorities will have a process for routing all the UFO reports to someone who sends out form letters and otherwise ignores them. The actual airspace protection is done by radar and whatever the US calls \"QRA\". There's no suggestion or evidence of any damage, so this ranks as a much lower threat than all sorts of other things like celebrity CEO assassins. In order of decreasing likeliness: - nothing there - just regular commercial aircraft - weird aircraft, but classified, hence the blank response from authorities - eccentric hobbyist or intentional faker - aliens - foreign drones reply jerf 1 hour agorootparentSNAFU is high on my list too, though generally I'd expect someone to have jumped in front of this by now. (That may be happening; see the responses from Congress today, which are the sort of thing that would look like.) Again, part of my analysis is the length of time this has been occurring; theories I had in the first couple of days generally involved the problem being only a couple of days old. The longer the mystery persists, the more we have to reconsider such theories. reply lupusreal 1 hour agorootparentprevForeign drones must be above aliens (but no higher I think.) Foreign drones are known to exist, while aliens are just speculative science fiction. reply voxic11 1 hour agorootparentI assume it was just a joke since the one thing the authorities have been willing to say is that they are definitely not foreign drones. reply delfinom 3 hours agorootparentprevYou forgot near the top. - Chinese nationals using off the shelf drones to take photos of military installations Just this week: https://www.military.com/daily-news/2024/12/11/chinese-citiz... A few months ago: https://www.wired.com/story/fengyun-shi-espionage-act-drone-... Lol reply reverendsteveii 2 hours agorootparentYou'll notice they were able to identify both the flyer and the purpose of the flight in both these cases. reply IncreasePosts 2 hours agorootparentprevWhy would they be interested in a random military installation in New jersey? And not omething on the Pacific coast or Hawaii or Guam or in the Philippines or Japan or Okinawa be more likely? reply btbuildem 1 hour agorootparentBecause the US is full of infrastructure that is critical but weak, and the JIT supply chain stretched to the thinnest of margins in the name of sacred profit can often be the best point of attack. Remember when Helene ravaged the southeastern US? One of the things that got cut off was a plant producing saline -- turns out, the US gets its saline from three manufacturers, when one went dark, the effects were felt nation-wide. Effects like cancelling surgical procedures for the lack of basic resources, and saline shortages lasting until today. It would make a lot of sense for foreign adversaries to scope out these weak points, and integrate them into their strategies. reply axus 2 hours agorootparentprevTo get paid for the pictures, but not have to travel far? reply reverendsteveii 2 hours agorootparentprevQuestion: how do you think the US government post-9/11 would respond if they actually didn't know who belonged to these drones and they were less than an hour from Washington DC (given a flight speed of 200mph https://en.defence-ua.com/weapon_and_tech/325_kmh_while_ukra...)? Would they pussyfoot around for a week, then blow smoke up our asses about it or would they immediately eliminate the threat and then blow smoke up our asses about it? I think that someone somewhere knows what's happening and won't tell us but has enough authority to stand down an armed response, which to me sounds like DHS or DoD. reply michaelt 2 hours agorootparentprev> fecklessness of all the relevant authorities. [...] nobody has the authority to figure out what is going on, or nobody has the motivation Some would see that as an admirable example of a small government not overstepping its bounds. The local sheriff doesn't have the authority to shoot down aircraft? And doesn't exceed their authority by shooting them anyway? Good job local sheriff. The FAA has a handful of drone regulation folks? Nowhere near enough for a 24/7 national quick response drone tracking force? Very restrained and cost-conscious, good job FAA. Congress hasn't authorised the military to spend taxpayer money on a national anti-drone-swarm defence system, and nobody's spent taxpayer money without authorisation? Sensible, we don't need bureaucrats funding their pet projects on the taxpayer's dime. reply teksimian 2 hours agorootparent> Some would see that as an admirable example of a small government not overstepping its bounds. some would see it as a government in paralysis through bloat and bureaucracy with accountability not being clearly assigned to anyone. This is more likely the case now. reply nradov 2 hours agorootparentprevThe type of drones that are small and cheap enough to make a \"swarm\" lack the range to cross the Taiwan Strait. They would have to be launched from a ship or larger aircraft, which are vulnerable to existing defenses. Lessons from land conflicts in Eastern Europe have very limited relevance to naval conflicts in the Indo-Pacific. reply tigerBL00D 2 hours agoparentprevI would not write this.off as hysteria. It's important to consider motivation of potential actors. Every advanced rocket guidance system uses cameras to zero in on its targets during the final approach. You can't rely on GPS at that point. To do a good job you need to know what your target looks like and high resolution drone imagery helps a lot. reply exitb 1 hour agorootparentWhy put lights on the drones? Why not map during the day? reply pc86 1 hour agorootparentCould be multi-phase testing? Easily-acquired lighted drones in one phase, dark drones in a future phase? reply ninininino 3 hours agoparentprevHave you been following this news story at all? There are probably hundreds of video clips on social media depicting the same craft. So I'm not sure what the relevancy is of your story. https://www.youtube.com/watch?v=OT9rrkYGAUU&list=RDNSOT9rrkY... 3 minutes and 7 seconds in this video is a good example of what these typically appear as. But yes it's most likely a US military drone exercise or active operation (have seen conjecture about a search for something, testing drone capabilities in a noisy RF environment. reply jerf 3 hours agorootparentThe military theory doesn't fit to me on the grounds that at this point they should be just admitting it. They're calling more attention to the drones than they would if they would just say \"yup, those are ours\". You don't hide things by parading them around in front of people. They've got all sorts of places to secretly fly things and all the permits they need to create whatever RF environment they want in the process. The military has had all sorts of secret aircraft over the years and they never test them by loitering around civilian areas for weeks at a time making damned sure thousands of people can get photographs and turn it into a national story. There's plenty of things like photos of the stealth aircraft that people accidentally caught and didn't realize what they were until years later when the relevant aircraft become public knowledge, but those were generally obtained despite the precautions taken, not because they were cruising around in major cities in broad daylight. The fact that this is still one of the best theories I've got despite everything I just said is a sign of how weird this situation is. reply unsupp0rted 2 hours agorootparentThe next question after \"yup those are ours\" is \"then why are they there\", and they might not wish to answer that one. reply kjkjadksj 1 hour agorootparent“Training exercise” case closed if they wanted to end it right there. reply unsupp0rted 54 minutes agorootparentThat wouldn't close the case for most people. Not that leaving it a mystery like they're doing right now is any better. reply nonameiguess 2 hours agorootparentprevWith all due respect, this is yet another instance of Hacker News confidently stating very wrong things. My wife ran the operational testing program for a classified Naval aircraft capability for nearly a decade. They flew unmarked planes out of a commercial airport. People photographed them and asked questions all the time. Nobody ever answered them. Neither confirm nor deny is standard practice. If you have something like the U2 flying at 50,000 feet, by all means, hide it. Fly out of Area 51 or whatever. But if you're just modifying standard aircraft and it flies low enough that people are going to see it anyway, the best you can do is keep it out of anyone's hands to physically examine, but you can't keep people from seeing it. She used to show me speculation just like this on hobbyist observer web forums. People speculating the planes belonged to the CIA, were running cocaine shipments, all kinds of crazy shit. Nobody for whatever reason ever guessed the obvious and only true statement. It was just basic military aircraft testing out new surveillance tech that wasn't ready to field yet. Not \"surveillance state monitor the public\" shit that Hacker News thinks we're doing, either. Just cranky weird shit like hiring a bunch of people in west Texas to ride around on camels and horses and seeing if you can tell the difference, because it's a lot easier to do that first over territory you control before you try to do it in Iraq. reply jerf 1 hour agorootparent\"civilian areas for weeks at a time making damned sure thousands of people can get photographs and turn it into a national story\" was not an extraneous part of my quote. This is not just \"not answering questions\", this is rubbing it everyone's face, this is running around in the airport shrieking about their secret airplanes and making sure everyone notices them and then telling everyone \"oh, but no, those aren't ours what on Earth could they possibly be??!?\". This is not how they do things, which your post reinforces, not contradicts. Tell me when anything your wife did ended up on the national news for days at a time like this. reply freejazz 1 hour agorootparent> was not an extraneous part of my quote It's just more of the same. reply eagerpace 15 minutes agorootparentprevEvery clip in that video looks like an aircraft to me. reply Aloisius 25 minutes agorootparentprevI don't understand. That is clearly just a plane at 3 minutes 7 seconds. reply 404mm 3 hours agorootparentprevAfter seeing that news clip, my only question is “why do they care?”. I’m not saying nobody should care but why do we have citizens on the hunt for drones. From the look of it, the drones don’t seem to be invading citizens privacy, nor does it put them in danger. It’s pretty clear they don’t even know where exactly the drones operate, which is understandable given the conditions. And why does the mayor care? Cities can impose certain restrictions on drone operations but they cannot just ban drones. They don’t own the airspace. This is up to FAA/FBI/DHS to investigate, if they have reasonable belief laws are being violated or safety is being threatened. Local law enforcement or state agencies can investigate as well but from a different angle (privacy violations, local ordinances, noise complaints, trespassing…). reply anarchy79 2 hours agorootparentThis is too funny, someone's having a laff! reply anarchy79 2 hours agorootparentprevAaahahah! The guys who are doing this are absolutely shitting themselves laughing right now, sending the whole nation into UFO panic and getting it on national news and talked about at the highest levels of government for a couple hundred bucks. No drones necessary! It's fucking genius, and just like magic tricks, it's so simple that everyone overlooks it and jumps straight to \"MUST be actual magic/Aliens/secret government program/evil communists!\", and for the same reason- people want to get tricked, mesmerized, shocked, see something magical and special, to the point that they become absolutely blind to the most mundane explanations, and that's precisely why it works so well! Not going to ruin it for them either, if you figure it out you figure it out and then you know, it's pointless telling people anyway because they will just come up with random nonsense to dismiss it because 1) they want to believe so hard, 2) they won't admit they were so easily tricked. Sorry for being an ass, I'm just finding this situation absolutely hilarious! reply left-struck 4 hours agoparentprev>Professional Drone photographer Please tell me that’s someone who takes photos using drones not photos of drones - for a living reply Out_of_Characte 4 hours agorootparentSome people have the most bizarre hobbies. From photographing bigfoot to ufo's or planespotters. I dont intend to understand all of them but photographing drones might be one of the more moral ones in this century. Just imagine drones filming your living room, or military installations like feared in the article. Having someone record such incidents is appreciated. reply left-struck 3 hours agorootparentOh yeah I totally get having a niche hobby. I’ve personally considered starting a collection of photos of modified 90s Japanese cars. I take photos all the time of my cat with a “pro” camera but that doesn’t make me a professional cat photographer. Now if I were making money from it on the other hand… I would be amazed if there’s enough of a demand for drone photos to support someone reply andrewflnr 3 hours agorootparentprevProbably. At least, I know that job definitely exists. reply j_timberlake 10 hours agoprevQuick summary after following this for a few days: FBI says they're rotary and fixed-wing drones, White House says they aren't foreign adversaries, Pentagon says they aren't USA military, all 3 insist that there's no indication of a real threat despite the drones being bigger and higher tech than retail drones. Politicians are PO'd that something about this doesn't add up: How can anyone know these aren't a threat without knowing whose they are? Why isn't anyone bringing them down? Where do they land? Is this similar to the Chinese spy balloon? I've seen a huge number of theories by now, and not one of them actually fits. reply gregw2 5 hours agoparent\"How can anyone know these aren't a threat without knowing whose they are?\" Easy. They didn't say they don't know whose they are. They could belong to a private contractor who is paid by the military but the military doesn't own the drones nor company (plausible deniability /outsourcing.) Or they could be a friendly country (e.g. UK) red-teaming the US with our consent. I've never heard anyone apply the Five Eyes horse trading to inter-country UFO-related dynamics of operation but its fairly conceivable and has a bit of precedent, right? reply j_timberlake 1 hour agorootparent\"They didn't say they don't know whose they are.\" The FBI explicitly said they didn't 2 days ago. There's a possibility the FBI is being purposefully left in the dark by other feds, or lying under oath at risk of prison time for perjury, but without any evidence that's just one more of MANY conspiracy theories here. reply philistine 9 minutes agorootparentIn the three-letter agency soup, it's very possible another agency called them and said: you guys don't know who these are, and you will never know. But we know. reply mdgrech23 4 hours agorootparentprevyea this is the sad shitty answer - it's just a private company w/ a government contract gathering data on us reply next_xibalba 4 hours agorootparent> gathering data on us A substantial leap. Given that these are flying near military installations, wouldn't the most plausible explanation be that these are test flights? What data would be gathered from low altitude that could not be aggregated from the myriad other sensors in our environments? Or from satellites, etc.? Seems like the U.S. military has taken to heart that in any near future conflicts, forces of any branch will need to be heavily augmented by drones for reconnaissance, offense, and defense. So, if that's true, I would expect any military site at which personnel are trained to be flying drones constantly. And it serves them no benefit to let everyone know what they're doing. If the U.S. public is \"read in\", so are all potential adversaries. reply j-krieger 9 hours agoparentprev> How can anyone know these aren't a threat without knowing whose they are They are - obviously - lying. This screams secrecy to me. All 3 know that these drones are not a threat. They aren't US military because they are a 3 letter agency program. They know there's nothing to worry about it, but they won't tell you any more details. Which has been the modus operandi for secret services for decades, so I'm surprised it's such an issue? reply j_timberlake 13 minutes agorootparentThese are the least-bad theories, but if an agency is desperate enough to deploy the drones night after night even after being noticed, then that's extremely foreboding. What would drive them to do that, a dirty bomb that needs to be found with drone sensors? Personally I'd rather have evidence of this before dwelling on all the possible tragedies here. reply rjrdi38dbbdb 8 hours agorootparentprevI think what's so surprising is that they would run a secretive program in such a conspicuous manner, not that the secretive program exists. reply fasa99 1 hour agorootparentExactly. That's what I think it is, government secrecy as their standard operating procedure. When unsure, don't say anything. After all, disclosing the public includes adversaries also knowing. It seems to me what's happening is a \"Streisand Effect\" where the whole attitude of \"go away, nothing to see here\" is in fact maximizing attention and defeating the purpose of hiding this away. If it were me I'd put a band-aid on a drone, fly it to a person, and say, \"we are testing military capabilities to render first aid to our soldiers\" or something similar. It's not a lie, it's good optics, adversaries can worry about it... then put whatever it is on ice for a while until the heat dies down reply cheschire 6 hours agorootparentprevCan you think of a better way to normalize it? Think about the average persons response to online privacy these days for a good indicator about how people will feel about drone monitoring in a few years if this is normalized. reply wholinator2 4 hours agorootparentnext [6 more] [flagged] wrigby 3 hours agorootparentPlease don't do this. You're not going to hit a drone at any appreciable altitude from a \"high window\" with a \"nice rifle.\" One of the first rules of putting bullets downrange is to know what's behind your target, and you simply can't know that when you're shooting into the air. See also: https://en.wikipedia.org/wiki/Celebratory_gunfire#Injuries reply shagie 2 hours agorootparentprevThe FAA classifies drones as aircraft. https://www.faa.gov/Air_traffic/Publications/atpubs/aim_html... Damaging an aircraft is considered criminal aircraft sabotage under 18 U.S.C. 32 https://www.law.cornell.edu/uscode/text/18/32 https://www.justice.gov/archives/jm/criminal-resource-manual... There is nothing in there about if the aircraft is legally or illegally operated. https://dronedj.com/2024/06/30/florida-walmart-delivery-dron... And for more resources for drone pilots: https://www.dronepilotgroundschool.com/shooting-drone/ --- Firing on drones is a good way to lose your freedoms and even beyond that one's rights to have firearms. reply AdamJacobMuller 1 hour agorootparenthttps://www.youtube.com/watch?v=E54YtvmRKAM reply pjc50 3 hours agorootparentprevIt's kind of amazing that you can post incitement to terrorism on HN. People have been jailed for using high-power laser pointers against aircraft. reply Gwiz462 3 hours agorootparentprevMaybe that is why they are only being tested in the Coastal states. reply curt15 7 hours agorootparentprevShoot one down and see who comes knocking? reply hiatus 4 hours agorootparentIf history is any indication it will be local police responding to shots fired. Many municipalities in NJ do not allow the discharge of a firearm within town limits. Morris Township has such a law in their code as well. reply zelon88 2 hours agorootparentI wonder where the threshold is for claiming self defense against a drone? Does the Castle Doctrine apply to non-human assailants? reply Loughla 1 hour agorootparentMore like - does the castle doctrine apply to defending yourself against someone not actually trying to enter your castle. It would be like shooting someone for taking pictures of your house from the street. I'm relatively certain law enforcement would have opinions about that. reply zelon88 1 hour agorootparentI don't think you understand. It sounds like you think I'm talking about defending youself against a human. I am not. If a drone is trying to gain access to your home, do you have the right to defend against it using deadly force? Meaning; Force that would be deadly to a human attacker. reply hilbert42 5 hours agorootparentprevHa, with all this publicity someone will likely take up the challenge and possibly succeed. The hunting instinct in some is just too strong. One wonders how they'd keep tracking it down a secret especially if the perpetrator was smart and gave them a decent run for their money. reply euroderf 7 hours agorootparentprevFourth Amendment in action ! reply WaitWaitWha 4 hours agorootparentThis could be scoped very tightly to reasonableness with an emergency warrant, plenty of probable cause. Can you elucidate what you meant? reply duxup 4 hours agorootparentprevThis seems like it would be a difficult task to accomplish. reply rmbyrro 6 hours agorootparentprevCareful who you wish on your door... reply weard_beard 5 hours agorootparentThis is America. If they want to come knock on my door without identifying themselves they'll get worse treatment than their drone. reply KumaBear 4 hours agorootparentPeople like this talk a big game but the warrant will be written and they will comply. Always the online warriors that act tough but always fold. reply pjc50 3 hours agorootparentNot just that, there are plenty of documented instances of people being shot dead for being suspected of holding a gun. Do people really think they can just shoot a cop, close their front door, and go back to living their life? reply next_xibalba 4 hours agorootparentprevOr they will end up in situation that in most cases will end in their death. Which seems so obvious that they must be suicidal. Law enforcement can bring far more force to bear than a single person can defend against. reply hnpolicestate 3 hours agorootparentHN has so much boot in its mouth. Authority says jump and you guys ask how high. reply mrguyorama 4 hours agorootparentprevAll this talk about \"2nd amendment is about deposing tyranny\" and yet they weren't the ones protesting the wars in the middle east and the Patriot act, two recent and objectively tyrannical acts. In fact, we know that the gun nuts in the US were broadly on the side of SUPPORTING those two things. reply next_xibalba 4 hours agorootparentI think you're importing heavy bias into your interpretation. 2A types are interested in deposing tyranny when its directed against them by their own government. Not tyranny anywhere on the face of the Earth. If that's true, and I do believe it is, it is not at all incompatible with foreign wars, whether one believes they're tyrannical or not. reply mindslight 17 minutes agorootparent> 2A types are interested in deposing tyranny when its directed against them by their own government The NRA's complete silence on the murder of Breonna Taylor by government agents, as retaliation for Kenneth Walker exercising his 2A natural right to self/home defense at night. Case closed. \"Freedom\" culture seems to have become just as post-reality detached from effective values as everything else. mrguyorama 1 hour agorootparentprevFull transparency: I think the only \"Tyranny\" that \"2A types\" care about is a law banning guns. They seem to love the militarization of the police, police having zero accountability (\"They do a hard job\", so do I but I don't get to shoot someone cause I was spooked and then go on vacation), and literally vote for Trump, who objectively has done more to remove gun rights than any democrat since clinton. An absurd amount of the most aggressive 2A types are literally just cops, you know, the actual boot that would stand on the neck in any tyranny situation. They'll scream and cry about the ATF and then talk with their cop buddies while smoking some MJ, in a state without recreational cannabis laws. In short, they are dishonest, whether they are smart enough to realize it or not. reply scarecrowbob 18 minutes agorootparentI agree. To be clear, I have a lot of guns, but it's not because I have any special love of the US BoR or even a belief that they are useful against state actors. Or, even a real enjoyment of shooting. I have guns because my neighbors all have guns and think queer/trans/atheist/lefty/etc folks are literally demonic. They are explicitly waiting for any suspension of regular government in which they can play their fantasy of a \"purge\". I'd much rather be collecting pretty dresses, but this is how it is where I live. I would say that the parent comment is accurate in noting 2A loving folks don't want government authority applied to -them-, but it's -only- to them and many are living in the privileged fantasy that this power will never be applied to them and only to their grievances- hence the boot licking they do. I don't think that's dishonesty, I think it is delusional. And they generally go from being \"normal conservatives\" to out right fascists just as soon as that fantasy weakens even a little. afthonos 4 hours agorootparentprevI like the idea that the government will show up without identifying themselves just so people can live out their fantasy of shooting someone without getting into trouble. They will absolutely identify themselves. The reason you should be worried is the endless, expensive process you’ll be subjected to after they knock on your door. reply lazyasciiart 23 minutes agorootparentApparently they didn’t identify themselves to Breonna Taylor. It’s probably happened more than once. reply jf22 2 hours agorootparentprevWhat will you do? Are you going to shoot people for knocking on your door? reply tuyiown 4 hours agorootparentprevI don't know much about america, but after shooting down a secret drone, you really would assume that people knocking at your door really is the situation you think it is ? reply addandsubtract 8 hours agorootparentprevIf you wanted to find out whose they are, just follow them and see where they land, and who picks them up? reply diggan 6 hours agorootparent> just follow them How exactly do you follow a fixed-wing drone? Some of the high-end/industrial drones has pretty impressive ranges. reply potato3732842 6 hours agorootparentYou pay a bunch of money to someone who has a Dash 8 or similar common commercial aircraft. These drones probably don't have 1000mi range. And even if you can't follow one all the way to its destination you can still take some real good pictures with flash and plaster them all over the news and wait for someone to say \"I pump fuel and sweep floors at airport X and a bunch of dickbags with black suburbans and bad attitudes have a hanger full of those things\". reply almog 6 hours agorootparent>These drones probably don't have 1000mi range. Since you're replying to a question about tracking fixed wing it's worth mentioning that their range can be well over 1000 miles as some of the Iranian Shahed drones have a range of almost 1600 miles. reply nradov 5 hours agorootparentprevA Dash 8 or other similar commercial aircraft lacks the radar necessary to track an aerial target. Most airliners have weather radar but it's not really useful for this purpose. In much of the airspace around that region a Dash 8 would also have to operate under ATC control; the pilot can't just fly wherever without getting violated. reply philistine 7 minutes agorootparentGet your own 1600 miles range black ops drone of your own then. j2bax 6 hours agorootparentprevWith a fixed wing drone of your own of course! reply red_admiral 2 hours agorootparentYeah, unless someone really really big is behind this (or it's aliens), then a US military drone should be able to track and follow one of the unknown drones for a while. reply falcor84 6 hours agorootparentprevWell, there's a lot of evidence that humans evolved to be persistence hunters, so we just need to continue this process and adapt further. reply 1oooqooq 8 hours agorootparentpreva shining example of a functioning democracy. reply JKCalhoun 4 hours agoparentprev1) You don't need a single theory to fit all the evidence — some sightings might be unrelated to others. 2) You don't need a theory to fit all the evidence since, undoubtedly, not all the evidence is accurate. A theory that fit most of the evidence is adequate. 3) We all know people and even photos lie. That gives us quite a bit of leeway to be dismissive of sightings and official responses as well. reply Aloisius 12 minutes agoparentprev> FBI says they're rotary and fixed-wing drones The FBI simply repeated what public reports and eyewitness have said - a rather massive difference. reply pelorat 3 hours agoparentprevBecause they have navigation and avoidance lights on, as required by the FAA. This is dumb hysteria. reply kulshan 57 minutes agorootparentAP reported yesterday they are often running without any lights at all. reply otikik 7 hours agoparentprev> How can anyone know these aren't a threat without knowing whose they are? Because they are theirs, obviously. They just won't say it. reply ptero 5 hours agorootparentNeither FBI nor Pentagon have ability to fly drones in the US airspace at will. On the contrary, they, like everyone else, have to get FAA approvals and those always leak. And usually in fact published by the FAA who needs to warn pilots of potential threats -- one could go to the official FAA website and search those NOTAMs. Ignoring FAA by the FBI or the military just doesn't happen, the price to pay is WAY too high. NSA or spooks could theoretically be behind this, but why do it where it annoys people and attracts attention and not in some desert or foreign place? Something doesn't add up. reply next_xibalba 4 hours agorootparentIsn't airspace around all military installations exempted from this? How would you train your people to use your drones otherwise? What's more, the feds are clearly signalling that these are ours. As others point out, you can't say its not an adversaries asset unless you know whose it is. Which would suggest either they are flying these illegally, they have some kind of exemption to fly in civilian air space, or they are being flown in military air space that is observable from non-military locations. reply hmmm-i-wonder 5 hours agorootparentprevWhile completely true, it doesn't address the fact that CIA, NSA, FBI and other gov agencies have used their control or secret ownership of 'private' companies to break federal regulations in the past. They _could_ be using some sort of cutout to confuse the ownership/control to get around regulations. reply otikik 1 hour agorootparentprevI can imagine a parallel chanel where FAA is informed but NOTAMS are not issued, or issued selectively. reply tomrod 5 hours agorootparentprevAttracting attention in one direction can be misdirection. I have no idea if that is the case here, simply felt like it's an avenue not considered. reply guerrilla 5 hours agorootparentprev> Neither FBI nor Pentagon have ability to fly drones in the US airspace at will. And neither of those agencies ever did anything they're not \"able\" to do... regularly... reply briandear 2 hours agorootparentprevThere is a NOTAM for these. reply nradov 5 hours agorootparentprevThe FBI, NSA, and all other civilian agencies must follow FAA regulations but legally speaking the military doesn't. The military operates aircraft in domestic airspace under a memorandum of understanding with the FAA which basically states that they'll follow the regulations. This makes things easier for everyone and prevents mishaps. But if the military chooses to violate that agreement then there aren't really any enforceable legal consequences. reply ComplexSystems 5 hours agorootparentprevWhy don't they just say it then? Who cares? reply mrguyorama 4 hours agorootparentSame reason the feds didn't say anything about the F-117 in the 80s when hundreds of people in nevada were mistaking it for a UFO: They have no interest in telling the world about the exact nature of their ISR assets. The US DoD has recognized a lack of capacity and capability in our native drone programs when examined in context of the Ukraine war. They are spending plenty of money to shore of that lack, and not all of the programs and projects they are funding are through Anduril and have literal fan groups. reply keepamovin 9 hours agoparentprevWhy do the theories not fit? And where's the link to the FBI statement? I believe they said \"include rotary and fixed-wing\" not exclusively, but this is based on reports received. They haven't actually captured one. included sightings of both fixed-wing and rotary drones, Robert Wheeler, the assistant director of the FBI’s Critical Incident Response Group, said during a Homeland Security subcommittee hearing on security threats posed by drones. source: https://www.nj.com/news/2024/12/more-than-3k-mystery-drone-s... reply j_timberlake 9 hours agorootparentNo point quoting articles, just watch him say it: https://www.youtube.com/watch?v=dTotPeiMjlc&t=6767s Up to you how you want to interpret his exact words. reply keepamovin 9 hours agorootparentYeah there's a point quoting, people here don't always watch videos, but thanks for the link. Article gets the quote slightly wrong, but semantically it's right: some are described as being slightly larger than um um than a commercial uh available drone um fixed Wing as well as rotary Technically you could say the rotary/fixed-wing is only invoked to describe the class of drones compared to which these reports are larger, not that the reports \"include\" (\"some are described\") fixed wing and rotary. I'm OK with either the weaker (less UFO) or stronger (more UFO) interpretations. How about you? reply xattt 8 hours agorootparentBack in my day, we called “commercial fixed-wing drones” RC model planes. reply pc86 1 hour agoparentprevDid the WH say \"these are not foreign adversaries' drones\" or did they give some mealy-mouthed nonsense like \"there is no evidence that ...\" or \"we have no reason to believe that ...\"? Because those are two very different things. reply j_timberlake 55 minutes agorootparentPentagon: \"Our initial assessment here is that these are not drones or activities coming from a foreign entity or adversary.\" They can potentially claim \"our initial assessment was wrong\" later, but IMO they could have done that anyway regardless of their word choice here. reply axegon_ 3 hours agoparentprevI think the one thing no one really mentions is the fact that drones are extremely easy to build in the comfort of your living room. If you have a 3d printer, some spare parts laying around and a cheap electronics store around the corner(check, check and check in my case), you can build a drone for less than 300 bucks which is far less than the retail ones - completely autonomous, no radio link needed, takes off, does what it does and lands on it's own with no human intervention. reply creaturemachine 3 hours agorootparentWe all have that same cheap electronics store, it's called AliExpress. reply jyounker 5 hours agoparentprevIt's easy to say they're probably no threat. The number of ways for something to be a threat is much smaller than the number of ways of something being a not a threat, therefore the probability of them being a threat is very low. It's always possible to make a just-so story about them being a threat, and those are the kind of stories that catch people's attention. The odds are they belong to a mapping company, or a drone construction company, or a university or something else completely innocuous. Why don't we know? Well because it's a big world, and people dealing with actual problems have more important shit to deal with. reply hersko 2 hours agorootparentWhat? There are many recreational (small) drone rules with the FAA because they can harm people. A 6 foot drone falling hundreds of feet on someone is obviously a threat. reply red_admiral 9 hours agoparentprevI guess the CIA/NSA are technically not \"military\"? reply JKCalhoun 4 hours agoparentprevThe most likely theory I have seen is regarding a craft from Pivotal Aero [1]. I'm not sure what the holes in that theory are. (When some John Bircher shoots one down though I suppose we'll have our answer, ha-ha, not-ha-ha.) [1] https://pivotal.aero reply duxup 4 hours agoparentprevIt doesn't strike me as odd that politicians would be out of the loop at times, especially locals. reply stronglikedan 3 hours agoparentprev> Pentagon says they aren't USA military But they apparently didn't fly on Thanksgiving, which is an interesting coincidence if true. reply pjc50 7 hours agoparentprevI'm reminded of https://www.theguardian.com/uk-news/2020/dec/01/the-mystery-... No \"official\" conclusion, but the common sense position seems to be that most or all of the reported incidents were nothingburger. reply andrewla 3 hours agoparentprev> FBI says they're rotary and fixed-wing drones, White House says they aren't foreign adversaries, Pentagon says they aren't USA military Do you have sources for these? Not challenging the assertions, but all I see in the news articles is vague un-attributed paraphrasing of statements. For example you say that the \"FBI says they're rotary and fixed-wing drones\"; the latest I saw from the FBI was what this article said; that they had lots of reports of sightings but no further information. The pictures I've seen all look like blurry pictures of helicopters; also occasionally blurry \"orbs\". Does nobody have access to anything better than this? Is this even a real thing? reply j_timberlake 41 minutes agorootparentSkip the articles, go to the source: https://www.youtube.com/watch?v=5ETJ2d0o3Zk https://www.youtube.com/watch?v=9MPJydlIpfs https://www.youtube.com/watch?v=dTotPeiMjlc (CSPAN links would be better, but I've already spent way too much time on this.) Would have put sources in if I'd realized I'd get this many views. I also might have mixed up what the Pentagon says vs the Press Secretary, but since they both answer to Joe, it shouldn't matter much. reply Aloisius 6 minutes agorootparentSo the FBI didn't actually say they were drones. The FBI said public reports and eyewitnesses said they're drones. reply noworld 3 hours agoparentprevSomeone just needs to shoot one down. reply briandear 2 hours agoparentprev“The aren’t military.” Yet there are dozens of other agencies that work with the Pentagon that aren’t military either. These are likely part of an SCI program — either a real op or a training op. Very few people would know what’s going on, so most of the agencies commenting likely are being completely honest based on their own knowledge. This is government. FAA NOTAM FDC 4/1797 Restricts the airspace until 20 December. If they were truly “unknown” then why would the NOTAM arbitrarily end on 20 Dec? If they were unknown, they’d have the NOTAM be indefinite until the situation were resolved. reply mnky9800n 8 hours agoparentprevPerhaps Dr. Evil has shown up, requested 1 million dollars, or otherwise his drones will attack innocent civilians? reply rmah 4 hours agoparentprevThe Chinese \"spy balloon\" that it turned out wasn't a spy balloon (according to the pentagon)? https://www.bbc.com/news/world-us-canada-66062562 reply left-struck 4 hours agorootparentFrom the article you just linked ‘Pentagon spokesperson Brigadier General Pat Ryder said on Thursday that the US was \"aware that [the balloon] had intelligence collection capabilities\". But \"it has been our assessment now that it did not collect while it was transiting the United States or over flying the United States\".’ When did the pentagon confirm it was not a spy balloon? The article is very short and the meaning is clear, it doesn’t say anything about whether the pentagon thinks it’s a spy balloon. reply pc86 4 hours agorootparentprevYour assertion is not supported by your source: > Pentagon spokesperson Brigadier General Pat Ryder said on Thursday that the US was \"aware that [the balloon] had intelligence collection capabilities\". ... He said the efforts the US took to mitigate any intelligence gathering \"contributed\" to the balloon's failure to gather sensitive information. So it was a spy balloon but it was off, or it was a spy balloon and on and we outsmarted it, or it was a spy balloon and it malfunctioned at least in part. Nothing in that source suggests that it was not a spy balloon. reply left-struck 3 hours agorootparentMaybe the article had a different headline and they didn’t read the actual article? I’m baffled how some could read that incredibly short article and come away with any assertion about what the pentagon thinks about the balloon other than that it can collect ”intelligence data” reply apcragg 21 hours agoprevThe photos I've seen posted look very obviously like commercial airliners and helicopters with their navigation lights on. You can even make out the American Airlines livery on the tail! https://www.app.com/story/news/local/new-jersey/2024/12/11/d... reply gradus_ad 20 hours agoparentI live in NJ. I've seen these drones. They are not commercial airliners or helicopters. They are loud, fly low and slow, and make abrupt turns unlike any planes I've seen. Their lights are also very different from other aircraft. I can see how it's tempting to chalk this up to hysteria, but they are absolutely large drones of some kind. reply motorest 12 hours agorootparent> I live in NJ. I've seen these drones. They are not commercial airliners or helicopters. They are loud, fly low and slow, and make abrupt turns unlike any planes I've seen. Their lights are also very different from other aircraft. You better crank out your camera and collect any proof at all,because what you are describing bears no resemblance to the sightings mentioned in the article. There is a reason why sightings of supernatural fenomenal went down abruptly with the inception of cheap digital cameras. reply iepathos 10 hours agorootparentFor real, with everyone having a smartphone with high quality cameras on them there really is zero excuse for there to not be highly detailed accurate videos of this if they are legit especially with people describing them as \"low and slow\". reply The_Colonel 10 hours agorootparentThe article suggests the drones appear during nighttime with which cameras will struggle. \"low\" is relative and can mean 200 meters which would be very difficult even for regular cameras (without a tripod), let alone a smartphone. reply jahnu 9 hours agorootparentEven taking a picture of the moon with a typical phone results in a white mushy blob. reply diggan 6 hours agorootparentI like that parent said \"200 meters\" and then you give a \"even\" example with the distance of ~400,000 kilometers :) reply rmbyrro 6 hours agorootparentCompared to the radius of the known Universe, it's in the ballpark reply jahnu 45 minutes agorootparentprevHaha fair enough :D reply DaiPlusPlus 7 hours agorootparentprevUnless you have a Samsung phone… https://www.theverge.com/2023/3/13/23637401/samsung-fake-moo... reply HPsquared 5 hours agorootparentThis technology may well \"fill in the blanks\" with small flying objects too. Make them look like the most common i.e. airliner or helicopter. reply bagels 40 minutes agorootparentprevI'm not arguing that these are or aren't anything interesting, but low, relative to airplanes is still pretty far for cell phone cameras, especially in the dark. reply xattt 8 hours agorootparentprevI’ll stop you there and say there are videos. They just happen to be of naturally-occurring phenomena and captured by inept operators who don’t subscribe to Occam’s Razor. reply drjasonharrison 2 hours agorootparenthad to look it up, the opposite of Occam's Razor, it is Hickham's Dictum https://en.wikipedia.org/wiki/Hickam%27s_dictum reply matthewdgreen 6 hours agorootparentprevSmartphone cameras are absolutely useless when it comes to taking useful pictures of distant, moving objects. Even a proper DSLR is extremely difficult to use on a moving object at night due to focus issues. reply kjkjadksj 1 hour agorootparentNot focus issues. Set to infinity it will be fine. But shutter speed issues certainly. When people take sharp photographs at night they generally aren’t handholding a camera and shooting a moving subject. And if they are they are close enough to use flash. reply kjkjadksj 1 hour agorootparentprevYou go take that smartphone of yours and try and take a high quality video of just an airliner at night. Its not easy at all. Even in daylight this is like a 35mm lens on a tiny sensor its not the hardware you need to crop out a speck from the sky and show the world what it is. You really need a lens thats about the size of your calf and the sort of camera that goes along with that. And probably a tripod. Not something many have handy. reply wyager 4 hours agorootparentprevTbf, smartphone cameras are not really \"high quality\" in a way that's useful here. Try taking a video of something with small angular subtension like an aircraft at cruising altitude with a cell phone camera. reply registeredcorn 2 hours agorootparentprev>with everyone having a smartphone with high quality cameras on them there really is zero excuse for there to not be highly detailed accurate videos of this Absolutely not. I understand the tendency to assume that modern tech would make it relatively easy thing to accomplish but there are considerable challenges with ground-based aerial photography/videography...at nighttime...completely unplanned and unscheduled...by an amateur. Better technology makes the field more accessible in a general way, but there is still a very large barrier of: skill, hardware, and out-right luck involved in good image capture as a medium. Consider, if you ever look towards the beginning or end of some runways you may see a group of plane spotters setup taking photos and video of the airplanes. The typical hardware used to capture things well is a minimum of: DSLR, tripod, battery extenders (or spares), and good perch to rest during lulls (it's more physically demanding on your arms then you might imagine.) More crucially, this is for airplanes that are taking off and landing 1) in a predictable pattern 2) at routine intervals 3) captured primarily in daylight. Add in height? Introduce increased shake. Add in darkness? Introduce exposure (hold the camera still, longer to get a brighter image). Add in inexperience? Introduce beginner mistakes. On top of those practical concerns, it's probably also pretty creepy to see these unknown objects/drones/whatever. Fear impacts our ability to react in a helpful way. Smartphones make it simpler to capture a picture or a video, but there is profound gulf between getting something and something even remotely good. If you're not sure what I mean, here's a simple test you can try: 1) Grab a pencil and go into a completely dark room like a basement 2) Turn off the flash on your phone 3) Holding the pencil between pointer finger and thumb stretch your hand as far from your body as you physically can 4) Take one photo of the tip of the pencil eraser one-handed. That is considerably easier than it would be to photograph/video a moving object across the night sky, even if it is perceived as moving \"low and slow\". Longer exposure times mean the camera has to be held motionless for longer so the camera sensor can \"soak up\" more light to \"expose\" the photograph properly. (This is why photos at night feel like they take perceptibly longer to capture than they do in daytime - they do take longer!) Flash can help with nearby subjects, but for objects far away (thousands of feet above you) no amount of flash is going to reach the object to reduce exposure time. Then, let's make things even worse! The object is moving which means that overexposure will turn that solid object into a blur. This is something that is easily possible[1] when taking photos of the night sky. [1] https://photographylife.com/wp-content/uploads/2019/07/Sharp... reply epr 5 hours agorootparentprevThere are multiple videos already, some even in broad daylight. For example, the nbc news clip on youtube about 15 seconds in. reply walrus01 9 hours agorootparentprevI live in the Pacific NW and there are a vast number of people with really good quality trail cameras who put them tied to trees all over the place for deer and elk hunting purposes. If Bigfoot was real, we absolutely would have seen one by now. reply sandworm101 9 hours agorootparentFuturama - s4e17 Sir, if I may? Why don't you just set up, like, a billion video cameras... In the woods and see if he walks by one? Ah. That would be very expensive... And most people who believe in Bigfoot are broke. reply DebtDeflation 16 hours agorootparentprevI've been following the story and this has been discussed on the local Reddit subs. They are almost certainly PteroDynamics XP-4 drones flying from and to the military bases in question for testing purposes. There literally was a public demo of them on the USNS Burlington in Philadelphia a year ago. reply senkora 15 hours agorootparentVideo of that model of drone: https://www.reddit.com/r/EngineeringPorn/comments/13juxdi/pt... reply VectorLock 12 hours agorootparenthttps://www.youtube.com/watch?v=kA1ENhxLqTo reply bloopernova 2 hours agorootparentI really like that it switches off the outer pair of propellers in level flight, that's a nice feature. Changing the vertical alignment of the wings to horizontal after takeoff is also really cool, an interesting alternative to 4 vertical propellers with a separate pair of wings. It seems to eliminate the extra moving parts to control those vertical propellers. reply topspin 11 hours agorootparentprevSomething actually patent-worthy. reply fer 10 hours agorootparentHow? it's just a UAV, quad version of a V-22 Osprey. Maybe I'm missing something peculiar about it? https://en.wikipedia.org/wiki/Bell_Boeing_V-22_Osprey reply rtkwe 3 hours agorootparentThe wing folding mechanism is pretty novel as far as I'm aware. The idea of quad hover to forward flight isn't new or unique but the specific configuration is something I haven't seen before. NASA was working on some that tilted the whole wing not this folding design which uses fewer motors compare to the old NASA Greased Lightning test article. https://www.youtube.com/watch?v=kXql26sF5uc reply topspin 10 hours agorootparentprevOsprey has a common power shaft between the engines for fault tolerance, constraining the structure's design, such as the lack of dihedral. This has a different set of design constraints and a different solution to propulsion failure. reply matsemann 9 hours agorootparentprev\"just\" is doing a lot of work there. Everything is \"just\" an evolution of something else. Doesn't mean it's not novel or clever. reply throwaway48476 10 hours agorootparentprevThe hinge mechanism and the control dynamics. reply j-krieger 9 hours agorootparentprevHN is yet again amazed that military technology is in fact used to carry out secret operations. reply coliveira 16 hours agorootparentprevnext [7 more] [flagged] keepamovin 9 hours agorootparent> should've already learned this, if they were not so stupid. The stupid take is the one you propose, it's ridiculous. So USAF has secret decoys in WWII and before, that followed WWII fighters, and hovered over people's houses, among millions of other sightings worldwide? So advanced yet they don't send them to war? The energy required for some UFO manoeuvres is far above what we know how to create: https://youtu.be/HlYwktOj75A?si=Q68f2ODxgO_IpGlv&t=770 reply mjfl 11 hours agorootparentprevThen Senators should stop blaming Iran for them. It’s irresponsible reply throwaway48476 10 hours agorootparentThey get money from the 'war with Iran' lobby. From their perspective such statements are rational. reply hoppyhoppy2 10 hours agorootparentprevThat was a US Representative, not a Senator, but point taken reply matsemann 9 hours agorootparentprev> People should've already learned this, if they were not so stupid. You're falling in the same trap as conspiracy theorists, though: Putting out almost non-falsifiable statements, and then claiming you know better and are smarter. Either it will be revealed that it was USAF and you can feel smug about being correct, or it will not come out and you can still feel smug about being correct because no one can prove you wrong. reply j-krieger 9 hours agorootparentThird option: You can draw conclusions from past projects made public where this exact thing happened dozens of times. reply paranoidrobot 19 hours agorootparentprev\"large drones\" How large is \"large\"? Some of the articles are claiming \"SUV sized\" drones, but their photos are either of commercial aircraft, or of something that looks to be a DJI Phantom 4, or something much like it. Have you managed to capture any videos of images of these large, low flying, slow moving drones? reply toofy 16 hours agorootparentit’s amazing how so many people have seen these truck sized drones but they’ve all somehow failed to get pictures. i can go outside right now in the dark with this phone i’m typing on and get a solid picture of stuff but somehow they keep showing us pictures that look like 1940s era ufo photo blur. reply ZenRiots 5 hours agorootparentIn my experience the majority of that 1940s photo blur comes when you crop and zoom what otherwise looks like a beautiful digital photograph. I experienced this quite often when utilizing security cameras to try and read license plates. Any movement of the vehicle whose plate you are attempting to track creates pixelization requiring you sometimes to stitch together multiple frames where individual characters on the plate have become clear in order to read the entire license plate. reply FuriouslyAdrift 27 minutes agorootparentHigh resolution film can get to the equivalent to 500 MP resolution just in 35mm. Larger film has insanely high resolving power... https://www.analog.cafe/r/409200000-pixels-with-adox-cms-20-... reply roflyear 16 hours agorootparentprevNo you can't - try it. Take a picture of the moon. reply sethammons 16 hours agorootparentcareful, you may get an AI moon to make up for the fact you can't really get a good picture of it. https://www.samsung.com/uk/support/mobile-devices/how-galaxy... reply HPsquared 5 hours agorootparentThe same probably happens with blurry small aircraft in the scene. It'll \"upscale\" (i.e. draw in) all kinds of objects with what it thinks is most likely from the context, from its training set. reply ben_w 7 hours agorootparentprevI can get an acceptable picture of the moon with my phone (at least when autofocus doesn't decide to do something stupid), yet also I can't get good pictures of birds in nearby trees or urban foxes on the other side of the road. Phone can do night with just hand jitter ok, can't effectively compensate for target motion. reply karamanolev 11 hours agorootparentprevProbably not with a phone, but \"affordable\" full-frame MILC/DSLR cameras with 100-400mm or 600mm lenses exist and people have them. Much better chances. reply The_Colonel 10 hours agorootparentThis article links photos from a Sony full frame camera and 600mm lens but it clearly struggles: https://eu.app.com/picture-gallery/news/2024/12/10/drones-in... reply ycombinete 9 hours agorootparentThese photos look very much like a helicopter. Especially the fifth photo. reply sandos 9 hours agorootparentprevOdd, one of those pictures clearly show either a regular RC helicopter, or a full-scale helicopter. You can see the boom and tail light clearly. And no sound associated with it? There are designs for \"silent\" blades. I mean theyre not silent, bud at least less noisy. reply haswell 9 hours agorootparentprevEven decently fast glass won’t do a good job of capturing drones at night unless there’s a significant amount of ambient light. And telephoto lenses with the range you mention with fast apertures are not exactly cheap. A 600mm F/4 goes for $12-15K and is still not fast enough for shooting moving subjects in the dark. reply theodric 5 hours agorootparentprevI did find it odd when this news reporter said of the craft \"it's really difficult to show you with our camera, so we have to show you with our phones.\" You'd think a broadcast-grade camera rig would be better than a smartphone at this. At the 11-second mark: https://youtu.be/M186uZ1RCxU?t=11 reply ninininino 3 hours agorootparentprevIncorrect, there are dozens or hundreds of video clips showing these drones in both social media and mainstream news. reply Aeolun 19 hours agorootparentprevAt least 6 out of 10 images in the linked article are clearly commercial aircraft. reply abuani 19 hours agorootparentAnd those other 4 out of 10 are very clearly not commercial airlines. I live in NJ was very skeptical of this at first, but after seeing the same patterns 5 nights in a row for aircrafts not going towards Newark, I really have a hard time believing it is simply airlines. reply murderfs 17 hours agorootparentI believe the other 3 pictures are this helicopter: https://globe.adsbexchange.com/?icao=ab19fa&lat=39.865&lon=-... Image 8 is too blurry to make out, but it's probably also a plane. reply sandos 9 hours agorootparentI would agree with that! It matches the curvature of the fuselage in one point, and there is an image with faintly visible nav lights on this page: https://www.anthelionhelicopters.com/flight-training/add-on-... which matches the images as well, with the green light bright, so its likely flying head-on in the picture. reply Aeolun 19 hours agorootparentprevSure, I’m not saying there’s nothing, but there’s clearly some component of hysteria. reply abuani 19 hours agorootparentOh, very much so some elements of mass hysteria. It took the better part of two weeks for authorities to recognize it, then it was \"nothing to see here\", then FBI is investigating. It sucks that one of our state representatives is out their claiming it's Iran and stoking further tensions. My personal feeling is if it was enemy drones, our military would have already taken them down. It's hard to imagine we'd let this go on for many weeks without a response. But it's also hard to imagine military testing so obviously over public space. So who knows lol reply llamaimperative 19 hours agorootparent> My personal feeling is if it was enemy drones, our military would have already taken them down I think you overestimate a few things here… the military isn’t constantly monitoring all airspace across the country for drone-sized objects and shooting things down if they don’t recognize them. Perhaps they should be as we enter this brave new world of drone-everything, but they don’t right now. reply abuani 19 hours agorootparentNJ has some of the leading research centers for the US military, our new president's second estate, and critical infrastructure for telecommunications. Reportedly drones were flying close to all of these spots. I would fully expect our military to be monitoring these parts of the country for drone-sized objects given how effective they have been in waging our wars the past 20 years. So yeah, it's a massive intelligence failure if these are combatant drones. reply llamaimperative 15 hours agorootparentI don't disagree with any of this. Obviously drones are an extremely real intelligence and actual security threat that we clearly don't know how to handle. reply vaxman 18 hours agorootparentprev20 years lol Off by a factor of 2.5x, but your expectation is reasonable --so is having a Defense Secretary that tells his staff when he's checking into the hospital for a serious medical condition and an airspace that doesn't allow balloons to get within range of broadcasting firmware updates to ESP32s. https://www.app.com/story/news/local/new-jersey/2024/12/11/d... reply ZYbCRq22HbJ2y7 16 hours agorootparent> Abichandani has no idea as of now whether the drones over New Jersey are swarming drones. Then this article goes on to speculate about scary things. reply vaxman 5 hours agorootparent..and Abichandani is reported to be an actual academic (in drone swarming technology) at a prestigious university that is local to the observations, not an enthusiast or politician! In next room, I have a nearly 100yo man who, in a small group of people using computers with (literal) core memory, invented the technology, satellites and delivery systems to do Reconnaissance from orbit and more importantly, to spot the first signatures of arial weapons systems, yet downvoted here in the dystopian future when I merely correct the peanut gallery for spreading obvious fiction that America's ability to spot drones does not go back further than 20 years (or that the internal proprietary code of the latest ESP32 series Chinese MCUs has the well known ability to receive firmware updates via RF, even from Chinese balloons, Chinese LEO Starlink competitors and yes, drones). reply dylan604 19 hours agorootparentprevahem, our president-elect. he is not the new president, yet. reply obmelvin 17 hours agorootparentprevThe military isn’t allowed to shoot down drones in the US. There was a WSJ story last month about drones flying over Langley for 2 weeks. All the general could do is stand on the roof and watch reply ANewFormation 16 hours agorootparentYeah they can only shoot down unidentified weather balloons. reply bee_rider 14 hours agorootparentIIRC there were multiple instances of the balloons and the one they shot down was intentionally shot down in a relatively safe area. reply ANewFormation 2 hours agorootparentThey shot down at least 3 including one that 100% belonged to a local club, meaning the military had no clue what they were launching missiles at. One was shot down over Lake Huron, and the pilot actually even managed to miss the balloon with his missile. It's like 99 Red Balloons meets Idiocracy. Obviously the military can shoot down whatever they want, let alone use EM tech, which is highly effective at grounding drones. Drones keep getting sighted near the exact areas that would be testing out drone militarization, and not getting shot down. Gee, I wonder who's they might be. People would be so dramatically more informed if they dropped social media and corporate news. reply ericjmorey 18 hours agorootparentprevHe's the one that got elected as a Democratic candidate and switched to the Republican party about a month after he was elected. reply hersko 2 hours agorootparentprevIt's not hysteria if UFOs start showing up en-masse and then people start thinking everything in the sky is a UFO. It just means people are more likely to attribute lights in the night sky to this new phenomenon. Of course there will be false positives, but it does not mean the underlying issue exists. reply _Wintermute 18 hours agorootparentprevReminds me of the hysteria we had about drones shutting down an airport in the UK, with loads of reported sightings yet no evidence. https://en.wikipedia.org/wiki/Gatwick_Airport_drone_incident reply motorest 12 hours agorootparentprev> And those other 4 out of 10 are very clearly not commercial airlines. Cool, so a simple cursory glance of these mysterious phenomena is enough to immediately call bullshit on 60% of the claims. That's a heck of a false positive rate, given the fact that this happens before any verification takes place. If at least 60% of the claims given the same credibility are outright rejected without any effort, what does it say about the claims and those who make them? reply ricksunny 18 hours agorootparentprevThere is supposed to be an elemwent of 'mimicry' on the part of the Phenomenon. Kelleher in his work with AAWSAP was the most vocal in studying & concluding that aspect: https://www.rdrnews.com/opinion/columnists/drones-mimicry-an... reply lxgr 17 hours agorootparentI'm very sorry, as it's probably a perfectly respectable local news source, but: Did you just link a Roswell newspaper article on UFOs? :) reply wbl 19 hours agorootparentprevWhich ones clearly aren't that or a police helicopter? reply toofy 16 hours agorootparentprevwhy hasn’t someone got decent pictures to back this up after five nights? reply roflyear 16 hours agorootparentThe drones only operate at night and it's hard taking good pictures at night with phones (or even nice cameras) - try to take a picture of the moon, which isn't moving, is brighter, etc.. you can tell it's the moon but it's a lot quality picture. reply Aeolun 12 hours agorootparentDrones are a lot closer than the moon. I’m fairly certain my middle of the line camera can do better than what I see on that article. reply roflyear 2 hours agorootparentWhy argue online? Just try to take a picture outside of a streetlight, or something, in a dark area. You'll see what I mean. reply gloflo 12 hours agorootparentprevDrones are small while the moon is far away. reply mp05 18 hours agorootparentprevStop believing your lying eyes for they deceive you. Here, read this, it will calm your nerves. reply bee_rider 14 hours agorootparentMost of us have not actually seen these things. We’ve just seen social media posts about them. reply bluescrn 19 hours agorootparentprevIf it's got bright lights on it, it's very unlikely to be espionage. reply moralestapia 18 hours agorootparentHiding in plain sight is also a thing. reply numbsafari 18 hours agorootparentSo is sowing mass hysteria and deepening distrust in authorities. reply bee_rider 14 hours agorootparentIt sucks that we have to worry that our normally silly and harmless UFO hysteria and other fringe stuff might actually be an influence operation. (Just because tone doesn’t go well over the internet sometimes: Not disagreeing or being sarcastic, commiserating). reply mschuster91 6 hours agorootparentprevWell that's the natural result of not doing anything meaningful against Russia and its \"plausible deniability\" campaigns in well over a decade. Of course Russia and China feel emboldened when they never felt consequences. reply StanislavPetrov 16 hours agorootparentprevAs someone who lives in New York near two very busy airports, I can assure you that after seeing dozens of planes fly over my house every hour, year after year, it isn't hard to figure out what isn't a plane. reply highcountess 18 hours agorootparentprevBut they got you to click and flip through the slides reply keepamovin 7 hours agorootparentprevIt's not just NJ, here's one weirdn in Miami: https://www.reddit.com/r/UFOs/comments/1hcfaqw/glowing_orb_f... (https://archive.is/VPxBG) (from tiktok account jessica.leigh) Also, a consensus is building that it's ridiculous for the powers that be to claim they have no clue. This is an underappreciated take. See for example: https://www.reddit.com/r/UFOs/comments/1hcdsgf/whatever_this... (https://archive.is/mFMis) reply JumpCrisscross 18 hours agorootparentprev> can see how it's tempting to chalk this up to hysteria, but they are absolutely large drones of some kind It's probably neither enemy infiltration or hysteria, but mis-identified drones and aircraft. (Together with some hooliganism.) Pentagon should investigate. But this is way below the threshold of warranting public alarm. \"What is that thing in the sky\" is a notoriously terrible game for the public. reply walrus01 19 hours agorootparentprevUnder what circumstances and motivations, exactly, do you think that unlicensed and illegal (clearly not FAA Part 107 compliant) drone operators would be motivated to put blinking white, red and green lights on their mystery drones? Why would they do that? If you're doing to build a drone to fly at night and do clearly illegal things you're going to make the thing matte black and have no lights on it whatsoever. reply mmooss 14 hours agorootparent> blinking white, red and green lights I feel like I've seen a lot of that this time of year ... reply 0cf8612b2e1e 19 hours agorootparentprevOr disguise them as birds. https://www.newsweek.com/china-shows-new-drones-disguised-bi... reply op00to 17 hours agorootparentprevWhat’s not part 107 compliant? All the activity I’ve heard was fully legal. reply walrus01 14 hours agorootparentFor starters, you need special waivers from the faa to fly at night. If any such waivers existed, I am sure the FAA would have told the news media who are hyping up this story. reply 15155 10 hours agorootparentThis has not been the case for years. https://www.faa.gov/uas/commercial_operators/operations_over... reply ddtaylor 18 hours agorootparentprevIt would allow for different configurations to make identification harder. It's very easy to only operate at night and swap out the color and pattern of the lights constantly. Almost every photo device would capture the light pattern the attacker WANTS them to capture. High quality equipment could get better pictures, but such equipment is often not rolling 24/7 or easy to point at a drone moving fast. reply carabiner 14 hours agorootparentprev> low and slow How can you be sure? Are you aware of the speed-size illusion? https://jov.arvojournals.org/article.aspx?articleid=2551105#.... reply keepamovin 9 hours agorootparentprevPlease take my upvote for your first hand account over someone's speculation. What do they sound like? reply foxglacier 6 hours agorootparentIt contains speculation about their height and speed. You usually can't estimate those things for a UFO because near, low, and slow looks the same as far, high and fast when you have no idea how big it is or how it \"should\" behave. reply carabiner 19 hours agorootparentprevOk, what configuration are these drones? Quadcopters? Why are they only flying at night? To evade detection? Then why do they have lights? reply genewitch 18 hours agorootparentThe videos i saw ostensibly showed what looked like rear fixed wing aircraft, like a small f-16 or something. But you could only make out that detail from the lights, which can be configured however you want to configure them to look, so, technically, it could be a large quadcopter (or octa, or hex) with lights affixed that make it look like a fixed wing aircraft. none of the videos i saw had sound from the drone to verify fixed wing or \"copter\". regarding night flights, FLIR would work better for certain things at night ;-) reply 05 10 hours agorootparent> FLIR would work better for certain things at night ;-) At those distances and with typical thermal imager resolutions, the zoom lens required would cost more than a cheap car.. reply genewitch 5 hours agorootparentwhen i say FLIR i mean the things that militaries use, not the little doodad you plug into a cellphone or a handheld device with a screen and a camera. I was under the impression these things loitered much longer than any commercial quadcopter or normal battery powered aircraft. if my understanding is correct, that leaves two options - a glider, which is weight constrained so probably just a gopro or two, or a fueled aircraft, in which case, FLIR makes sense because that's a decent platform. the reports were \"flying around for hours\" but that could be exaggeration and it flew a pattern several times over a couple of hours but was landing to swap batteries or whatever. IDK. I think this is all much ado about nothing. reply K0balt 10 hours agorootparentprevThese are being extensively tested in the area: https://pterodynamics.com/ reply taylorius 18 hours agorootparentprevWhat sort of noise do they make? Do they sound like normal drones? reply megablast 18 hours agorootparentprevAnd you recorded if of course! reply mcphage 17 hours agorootparentIf all we had to depend on was cell phone footage, I'm not sure I'd believe the moon existed. reply philosopher1234 19 hours agorootparentprevAre there any recordings to back up your story? reply paul7986 18 hours agorootparentprevThis story is so strange. I mean the US if im not mistaken allowed a huge white ballon to transverse the country and i heard Trump say that was from China. If that's true we just allowed it fly all over our airspace (weird). Is that not a potential public safety hazard and now these things. So odd nothing is being done like one of our jet fighters going up and shooting one down into a field. reply scottyah 18 hours agorootparentIt's much more valuable to watch it, see what kind of scans are coming from it than to just shoot it down immediately. It is also a bargaining chip for those in international politics. If you're going to shoot it down, it has the same value if you do it immediately or later (assuming any remote wiping/detonation), so either you're paranoid that it poses a legitimate threat or it's beneficial to not shoot it down immediately. reply kasey_junk 18 hours agorootparentprevShooting things down over populated areas is a public safety issue. Drones flying about may or may not be. reply paul7986 18 hours agorootparentInto a large field or farm reply ZYbCRq22HbJ2y7 16 hours agorootparentprev> American officials later disclosed that they had been tracking the balloon since it was launched from Hainan and its original destinations were likely Guam and Hawaii,[a] but prevailing winds blew it off course and across North America.[11] > The Chinese government maintained it was a civilian (mainly meteorological) airship that had been blown off course. https://en.wikipedia.org/wiki/2023_Chinese_balloon_incident reply paul7986 1 hour agorootparentprevSo weird my comments in this thread here are being downvoted a ton. Those who are downvoting and you are in the US i'd love to hear why you have no concern about these things and or no concern the world thinking we let drones fly unabated in our airspace ... prompting various foreign nations to try and do the same over our massive US of A airspace on up into remote-ish Alaska. You have congressman saying scary things while the Pentagon says those congressman words arent true. I mentioned Trump above (i voted for her) if that was something that triggered some downvotes? reply paul7986 15 hours agorootparentprevoverall this says the US will allow undenitified drones in our air space and to fly unabated to our enemies ... one of these or future ones could be weaponized. So its unfathomable to me that they we are letting these things fly unabated in our airspace, as well the govt is providing zero info or re-assurance. reply JohnBooty 14 hours agorootparentIf we start blasting things out of the sky: - We certainly can't deny that \"something\" is happening - The US, if not the world, is going to be rocked by (basically) open war in the skies of America - If we fail to down these things, we look like utterly weak fools - Succeed or fail, we reveal our capabilities (or lack thereof) - Legit public safety issue, bullets/shells/missiles/etc that miss these things have to come down somewhere, as well as wreckage (if any) it self These drones, IF hostile are not necessarily the security risk one might think IMO. If we are just leaking radio signals into the air around bases that these things can intercept, then those communications could just as easily be intercepted by people/cars/etc on the ground. And our \"near peers\" have plenty of satellites overhead. I am not going to tell you that letting them fly around unmolested is good. It is not. It sucks. But it is probably the least shitty option. reply paul7986 14 hours agorootparentAll our pussy footing around now will look so foolish once these or others attack us. Jesus! If these are US military and they refuse to acknowlegde such yet now with social media it makes us look stupid, foolish and a target for drone strikes somewhere overhead in all the US of A. reply JohnnyLarue 12 hours agorootparentprevBecause they're not threats, and your 'enemies' are just other countries who have resources your country wants, but won't do what your country says. The calls are coming from inside the house. reply JPKab 18 hours agorootparentprevNah dude, all of these people in the comments thread who live in northern California and have no knowledge of drones beyond playing with a buddy's DJI one time at a cookout are insisting it's your imagination, and that you're gripped by a mass hysteria. Who are you gonna believe? Them, or your lying eyes? reply nozzlegear 18 hours agorootparentI don't think your sarcasm adds anything constructive to the discourse. If anything, it makes the person you're replying to look less credible because you're furthering the stereotype of UFO conspiracy theorists touting \"trust me bro\" evidence and little else. reply gooseus 19 hours agoparentprevI have had a bet going with two of my friends on this exact point for almost a week now, and the fact that it is _still_ not been resolved by any agency is insane. I also have a couple friends who work at Picatinny as well, and have heard that their civilian security have spotted some (which is strange since their airspace is always restricted), but there haven't been any internal memos regarding them. Some things I've observed/heard/thought during arguments and searching for evidence in either direction: 1. People need video evidence and assume it's easy to get because everyone carries a video camera with them. 2. Most people have never tried to capture a fast-moving object with lights in the night's sky with a cellphone. 3. People assume everyone else is a complete fucking idiot, including police, the media, politicians, and most every authority on the subject. This is also in both directions, but with my friends they seem to assume that people have coincidentally forgotten what a plane looks/sounds like in the nights sky and decided to report them as \"not planes\" to the authorities. 4. The skeptical position on this is firmly in the minority across all social media I've seen. 5. Lots of videos are completely indistinguishable from planes, and any that seem \"weird\" can be easily explained by tricks of perspective. 6. If there ARE drones being operated in a way where they would prefer not be recognized, then it doesn't seem crazy they would put lights on and move in ways that would disguise them as planes. 7. Flight trackers are not reliable because not all planes that fly need to have flight plans and transponders. I have taken the position that _something_ weird is happening, and that not all of the reports can be explained by commercial/private planes, but I don't mind being wrong so long as a definitive answer is going to present itself. Anyways, glad to see the discussion has made it to HN so I can crowdsource some more arguments, would love it if you all could help resolve this wager. reply bragr 18 hours agorootparent>not all planes that fly need to have flight plans and transponders Technically true but since 2020 almost all aircraft are required to have transponders to fly in controlled airspace. You could have a small GA aircraft without a transponder and only fly in and out of small uncontrolled air strips, but in practice most aircraft are going to have ADS-B out now. https://www.faa.gov/air_traffic/technology/equipadsb/researc... reply tsimionescu 11 hours agorootparentprev> If there ARE drones being operated in a way where they would prefer not be recognized, then it doesn't seem crazy they would put lights on and move in ways that would disguise them as planes. Wouldn't it be much, much, much easier and less crazy that, if you want to fly a small object at night and hide its exact nature and position, you would just paint it a deep, non-reflective black? Adding lights to an object you want to hide at night is completely crazy. reply gooseus 5 hours agorootparentThis is true, and we had this debate a little bit - disguising is not the same as hiding. If you're trying to avoid any detection then you would also want to mask the sound, or else people will be hearing things in the sky and not seeing anything... until they start pointing low-light and infrared cameras at the sky. When that happens the vantablack drones are going to pop against the background and leave no doubt that there is something strange in the sky, since they def won't be looking/moving like bats. By disguising as planes you blend in with the air traffic for most people, and create confusion and debate with anyone who does notice they are out of the ordinary (exactly what we're seeing now). Another point is that lights on flying objects in the dark serve a purpose, and if these drones are coordinating with each other, they may be using the lights to maintain formations or avoid running into each other without relying on other communication channels that could give away more information. reply 01100011 11 hours agorootparentprev> the fact that it is _still_ not been resolved by any agency is insane I don't think it's insane. We won't get serious about tracking UAVs/drones/RC aircraft until there is an incident. Until then, agencies likely do not have the money, resources, time or motivation to do it. reply superfrank 19 hours agoparentprevFrom what little I've seen on this, it kind of feels like the issue with Priuses acceleration out of control like 15 years ago. It was a huge scandal that lead to multiple Toyota recalls and even a lawsuit settlement and in the end, it seems like it was basically human error. One person messed up and crashed their Prius claiming the accelerator got stuck and it got picked up by the news. That story then primed other people to start looking for that and from then on anytime a Prius crashed people were looking to blame the accelerator. More people reported their Priuses accelerating out of control which then reinforced the idea even more and so on and so on. reply genewitch 18 hours agorootparentwell, it wasn't a prius originally, it was a lexus that launched off a southern california freeway because they burned the brakes up trying to stop the acceleration. Toyota and lexus sometimes have the gas pedal hinged on the floor panel, rather than suspended from piece of metal from up above. If you swap out the stock floor mats for ones not designed with this in mind, during a hard brake your feet can move forward, jamming the floor mat into the accelerator and causing the engine to receive more fuel. If you'd like a picture, i can go take a picture of the accelerator pedal in my lexus from 2012, and the floor mats which are all but bolted down to prevent this from happening. as a side note i prefer the hinged design because there's less distance to traverse, i just wish the brake was the same way! reply IAmGraydon 18 hours agorootparentprevThat’s known as mass psychogenic illness, and history is full of examples. https://en.wikipedia.org/wiki/Mass_psychogenic_illness reply throwawayq3423 16 hours agorootparentOtherwise known as gaslighting reply fdkz 17 hours agorootparentprevSome information about the Toyota cases: https://users.ece.cmu.edu/~koopman/pubs/koopman14_toyota_ua_... page 14 is especially interesting. And more technical information: https://www.safetyresearch.net/Library/BarrSlides_FINAL_SCRU... reply bsder 18 hours agorootparentprevMost of the Toyota acceleration accidents were almost certainly the result of operator error. The fact that the staistical probablity increased with age gives that away. However, Toyota got convicted because their software development process was so terrible that they were effectively criminally negligent and deserved to get absolutely roasted for it. reply jahewson 13 hours agorootparent> criminally negligent Well, civil reckless disregard, as it wasn’t a criminal case. reply UltraSane 8 hours agorootparentprevDid they use tons of global variables? reply bluGill 5 hours agorootparentGlobals are common and even right in this application. However they didn't take proper care in other ways (i'm not clear what I've just been in embedded long enough to know globals are often required despite how hard they are to get right) reply UltraSane 20 minutes agorootparenttons of global variables on code that has lots of people working on it seems almost as hard as trying to write lock-free data structures. reply bluGill 14 minutes agorootparentIn general embedded controllers like this don't have a lot of people working on them. They also have rules (enforced by review which isn't great) about when they can be accessed. In an embedded context you are not allowed to allocate memory (except at startup), so a lot of these globals are just arrays/buffers only used by one function or pseudo class (a class by intent but not actually a class by the language if the language even has a concept of class) reply 7thaccount 4 hours agorootparentprevThe investigation literally called their code \"spaghetti\". reply bee_rider 4 hours agorootparentprevProbably didn’t use misra reply brandonmenc 16 hours agorootparentpreviirc wasn't it the floor mats being designed such that they were prone to interfering with the pedals? reply plipt 20 hours agoparentprevI find the discussions on Metabunk.org helpful with news stories like this. For example here is a clip that a Fox News host recorded. Presented as a drone, but is it not clearly just an airplane filmed flying directly overhead? https://www.metabunk.org/threads/drones-over-new-jersey.1377... reply Terr_ 19 hours agorootparentYeah, that looks pretty damn normal. I mean, what kind of Nefarious Power would send out its Secret Drones with standard wingtip lights and headlights on? Note that in this aviation context, those headlights are more to make the plane itself more visible to everyone else, not to give extra information to its pilot(s). It's hard to make lights bright-enough that they could illuminate something in time for an in-air plane to avoid it. (E.g. a magical flying sleigh.) reply wbl 19 hours agorootparentThat sleigh does have a high visibility red light although the mounting is somewhat unorthodox. reply Terr_ 15 hours agorootparentI considered trying some napkin-math for how many calories Rudolph would need to burn running a luciferin reaction like a firefly, but immediately stumbled over the issue of many lumens the FAA would consider acceptable. (Assuming they could be convinced to overlook all the other issues of proper color and signaling etc.) reply _DeadFred_ 17 hours agoparentprevI don't think the Coast Guard mistook 12 American Airlines planes for drones following their boat: https://apnews.com/article/fbi-drones-new-jersey-a978470fa3b... In another article a Sheriff saw 50 drones coming in from the ocean. Here a New Jersey elected official talks about the Sheriff/Police helicopter following an unidentified drone, then pull back because they feared for their safety (so low probability it was not something odd but just an American Airlines plane): https://www.youtube.com/watch?v=-yxDXqU9OQQ reply bragr 14 hours agorootparentWhy not? The navy confused infrared lens flairs of UFOs https://www.youtube.com/watch?v=qsEjV8DdSbs reply hersko 2 hours agorootparentThis would be convincing if the pilots who captured the video didn't see it with their own eyes. reply op00to 17 hours agorootparentprevYou keep posting the same stuff multiple times in the thread. It doesn’t help your argument. reply _DeadFred_ 17 hours agorootparentMy argument that the Coast Guard didn't mistake American Airlines planes for 12 drones following their boat is invalidated because I posted an AP article twice? reply jklinger410 20 hours agoparentprevThere is more evidence here than just pictures from this one article. The pentagon, for example, just declared that they do not know what they are[1]. Among many other credible sources. [1]https://www.reddit.com/r/UFOs/comments/1hc1l58/pentagon_no_e... reply antonvs 20 hours agorootparent> There is more evidence here than just pictures from this one article. What “more evidence”? All the Pentagon is saying is that there’s no evidence that’s a foreign entity is behind it. Not “more” evidence. reply sitkack 19 hours agorootparentCan you or can you not draw a red line with a blue pen? reply sitkack 13 hours agorootparentThe Expert (Short Comedy Sketch) https://www.youtube.com/watch?v=BKorP55Aqvg It was a comment on the inability of half of this thread to use basic logic. reply mrandish 12 hours agorootparentprev> The pentagon, for example, just declared that they do not know what they are I often hear those hyping UFO sightings citing this type of statement by the Pentagon. However, the Pentagon saying the don't know what it is doesn't mean anything. Of course, they don't know what it is. They weren't there. They didn't see it nor have any idea if there was anything unusual seen. The null hypothesis is the still the most likely: this is a result of media hype causing increased erroneous reports of aircraft and hobbyist drones along with false reports by social media attention seekers. Also, the Pentagon has a consistently terrible track record of failing to properly identify spurious internal lens reflections, digital stabilization artifacts, IR ghosting and gimbal rotation on their own footage. https://www.youtube.com/watch?v=qsEjV8DdSbs. reply pavel_lishin 19 hours agorootparentprev> The pentagon, for example, just declared that they do not know what they are That is absolutely not what was said in that video. They just said that they're not drones from a foreign entity or adversary, nor are they US military drones. reply chrisco255 19 hours agorootparentCould they be defense contractor drones being tested? reply block_dagger 16 hours agorootparentprevThe Pentagon - credible!? Ha. reply mrguyorama 4 hours agorootparentprevThe pentagon also didn't tell anyone in the 80s that all the \"UFO sightings\" in Nevada were test flights of the F-117. You know the pentagon doesn't have to tell you (or even the feds!) the truth, right? You know that when they say \"We can't track 1 trillion dollars of our budget!\" they aren't being fully honest, right? reply Amezarak 19 hours agorootparentprev> The pentagon, for example, just declared that they do not know what they are[1]. This sounds impressive, but people don't seem to realize that there is no USGOV tracking of drone-sized objects in US airspace. Of course they can't say who is doing it or where they're coming from, they also don't know what's going on when you launch a drone from your backyard and fly it around. The FAA has a database of reports of people illegally flying drones around planes and airports, it's been happening constantly since they've been mass market items and the perps rarely get caught. reply bragr 18 hours agorootparent>people don't seem to realize that there is no USGOV tracking of drone-sized objects Anything 250g or heavier has to have Remote ID now. Now that doesn't exclude the possibility of illegal drones without it, but it isn't true that there is \"no drone tracking\". https://www.faa.gov/uas/getting_started/remote_id https://www.ecfr.gov/current/title-14/chapter-I/subchapter-F... reply echoangle 2 hours agorootparentUnless there are also receivers for this operated by the government, that's technically not a conflict with the claim. Tracking means you're tracking something, not just forcing them to send a signal. It's only tracking once you receive and process the signal. reply op00to 17 hours agorootparentprevWhat do you think Drone ID is? It’s basically Bluetooth transmissions. Very localized reception and basically impossible to monitor over a wide area without many, many receivers spread out evenly all over the place. reply 15155 10 hours agorootparentprevWho exactly is enforcing this law in reality? reply _djo_ 20 hours agoparentprevSame. This is a ridiculous mass hysteria driven by media sensationalism and ignorant members of the public. reply fourteenfour 20 hours agorootparentLol, also rep. Jeff Van Drew claiming without evidence that the drones are coming from an Iranian mothership off the coast. reply shagie 19 hours agorootparentOne of the channels that I follow is \"What is Going on With Shipping\" (its mostly about ocean going supply chain things and started with the Evergiven)... and today's video is: War of the Jersey Shore!Did Iranian Navy Carriers Launch Drones Over the New Jersey? - https://youtu.be/hTpYN70tZ6Y And since this is a \"the Iranian mothership off the coast\" - the info about where the drone carriers are is presented. The video discretion links to other sites with info. https://x.com/TankerTrackers/status/1866922032681652322 > Iran has two drone carrier vessels; the SHAHID BAGHERI and the SHAHID MAHDAVI. Both are located in the anchorage of Shahid Bahonar, Iran. > We know this because we are looking at them right now. reply 0cf8612b2e1e 19 hours agorootparentprevSomething tells me that if there were so much as an Iranian dinghy sitting off the coast, the military would be extremely aware of its presence. Monitoring absolutely everything that it did. reply bhk 17 hours agorootparentSomething tells me that if there were a bus-sized Chinese spy balloon floating all the way across the continental US, the military would be extremely aware of its presence. (As I recall they were, but they would not publicly acknowledge it until the public sightings became undeniable.) reply dylan604 19 hours agorootparentprevwhat/who ever that something is that is telling you that, i'd suggest a better source. it is part of the \"game\" that militaries the world over try to do things without their opponents knowing they were ever there. international boundaries are 12 miles of water, yet navy submarines get much much closer than that as a matter of course. do you think the military or any 3 letter agency knows 100% where all foreign spies are within their borders? reply bhk 17 hours agorootparentprev\"...without evidence...\" What he claimed was \"high\" (high-level, I assume, rather than intoxicated) and \"reputable\" sources who needed to remain anonymous told him there was circumstantial evidence of this. I don't see any motive for him to make this up, or for those sources to. Perhaps someone in some agency is jumping to conclusions on partial information. Or perhaps this fits into the pattern of DoD officials, ex-officials, and whistleblowers spinning tales of UAP sightings and an official UAP retrieval program. reply ZYbCRq22HbJ2y7 16 hours agorootparent> I don't see any motive for him to make this up To get people to pay attention to him? reply StanislavPetrov 16 hours agorootparentprev>I don't see any motive for him to make this up, or for those sources to. To whip up more hysteria against Iran? reply bhk 15 hours agorootparentMaybe. There's a pattern there, too. For example: https://x.com/mtracey/status/1855682527756697724 reply IAmGraydon 18 hours agorootparentprevYes and where did he even get this from? Why do we have representatives literally making up stories and telling them to the American public? What is actually going on here? reply anigbrowl 18 hours agorootparentProbably just made it up. He's a naked opportunist and there's no penalty in the GOP (or arguably in Congress in general) for being a shameless liar. reply LAC-Tech 15 hours agorootparentprevJaff Van Drew is endorsed by AIPAC and has received just over $100k from them. reply gowld 20 hours agorootparentprevIn his defense, he is a Cold War relic. reply sitkack 19 hours agorootparentHe was 20 in 1973, that doesn't qualify as a CW relic. Not even a curio. reply ipsum2 19 hours agorootparentRelic from the Cold war, not a relic at the time of the cold war. reply anigbrowl 18 hours agorootparentIt still doesn't make sense. He was elected to Congress in 2018, long after the end of the Cold War. I think GP is just mixing him up with someone else. reply postalrat 20 hours agorootparentprevIs that your gut feeling or do you know something the government isn't willing to reveal? reply antonvs 20 hours agorootparentIt’s essentially a null hypothesis. There doesn’t seem to be any actual evidence of anything. It’s all based on social media pos",
    "originSummary": [
      "Over 3,000 drone sightings in New Jersey and the US northeast have led to calls for a \"limited state of emergency\" and a temporary drone ban by State Senator Jon Bramnick.",
      "Concerns are heightened due to drones being spotted near sensitive locations, such as President-elect Trump's golf course and critical infrastructure.",
      "Despite the large number of sightings, the FBI has not provided an explanation, and the Pentagon has dismissed claims of foreign involvement, including from an \"Iranian mothership.\""
    ],
    "commentSummary": [
      "Mysterious drone sightings in New Jersey have raised concerns, similar to the 2018 Gatwick airport incident, where drone reports caused a shutdown without any drones being captured on camera or radar.",
      "Authorities, including the FBI, Pentagon, and White House, have denied any foreign or military involvement, leading to speculation about a secretive government operation or misidentified aircraft.",
      "The lack of concrete evidence or resolution has resulted in public anxiety and ongoing debate."
    ],
    "points": 403,
    "commentCount": 713,
    "retryCount": 0,
    "time": 1733943739
  },
  {
    "id": 42396372,
    "title": "A ChatGPT clone, in 3000 bytes of C, backed by GPT-2 (2023)",
    "originLink": "https://nicholas.carlini.com/writing/2023/chat-gpt-2-in-c.html",
    "originBody": "Main Papers Talks Code Writing Writing A ChatGPT clone, in 3000 bytes of C, backed by GPT-2 by Nicholas Carlini 2023-04-02 This program is a dependency-free implementation of GPT-2. It loads the weight matrix and BPE file out of the original TensorFlow files, tokenizes the input with a simple byte-pair encoder, implements a basic linear algebra package with matrix math operations, defines the transformer architecture, performs transformer inference, and un-tokenizes the output with the BPE decoder. All in ~3000 bytes of C. It's optimized efficiently enough so that GPT-2 Small takes a few seconds per reply on any modern machine. To do this I've implemented KV caching and an efficient matrix multiplication algorithm, with optional OMP parallelism. You can then use this to create something like Chat GPT---just so long as you don't care about the quality of the output. (It's actually pretty terrible output, objectively speaking... But it does run.) There are a few quirks (especially with handling UTF-8 characters), and running the XL size model at long context length can require ~100GB of RAM. But if you're just typing with ASCII using GPT2-Small it should run just about anywhere. I've uploaded the code to GitHub, so feel free to try and use it there. This program is made up of the following main blocks (hover over each to see the coresponding code): Basic matrix math library (700 bytes) Fast matrix multiplication (300 bytes) Neural network layers (300 bytes) Transformer model (600 bytes) Byte pair encoding (400 bytes) I/O (200 bytes) Weight loading (300 bytes) Byte pair encoding loading (300 bytes) #include #include #include #include int U,C,K,c,d,S,zz;char*bpe;typedef struct{float*i;int j,k;} A;void*E,*n;A*f;FILE*fp; #define N(i,j)for(int i=0; i2);U=K*64;C=12*S+12;zz=atoi(D[4]);E=malloc(2LL*U*U*C*zz); bpe=malloc(1e9);fp=fopen(D[2],\"r\");unsigned char a[S=999],b[S];N(i,5e4){int k=i*S;if(i254){fscanf(fp,\"%s %s\",a,b);strcat((char*)a,(char*)b);int j=0;N(i,a[i])bpe[k+j++]=a[i]^196?a[i]:a[++i]-128;bpe[k+j++]=0;} else if(i>187){bpe[k]=i-188;bpe[k+1]=0;}}int e[1024];d=w(D[3],e)-e;int h;N(i,d){if(e[i]==18861)h=i+1;}printf(\"AI\");N(i,d-h)printf(\"%s\",bpe+e[i+h]*999); fp=fopen(D[1],\"r\");A\\ x[999];A*R=x;N(i,C){N(j,12)*R++=m(U+U*(j?j^8?j^11?0:3:3:2),U*((j%8==3)+3*(j%8==1)+(j==9)));}*R++=m(U,1);*R++=m(U,1);A QA=m(1024,U),Z=p(m(5e4,U)); while(1){char W[1000]={ 0} ;int T;strcat(W,\"Alice: \");printf(\"%s: \",bpe+20490*999);fflush(stdout);fgets(W+8,1000,stdin);printf(\"AI:\");strcat(W,\"Bob:\");d=w(W,e+d)-e;n=E;c=0; while(1){E=n;T=d+32-d%32;c*=!!(d%32);A O=o(T,U,1);N(i,d){N(j,U)O.i[i*U+j]=Z.i[e[i]*U+j]+QA.i[j*1024+i];}N(i,C){int y;S=0;N(j,10){if(j==i)y=S;S++;N(k,10*(j>0)){if(j*10+kB.i[S])S=i;}if(d==zz){memcpy(e,e+zz/2,S*2);d-=zz/2;c=0;}e[d++]=S; if(bpe[S*999]==10)break;printf(\"%s\",bpe+S*999);fflush(stdout);}}} Background: ChatGPT and transformers In case you've been living under a rock for the past few months, ChatGPT is an application where you can talk to a type of machine learning model called a \"language model\" as if it was another person. It responds remarkably well, and GPT-4, the latest model that powers ChatGPT, is incredibly impressive. This C program implements the behavior of ChatGPT using a much weaker model from 2019: GPT-2. Despite being just 2 smaller than GPT-4, it has no where near the same capabilities---but it is open source. So it has that going for it. GPT-2 is a type of machine learning model called a \"transformer\". These neural networks take a fixed-size sequence of words as input, and predict the next word that will occur. By repeating the procedure over and over, you can use them to generate arbitrary-length sequences. This post isn't meant to be an introduction to all the machine learning you'll need to know why a transformer is designed the way it is, but the rest of this post will be dedicated to describing how the above C code works. Walkthrough the C Code Getting started: Matrix Math (700 bytes) Seeing as neural networks are just matrix operations. So we're going to need to get started by building a matrix library in as few bytes as possible. My definition of a matrix is completely minimal: typedef struct { float* dat; int rows, cols; } Matrix; We'll begin by by observing that while there are a bunch of different operations we'll need to implement, there are basically two \"types\" of operations\" Matrix-constant operations (e.g., add 7 to each entry of a matrix) Matrix-matrix operations (e.g., add corresponding matrix entries) This similarity allows us to use macros to pull out a bunch of the common logic into a meta-routine that knows how to operate on, for example, pairs of matrices and just leaves the specific operator implementation defined. To do this in C, I'll define the function #define BINARY(function, operation) as the following: Matrix FUNCTION(Matrix a, Matrix b) { for (int i = 0; i 0); k++) { if (j*10+k254) { // Ones above 254 are from the BPE file. Load those fscanf(fp, \"%s %s\", a, b); strcat((char*)a, (char*)b); int j = 0; for (int i = 0; a[i]; i++) { // UTF8 encoding makes life hard so handle that here bpe[k+j++] = a[i] ^ 196 ? a[i] : a[++i]-128; } bpe[k+j++] = 0; } else if (i > 187) { // Tokens above 187 are the nonprintable asii character from 0-32 bpe[k] = i-188; bpe[k+1] = 0; } } Conclusion It's really remarkable how you can distill so many decades of progress in machine learning to just a few thousand bytes. There is essentially nothing missing here from everything you need to run any state-of-the-art neural network (except for the actual model weights). While I mostly put this together for fun, it's a nice demonstration how simple neural networks actually are. If you want to be notified the next time I write something (maybe like this, maybe not) enter your email address here. There's also an RSS Feed if that's more of your thing.",
    "commentLink": "https://news.ycombinator.com/item?id=42396372",
    "commentBody": "A ChatGPT clone, in 3000 bytes of C, backed by GPT-2 (2023) (carlini.com)330 points by chubot 14 hours agohidepastfavorite117 comments thomasfl 7 hours ago\"While I mostly put this together for fun, it's a nice demonstration how simple neural networks actually are.\" Psst, don't tell anyone. Artificial Intelligence is the black magic we do to make money. reply stavros 8 hours agoprevI don't know, GPT-2 wrote some of my favorite fairy tales: https://deepdreams.stavros.io/episodes/the-princess-the-fair... reply parkaboy 4 hours agoparentThat was both impressive, weird, and 90% coherent. Which does give it a special kind of uncanny vibe. reply stavros 4 hours agorootparentI know, right?! I love it. Unfortunately, GPT-3 and later were much less weird and wonderful, because they were perfectly coherent. reply rcdwealth 3 hours agoparentprevThat is great, and in reality entertaining and for listening and sleeping in, good story. So did you make it with that GPT-2 from this page? reply stavros 1 hour agorootparentNo, it's three years old. It was made with OpenAI's GPT-2. reply hilti 13 hours agoprevI haven‘t run the code, but I‘m impressed by the small size. The first ELISA programs have been larger. And within the past 4 years we can fit this into bytes. If someone has a hint where the magic lies in, please explain it to me. Is it the GELU function or the model that‘s downloaded through the bash script? reply 01HNNWZ0MV43FF 11 hours agoparentMost of the magic is in the 475 MB model file downloaded through the Bash script. reply dogboat 10 hours agorootparentAnd probably like 100Gb of training data or whatever :). HN had a heady debate at least once about if that training data is source or not. reply Sharlin 7 hours agorootparentI guess the training data should be called assets. Analogously to how you can download the Quake source, and build it and get a working executable, but without the (non-open) assets you cannot replicate what you get by buying the game. reply fluoridation 4 hours agorootparentBy that analogy, the executable code would be the game engine, the model that inference is done on would be the assets, and the training data would be... I guess the PSDs and high-poly models that get compressed and simplified to turn them into game assets. reply Sharlin 1 hour agorootparentIt depends on whether the analogue of playing a game is training or inference. If the former, then the training data are the assets, the training software is the game, and the resulting model is the game experience (or if you want something more concrete, savegames and recorded play I guess). But yeah, if gameplay equals the use a trained model, then the model is an asset bundle (the pak0.pak if you will) and training data is the original models, textures etc, and the training software is all the programs that are used in the asset production pipeline. reply fluoridation 24 minutes agorootparentWell, consider that training is a batch processing step, while inference is the that's interactive. So training is more analogous to compilation than to gameplay. reply hilti 10 hours agoparentprevNot really impressed after running it. AI: How can I help you? Human: Who are you? AI: I am Alice. Human: Tell me something about a computer. AI: I am a computer model trained by OpenAI. How can I help you? Human: What is a computer? AI: I am a computer model trained by OpenAI. How can I help you? Human: Explain mathematical addition. AI: Explain mathematical multiplication. Human: 2+2 AI: 2+2 Human: Sum 2+2 AI: Sum 2+2 Human: What are your capabilities? AI: I am a computer model trained by OpenAI. How can I help you. reply Sharlin 7 hours agorootparentI'm impressed that it's even that conversational, given that GPT-2 was never trained for conversations. reply tmaly 54 minutes agoprevWhat type of hardware could this run on? Could quantized weights on huggingface be used with this? What type of problems or queries would this be really good at? reply andai 6 hours agoprevI remember playing with GPT-2 when it came out. A friend and I exported our chat logs, fine tuned GPT-2 on them, and had it simulate conversations between us. It was hilarious and sometimes disturbingly accurate. I'm wondering what caused the quantum leap between GPT-2 and 3? Bigger model, more data, or both? I know RLHF makes a huge difference, but even the base GPT-3 model (text completion) was very useful, given enough examples. reply hmottestad 13 hours agoprevIs GPT-2 instruction tuned so that it can actually be used for chat? Otherwise I feel it’s more than just a stretch to call this a ChatGPT clone. reply motorest 12 hours agoparentFrom the article: > You can then use this to create something like Chat GPT---just so long as you don't care about the quality of the output. (It's actually pretty terrible output, objectively speaking... But it does run.) It's unusable and bears no relationship other than the name-dropping. But it's a program that compiles and runs. By the looks of those in this discussion who are giving high praises about the capabilities of a project whose author admittedly states it doesn't really work, I guess the point is using buzzwords to bait the bandwagon types. reply zanderwohl 10 hours agorootparentPeople \"demake\" games all the time. Nobody complains if those games are missing most of the features of the original because the core gameplay loop (the essence) is the same. That's the point here -- you can make a small-scale, low-resolution version of a major program in a very small space. > By the looks of those in this discussion who are giving high praises about the capabilities of a project whose author admittedly states it doesn't really work, I guess the point is using buzzwords to bait the bandwagon types. Instead of assuming everyone else is naive, perhaps consider another perspective? reply bippihippi1 11 hours agorootparentprevthe point seems to be making a small binary to run language model. How useful is that? From a functional perspective, I guess not very but the model can be improved. From a performance / cost perspective, also not very because most of the cost is in training the model and small binary isn't necessarily indicative of quick. I guess it's just kind of interesting that it doesn't take that much code to run the model. reply hmottestad 8 hours agorootparentprevMy thinking was more that ChatGPT is called \"Chat\" because it allows users to chat with a Generative Pre-trained Transformer. reply zxspectrum1982 6 hours agoprevThese days, you can easily implement your own ChatGPT in a snap by using gptscript: https://github.com/gptscript-ai/gptscript reply fulafel 12 hours agoprev> (TAKE THAT LANGUAGES WITH PROPER MACROS. LISP ISN'T ALWAYS BETTER THAN C!) Ok, allowed this time as punching up. -- If you missed the code link (it's buried in the text): https://github.com/carlini/c-chat-gpt-2 reply atiedebee 8 hours agoprevI dont see how C macros are anything like regex. They match words and replace them with different text. Regex is about matching text with relatively complex patterns, and by itself doesn't do any text replacement. reply ab_testing 13 hours agoprevDid anybody run it locally to see what kind Of output is generated by this GP2 running locally. reply dailykoder 12 hours agoparentKind of always gives me the same output over and over again. It's kinda neat though. Have to look into it and tweak it myself. Wanted to play around with gpt2 locally for quite some time. Thanks for the post! reply genewitch 12 hours agoparentprevafter reading it, this should output the exact same output as whatever gpt2 model you load normally and in this program, given the same temperature and seed i didn't see those myself in the code, but i was mostly trying to figure out why it was obfuscated; i think the unobfuscated code isn't too terribly much longer (10,000 chars?) and would still be impressive to behold on a screen. reply vunderba 12 hours agorootparentThe regular code is linked in the article: https://github.com/carlini/c-chat-gpt-2/blob/main/c_chat_gpt... reply go_prodev 12 hours agoprevGELU really is like magic: UNARY(GELU, b / 2 * (1 + tanh(.7978845 * (b + .044715 * b * b * b)))) reply jey 10 hours agoparentThis is just a practical approximation to the actual mathematical definition of GELU, which is `GELU(x) := x * Φ(x)` where Φ(x) is the CDF of the Gaussian distribution. reply fluoridation 4 hours agorootparentIsn't that just erf()? reply kgwgk 3 hours agorootparentThey are related but the error function approaches -1 for large negative numbers. Φ(x) approaches 0 and so does x * Φ(x). reply dogboat 10 hours agoparentprevFast inverse square root lookalike. reply shoo 8 hours agorootparentYou can hand that GELU definition to a mathematician and they can interpret it as a function of a real number b. The definition does not depend upon b being a floating-point number with a particular bit representation. In contrast, the fast inverse square root really exploits the bit representation of a floating point input to cheaply compute an initial guess. reply benob 6 hours agoprevShould try with smollm2 which is one of the smallest instructed models. reply ljouhet 10 hours agoprevI love the way it's written: see this ChatGPT-like code that fits in your screen? Let's break it down! reply robblbobbl 6 hours agoprevThanks. For the learning it's really good. reply deadbabe 4 hours agoprevSo will it ever be possible to do something similar with ChatGPT 3.5 or so? reply boiler_up800 12 hours agoprevIntelligence as a new fundamental layer! These small programs that do so much really inspire me. reply anthk 8 hours agoprevI've seen better with classical AI chatbots: https://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/areas... Splotch will compile it fine on modern unixen with few changes. reply neomantra 6 hours agoprevAre commentors even reading the article or just bitching about how GPT-2 sucks or pedantry of LoC metrics? Look at this article a different way. The author put a lot of information in a small context window so that it easier for readers to understand transformers. They included a useful code highlighter to ground it. To soooo many people, even those with strong math/science, GPT is magic. This article opens the spell book, lays it out as a computation graph with all the fixing’s. The code isn’t abominable especially when paired with the prose. It is a good piece of education and I will also call it art. reply FrustratedMonky 5 hours agoparentAlso, demistifying the 'complexity'. I see so many articles saying, or assuming, that 'those software people know what is happening', because it is programmed. I hear 'well they programmed it, so they know what is going on right?'. This is pretty clearly showing, look it isn't a lot of code, and look what happens. Even if GPT2 isn't all that great, look at the amount of code, it is small, not some pile of millions of lines of complex programming to make it work. reply ethan-j 12 hours agoprevAt least it's kind of a conversation. bash ./run.sh AI: How can I help you? Human: who are you AI: I am alice. Human: what can you do for me? AI: I can help you. Human: how to say bird in Chinese? AI: bird in Chinese. Human: 2+2=? AI: 2+2= bird. reply dogboat 10 hours agoparentThis is what it was like to live in 2019 reply yard2010 10 hours agoparentprevHow long would it take for people to accept this as the ground truth fighting and dying for this, starting the next cult/religion? reply portaouflop 9 hours agorootparentHave you accepted our lord and saviour, the machine-proclaimed 2+2bird into your life as the one and only true way to eternal life and happiness? reply mindcrime 6 hours agorootparentIf only 2+2bird had died for our sins, but alas, it wasn't dead, it was merely resting. reply otikik 9 hours agorootparentprevIs it an African swallow or a European swallow? reply npsomaratna 9 hours agorootparentI don’t know that! reply kandros 10 hours agorootparentprevAll hail the 4 bird reply portaouflop 9 hours agorootparentScholars are still fighting whether it’s 4bird or 2+2bird. Bitter clashes between 4 and 2+2 birders around the world resulted in dozens injured, promoting the UN to call for peace between the two churches reply marai2 5 hours agorootparentEveryone knows (2+2bird) times it’s complex birdy conjugate (2-2bird) == 8bird reply justincormack 7 hours agorootparentprevIt is both, the holy binity. reply gravitronic 6 hours agorootparentprevWell my kids are already convinced 1+1=window reply ForOldHack 7 hours agorootparentprev8 seconds. Its a CULT!. There. reply 0xEF 9 hours agorootparentprevHistorically speaking, not long, sometimes as little as a few weeks worth of minimal propaganda. The trick is to target the memes at people who are feeling victimized with Big Math's fascist BS. reply Wowfunhappy 5 hours agoparentprev> Human: how to say bird in Chinese? AI: bird in Chinese. Well, it knows how to be snarky! reply owenpalmer 9 hours agoprev\"I am not a madman for saying that it is likely that the code for artificial general intelligence is going to be tens of thousands of lines of code, not millions of lines of code. This is code that conceivably one individual could write, unlike writing a new web browser or operating system.\" - John Carmack, Lex Fridman Podcast (August 4th, 2022) This was around 3 months before ChatGPT's initial release. Timestamped: https://www.youtube.com/watch?v=I845O57ZSy4&t=14677s reply GTP 8 hours agoparentI listened to that podcast at the time. I remeber being surprised about one thing in particular. He was talking about predictions of when the first people will land on Mars. He said that we tend to underestimate many of the challenges involved and so we tend to think it will happen sooner than what it is reasonable to expect. He also recounted a time he was talking with other people about it but, since they decided to bet money on which prediction will be closest to the reality, the people involved started doing a more in-depth consideration of the challenges involved and being more cautious about claiming it will happen very soon. But then, he trew all of his arguments about the bias towards unrealistic optimism and the need for more nuanced analysis out of the window when they started talking about when we will have AGI. reply pixelsort 6 hours agorootparentFor a detailed accounting of the challenges involved, I recommend this video: Why It Would Be Preferable To Colonize Titan Instead Of Mars https://youtu.be/_InuOf8u7e4?si=hRO1ZYCZtbQXUuK9 If you fully watch it, or already know these issues, the notion of going to Mars any time soon seems outright foolish. If you have a large enough platform, it might still be useful as fundraising campaign, a PR stunt, or as a way to rally the uninformed masses around a bold vision. But, that's about it. reply winterismute 6 hours agoparentprevHis take was not really \"novel\" however, John McCarthy said basically the same thing multiple times in the 90s and maybe even 80s? He would say something along the lines of \"If we ever get to an algorithm that expresses general intelligence, we will be able to write that in one or two pages of a manual. Such a book will still be rather long and the rest of the pages will be about how we got to that algorithm and why it took us so long\". reply yreg 8 hours agoparentprevAttention is all you need and GPT-2 were well known at that point. Many might doubt whether this approach leads to \"general\" intelligence – depends on the definition. BTW, Karpathy has a nice video tutorial about building an LLM: https://www.youtube.com/watch?v=kCc8FmEb1nY reply tpoacher 6 hours agoparentprevDepends what you mean by 'code', of course. There's some pretty high-level libraries doing heavy-lifting in those 10 thousands of lines. And if also count the training data and the billions of encoded parameters as \"code\", that is required to make this work, then that's a lot of \"lines\". At the other extreme, if you're happy to exclude 'libraries' then I could wrap these tens of thousands of lines to a bashscript, and claim I have written an artificial general intelligence in only 1 line. reply xiphias2 5 hours agorootparentEverybody who has worked on a large/huge code base knows that most of it is there for historical reasons: it's always safer to add a new feature than to replace something old, as most of the time people don't know if that old code is useful or not. BTW tinygrad shows that tens of thousands of lines are enough, it's skipping even most of the AMD kernel drivers and talks to the hardware directly. reply sumtechguy 4 hours agorootparentI have seen people re-write large chunks of functionality not knowing it was already there in a form they didnt know about. Have done it myself a few times. Write largish blob of code. Replace it with one system call that does the same thing. Also most things are simple. It is the data and libraries and applications from those simple things that are interesting. Take for example C++. The actual language is a few dozen keywords. But the libraries and things built using those small things is quite large. Also most drivers are written so that we can re-use the code. But with the right docs you can twiddle the hardware yourself. That was 'the 80s/90s way'. It was not until macos/os2/windows/xlib that we abstracted the hardware. Mostly so we could consistently reuse things. reply z7 5 hours agoparentprevSchmidhuber said this before, cf. https://old.reddit.com/r/MachineLearning/comments/2xcyrl/i_a... reply mjburgess 8 hours agoparentprevHis claim is just that AGI will largely be comprised of stateless mathematical operations -- all of which could be a single line of code if written that way. As a claim, it's antique -- it would easily have been a view of Turing and others many decades ago. And as a claim its as false then as now. Not least because all the code which is the actual algorithm for generating an LLM is all the code that goes into its data collection which is just being inlined (/cached) with weights. However, more than that, it's an extremely impoverished view of general intelligence which eliminates any connection between intelligence and a body. All the \"lines of code\" beyond a single are concerned with I/O and device manipulation. Thus this is just another way of repeating the antique superstition that intelligence has nothing to do with embodiment. reply antonvs 5 hours agorootparentExecuting computer code is embodied in a physical machine. Modern machines have vision and audio I/O capabilities, for example. You seem to be assuming, without any evidence, a narrow view of what embodiment entails. The \"antique superstition\" claim is particularly ironic in this context, since it much more clearly applies to your own apparently irrational hasty conclusion. reply mjburgess 5 hours agorootparentWhat claim do you think I'm making? reply DrBazza 7 hours agorootparentprev> As a claim, it's antique -- it would easily have been a view of Turing and others many decades ago. Absolutely. We discussed this in the 90s and were of the opinion, then, that event state of the art NNs (in the 90s) wouldn't get much more complex because of their actual mathematical descriptions. It's all the bells and whistles around managing training, and real-world input/output translation code. The core or 'general case' always will be tiny. reply n4r9 8 hours agorootparentprev> antique claim ... extremely impoverished ... antique supersition Frankly, when the total argument against a position consists of such \"boo\" words, I immediately suspect some projection of personal preferences. But anyway I googled \"intelligence vs embodiment\" and found this quite nice summary albeit from 2012: https://pmc.ncbi.nlm.nih.gov/articles/PMC3512413/ The basic idea seems to be that human conscious experience is a mishmash of sensory-reflexive impulses and internal deliberation, combined into a sophisticated narrative. Simulating this kind of combination may help robots to move about in the world and to relate more closely to human experience. I have a lot of sympathy with this although I'm guarded about how much it really tells us about the potentials for AGI. > Not least because all the code which is the actual algorithm for generating an LLM is all the code that goes into its data collection which is just being inlined (/cached) with weights. Could this \"data collection\" code not potentially be put into a few thousand lines also? reply GTP 7 hours agorootparent> Could this \"data collection\" code not potentially be put into a few thousand lines also? This would mean hardcoding a model of the world. Which maybe, with the help of some breakthrough from physics, would be possibe (but I think the kind of breakthrough needed to get down to such a small size would be a theory of everything). But this means eliminating the self-learning part of current neural networks, which is what makes them attractive: you don't have to hardcode the rules, as the model will be able to learn them. reply n4r9 7 hours agorootparentWhat I mean is, we could program an entity which gathers its own data and updates its own weights. With the lines of code being in the tens of thousands. reply GTP 6 hours agorootparentBut op's point was about people talking about tiny LLMs failing to consider the amount of parameters used. This has nothing to do with the ability of autonomously collecting the training data. reply Buttons840 8 hours agoparentprevTime for another Year of Linux (TM) prediction: Linux (and friends) do a lot of things on the command line. LLMs are good at writing text and using a command line interface. Creating LLMs and AIs takes relatively little work and is interesting, open source is especially good at this type of work. Therefore, I predict that Linux will keep pace with other operating systems when it comes to voice control. reply ForOldHack 7 hours agorootparentTime for another prediction that a computer will have a PhD, by the end of the decade. 1960, 1970, 1980, 1990, 2010, 2020, 2030. Next, yawn. reply cm2187 6 hours agoparentprevThat's also why nvidia's position is fragile. The cost of the GPU is so high that at one point AI will have to be profitable and it is practical for those models to be ported to a competing platform. reply paxys 11 hours agoprevWhat's the point of minifying code that is anyways going to be compiled? reply kgwgk 10 hours agoparentPeople ask me, 'What is the use of climbing Mount Everest?' and my answer must at once be, 'It is of no use.' There is not the slightest prospect of any gain whatsoever. Oh, we may learn a little about the behavior of the human body at high altitudes, and possibly medical men may turn our observation to some account for the purposes of aviation. But otherwise nothing will come of it. We shall not bring back a single bit of gold or silver, not a gem, nor any coal or iron. If you cannot understand that there is something in man which responds to the challenge of this mountain and goes out to meet it, that the struggle is the struggle of life itself upward and forever upward, then you won't see why we go. What we get from this adventure is just sheer joy. And joy is, after all, the end of life. We do not live to eat and make money. We eat and make money to be able to live. That is what life means and what life is for. -- George Mallory reply vouaobrasil 8 hours agorootparentI agree with Mallory that we make money to live but I also think that modern technological society has turned pursuits into highly specialized perversions that aren't even inspiring any more. The worldwide coverage of mountain climbing has even turned mountain climbing into a somewhat arbitrary thing in terms of \"climbing everests\": first it was to the top of the mountain (cool), then it was to the top in a certain time, then it was without supplementary oxygen, then it was climbing all 8,000m+ mountains, then it was doing THAT without oxygen... At some point it's diminishing returns and becomes stupid -- and results in people just killing themselves, and AI is already on that level. With every achievement there also comes a responsibility and our society is just achievement without responsibility. reply stavros 8 hours agorootparentI think you missed the point of the quote entirely. When I do something, I don't do it because nobody has ever done it before. I do it to see if _I_ could do it. Otherwise nobody would ever run a marathon again. reply vouaobrasil 7 hours agorootparentI didn't miss the point of the quotation. I am not really concerned with your motivations. My point was that Mallory's quotation becomes distorted by technological society to present new challenges that are relatively harmful and stupid, like making a small ChatGPT clone (or even making ChatGPT in the first place). So while I agree that some people's motivations may be sound, it is how they are applied that is a perversion, and that Mallory's quotation has the germ of a phenomenon that is incredibly dangerous and isn't as deserving of awe as it is. reply jstanley 6 hours agorootparentA person had an idea for something they wanted to do. They set about doing it. They undoubtedly ran into difficulties and had to think about how to solve them. They came up with solutions, probably some of the solutions aren't as elegant as they had hoped for, but they reached something that was acceptable, again and again. And eventually they created something that, to some extent, satisfied them. That process is the joy. I just don't see the harm in what this person has done? Envisaging something that could be created, and then creating it, is what life is all about. I just don't see how words like \"perversion\" and \"distortion\" can sensibly be applied to this work? reply vouaobrasil 6 hours agorootparentThe entire point is that technology shapes society so that joyful activities are subverted to create perversions like AI. The atomic bomb was an intellectually stimulating joy for many physicists for example. Life is about joy but it must be accompanied by the responsibility to seek joy in activities that don't do harm like AI. reply lucianbr 9 hours agorootparentprevIs it carefully minified by hand, or by another program? Because I really, really don't see how calling a minifier is \"the struggle of life itself upward\". reply byzantinegene 11 hours agoparentprevI'm assuming 3000 bytes refers to the uncompiled minified code reply exac 11 hours agorootparentIndeed, and the question is why do that? We can count LOCs just fine already. reply thrw42A8N 11 hours agorootparentBecause it'd be very hard to compare short program length otherwise? 5 LoC says nothing. reply ffsm8 10 hours agorootparentTechnically, it depends on the language. I.e. python doesn't have anything like a semicolon to combine multiple statements and assignments per line But yeah, for C the LOC metric can be gamed to a silly degree reply mattashii 10 hours agorootparent> python doesn't have anything like a semicolon to combine multiple statements Python does have a \"semicolon to combine multiple statements\", and has further (lambda f: f(f)) expressions for complex expressions with local names and scopes. (not that using either for those would result in pythonic code, but it is certainly not missing from the language) reply ffsm8 9 hours agorootparentOh, you're right. I should've tested that before writing my comment. Thanks for calling me out reply stavros 8 hours agorootparentprevYeah but lines in anything should be \"lines formatted with a standard formatter\", not just \"one line with ten thousand semicolons in it\". reply CaptainNegative 6 hours agorootparentWhat counts as a standard formatter? Python one-liners are Turing complete even without semicolons, evals, execs, and with finite stack depth. E.g. some formatters keep this at one line, while others introduce line breaks https://yonatan.us/misc/bf.html . reply oneeyedpigeon 7 hours agorootparentprevYou also need to define whether the code has to be raw CPU instructions or if it's allowed to use an external library containing all the code humanity has ever produced. reply thrw42A8N 6 hours agorootparentThe usual with this is \"whatever ships with the language compiler and OS\". reply heinrichhartman 11 hours agoparentprevWhat's the point of art? reply InsideOutSanta 9 hours agorootparentTo complain about it not having any point on Hacker News, thus creating a paradox where the complaint itself becomes the most discussed and engaging aspect of the post. reply actionfromafar 9 hours agorootparentThis is not what HN is for and your comment has no point. (Upvoted.) reply paxys 8 hours agorootparentprevSo a standard C program is not art, but if you remove newlines and shorten variable names it suddenly becomes art? reply psychoslave 7 hours agorootparentOnly if we arbitrarily state this is now art. But you can of course say the same for the standard version. There is even a youngster out there that started a work called \"the art of computer programming.\" We are definitely legitimate to lament about the good old time when art and mere texnical stuffs were clearly and sharply separated, while this new generation is ruining societies and our glorious civilizations with their careless use of words that mixes everything. Well, at least as legitimate as any old man in traceable history. https://history.stackexchange.com/questions/28169/what-is-th... reply GTP 6 hours agorootparentprevIf it's an entry for the IOCCC, yes ;) reply hk__2 9 hours agorootparentprevThat’s craftmanship, not art. reply lores 6 hours agorootparentA talk by Brian Eno convinced me that there is no meaningful difference between the two, and I've yet to see a definition of art that does not end up in self-contradiction if we try to make the distinction. reply vouaobrasil 8 hours agorootparentprevThe point of art is the expression of human experience and ability, but it frequently becomes perverted into serving capitalist tendencies. So: 1. Art becomes content 2. Automation to make life better becomes automation for profit 3. Life becomes meaningless achievement At some point, there is always the counterpoint of balance and we don't have that. reply tomcam 13 hours agoprevJart is already hard at work on a version that’s only 2070 bytes but includes a full lisp interpreter for the prompt parser reply cowsaymoo 13 hours agoparentThat fits inside a QR code. Artificial brain scan. reply hilti 10 hours agoparentprevNever heard of Jart - who or what is it? reply ryankrage77 9 hours agorootparentJustine Tunney, https://github.com/jart reply tgma 13 hours agoprevTL;DR: code-golf style C program to do inference on an existing TensorFlow model data for GPT2, not full ChatGPT, nor training or anything. reply jnwatson 12 hours agoparentThis isn't code golf. This is just white space removed. reply slt2021 12 hours agoparentprevmore like IOCCC+codegolf style implementation of GPT2 http://www.ioccc.org reply hnfong 11 hours agorootparentThere is actually an IOCCC entry in 2019 that does almost exactly this except it’s LSTM instead of transformers: https://www.ioccc.org/2019/mills/prog.c https://www.ioccc.org/2019/mills/hint.html reply demon08 9 hours agoprev [5 more] [flagged] cnity 9 hours agoparentHacker News front page isn't a trophy ceremony for smart AI models. reply hk__2 9 hours agoparentprev> Isn't the whole point that the models hosted by OpenAI are smarter? That’s not the point here, because as the link says (3rd paragraph): \"It's actually pretty terrible output\". reply sweca 9 hours agoparentprev [–] Because it's novel and interesting. This person wrote a super optimized dependency free implementation of GPT in C. reply menaerus 8 hours agorootparent [–] It's not really novel nor super-optimized. Many inference engines are out there. But interesting it is. Probably a good learning material too. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "Nicholas Carlini has developed a ChatGPT clone using a minimal C implementation of GPT-2, which is only about 3000 bytes in size.- The project is dependency-free and optimized to run GPT-2 Small on modern machines, though it produces low-quality output.- This initiative highlights the simplicity of neural networks and the ability to condense complex machine learning models into compact code, with the source code available on GitHub."
    ],
    "commentSummary": [
      "A ChatGPT clone, implemented in just 3000 bytes of C and powered by GPT-2, illustrates the simplicity and minimal code required to run a language model.- Although not highly functional, this project sparks discussions on AI's nature, training data's role, and the potential for small, efficient implementations.- It serves as an educational tool, demonstrating core concepts of transformers and the feasibility of compact AI solutions."
    ],
    "points": 330,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1733979696
  }
]
