[
  {
    "id": 42276620,
    "title": "இந்த பொத்தான் என்ன செய்கிறது? – என் புதிய கார் ஒரு மர்மமான மற்றும் ஆவணப்படுத்தப்படாத சுவிட்ச் கொண்டுள்ளது",
    "originLink": "https://blog.koenvh.nl/what-does-this-button-do-cm42u2oi7000a09l42f54g2pr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42276620",
    "commentBody": "",
    "originSummary": [
      "2020 ஆம் ஆண்டின் ஓபெல் கோர்சா வாகனத்தின் உரிமையாளர், முந்தைய உரிமையாளரான பெரிய நிறுவனத்தால் நிறுவப்பட்டதாக இருக்கக்கூடிய ஒரு காப்பு கண்காணிப்பு அமைப்புடன் இணைக்கப்பட்ட மர்மமான ஒரு சுவிட்சை கண்டுபிடித்தார்.",
      "கணினி ஒரு ஜிபிஎஸ் டிராக்கராகவும், சாத்தியமான ஒரு இயக்கத்தடைப்பியாகவும் செயல்படுகிறது, ஓட்டுனரின் இயக்கங்களை கண்காணித்து, தரவுகளை ஒரு காப்பக மேலாளருக்கு அனுப்புகிறது.",
      "உரிமையாளர் தனியுரிமை பற்றிய கவலைகளால் அந்த அமைப்பை அகற்ற திட்டமிட்டுள்ளார், குறிப்பாக கண்காணிப்பு சாதனங்களுடன் தெரியாமல் வாகனம் ஓட்டுவதன் பிரச்சினையை வெளிப்படுத்துகிறார்."
    ],
    "commentSummary": [
      "TEXT: புதிய கார் மாடல் GPS மற்றும் eSIM தொழில்நுட்பத்துடன் இணைக்கப்பட்ட ஒரு சுவிட்சை கொண்டுள்ளது, இது தனியுரிமை கவலைகளை எழுப்புகிறது, ஏனெனில் இந்த அம்சங்களை முடக்க முடியாது, இது தரவுச் சேகரிப்பு மற்றும் அரசாங்க கண்காணிப்பை சாத்தியமாக்குகிறது.",
      "தமிழில் எழுத வேண்டும். சில நுகர்வோர் தனியுரிமை பிரச்சினைகளை தவிர்க்க பழைய கார்கள் விரும்புகிறார்கள், ஏனெனில் நவீன வாகனங்கள் அவற்றின் இணைப்பு அம்சங்களால் \"சக்கரங்களில் ஸ்மார்ட்போன்கள்\" என்று ஒப்பிடப்படுகின்றன.",
      "தனியுரிமை ஆய்வுகள் புதிய கார்கள் தொடர்பான முக்கிய கவலைகளை வெளிப்படுத்துகின்றன, ஆனால் சில பிராண்டுகள் தரவுப் பகிர்விலிருந்து விலகுவதற்கான விருப்பங்களை வழங்குகின்றன, தொழில்நுட்ப முன்னேற்றங்கள் மற்றும் தனியுரிமை உரிமைகளை சமநிலைப்படுத்துவது குறித்து தொடர்ச்சியான விவாதங்களை தூண்டுகின்றன."
    ],
    "points": 532,
    "commentCount": 376,
    "retryCount": 0,
    "time": 1732910387
  },
  {
    "id": 42276865,
    "title": "4Chan CAPTCHA ஐ உடைத்தல்",
    "originLink": "https://www.nullpt.rs/breaking-the-4chan-captcha",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42276865",
    "commentBody": "",
    "originSummary": [
      "தமிழில் எழுத வேண்டும்: இந்த திட்டம் 4Chan CAPTCHAs ஐ 80% க்கும் மேற்பட்ட துல்லியத்துடன் தீர்க்க TensorFlow ஐப் பயன்படுத்தி ஒரு இயந்திரக் கற்றல் மாதிரியை உருவாக்குவதை நோக்கமாகக் கொண்டது, இறுதியில் 90% க்கும் மேற்பட்ட துல்லியத்தை அடைந்தது.",
      "தமிழில் எழுத வேண்டும்: மாதிரி LSTM CNN கட்டமைப்பை CTC குறியீட்டுடன் பயன்படுத்தியது, 500 கையால் தீர்க்கப்பட்ட மற்றும் 50,000 செயற்கை படங்களில் பயிற்சி பெற்றது, மேலும் TensorFlow.js உடன் உலாவி பயன்பாட்டிற்காக மாற்றப்பட்டது.",
      "திட்டம், தரவுச் சேகரிப்பு, செயற்கை தரவுத் தயாரிப்பு மற்றும் இணக்கத்தன்மை சிக்கல்களைத் தாண்டி, இயந்திரக் கற்றல் மற்றும் கணினி பார்வை தொடர்பான மதிப்புமிக்க பார்வைகளை வழங்கியது."
    ],
    "commentSummary": [
      "4Chan இன் CAPTCHA அமைப்பு உடைக்கப்பட்டுள்ளது, இது எழுத்து அடிப்படையிலான CAPTCHA களின் வரம்புகளை வெளிப்படுத்துகிறது, ஏனெனில் கணினிகள் இப்போது அவற்றை தீர்க்கும் திறனில் மனித திறன்களை மிஞ்சுகின்றன.",
      "அவைகளின் பாதிப்புகள் இருந்தபோதிலும், CAPTCHAs இன்னும் ஸ்பாமிங் செலவைக் கூடுதலாக்குவதில் ஒரு பங்கு வகிக்கின்றன, இதனால் சில சாத்தியமான ஸ்பாமர்களை தடுக்கின்றன.",
      "CAPTCHA-ஐ உடைக்கும் செயலின் நெறிமுறை விளைவுகள் விவாதிக்கப்படுகின்றன, ஏனெனில் இது அதிகமான ஸ்பாம் மற்றும் AI உருவாக்கிய உள்ளடக்கத்தை எளிதாக்குகிறது, இது வலைத்தள உரிமையாளர்கள் மற்றும் பயனர்களை பாதிக்கிறது, மேலும் பயனுள்ள ஸ்பாம் எதிர்ப்பு தீர்வுகளின் தேவையை வெளிப்படுத்துகிறது."
    ],
    "points": 445,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1732912342
  },
  {
    "id": 42277850,
    "title": "வாட்சவ் ஸ்பகோவ்ஸ்கியின் (2017) ஜியோமெட்ரிக் கோடு கலை",
    "originLink": "https://www.theparisreview.org/blog/2017/02/15/rhythmical-lines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42277850",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "வாட்ச்லா ஸ்பாகோவ்ஸ்கியின் ஜியோமெட்ரிக் கோடு கலை அதன் சிக்கலான வடிவமைப்புகளுக்காக அங்கீகாரம் பெறுகிறது, இது ஒப் ஆர்ட் மற்றும் பிரிட்ஜெட் ரிலே மற்றும் பெர்னார்ட் கோஹென் போன்ற கலைஞர்களுடன் ஒப்பிடப்படுகிறது. கணித மாதிரிகளை ஒத்த இந்த கலை, டிஜிட்டல் மற்றும் ஜெனரேட்டிவ் கலை உருவாக்குநர்களை ஊக்குவிக்கிறது, இது நவீன டிஜிட்டல் தளங்களில் அதன் திறனை வெளிப்படுத்துகிறது. விவாதங்கள் ஸ்பாகோவ்ஸ்கியின் படைப்பின் வரலாற்று முக்கியத்துவத்தையும், கணிதம் மற்றும் கலை இணைப்பையும் வலியுறுத்துகின்றன, தொடர்புடைய கலை மற்றும் கண்காட்சிகளுக்கான இணைப்புகள் பகிரப்பட்டு வருகின்றன."
    ],
    "points": 300,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1732920852
  },
  {
    "id": 42279454,
    "title": "பொறியியல் தூக்கம்",
    "originLink": "https://minjunes.ai/posts/sleep/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42279454",
    "commentBody": "",
    "originSummary": [
      "குடும்ப இயற்கை குறுகிய நித்திரை (FNSS) என்பது ஒரு நிலை ஆகும், இதில் சில நபர்கள் DEC2 ஜீனில் உள்ள மரபணு மாற்றத்தால், குறிப்பாக ஓரெக்சின் அளவுகளை பாதிக்கும், தீமையான விளைவுகள் இல்லாமல் குறைவாக உறங்க முடியும்.- ஓரெக்சின் நித்திரை ஒழுங்குமுறையில் முக்கிய பங்கு வகிக்கிறது, சமநிலையின்மை தூக்கமின்மை அல்லது தூக்கமின்மை ஏற்படுவதற்கு வழிவகுக்கிறது, மேலும் FNSS நகலெடுப்பை ஓரெக்சின் ஆகோனிஸ்ட்கள் அல்லது ஜீன் சிகிச்சை மூலம் ஆராய்ச்சி செய்து வருகிறது.- அதன் சாத்தியக்கூறுகள் இருந்தாலும், FNSS குறைவாக ஆராயப்பட்டுள்ளது, மேம்பட்ட தூக்க பொறியியல் முறைகளை உருவாக்க மேலும் ஆய்வுகள் தேவை என்பதை குறிக்கிறது."
    ],
    "commentSummary": [
      "குடும்பத்துடன் தொடர்புடைய இயற்கை குறைந்த தூக்கம் (FNSS) என்பது ஒரு மரபணு மாற்றமாகும், இது நபர்களுக்கு தீமைகள் இல்லாமல் குறைவாக தூங்குவதற்கான திறனை வழங்குகிறது, இதன் சாத்தியமான நன்மைகள் மற்றும் ஆபத்துகள் குறித்து ஆர்வத்தை தூண்டுகிறது.",
      "தமிழில் எழுத வேண்டும். நீண்டகால சுகாதார பாதிப்புகள் குறித்த கவலைகள் எழுப்பப்படுகின்றன, குறிப்பாக சிலர் தங்கள் தூக்கத்தை சிறப்பாக மேம்படுத்திய அனுபவங்களை பகிர்ந்தாலும், தூக்கக் குறைவால் மனநோய் ஏற்படும் அபாயம் அதிகரிக்கக்கூடும்.",
      "இந்த விவாதம் தூக்கத்தின் பரிணாம பாத்திரம், தூக்கத்தை பயோஹாக்கிங் செய்யும் சாத்தியக்கூறுகள் மற்றும் சமூக விளைவுகளைப் பற்றியும் கருதுகிறது, குறைந்த தூக்கத் தேவைகள் இறுதியில் பயனுள்ளதாகவா அல்லது தீங்காகவா உள்ளன என்பதை கேள்வி எழுப்புகிறது."
    ],
    "points": 290,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1732941212
  },
  {
    "id": 42277673,
    "title": "கூகிளின் சிதைவடைதல்",
    "originLink": "https://www.baldurbjarnason.com/2024/the-deterioration-of-google/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42277673",
    "commentBody": "",
    "originSummary": [
      "ஜையன்ட் ஃப்ரீக்கின் ரோபோட் மூடப்படுவது சுயாதீன வெளியீட்டாளர்கள் எதிர்கொள்ளும் சவால்களை வலியுறுத்துகிறது, ஏனெனில் கூகுள் மற்றும் ஃபேஸ்புக் போன்ற முக்கிய தளங்களில் இருந்து வருகை குறைவதால் பல தளங்கள் மூடப்படுகின்றன.- தேடல் முடிவுகளை மேம்படுத்த வடிவமைக்கப்பட்ட கூகுளின் இயந்திர கற்றல் அமைப்பு, பல சிறிய தளங்களை தவறுதலாக பட்டியலிலிருந்து நீக்கியுள்ளது, இதனால் உள்ளடக்க உருவாக்குநர்களுக்கு நிதி சிக்கல்கள் ஏற்பட்டுள்ளன.- ஆல்காரிதத்தின் சிக்கலான தன்மை மற்றும் கூகுளின் ஆதிக்கம் செலுத்தும் சந்தை நிலைமை தொடர்ச்சியான பிரச்சினைக்கு பங்களிக்கிறது, உருவாக்குநர்களை குறைந்த மாற்று வழிகள் மற்றும் தீர்வுகளுடன் விட்டு விடுகிறது."
    ],
    "commentSummary": [
      "Google இன் வீழ்ச்சி அதன் தேடல் தரத்தை விட விளம்பர வருவாயில் கவனம் செலுத்துவதுடன் தொடர்புடையது, இதனால் புதுமை மற்றும் பார்வை குறைவாகியுள்ளது.",
      "TEXT: பயனர்கள், சமீபத்திய ஆண்டுகளில் கூகுளின் முக்கியமான சாதனைகள் எதுவும் இல்லாமல், கூகுள் மேப்ஸ் மற்றும் கூகுள் டாக்ஸ் போன்ற சேவைகளின் தரத்தில் குறைவு ஏற்பட்டுள்ளதாக தெரிவிக்கின்றனர்.",
      "தேடல் இயந்திர ஆப்டிமைசேஷன் (SEO) மற்றும் AI உருவாக்கிய உள்ளடக்கத்தின் வளர்ச்சி தேடல் முடிவுகளை சிக்கலாக்கியுள்ளது, இதனால் பயனர்கள் Kagi மற்றும் DuckDuckGo போன்ற மாற்றுகளை ஆராய்ந்து சிறந்த தேடல் அனுபவங்களை பெற முயலுகின்றனர்."
    ],
    "points": 206,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1732919203
  },
  {
    "id": 42279010,
    "title": "சோல்-ஆர்க் உற்பத்தியாளர் அமெரிக்காவில் உள்ள அனைத்து டெய் இன்வெர்டர்களையும் முடக்கியதாக தகவல்",
    "originLink": "https://solarboi.com/2024/11/17/sol-ark-oem-disables-all-deye-inverters-in-the-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42279010",
    "commentBody": "",
    "originSummary": [
      "TEXT: Sol-Ark அமெரிக்காவில் உள்ள அனைத்து Deye இன்வெர்டர்களையும் முடக்கி, பிராந்தியக் கட்டுப்பாடுகள் பற்றிய செய்தியுடன் அவற்றை நோக்கமுடன் செயலிழக்கச் செய்து வீடுதோட்ட உரிமையாளர்களை பாதித்தது. TEXT:",
      "சோல்-ஆர்க், அமெரிக்காவில் பிரத்யேக விற்பனை உரிமைகளை கொண்டிருப்பதால், பாதிக்கப்பட்ட வாடிக்கையாளர்களுக்கு தள்ளுபடி மாற்று திட்டத்தை வழங்கியது, இணையத்துடன் இணைக்கப்பட்ட சூரிய இன்வெர்டர்களின் கட்டுப்பாடு மற்றும் பாதுகாப்பு குறித்து கவலைகளை எழுப்பியது.",
      "இந்தச் சம்பவம், குறிப்பாக சீனாவில் தயாரிக்கப்பட்ட தயாரிப்புகளுடன், இதே போன்ற இடையூறுகளைத் தவிர்க்க நம்பகமான ஆதரவு மற்றும் பாதுகாப்பான நெட்வொர்க்கிங் கொண்ட இன்வெர்டர்களைத் தேர்ந்தெடுப்பதன் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "சோல்-ஆர்க் அமெரிக்காவில் உள்ள அனைத்து டெய் இன்வெர்டர்களையும் முடக்கியதாக கூறப்படுகிறது, இது இணைய இணைக்கப்பட்ட சாதனங்கள் மற்றும் மேக சேவைகளின் சார்பில் ஏற்பட்டுள்ள ஏமாற்றத்தை தூண்டுகிறது. - பயனர்கள், உள்ளூர் சாதனங்களுக்கு மேக சேவைகளின் சார்பில் கவலைகளை வெளிப்படுத்தி, எதிர்காலத்தில் ஏற்படக்கூடிய இடையூறுகளைப் பற்றி அச்சப்படுகின்றனர் மற்றும் உள்ளூர் கட்டுப்பாட்டை ஆதரிக்கின்றனர். - இந்த சம்பவம் மேக சார்ந்த தொழில்நுட்பத்துடன் தொடர்புடைய அபாயங்களை வலியுறுத்துகிறது, இது மேம்பட்ட நுகர்வோர் பாதுகாப்பு மற்றும் மாற்று தீர்வுகளுக்கான அழைப்புகளை தூண்டுகிறது."
    ],
    "points": 170,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732935117
  }
]
