[
  {
    "id": 42276620,
    "title": "ماذا يفعل هذا الزر؟ - سيارتي الجديدة تحتوي على مفتاح غامض وغير موثق",
    "originLink": "https://blog.koenvh.nl/what-does-this-button-do-cm42u2oi7000a09l42f54g2pr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42276620",
    "commentBody": "",
    "originSummary": [
      "اكتشف مالك سيارة أوبل كورسا 2020 مفتاحًا غامضًا مرتبطًا بنظام تتبع الأسطول، من المحتمل أنه تم تركيبه من قبل المالك السابق، وهي شركة كبيرة.",
      "يعمل النظام كجهاز تتبع GPS وربما كجهاز تعطيل، حيث يتتبع تحركات السائق ويرسل البيانات إلى مدير الأسطول.",
      "يخطط المالك لإزالة النظام بسبب مخاوف تتعلق بالخصوصية، مما يبرز مشكلة القيادة دون علم بوجود أجهزة تتبع."
    ],
    "commentSummary": [
      "يتميز طراز سيارة جديد بمفتاح مرتبط بتقنية GPS وeSIM، مما يثير مخاوف بشأن الخصوصية حيث لا يمكن تعطيل هذه الميزات، مما قد يمكن من جمع البيانات ومراقبة الحكومة.",
      "يفضل بعض المستهلكين السيارات القديمة لتجنب قضايا الخصوصية، حيث تُقارن المركبات الحديثة غالبًا بـ\"الهواتف الذكية على عجلات\" بسبب ميزات الاتصال الخاصة بها.",
      "تسلط دراسات الخصوصية الضوء على مخاوف كبيرة بشأن السيارات الجديدة، على الرغم من أن بعض العلامات التجارية تقدم خيارات لعدم مشاركة البيانات، مما يثير نقاشات مستمرة حول تحقيق التوازن بين التقدم التكنولوجي وحقوق الخصوصية."
    ],
    "points": 532,
    "commentCount": 376,
    "retryCount": 0,
    "time": 1732910387
  },
  {
    "id": 42276865,
    "title": "كسر كابتشا 4شان",
    "originLink": "https://www.nullpt.rs/breaking-the-4chan-captcha",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42276865",
    "commentBody": "",
    "originSummary": [
      "كان الهدف من المشروع تطوير نموذج تعلم آلي باستخدام TensorFlow لحل رموز التحقق CAPTCHA الخاصة بموقع 4Chan بدقة تزيد عن 80%، وحقق في النهاية دقة تزيد عن 90%.",
      "استخدم النموذج بنية LSTM CNN مع ترميز CTC، وتم تدريبه على 500 صورة محلولة يدويًا و50,000 صورة اصطناعية، وتم تحويله للاستخدام في المتصفح باستخدام TensorFlow.js.",
      "قدمت المشروع رؤى قيمة في تعلم الآلة والرؤية الحاسوبية، متغلبًا على تحديات مثل جمع البيانات، وتوليد البيانات الاصطناعية، وقضايا التوافق."
    ],
    "commentSummary": [
      "تم اختراق نظام CAPTCHA الخاص بموقع 4Chan، مما يبرز محدوديات أنظمة CAPTCHA النصية حيث أصبحت أجهزة الكمبيوتر الآن تتفوق على القدرات البشرية في حلها.",
      "على الرغم من نقاط ضعفها، لا تزال CAPTCHAs تلعب دورًا في زيادة تكلفة الرسائل غير المرغوب فيها، مما يردع بعض المرسلين المحتملين.",
      "تُناقش التداعيات الأخلاقية لكسر CAPTCHA، حيث إنها تسهل المزيد من الرسائل غير المرغوب فيها والمحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي، مما يؤثر على مالكي المواقع والمستخدمين، مما يبرز الحاجة إلى حلول أكثر فعالية لمكافحة البريد العشوائي."
    ],
    "points": 445,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1732912342
  },
  {
    "id": 42277850,
    "title": "الفن الخطي الهندسي لوكواف شباكوفسكي (2017)",
    "originLink": "https://www.theparisreview.org/blog/2017/02/15/rhythmical-lines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42277850",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "الفن الخطي الهندسي لوكلاف سزباكوفسكي يكتسب اعترافًا بتصاميمه المعقدة، حيث يُقارن بفن الأوب آرت وفنانين مثل بريدجيت رايلي وبرنارد كوهين. - الفن، الذي يشبه الأنماط الرياضية، يلهم مبدعي الفن الرقمي والتوليدي، مما يبرز إمكانياته في المنصات الرقمية الحديثة. - تركز المناقشات على الأهمية التاريخية لأعمال سزباكوفسكي ومزجها بين الرياضيات والفن، مع مشاركة روابط للفن والمعارض ذات الصلة."
    ],
    "points": 300,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1732920852
  },
  {
    "id": 42279454,
    "title": "هندسة النوم",
    "originLink": "https://minjunes.ai/posts/sleep/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42279454",
    "commentBody": "",
    "originSummary": [
      "النوم الطبيعي القصير العائلي (FNSS) هو حالة يتمكن فيها الأفراد من النوم لفترات أقل دون تأثيرات سلبية بسبب طفرة جينية، خاصة في جين DEC2 الذي يؤثر على مستويات الأوريكسين. يلعب الأوريكسين دورًا رئيسيًا في تنظيم النوم، حيث تؤدي الاختلالات إلى النعاس أو الأرق، ويستكشف البحث إمكانية تكرار FNSS من خلال منبهات الأوريكسين أو العلاج الجيني. على الرغم من إمكانياته، لا يزال FNSS غير مدروس بشكل كافٍ، مما يشير إلى الحاجة لمزيد من الدراسات لتطوير طرق محسنة لهندسة النوم."
    ],
    "commentSummary": [
      "النوم القصير الطبيعي العائلي (FNSS) هو طفرة جينية تمكن الأفراد من النوم لفترات أقل دون آثار سلبية، مما يثير الاهتمام بفوائده ومخاطره المحتملة.",
      "تُثار مخاوف بشأن التأثيرات الصحية طويلة الأمد لقلة النوم، بما في ذلك احتمال زيادة خطر الإصابة بالخرف، على الرغم من بعض القصص الشخصية عن نجاح تحسين النوم.",
      "تناقش المناقشة أيضًا الدور التطوري للنوم، وإمكانية التلاعب البيولوجي بالنوم، والآثار المجتمعية، متسائلة عما إذا كانت الحاجة إلى تقليل النوم مفيدة في النهاية أم ضارة."
    ],
    "points": 290,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1732941212
  },
  {
    "id": 42277673,
    "title": "تدهور جوجل",
    "originLink": "https://www.baldurbjarnason.com/2024/the-deterioration-of-google/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42277673",
    "commentBody": "",
    "originSummary": [
      "إغلاق موقع Giant Freakin Robot يبرز التحديات التي تواجه الناشرين المستقلين، حيث يتم إغلاق العديد من المواقع بسبب انخفاض حركة المرور من المنصات الكبرى مثل جوجل وفيسبوك. - نظام التعلم الآلي لجوجل، المصمم لتحسين نتائج البحث، قام بشكل غير مقصود بإزالة العديد من المواقع الصغيرة، مما أدى إلى صعوبات مالية لمنشئي المحتوى. - تعقيد الخوارزمية وموقع جوجل المهيمن في السوق يساهمان في استمرار المشكلة، مما يترك للمبدعين بدائل وحلول محدودة."
    ],
    "commentSummary": [
      "يرتبط تراجع جوجل بتركيزها على إيرادات الإعلانات على حساب جودة البحث، مما أدى إلى تقليل الابتكار والرؤية.",
      "يبلغ المستخدمون عن تراجع في جودة الخدمات مثل خرائط جوجل ومستندات جوجل، دون تحقيق إنجازات كبيرة من جوجل في السنوات الأخيرة.",
      "أدى صعود تحسين محركات البحث (SEO) والمحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي إلى تعقيد نتائج البحث، مما دفع المستخدمين إلى استكشاف بدائل مثل Kagi وDuckDuckGo للحصول على تجارب بحث أفضل."
    ],
    "points": 206,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1732919203
  },
  {
    "id": 42279010,
    "title": "أفادت التقارير أن شركة سول-آرك قامت بتعطيل جميع محولات داي في الولايات المتحدة.",
    "originLink": "https://solarboi.com/2024/11/17/sol-ark-oem-disables-all-deye-inverters-in-the-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42279010",
    "commentBody": "",
    "originSummary": [
      "قامت شركة Sol-Ark بتعطيل جميع محولات Deye في الولايات المتحدة، مما أدى إلى إزعاج أصحاب المنازل عن طريق تعطيلها عمدًا برسالة حول القيود الإقليمية.",
      "قدمت شركة Sol-Ark، التي تمتلك حقوق البيع الحصرية في الولايات المتحدة، برنامج استبدال مخفض للعملاء المتضررين، مما أثار مخاوف بشأن التحكم وأمان المحولات الشمسية المتصلة بالإنترنت.",
      "يؤكد الحادث على أهمية اختيار محولات ذات دعم موثوق وشبكات آمنة لتجنب اضطرابات مماثلة، خاصة مع المنتجات المصنعة في الصين."
    ],
    "commentSummary": [
      "يُزعم أن شركة Sol-Ark قامت بتعطيل جميع محولات Deye في الولايات المتحدة، مما أثار إحباطًا بسبب الاعتماد على الأجهزة المتصلة بالإنترنت والخدمات السحابية. - يعبر المستخدمون عن مخاوفهم بشأن الاعتماد على الخدمات السحابية للأجهزة المحلية، خوفًا من الاضطرابات المحتملة في المستقبل والدعوة إلى التحكم المحلي. - يبرز الحادث المخاطر المرتبطة بالتكنولوجيا المعتمدة على السحابة، مما يدفع إلى الدعوة لتحسين حماية المستهلك وحلول بديلة."
    ],
    "points": 170,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1732935117
  }
]
