[
  {
    "id": 42370622,
    "title": "நாம் CEO சுட்டுக்கொல்லப்பட்ட சந்தேக நபர் குறித்து அறிந்தது",
    "originLink": "https://www.bbc.com/news/articles/cp9nxee2r0do",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42370622",
    "commentBody": "",
    "originSummary": [
      "பால்டிமோரில் குறிப்பிடத்தக்க குடும்பத்தைச் சேர்ந்த 26 வயதான லுயிஜி மாங்கியோன், நியூயார்க் நகரில் யுனைடெட் ஹெல்த்கேர் தலைமை நிர்வாக அதிகாரி பிரையன் தாம்சனைக் கொன்ற குற்றச்சாட்டில் கைது செய்யப்பட்டுள்ளார்.",
      "மாங்கியோன் பென்சில்வேனியாவில் ஒரு கோஸ்ட் கன் மற்றும் கார்ப்பரேட் அமெரிக்காவுக்கு எதிரான கோபத்துடன் தொடர்புடைய நோக்கத்தை குறிக்கும் ஒரு ஆவணத்துடன் கைது செய்யப்பட்டார்.",
      "அவரது கல்வி சாதனைகள் மற்றும் தரவுப் பொறியாளராகிய தொழில்முறை வாழ்க்கை இருந்தபோதிலும், மாங்கியோனின் சமூக ஊடகங்கள் சமீபத்தில் குடும்பத்தினரிடமிருந்து மற்றும் நண்பர்களிடமிருந்து தனிமைப்படுத்தப்பட்டிருப்பதை குறிக்கின்றன."
    ],
    "commentSummary": [
      "CEO ஷூட்டிங் சந்தேகத்தின் வழக்கு பல்வேறு கோட்பாடுகளை உருவாக்கியுள்ளது, ஒரு செய்தியை பரப்புவதற்கான திட்டமிடப்பட்ட திட்டம் முதல் வெறும் தகுதி இல்லாமை மற்றும் அதிர்ஷ்டம் வரை. சந்தேகத்தின் நடத்தை, சான்றுகளை எடுத்துச் செல்வது மற்றும் மனித வேட்டையின் போது பொதுவில் தோன்றுவது உள்ளிட்டவை, பொதுமக்களின் ஊகங்களை அதிகரித்துள்ளது. இந்த சம்பவம் சமூக பிரச்சினைகள் குறித்து விவாதங்களை தூண்டியுள்ளது, குறிப்பாக சுகாதார அமைப்பின் மீதான பொதுமக்களின் ஏமாற்றம் மற்றும் பாதிக்கப்பட்டவரின் நிலை அடிப்படையில் குற்றச்செயலின் சிகிச்சையில் உள்ள வேறுபாடுகள்."
    ],
    "points": 606,
    "commentCount": 1675,
    "retryCount": 0,
    "time": 1733779048
  },
  {
    "id": 42371481,
    "title": "இது ஒரு நகைச்சுவை அல்ல, ஃபன்கோ என் அம்மாவை அழைத்தது",
    "originLink": "https://twitter.com/itchio/status/1866239798924763227",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42371481",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பன்கோ ஒரு குறிப்பிட்ட பக்கத்தை இலக்காகக் கொண்டு itch.io மீது ஒரு நீக்க கோரிக்கையை வெளியிட்டது, ஆனால் அது முழு தளத்தையும் தற்காலிகமாக நீக்குவதற்கு வழிவகுத்தது, இது பொதுமக்களின் எதிர்ப்பை ஏற்படுத்தியது.",
      "Funko அவர்கள் நோக்கம் itch.io தளத்தின் முழுமையையும் இலக்காகக் கொள்ளவில்லை, மாறாக ஒரு குறிப்பிட்ட பக்கத்தை மட்டுமே இலக்காகக் கொள்ள வேண்டும் என்பதையே தெளிவுபடுத்தினர்.",
      "இந்தச் சம்பவம், நிறுவனங்கள் மற்றும் அவற்றின் கூட்டாளிகள், நீக்க கோரிக்கைகளை திறம்படக் கையாளுவதில் பொறுப்பை பற்றிய விவாதங்களைத் தூண்டியுள்ளது."
    ],
    "points": 587,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1733785004
  },
  {
    "id": 42373437,
    "title": "மர கணிதம்",
    "originLink": "https://treecalcul.us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42373437",
    "commentBody": "",
    "originSummary": [
      "மர கணக்கீடு என்பது ஒரு டூரிங்-முழுமையான கணினி மாதிரி ஆகும், இது ஒரு ஒற்றை இயக்கியை கொண்டுள்ளது, இது நிரல் பகுப்பாய்வு, வகை சரிபார்ப்பு, தொகுப்பு மற்றும் மேம்படுத்தலை நேரடியாக குறியீட்டில் அனுமதிக்கிறது.- இது 任意 வகை அமைப்புகள் மற்றும் تدريجي வகைப்பாட்டை ஆதரிக்கிறது, சக்திவாய்ந்த வாசிக்க-மதிப்பீடு-அச்சிடு மடல்களை (REPLs) மற்றும் வெளிப்புற கருவிகள் இல்லாமல் நிரல் பரவலை இயக்குகிறது.- அதன் குறைந்தபட்ச இலக்கணம் மற்றும் அர்த்தவியல் அதை எளிதாக எங்கு வேண்டுமானாலும் செயல்படுத்தக்கூடியதாகவும், மாதிரியாக்கம், உத்தியோகபூர்வ விவரக்குறிப்புகள் மற்றும் கல்வி நோக்கங்களுக்காக ஏற்றதாகவும் ஆக்குகிறது."
    ],
    "commentSummary": [
      "மர கணிதம் என்பது பேராசிரியர் பாரி ஜே உருவாக்கிய ஒரு நிரலாக்க மொழியாகும், இது லேபிள் செய்யப்படாத மரங்களை மையமாகக் கொண்டு செயல்பாடுகளின் உள்வாங்கல் மற்றும் கையாளுதலை அனுமதிக்கிறது.",
      "இது Turing முழுமையானது, அதாவது போதுமான நேரம் மற்றும் வளங்கள் கிடைத்தால் எந்த கணக்கீடும் செய்ய முடியும், மேலும் இது செயல்பாட்டு மாற்றம் போன்ற தனித்துவமான அம்சங்களை வழங்குகிறது, இது Lisp அல்லது Forth போன்ற மொழிகளிலிருந்து வேறுபடுகிறது.",
      "சமூகத்தினர் அதன் விளைவுகள் மற்றும் சாத்தியமான பயன்பாடுகளைச் சுறுசுறுப்பாக விவாதித்து வருகின்றனர், ஆனால் அதன் இணையதளமான treecalcul.us இல் அதன் விளக்கம் மற்றும் நோக்கம் குறித்து சில குழப்பம் உள்ளது."
    ],
    "points": 410,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1733801432
  },
  {
    "id": 42369476,
    "title": "ட்ரெலிஸ் – 3D மெஷ் உருவாக்கும் மாதிரி",
    "originLink": "https://trellis3d.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42369476",
    "commentBody": "",
    "originSummary": [
      "இந்த இடுகை, ஒருங்கிணைந்த கட்டமைக்கப்பட்ட LATent (SLAT) பிரதிநிதித்துவத்தைப் பயன்படுத்தி புதிய 3D உருவாக்க முறையை அறிமுகப்படுத்துகிறது, பல்துறை மற்றும் உயர்தர 3D சொத்துகளை உருவாக்குவதை மேம்படுத்துகிறது.",
      "மாதிரி, TRELLIS என பெயரிடப்பட்டுள்ளது, திருத்தப்பட்ட ஓட்ட மாற்றிகளை பயன்படுத்துகிறது மற்றும் பெரிய தரவுத்தொகுப்பில் பயிற்சி பெறப்பட்டுள்ளது, 3D உருவாக்கத்தில் உள்ள தற்போதைய முறைகளை மிஞ்சுகிறது.",
      "இந்த அணுகுமுறை நெகிழ்வான வெளியீட்டு வடிவங்களை மற்றும் உள்ளூர் 3D திருத்தங்களை ஆதரிக்கிறது, குறியீடு, மாதிரி மற்றும் தரவுகளை பொதுமக்களுக்கு வெளியிட திட்டமிடப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "டிரெலிஸ், ஒரு 3D மெஷ் உருவாக்கும் மாதிரி, உயர் தரமான சொத்துகளை உருவாக்கும் திறன் காரணமாக கலவையான எதிர்வினைகளை உருவாக்கியுள்ளது, இது விளையாட்டு மேம்பாட்டின் கவனத்தை கிராபிக்ஸிலிருந்து கதை சொல்லலுக்கு மாற்றக்கூடும்.",
      "சிலர் கைத்தறி கலை நுணுக்கத்தின் குறையும் பங்கினை பற்றிய கவலை வெளியிடுகின்றனர், மற்றவர்கள் கலைஞர்கள் தங்கள் பணியை மேம்படுத்த AI-ஐ பயன்படுத்தி தழுவி கொள்ளும் திறனை காண்கிறார்கள்.",
      "Trellis அதன் தற்போதைய வரம்புகள் போன்ற குறைந்த தரமான வயர்ஃப்ரேம் மற்றும் சில வடிவங்களுடன் சவால்கள் இருந்தாலும், 3D மாதிரிகரிப்பில் முன்னோட்டம் மற்றும் ஜனநாயகமயமாக்குவதில் அதன் திறனைக்காக அங்கீகரிக்கப்பட்டுள்ளது."
    ],
    "points": 409,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1733771947
  },
  {
    "id": 42373098,
    "title": "இசையை காப்பாற்றுங்கள், காப்பகத்தை காப்பாற்றுங்கள்",
    "originLink": "https://www.savethearchive.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42373098",
    "commentBody": "",
    "originSummary": [
      "500 க்கும் மேற்பட்ட இசைக்கலைஞர்கள், இலாப நோக்கமற்ற கலாச்சார நிறுவனம் ஆன இன்டர்நெட் ஆர்கைவ் மீது $621 மில்லியன் வழக்கை திரும்ப பெற முக்கிய நிறுவனங்களை வலியுறுத்துகின்றனர்.",
      "இசைக்கலைஞர்கள் நியாயமான ஈடுசெய்தல், இசை மரபுகளை பாதுகாப்பது, மற்றும் ஒரேநிலை நடைமுறைகளை ஆதரிப்பதற்குப் பதிலாக வாழும் கலைஞர்களில் முதலீடு செய்வதன் அவசியத்தை வலியுறுத்துகின்றனர்.",
      "அவர்கள் இசைத் துறையின் வாழ்வாதாரம் கலைஞர்களின் எதிர்காலங்களை முன்னுரிமைப்படுத்தி, அவர்களின் படைப்புகளை பாதுகாப்பதில் உள்ளது என்று வாதிடுகின்றனர், பொதுமக்களின் ஆதரவை ஒரு திறந்த கடிதத்தின் மூலம் கேட்டுக்கொள்கின்றனர்."
    ],
    "commentSummary": [
      "திறந்த மூல திட்டங்கள், Relisten போன்றவை, சட்டபூர்வமாக பதிவு செய்யப்பட்ட கச்சேரிகளை சேமிக்க இணையக் காப்பகத்தை பயன்படுத்துகின்றன, இது இசை ரசிகர்களுக்கு உதவுவதோடு கலாச்சார வரலாற்றையும் பாதுகாக்கிறது.",
      "இணைய காப்பகம் முக்கியமான லேபிள்களிடமிருந்து சட்ட சவால்களை எதிர்கொள்கிறது, குறிப்பாக வரலாற்று பதிவுகளை பாதுகாக்க முயலும் கிரேட் 78 திட்டம் போன்ற திட்டங்களைப் பற்றிய சவால்களை எதிர்கொள்கிறது.",
      "இசைத் துறையில் கலைஞர்களுக்கு நியாயமான ஈடுசெய்தல் குறித்து தொடர்ந்து விவாதம் நடைபெற்று வருகிறது, இதில் காப்புரிமை, ஸ்ட்ரீமிங் வருவாய் மற்றும் நேரடி விற்பனை மற்றும் Patreon போன்ற தளங்கள் போன்ற மாற்று வருவாய் மாதிரிகள் பற்றிய விவாதங்கள் இடம்பெறுகின்றன."
    ],
    "points": 338,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1733797871
  },
  {
    "id": 42378488,
    "title": "நான் விட்ட இடத்திலிருந்து",
    "originLink": "https://antirez.com/news/144",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42378488",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "விவாதம் ரெடிஸ் தனது திறந்த மூல உரிமத்தை மாற்றியமைத்ததை மையமாகக் கொண்டுள்ளது, இது பங்களிப்பாளர்களிடையே அதிருப்தியை ஏற்படுத்தியுள்ளது, அவர்கள் இந்த நடவடிக்கையால் துரோகம் செய்யப்பட்டதாக உணர்கிறார்கள்.- புதிய உரிமம் சிலரால் சட்டபூர்வமான பயன்பாட்டை சிக்கலாக்குவதாகக் கருதப்படுகிறது, மற்றவர்கள் இதை பெரிய நிறுவனங்களால் சுரண்டப்படுவதைத் தடுக்க அவசியமாகக் கருதுகிறார்கள்.- முக்கிய தொழில்நுட்ப நிறுவனங்களால் ஆதரிக்கப்படும் ரெடிஸ் கிளை வால்கியின் தோற்றம் மற்றும் ரெடிஸ் நிறுவனர் சால்வடோர் சான்ஃபிலிப்போவின் திரும்புதல் ஆகியவை திறந்த மூல உரிமம் மற்றும் நிறுவனத்தின் செல்வாக்கு பற்றிய தொடர்ச்சியான விவாதத்தில் முக்கிய முன்னேற்றங்களாகும்."
    ],
    "points": 305,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1733848912
  },
  {
    "id": 42374823,
    "title": "டெவலப்பர் 25,000 வரிகள் கொண்ட நியோவிம் பிளகின் குறியீட்டைப் போன் மற்றும் தொடுதிரை பயன்படுத்தி எழுதினார்",
    "originLink": "https://old.reddit.com/r/neovim/comments/1h7vhmg/bro_been_developing_his_2k_star_plugin_on_a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42374823",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பங்களாதேஷில் உள்ள ஒரு டெவலப்பர், தொலைபேசி மற்றும் தொடுதிரையை மட்டுமே பயன்படுத்தி 25,000 வரி Neovim பிளகின் குறியீட்டை எழுதி, குறிப்பிடத்தக்க அர்ப்பணிப்பு மற்றும் தழுவல்தன்மையை வெளிப்படுத்தினார்.",
      "பங்களாதேஷில் மடிக்கணினிகள் விலை உயர்ந்தவை என்பதால், வளர்ந்து வரும் நாடுகளில் உள்ள டெவலப்பர்கள் எதிர்கொள்ளும் நிதி தடைகளை வெளிப்படுத்தும் வகையில், அவருக்கு மடிக்கணினி வழங்க நிதி திரட்டல் ஏற்பாடு செய்யப்படுகிறது.",
      "டெவலப்பர் தனது தொலைபேசியில் Termius, tmux, மற்றும் Vim போன்ற கருவிகளை பயன்படுத்துகிறார், மேலும் அவரது முயற்சிகள் தொலைபேசியில் குறியீட்டு செய்வதன் சவால்கள் குறித்து விவாதங்களை ஏற்படுத்தியுள்ளது."
    ],
    "points": 237,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733817648
  },
  {
    "id": 42371476,
    "title": "டீபாங்கிங் (மற்றும் டீபங்கிங்?)",
    "originLink": "https://www.bitsaboutmoney.com/archive/debanking-and-debunking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42371476",
    "commentBody": "",
    "originSummary": [
      "வங்கிக் கணக்குகளை கட்டாயமாக மூடும் 'டீபாங்கிங்' என்பது சர்ச்சைக்குரிய ஒரு பிரச்சினையாகும், குறிப்பாக கிரிப்டோ தொழில்களை பாதிக்கிறது, இது அரசியல் கருவியாக பயன்படுத்தப்படலாம் என்ற கவலைகளும் உள்ளன.",
      "தமிழில் எழுத வேண்டும். வாதம் தனியார் மற்றும் அரசியல் செயல்பாட்டாளர்களுக்கு இடையிலான சிக்கலான தொடர்புகளை உள்ளடக்கியது, சிலர் அபாய மேலாண்மைக்காக வங்கிக்கணக்கை மூடுவதை அவசியமாகக் கருதுகின்றனர், மற்றவர்கள் அதை அநியாயமாகவும், உரிய செயல்முறையின்றி இருப்பதாகவும் பார்க்கின்றனர்.",
      "வரலாற்று ஒழுங்குமுறை நடவடிக்கைகள், குறிப்பாக சில தொழில்களுடன் வங்கிகள் தொடர்புகளை துண்டிக்க அழுத்தம் கொடுத்த Operation Choke Point போன்றவை, தற்போதைய கிரிப்டோ வணிகங்களுக்கெதிரான நடவடிக்கைகளுக்கு ஒத்ததாக உள்ளதாக விமர்சகர்கள் குறிப்பிடுகின்றனர், இதற்கு 'Choke Point 2.0' என்று பெயரிடப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "Debanking என்பது, சட்டவிரோத நிதி செயல்பாடுகளைத் தடுக்க நோக்கமாகக் கொண்ட பணமோசடி தடுப்பு (AML) சட்டங்கள் போன்ற ஒழுங்குமுறை அழுத்தங்களின் காரணமாக, வங்கிகள் கணக்குகளை மூடுவதையோ அல்லது சேவைகளை மறுப்பதையோ குறிக்கிறது.",
      "விமர்சகர்கள், நபர்களுக்கும் வியாபாரங்களுக்கும் அநியாயமாக பாதிப்பை ஏற்படுத்தக்கூடிய, அவர்களின் பொருளாதார பங்கேற்பை குறைக்கும் வங்கிக் கணக்கை மூடுவதில் வெளிப்படைத்தன்மை மற்றும் உரிய செயல்முறை இல்லாமையை குறிப்பிடுகின்றனர்.",
      "வங்கிகள் அனைவருக்கும் அடிப்படை சேவைகளை வழங்க வேண்டும் என்ற கட்டாயம் இருக்க வேண்டுமா, இல்லையா என்பது குறித்த விவாதம், மற்றும் இந்த பிரச்சினை பரந்த அரசியல் மற்றும் சமூக அக்கறைகளுடன் எவ்வாறு இணைகிறது என்பதையே மையமாகக் கொண்டுள்ளது."
    ],
    "points": 223,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1733784987
  },
  {
    "id": 42377018,
    "title": "இரட்டை (YC W24) – 0% செலவுக் குறியீடுகளுடன் குறியீட்டு முதலீடு",
    "originLink": "https://news.ycombinator.com/item?id=42377018",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42377018",
    "commentBody": "",
    "originSummary": [
      "Double என்பது ஒரு நிதி தளம் ஆகும், இது 50 க்கும் மேற்பட்ட பங்கு சந்தை குறியீடுகளில் செலவில்லாமல் முதலீடு செய்ய அனுமதிக்கிறது, மேலாண்மை, சமநிலை திருத்தம் மற்றும் வரி இழப்பு அறுவடை ஆகியவற்றுக்கு மாதம் $1 என்ற நிலையான கட்டணத்தை வசூலிக்கிறது.",
      "மேடையில் நேரடி குறியீட்டு சேவையை வழங்குகிறது, இது பிரபலமான குறியீடுகளில் இருந்து தனிப்பட்ட பங்குகளை வாங்குவதன் மூலம் தனிப்பயனாக்கம் மற்றும் தினசரி போர்ட்ஃபோலியோ மேம்பாட்டை வழங்குகிறது, இதன் மூலம் மற்ற ரோபோ ஆலோசகர்களிலிருந்து தனித்துவமாக உள்ளது.",
      "டெக்ஸ்ட்: டபிள் $10 மில்லியன் மேலாண்மை கீழ் சொத்துக்களை (AUM) அடைந்துள்ளது மற்றும் குறைந்த கட்டண முதலீட்டு உத்திகளை வழங்குவதன் மூலம் $100 பில்லியன்/ஆண்டு ETF மற்றும் பரஸ்பர நிதி சந்தையை மாற்ற முயல்கிறது."
    ],
    "commentSummary": [
      "டெக்ஸ்ட்: டபிள் என்பது ஒரு முதலீட்டு தளம் ஆகும், இது மாதம் $1 என்ற நிலையான கட்டணத்துடன் மற்றும் 0% செலவுக் குறியீடுகளுடன் குறியீட்டு முதலீட்டை வழங்குகிறது, பாரம்பரிய ETF மற்றும் பரஸ்பர நிதி சந்தைகளை மாற்ற முயல்கிறது.- ஜேஜே மற்றும் மார்க் ஆகியோரால் நிறுவப்பட்ட இந்த தளம் 50 க்கும் மேற்பட்ட பங்கு சந்தை குறியீடுகளை நிர்வகிக்கிறது மற்றும் மீளச்சீரமைப்பு மற்றும் வரி இழப்பு அறுவடை போன்ற பணிகளை கையாள்கிறது, $10M மதிப்பிலான மேலாண்மை சொத்துக்களுடன்.- அதன் புதுமையான கட்டண அமைப்பைத் தவிர, டபிளின் நிலைத்தன்மை, பாதுகாப்பு மற்றும் வாங்கார்டு மற்றும் ஃபிடெலிட்டி போன்ற நிறுவப்பட்ட நிதி நிறுவனங்களுடன் ஒப்பிடும்போது அது எவ்வாறு செயல்படுகிறது என்பதில் கவலைகள் உள்ளன."
    ],
    "points": 215,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1733840214
  }
]
