[
  {
    "id": 42370622,
    "title": "सीईओ शूटिंग संदिग्ध के बारे में हम क्या जानते हैं",
    "originLink": "https://www.bbc.com/news/articles/cp9nxee2r0do",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42370622",
    "commentBody": "",
    "originSummary": [
      "लुइगी मंगियोन, जो बाल्टीमोर के एक प्रमुख परिवार से 26 वर्षीय हैं, पर न्यूयॉर्क सिटी में यूनाइटेडहेल्थकेयर के सीईओ ब्रायन थॉम्पसन की हत्या का आरोप लगाया गया है।",
      "मांगियोन को पेंसिल्वेनिया में एक भूत बंदूक और एक दस्तावेज़ के साथ गिरफ्तार किया गया, जो कॉर्पोरेट अमेरिका के प्रति गुस्से से संबंधित एक मकसद की ओर इशारा करता है।",
      "अपने शैक्षणिक उपलब्धियों और डेटा इंजीनियर के रूप में करियर के बावजूद, मंगियोन के सोशल मीडिया से हाल ही में परिवार और दोस्तों से अलगाव का संकेत मिलता है।"
    ],
    "commentSummary": [
      "सीईओ शूटिंग संदिग्ध के मामले ने कई सिद्धांतों को जन्म दिया है, जो एक संदेश फैलाने की जानबूझकर योजना से लेकर मात्र अक्षमता और भाग्य तक हैं।- संदिग्ध के व्यवहार, जिसमें सबूत ले जाना और मैनहंट के दौरान सार्वजनिक रूप से दिखाई देना शामिल है, ने सार्वजनिक अटकलों को बढ़ा दिया है।- इस घटना ने सामाजिक मुद्दों पर चर्चाओं को जन्म दिया है, विशेष रूप से स्वास्थ्य सेवा प्रणाली के साथ सार्वजनिक निराशा और पीड़ित की स्थिति के आधार पर अपराध के उपचार में असमानताओं पर।"
    ],
    "points": 606,
    "commentCount": 1675,
    "retryCount": 0,
    "time": 1733779048
  },
  {
    "id": 42371481,
    "title": "यह मजाक नहीं है, फनको ने अभी मेरी माँ को फोन किया।",
    "originLink": "https://twitter.com/itchio/status/1866239798924763227",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42371481",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "फनको ने itch.io पर एक विशेष पृष्ठ को लक्षित करते हुए एक टेकेडाउन अनुरोध जारी किया, लेकिन इसके परिणामस्वरूप पूरी साइट को अस्थायी रूप से हटा दिया गया, जिससे सार्वजनिक प्रतिक्रिया उत्पन्न हुई।",
      "फनको ने स्पष्ट किया कि उनका इरादा केवल एक विशेष पृष्ठ को लक्षित करने का था, न कि पूरे itch.io प्लेटफॉर्म को।",
      "इस घटना ने कंपनियों और उनके साझेदारों की जिम्मेदारी के बारे में चर्चाओं को जन्म दिया है कि वे हटाने के अनुरोधों को प्रभावी ढंग से कैसे प्रबंधित करें।"
    ],
    "points": 587,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1733785004
  },
  {
    "id": 42373437,
    "title": "ट्री कैलकुलस",
    "originLink": "https://treecalcul.us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42373437",
    "commentBody": "",
    "originSummary": [
      "ट्री कैलकुलस एक ट्यूरिंग-पूर्ण कम्प्यूटेशनल मॉडल है जिसमें एकल ऑपरेटर होता है, जो प्रोग्राम विश्लेषण, प्रकार जांच, संकलन, और अनुकूलन को सीधे कोड के भीतर सक्षम करता है।- यह मनमाने प्रकार की प्रणालियों और क्रमिक टाइपिंग का समर्थन करता है, जिससे शक्तिशाली रीड-इवाल-प्रिंट लूप्स (REPLs) और प्रोग्राम तैनाती बिना बाहरी उपकरणों के संभव होती है।- इसका न्यूनतम सिंटैक्स और सिमेंटिक्स इसे पोर्टेबल बनाता है और किसी भी प्लेटफॉर्म पर इंटरप्रेटर्स को लागू करना आसान बनाता है, जो मॉडलिंग, औपचारिक विनिर्देशों, और शैक्षिक उद्देश्यों के लिए उपयुक्त है।"
    ],
    "commentSummary": [
      "ट्री कैलकुलस एक प्रोग्रामिंग भाषा है जिसे प्रोफेसर बैरी जे द्वारा विकसित किया गया है, जो बिना लेबल वाले पेड़ों पर केंद्रित है और कार्यों की अंतर्दृष्टि और हेरफेर की अनुमति देती है।",
      "यह ट्यूरिंग पूर्ण है, जिसका अर्थ है कि यह पर्याप्त समय और संसाधनों के साथ किसी भी गणना को कर सकता है, और इसमें अद्वितीय विशेषताएं हैं जैसे कि फंक्शन इनवर्जन, जो इसे Lisp या Forth जैसी भाषाओं से अलग बनाती हैं।",
      "समुदाय इसके प्रभावों और संभावित अनुप्रयोगों पर सक्रिय रूप से चर्चा कर रहा है, हालांकि वेबसाइट treecalcul.us पर इसकी प्रस्तुति और उद्देश्य को लेकर कुछ भ्रम है।"
    ],
    "points": 410,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1733801432
  },
  {
    "id": 42369476,
    "title": "ट्रेलिस – 3डी जाल जनरेटिव मॉडल",
    "originLink": "https://trellis3d.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42369476",
    "commentBody": "",
    "originSummary": [
      "यह पोस्ट एक नए 3D जनरेशन विधि को प्रस्तुत करती है जो एकीकृत संरचित लेटेंट (SLAT) प्रतिनिधित्व का उपयोग करती है, जिससे बहुमुखी और उच्च-गुणवत्ता वाले 3D संपत्तियों के निर्माण में सुधार होता है।",
      "मॉडल, जिसका नाम TRELLIS है, रेक्टिफाइड फ्लो ट्रांसफॉर्मर्स का उपयोग करता है और एक बड़े डेटासेट पर प्रशिक्षित है, जो 3D जनरेशन में मौजूदा विधियों से बेहतर प्रदर्शन करता है।",
      "यह दृष्टिकोण लचीले आउटपुट प्रारूपों और स्थानीय 3डी संपादन का समर्थन करता है, और कोड, मॉडल और डेटा को सार्वजनिक रूप से जारी करने की योजना है।"
    ],
    "commentSummary": [
      "ट्रेलिस, एक 3डी मेष जनरेटिव मॉडल, ने उच्च-गुणवत्ता वाली संपत्तियों का उत्पादन करने की अपनी क्षमता के कारण मिश्रित प्रतिक्रियाएँ उत्पन्न की हैं, जो संभावित रूप से गेम विकास के फोकस को ग्राफिक्स से कहानी कहने की ओर स्थानांतरित कर सकता है।",
      "जब कुछ लोग हस्तनिर्मित कला के घटते हुए महत्व को लेकर चिंता व्यक्त करते हैं, तो अन्य लोग कलाकारों के लिए एआई का उपयोग करके अपने काम को बढ़ाने और अनुकूलित करने की संभावना देखते हैं।",
      "ट्रेलिस को प्रोटोटाइपिंग और 3डी मॉडलिंग को जनसामान्य तक पहुँचाने की क्षमता के लिए पहचाना जाता है, हालांकि वर्तमान सीमाओं जैसे खराब वायरफ्रेम गुणवत्ता और कुछ आकृतियों के साथ चुनौतियों के बावजूद।"
    ],
    "points": 409,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1733771947
  },
  {
    "id": 42373098,
    "title": "संगीत बचाओ, अभिलेखागार बचाओ",
    "originLink": "https://www.savethearchive.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42373098",
    "commentBody": "",
    "originSummary": [
      "500 से अधिक संगीतकार प्रमुख लेबल्स से अनुरोध कर रहे हैं कि वे इंटरनेट आर्काइव, एक गैर-लाभकारी सांस्कृतिक संस्था, के खिलाफ $621 मिलियन का मुकदमा वापस लें।",
      "संगीतकार उचित मुआवजे की आवश्यकता, संगीत विरासतों की सुरक्षा, और जीवित कलाकारों में निवेश पर जोर देते हैं, बजाय इसके कि एकाधिकारवादी प्रथाओं का समर्थन किया जाए।",
      "वे तर्क देते हैं कि संगीत उद्योग का अस्तित्व कलाकारों के भविष्य को प्राथमिकता देने और उनके कार्यों को संरक्षित करने पर निर्भर करता है, और एक खुले पत्र के माध्यम से सार्वजनिक समर्थन की अपील करते हैं।"
    ],
    "commentSummary": [
      "ओपन सोर्स प्रोजेक्ट्स, जैसे कि Relisten, इंटरनेट आर्काइव का उपयोग कानूनी रूप से रिकॉर्ड किए गए कॉन्सर्ट्स को संग्रहीत करने के लिए करते हैं, जो संगीत प्रेमियों की सहायता करते हैं और सांस्कृतिक इतिहास को संरक्षित करते हैं।",
      "इंटरनेट आर्काइव प्रमुख लेबलों से कानूनी चुनौतियों का सामना कर रहा है, विशेष रूप से ग्रेट 78 प्रोजेक्ट जैसे परियोजनाओं के संबंध में, जो ऐतिहासिक रिकॉर्डिंग को संरक्षित करने का प्रयास करता है।",
      "संगीत उद्योग में कलाकारों के उचित मुआवजे को लेकर बहस जारी है, जिसमें कॉपीराइट, स्ट्रीमिंग राजस्व, और प्रत्यक्ष बिक्री और Patreon जैसे प्लेटफार्मों जैसे वैकल्पिक राजस्व मॉडलों पर चर्चा हो रही है।"
    ],
    "points": 338,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1733797871
  },
  {
    "id": 42378488,
    "title": "जहां से मैंने छोड़ा",
    "originLink": "https://antirez.com/news/144",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42378488",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "विवाद का केंद्र बिंदु Redis का अपने ओपन-सोर्स लाइसेंस को बदलना है, जिससे उन योगदानकर्ताओं में असंतोष उत्पन्न हो रहा है जो इस कदम से खुद को धोखा महसूस कर रहे हैं।- कुछ लोगों द्वारा नए लाइसेंस को कानूनी उपयोग को जटिल बनाने के रूप में देखा जा रहा है, जबकि अन्य इसे बड़े निगमों द्वारा शोषण को रोकने के लिए आवश्यक मानते हैं।- प्रमुख तकनीकी कंपनियों द्वारा समर्थित Redis के फोर्क Valkey का उदय और Redis के संस्थापक सल्वातोर सैंफिलिप्पो की वापसी, ओपन-सोर्स लाइसेंसिंग और कॉर्पोरेट प्रभाव के बारे में चल रही बहस में महत्वपूर्ण विकास हैं।"
    ],
    "points": 305,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1733848912
  },
  {
    "id": 42374823,
    "title": "डेवलपर ने फोन और टचस्क्रीन का उपयोग करके 25k लाइनों का Neovim प्लगइन कोड लिखा।",
    "originLink": "https://old.reddit.com/r/neovim/comments/1h7vhmg/bro_been_developing_his_2k_star_plugin_on_a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42374823",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "बांग्लादेश के एक डेवलपर ने केवल फोन और टचस्क्रीन का उपयोग करके 25,000 लाइनों का Neovim प्लगइन कोड लिखा, जो उल्लेखनीय समर्पण और अनुकूलन क्षमता को दर्शाता है।",
      "एक फंडरेज़र का आयोजन किया जा रहा है ताकि उन्हें एक लैपटॉप प्रदान किया जा सके, क्योंकि बांग्लादेश में लैपटॉप महंगे होते हैं, जो विकासशील देशों में डेवलपर्स द्वारा सामना की जाने वाली वित्तीय बाधाओं को उजागर करता है।",
      "डेवलपर अपने फोन पर Termius, tmux, और Vim जैसे टूल्स का उपयोग करता है, और उसके प्रयासों ने फोन पर कोडिंग की चुनौतियों के बारे में चर्चाएं शुरू कर दी हैं।"
    ],
    "points": 237,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733817648
  },
  {
    "id": 42371476,
    "title": "डेबैंकिंग (और डिबंकिंग?)",
    "originLink": "https://www.bitsaboutmoney.com/archive/debanking-and-debunking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42371476",
    "commentBody": "",
    "originSummary": [
      "डिबैंकिंग, जो बैंक खातों का अनैच्छिक बंद होना है, एक विवादास्पद मुद्दा है, विशेष रूप से क्रिप्टो व्यवसायों को प्रभावित करता है, और इस बात की चिंता है कि इसका उपयोग राजनीतिक उपकरण के रूप में किया जा सकता है।",
      "बहस में निजी और राज्य अभिनेताओं के बीच जटिल अंतःक्रियाएं शामिल हैं, जहां कुछ लोग जोखिम प्रबंधन के लिए डेबैंकिंग को आवश्यक मानते हैं, जबकि अन्य इसे अनुचित और उचित प्रक्रिया की कमी के रूप में देखते हैं।",
      "ऐतिहासिक नियामक कार्रवाइयाँ जैसे ऑपरेशन चोक पॉइंट, जिसने बैंकों पर कुछ उद्योगों के साथ संबंध तोड़ने का दबाव डाला, आलोचकों द्वारा क्रिप्टो व्यवसायों के खिलाफ वर्तमान कार्रवाइयों के समान बताई जाती हैं, जिन्हें \"चोक पॉइंट 2.0\" कहा जाता है।"
    ],
    "commentSummary": [
      "डेबैंकिंग में बैंकों द्वारा खातों को बंद करना या सेवाओं से इनकार करना शामिल होता है, अक्सर नियामक दबावों के कारण जैसे कि एंटी-मनी लॉन्ड्रिंग (एएमएल) कानून, जो अवैध वित्तीय गतिविधियों को रोकने का उद्देश्य रखते हैं।",
      "आलोचक डेबैंकिंग में पारदर्शिता और उचित प्रक्रिया की कमी को उजागर करते हैं, जो व्यक्तियों और व्यवसायों को अन्यायपूर्ण तरीके से प्रभावित कर सकती है, जिससे उनकी आर्थिक भागीदारी सीमित हो जाती है।",
      "बहस इस बात पर केंद्रित है कि क्या बैंकों को सभी को बुनियादी सेवाएं प्रदान करने की आवश्यकता होनी चाहिए, चाहे उन्हें जोखिम के रूप में देखा जाए या नहीं, और यह मुद्दा व्यापक राजनीतिक और सामाजिक चिंताओं के साथ कैसे जुड़ता है।"
    ],
    "points": 223,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1733784987
  },
  {
    "id": 42377018,
    "title": "डबल (वाईसी डब्ल्यू24) – 0% व्यय अनुपात के साथ सूचकांक निवेश",
    "originLink": "https://news.ycombinator.com/item?id=42377018",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42377018",
    "commentBody": "",
    "originSummary": [
      "डबल एक वित्तीय प्लेटफॉर्म है जो 50 से अधिक स्टॉक मार्केट इंडेक्स में निवेश की अनुमति देता है, जिसमें कोई व्यय अनुपात नहीं होता है, और प्रबंधन, पुनर्संतुलन, और कर-हानि कटाई के लिए $1/माह का एक स्थिर शुल्क लेता है।",
      "यह प्लेटफ़ॉर्म लोकप्रिय सूचकांकों से व्यक्तिगत शेयर खरीदकर प्रत्यक्ष अनुक्रमण की पेशकश करता है, जो अनुकूलन और दैनिक पोर्टफोलियो अनुकूलन प्रदान करता है, जिससे यह अन्य रोबो-एडवाइज़र्स से अलग होता है।",
      "डबल ने प्रबंधन के तहत संपत्तियों (AUM) में $10 मिलियन हासिल किए हैं और कम शुल्क वाली निवेश रणनीतियों की पेशकश करके $100 बिलियन/वर्ष ईटीएफ और म्यूचुअल फंड बाजार को बाधित करने का लक्ष्य रखा है।"
    ],
    "commentSummary": [
      "डबल एक निवेश प्लेटफॉर्म है जो $1/माह की फ्लैट फीस और 0% व्यय अनुपात के साथ इंडेक्स निवेश की पेशकश करता है, जिसका उद्देश्य पारंपरिक ईटीएफ और म्यूचुअल फंड बाजारों को बाधित करना है।- जे जे और मार्क द्वारा स्थापित, यह प्लेटफॉर्म 50 से अधिक स्टॉक मार्केट इंडेक्स का प्रबंधन करता है और पुनर्संतुलन और कर-हानि कटाई जैसे कार्यों को संभालता है, इसके प्रबंधन के तहत $10M की संपत्ति है।- इसके नवाचारी शुल्क संरचना के बावजूद, डबल की स्थिरता, सुरक्षा और वैनगार्ड और फिडेलिटी जैसे स्थापित वित्तीय संस्थानों की तुलना में इसकी स्थिति को लेकर चिंताएं हैं।"
    ],
    "points": 215,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1733840214
  }
]
