[
  {
    "id": 42370622,
    "title": "সিইও গুলিবর্ষণ সন্দেহভাজন সম্পর্কে আমরা যা জানি",
    "originLink": "https://www.bbc.com/news/articles/cp9nxee2r0do",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42370622",
    "commentBody": "",
    "originSummary": [
      "লুইজি ম্যানজিওন, বাল্টিমোরের একটি উল্লেখযোগ্য পরিবারের ২৬ বছর বয়সী সদস্য, নিউ ইয়র্ক সিটিতে ইউনাইটেডহেলথকেয়ার সিইও ব্রায়ান থম্পসনের হত্যার অভিযোগে অভিযুক্ত হয়েছেন।",
      "ম্যানজিওনকে পেনসিলভানিয়ায় একটি ভূত বন্দুক এবং একটি নথি সহ গ্রেপ্তার করা হয়েছিল যা কর্পোরেট আমেরিকার প্রতি রাগ সম্পর্কিত একটি উদ্দেশ্যের ইঙ্গিত দেয়।",
      "তার একাডেমিক সাফল্য এবং ডেটা ইঞ্জিনিয়ার হিসাবে কর্মজীবন সত্ত্বেও, ম্যানজিওনের সামাজিক মিডিয়া সাম্প্রতিক সময়ে পরিবার এবং বন্ধুদের থেকে বিচ্ছিন্নতার ইঙ্গিত দেয়।"
    ],
    "commentSummary": [
      "সিইও গুলির সন্দেহভাজনের মামলাটি বিভিন্ন তত্ত্বের জন্ম দিয়েছে, যা একটি বার্তা ছড়ানোর ইচ্ছাকৃত পরিকল্পনা থেকে শুরু করে কেবলমাত্র অদক্ষতা এবং ভাগ্যের উপর নির্ভর করে। সন্দেহভাজনের আচরণ, যার মধ্যে প্রমাণ বহন করা এবং জনসমক্ষে উপস্থিত হওয়া অন্তর্ভুক্ত, জনসাধারণের জল্পনা-কল্পনা বাড়িয়ে দিয়েছে। এই ঘটনা সমাজের বিভিন্ন বিষয় নিয়ে আলোচনা উস্কে দিয়েছে, বিশেষ করে স্বাস্থ্যসেবা ব্যবস্থার প্রতি জনসাধারণের হতাশা এবং ভুক্তভোগীর অবস্থার উপর ভিত্তি করে অপরাধের আচরণের বৈষম্য।"
    ],
    "points": 606,
    "commentCount": 1675,
    "retryCount": 0,
    "time": 1733779048
  },
  {
    "id": 42371481,
    "title": "এটি কোনো রসিকতা নয়, ফানকো মাত্রই আমার মাকে ফোন করেছে",
    "originLink": "https://twitter.com/itchio/status/1866239798924763227",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42371481",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ফানকো একটি নির্দিষ্ট পৃষ্ঠাকে লক্ষ্য করে itch.io-তে একটি টেকডাউন অনুরোধ জারি করেছিল, কিন্তু এর ফলে পুরো সাইটটি সাময়িকভাবে সরিয়ে ফেলা হয়, যা জনসাধারণের প্রতিক্রিয়া সৃষ্টি করে।",
      "ফানকো স্পষ্ট করেছে যে তাদের উদ্দেশ্য ছিল শুধুমাত্র একটি নির্দিষ্ট পৃষ্ঠাকে লক্ষ্য করা, পুরো itch.io প্ল্যাটফর্মকে নয়।",
      "ঘটনাটি কোম্পানি এবং তাদের অংশীদারদের দায়িত্ব সম্পর্কে আলোচনা উস্কে দিয়েছে, বিশেষ করে টেকডাউন অনুরোধগুলি কার্যকরভাবে পরিচালনা করার ক্ষেত্রে।"
    ],
    "points": 587,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1733785004
  },
  {
    "id": 42373437,
    "title": "ট্রি ক্যালকুলাস",
    "originLink": "https://treecalcul.us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42373437",
    "commentBody": "",
    "originSummary": [
      "ট্রি ক্যালকুলাস একটি টুরিং-সম্পূর্ণ গণনামূলক মডেল যা একটি একক অপারেটর সহ, যা প্রোগ্রাম বিশ্লেষণ, টাইপ চেকিং, সংকলন এবং অপ্টিমাইজেশন সরাসরি কোডের মধ্যে করতে সক্ষম। এটি ইচ্ছামত টাইপ সিস্টেম এবং ধীরে ধীরে টাইপিং সমর্থন করে, যা শক্তিশালী রিড-ইভাল-প্রিন্ট লুপস (REPLs) এবং প্রোগ্রাম স্থাপনার জন্য বাহ্যিক সরঞ্জাম ছাড়াই সক্ষম করে। এর ন্যূনতম সিনট্যাক্স এবং সেমান্টিক্স এটিকে পোর্টেবল এবং যেকোনো প্ল্যাটফর্মে ইন্টারপ্রেটার বাস্তবায়নের জন্য সহজ করে তোলে, যা মডেলিং, আনুষ্ঠানিক স্পেসিফিকেশন এবং শিক্ষামূলক উদ্দেশ্যে উপযুক্ত।"
    ],
    "commentSummary": [
      "ট্রি ক্যালকুলাস একটি প্রোগ্রামিং ভাষা যা প্রফেসর ব্যারি জে দ্বারা উন্নত করা হয়েছে, যা লেবেলবিহীন গাছের উপর কেন্দ্রীভূত এবং ফাংশনের অন্তর্দৃষ্টি ও প্রক্রিয়াকরণকে অনুমোদন করে।",
      "এটি টুরিং সম্পূর্ণ, অর্থাৎ এটি পর্যাপ্ত সময় এবং সম্পদ পেলে যেকোনো গণনা সম্পাদন করতে পারে এবং এতে ফাংশন ইনভার্সনের মতো অনন্য বৈশিষ্ট্য রয়েছে, যা এটিকে Lisp বা Forth-এর মতো ভাষা থেকে আলাদা করে।",
      "সম্প্রদায়টি সক্রিয়ভাবে এর প্রভাব এবং সম্ভাব্য প্রয়োগগুলি নিয়ে আলোচনা করছে, যদিও ওয়েবসাইট treecalcul.us-এ এর উপস্থাপনা এবং উদ্দেশ্য নিয়ে কিছু বিভ্রান্তি রয়েছে।"
    ],
    "points": 410,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1733801432
  },
  {
    "id": 42369476,
    "title": "ট্রেলিস – ৩ডি মেশ জেনারেটিভ মডেল",
    "originLink": "https://trellis3d.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42369476",
    "commentBody": "",
    "originSummary": [
      "পোস্টটি একটি নতুন 3D প্রজন্মের পদ্ধতি পরিচয় করিয়ে দেয় যা একটি ঐক্যবদ্ধ স্ট্রাকচার্ড ল্যাটেন্ট (SLAT) উপস্থাপনা ব্যবহার করে, যা বহুমুখী এবং উচ্চ-মানের 3D সম্পদ তৈরির উন্নতি সাধন করে।",
      "মডেলটি, যার নাম ট্রেলিস, সংশোধিত ফ্লো ট্রান্সফরমার ব্যবহার করে এবং একটি বৃহৎ ডেটাসেটে প্রশিক্ষিত হয়, যা ৩ডি জেনারেশনে বিদ্যমান পদ্ধতিগুলিকে অতিক্রম করে।",
      "এই পদ্ধতিটি নমনীয় আউটপুট ফরম্যাট এবং স্থানীয় 3D সম্পাদনাকে সমর্থন করে, এবং কোড, মডেল এবং ডেটা জনসাধারণের জন্য প্রকাশ করার পরিকল্পনা রয়েছে।"
    ],
    "commentSummary": [
      "ট্রেলিস, একটি ৩ডি মেশ জেনারেটিভ মডেল, উচ্চমানের সম্পদ তৈরি করার ক্ষমতার কারণে মিশ্র প্রতিক্রিয়া সৃষ্টি করেছে, যা সম্ভবত গেম ডেভেলপমেন্টের ফোকাসকে গ্রাফিক্স থেকে গল্প বলার দিকে স্থানান্তরিত করতে পারে।",
      "যখন কেউ কেউ হাতে তৈরি শিল্পকলার কমে যাওয়া ভূমিকা নিয়ে উদ্বেগ প্রকাশ করেন, অন্যরা শিল্পীদের জন্য এআই ব্যবহার করে তাদের কাজ উন্নত করার সম্ভাবনা দেখতে পান।",
      "ট্রেলিস তার প্রোটোটাইপিং এবং ৩ডি মডেলিংকে গণতান্ত্রিক করার সম্ভাবনার জন্য স্বীকৃত, যদিও বর্তমান সীমাবদ্ধতাগুলি যেমন খারাপ ওয়্যারফ্রেম গুণমান এবং কিছু আকারের সাথে চ্যালেঞ্জ রয়েছে।"
    ],
    "points": 409,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1733771947
  },
  {
    "id": 42373098,
    "title": "সংগীত সংরক্ষণ করুন, আর্কাইভ সংরক্ষণ করুন",
    "originLink": "https://www.savethearchive.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42373098",
    "commentBody": "",
    "originSummary": [
      "৫০০ এর বেশি সঙ্গীতশিল্পী ইন্টারনেট আর্কাইভ, একটি অলাভজনক সাংস্কৃতিক প্রতিষ্ঠান, এর বিরুদ্ধে ৬২১ মিলিয়ন ডলারের মামলা প্রত্যাহারের জন্য প্রধান লেবেলগুলির প্রতি আহ্বান জানাচ্ছেন।",
      "সংগীতশিল্পীরা ন্যায্য ক্ষতিপূরণের প্রয়োজনীয়তা, সংগীতের ঐতিহ্য সংরক্ষণ এবং একচেটিয়া প্রথা সমর্থন না করে জীবিত শিল্পীদের বিনিয়োগের উপর জোর দেন।",
      "তারা যুক্তি দেন যে সঙ্গীত শিল্পের টিকে থাকার জন্য শিল্পীদের ভবিষ্যতকে অগ্রাধিকার দেওয়া এবং তাদের কাজ সংরক্ষণ করা প্রয়োজন, এবং একটি খোলা চিঠির মাধ্যমে জনসাধারণের সমর্থন আহ্বান করেন।"
    ],
    "commentSummary": [
      "ওপেন সোর্স প্রকল্পগুলি, যেমন রিলিসেন, ইন্টারনেট আর্কাইভ ব্যবহার করে আইনত রেকর্ড করা কনসার্ট সংরক্ষণ করে, যা সঙ্গীতপ্রেমীদের সহায়তা করে এবং সাংস্কৃতিক ইতিহাস সংরক্ষণ করে।",
      "ইন্টারনেট আর্কাইভ প্রধান লেবেলগুলির কাছ থেকে আইনি চ্যালেঞ্জের সম্মুখীন হচ্ছে, বিশেষ করে গ্রেট ৭৮ প্রকল্পের মতো প্রকল্পগুলি নিয়ে, যা ঐতিহাসিক রেকর্ডিং সংরক্ষণ করতে চায়।",
      "সঙ্গীত শিল্পে ন্যায্য শিল্পী ক্ষতিপূরণ নিয়ে চলমান বিতর্ক রয়েছে, যেখানে কপিরাইট, স্ট্রিমিং রাজস্ব এবং সরাসরি বিক্রয় এবং প্যাট্রিয়ন প্ল্যাটফর্মের মতো বিকল্প রাজস্ব মডেল নিয়ে আলোচনা চলছে।"
    ],
    "points": 338,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1733797871
  },
  {
    "id": 42378488,
    "title": "যেখান থেকে আমি ছেড়ে গিয়েছিলাম",
    "originLink": "https://antirez.com/news/144",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42378488",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "বিতর্কটি কেন্দ্রীভূত হয়েছে Redis এর ওপেন-সোর্স লাইসেন্স পরিবর্তনের উপর, যা অবদানকারীদের মধ্যে অসন্তোষ সৃষ্টি করেছে যারা এই পদক্ষেপে প্রতারিত বোধ করছেন।- নতুন লাইসেন্সটি কিছু লোকের দ্বারা আইনি ব্যবহারে জটিলতা সৃষ্টি করছে বলে মনে করা হচ্ছে, অন্যদিকে অন্যরা এটিকে বড় কর্পোরেশন দ্বারা শোষণ প্রতিরোধের জন্য অপরিহার্য বলে মনে করছেন।- Valkey এর আবির্ভাব, যা একটি Redis ফর্ক এবং প্রধান প্রযুক্তি কোম্পানিগুলির দ্বারা সমর্থিত, এবং Redis এর প্রতিষ্ঠাতা সালভাতোরে সানফিলিপ্পোর প্রত্যাবর্তন, ওপেন-সোর্স লাইসেন্সিং এবং কর্পোরেট প্রভাব সম্পর্কে চলমান বিতর্কে উল্লেখযোগ্য উন্নয়ন।"
    ],
    "points": 305,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1733848912
  },
  {
    "id": 42374823,
    "title": "ডেভেলপার ফোন এবং টাচস্ক্রিন ব্যবহার করে ২৫ হাজার লাইন নেভিম প্লাগইন কোড লিখেছেন",
    "originLink": "https://old.reddit.com/r/neovim/comments/1h7vhmg/bro_been_developing_his_2k_star_plugin_on_a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42374823",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "বাংলাদেশের একজন ডেভেলপার শুধুমাত্র ফোন এবং টাচস্ক্রিন ব্যবহার করে ২৫,০০০ লাইনের নেভিম প্লাগইন কোড লিখেছেন, যা অসাধারণ নিষ্ঠা এবং অভিযোজন ক্ষমতা প্রদর্শন করে।",
      "বাংলাদেশে ল্যাপটপের উচ্চমূল্যের কারণে উন্নয়নশীল দেশের ডেভেলপারদের যে আর্থিক বাধার সম্মুখীন হতে হয়, তা তুলে ধরে তার জন্য একটি ল্যাপটপ প্রদানের উদ্দেশ্যে একটি তহবিল সংগ্রহের আয়োজন করা হচ্ছে।",
      "ডেভেলপার তার ফোনে Termius, tmux, এবং Vim এর মতো টুল ব্যবহার করেন, এবং তার প্রচেষ্টা ফোনে কোডিংয়ের চ্যালেঞ্জগুলি নিয়ে আলোচনা উত্সাহিত করেছে।"
    ],
    "points": 237,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1733817648
  },
  {
    "id": 42371476,
    "title": "ডিব্যাঙ্কিং (এবং ডিবাঙ্কিং?)",
    "originLink": "https://www.bitsaboutmoney.com/archive/debanking-and-debunking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42371476",
    "commentBody": "",
    "originSummary": [
      "ডিব্যাঙ্কিং, যা ব্যাংক অ্যাকাউন্টের অনিচ্ছাকৃত বন্ধ হওয়া, একটি বিতর্কিত বিষয়, বিশেষত ক্রিপ্টো ব্যবসাগুলিকে প্রভাবিত করে, এবং উদ্বেগ রয়েছে যে এটি রাজনৈতিক হাতিয়ার হিসেবে ব্যবহার করা হতে পারে।",
      "আলোচনাটি ব্যক্তিগত এবং রাষ্ট্রীয় অংশগ্রহণকারীদের মধ্যে জটিল মিথস্ক্রিয়ার অন্তর্ভুক্ত, যেখানে কিছু লোক ডিব্যাঙ্কিংকে ঝুঁকি ব্যবস্থাপনার জন্য প্রয়োজনীয় হিসাবে দেখেন, অন্যরা এটিকে অন্যায্য এবং যথাযথ প্রক্রিয়ার অভাব হিসাবে দেখেন।",
      "ইতিহাসের নিয়ন্ত্রক পদক্ষেপগুলি যেমন অপারেশন চোক পয়েন্ট, যা ব্যাংকগুলিকে নির্দিষ্ট শিল্পের সাথে সম্পর্ক ছিন্ন করতে চাপ দিয়েছিল, সমালোচকরা এটিকে ক্রিপ্টো ব্যবসার বিরুদ্ধে বর্তমান পদক্ষেপের সাথে তুলনা করে, যাকে \"চোক পয়েন্ট ২.০\" বলা হয়।"
    ],
    "commentSummary": [
      "ডিব্যাঙ্কিং বলতে বোঝায় ব্যাংকগুলি অ্যাকাউন্ট বন্ধ করা বা পরিষেবা অস্বীকার করা, যা প্রায়শই নিয়ন্ত্রক চাপের কারণে ঘটে যেমন অর্থ পাচার বিরোধী (এএমএল) আইন, যা অবৈধ আর্থিক কার্যকলাপ প্রতিরোধের লক্ষ্য রাখে।",
      "সমালোচকরা ডিব্যাঙ্কিংয়ে স্বচ্ছতা এবং যথাযথ প্রক্রিয়ার অভাবের দিকে ইঙ্গিত করেন, যা অন্যায়ভাবে ব্যক্তি এবং ব্যবসায়ের উপর প্রভাব ফেলতে পারে এবং তাদের অর্থনৈতিক অংশগ্রহণ সীমিত করতে পারে।",
      "আলোচনাটি কেন্দ্রীভূত হয়েছে এই বিষয়ে যে ব্যাংকগুলিকে কি সকলের জন্য মৌলিক সেবা প্রদান করতে বাধ্য করা উচিত কিনা, সম্ভাব্য ঝুঁকির পরোয়া না করে, এবং কীভাবে এই বিষয়টি বৃহত্তর রাজনৈতিক ও সামাজিক উদ্বেগের সাথে সম্পর্কিত।"
    ],
    "points": 223,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1733784987
  },
  {
    "id": 42377018,
    "title": "ডাবল (ওয়াইসি ডব্লিউ২৪) – সূচক বিনিয়োগ ০% খরচ অনুপাত সহ",
    "originLink": "https://news.ycombinator.com/item?id=42377018",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42377018",
    "commentBody": "",
    "originSummary": [
      "ডাবল একটি আর্থিক প্ল্যাটফর্ম যা ৫০টিরও বেশি শেয়ার বাজার সূচকে বিনিয়োগের সুযোগ দেয়, যেখানে কোনো ব্যয় অনুপাত নেই এবং ব্যবস্থাপনা, পুনঃসমন্বয় এবং কর-ক্ষতি কাটানোর জন্য প্রতি মাসে একটি নির্দিষ্ট ফি $১ চার্জ করে।",
      "প্ল্যাটফর্মটি জনপ্রিয় সূচক থেকে পৃথক স্টক ক্রয় করে সরাসরি সূচক প্রদান করে, কাস্টমাইজেশন এবং দৈনিক পোর্টফোলিও অপ্টিমাইজেশন প্রদান করে, যা এটিকে অন্যান্য রোবো-অ্যাডভাইজর থেকে আলাদা করে।",
      "ডাবল ১০ মিলিয়ন ডলার সম্পদ ব্যবস্থাপনার অধীনে (AUM) অর্জন করেছে এবং কম-ফি বিনিয়োগ কৌশল প্রস্তাব করে ১০০ বিলিয়ন ডলার/বছর ইটিএফ এবং মিউচুয়াল ফান্ড বাজারে বিপ্লব ঘটানোর লক্ষ্য নিয়েছে।"
    ],
    "commentSummary": [
      "ডাবল একটি বিনিয়োগ প্ল্যাটফর্ম যা প্রতি মাসে $1 ফ্ল্যাট ফি এবং 0% খরচ অনুপাত সহ সূচক বিনিয়োগ প্রদান করে, যা ঐতিহ্যবাহী ইটিএফ এবং মিউচুয়াল ফান্ড বাজারকে ব্যাহত করার লক্ষ্য রাখে।- জেজে এবং মার্ক দ্বারা প্রতিষ্ঠিত, প্ল্যাটফর্মটি ৫০টিরও বেশি শেয়ার বাজার সূচক পরিচালনা করে এবং পুনঃসমন্বয় এবং কর-ক্ষতি সংগ্রহের মতো কাজগুলি পরিচালনা করে, যার ব্যবস্থাপনায় $১০ মিলিয়ন সম্পদ রয়েছে।- এর উদ্ভাবনী ফি কাঠামো সত্ত্বেও, ডাবলের স্থায়িত্ব, নিরাপত্তা এবং ভ্যানগার্ড এবং ফিডেলিটির মতো প্রতিষ্ঠিত আর্থিক প্রতিষ্ঠানের সাথে এর তুলনা নিয়ে উদ্বেগ রয়েছে।"
    ],
    "points": 215,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1733840214
  }
]
