[
  {
    "id": 42797260,
    "title": "„Készítettem egy nyílt forráskódú laptopot a semmiből”",
    "originLink": "https://www.byran.ee/posts/creation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797260",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Egy középiskolás diák sikeresen épített egy nyílt forráskódú laptopot a semmiből hat hónap alatt, és a projekt teljes egészében elérhető a GitHubon. A projekt jelentős figyelmet kapott, a Show HN egyik legnépszerűbb bejegyzéseként szerepelt, kiemelve az oktatás, a tehetség és a fiatal mérnökök lehetőségeinek témáit. Bár nem egy csiszolt termék, a laptop napi használatra alkalmas, bemutatva a nyílt forráskódú hardverfejlesztés lehetőségeit.”"
    ],
    "points": 2282,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1737578512
  },
  {
    "id": 42796950,
    "title": "„Hogyan javíthatja az otthoni munkavégzéshez használt világítást a szemfáradtság csökkentése érdekében”",
    "originLink": "https://rustle.ca/posts/articles/work-from-home-lighting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796950",
    "commentBody": "",
    "originSummary": [
      "„A szem megerőltetésének minimalizálása érdekében otthoni munkavégzés során hozzon létre kiegyensúlyozott világítási környezetet természetes fény, áttetsző függönyök és villódzásmentes mesterséges fények használatával. Alkalmazza a 20/20/20 szabályt: minden 20 percben nézzen 20 láb távolságra lévő tárgyra 20 másodpercig, hogy pihentesse a szemét. Egészítse ki munkaterületét fényáteresztő függönyökkel és a monitor fényerejéhez illeszkedő asztali világítással, miközben rendszeres szüneteket is tart az általános egészség megőrzése érdekében.”"
    ],
    "commentSummary": [
      "„A munkavégzés otthonról (WFH) világításának javítása és a szem megerőltetésének csökkentése érdekében használjon szórt fényt több forrásból, és tartson fenn egyenletes színhőmérsékletet. Vegye figyelembe a fal színének világításra gyakorolt hatását, és törekedjen az „Aranyóra” hatásra—szórt, meleg és gyengéd világításra a fotogén és kényelmes környezet érdekében. Fedezze fel az LED világítási lehetőségeket, például a magas Színvisszaadási Indexű (CRI) izzókat, a jobb fényminőség érdekében.”"
    ],
    "points": 570,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1737576537
  },
  {
    "id": 42799136,
    "title": "„Tailwind CSS v4.0”",
    "originLink": "https://tailwindcss.com/blog/tailwindcss-v4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799136",
    "commentBody": "",
    "originSummary": [
      "„A Tailwind CSS v4.0 bevezet egy nagy teljesítményű motort, amely akár 5x gyorsabb build-eket és több mint 100x gyorsabb inkrementális build-eket ér el, javítva a fejlesztők teljesítményét és rugalmasságát. A frissítés modern CSS funkciókat tartalmaz, mint például kaszkád rétegek, color-mix(), és beépített konténer lekérdezések, valamint egy elsődleges Vite plugin a jobb integráció és egyszerűbb telepítés érdekében. Az új funkciók, mint a 3D transzformációs segédeszközök, kibővített gradiens API-k, és a CSS-első konfiguráció design tokenekkel CSS változókként, megkönnyítik és felgyorsítják a modern webprojektek építését, egy frissítési útmutatóval a meglévő projektekhez.”"
    ],
    "commentSummary": [
      "„A Tailwind CSS v4.0 jelentős fejlesztéseket vezet be, mint például a natív CSS változók elérése és a kizárólag CSS-alapú konfiguráció, amely csökkenti a JavaScript-függőséget és növeli a sokoldalúságot. A frissítés ismert az AI munkafolyamatokkal való kompatibilitásáról és a tervezési rendszerekben való hasznosságáról, bár néhány tervező számára kihívást jelent a rendszerszerű tervezés. A kiadás vitákat váltott ki a meglévő projektek és eszközök integrációját érintő változások miatt, miközben népszerűségét megőrzi a használat egyszerűsége és a stílus hatékonysága miatt.”"
    ],
    "points": 395,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1737592382
  },
  {
    "id": 42797756,
    "title": "„A szövetségi bíróság (végre) alkotmányellenesnek minősíti az adatok hátsó ajtós keresését”",
    "originLink": "https://www.eff.org/deeplinks/2025/01/victory-federal-court-finally-rules-backdoor-searches-702-data-unconstitutional",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797756",
    "commentBody": "",
    "originSummary": [
      "„Egy szövetségi kerületi bíróság úgy döntött, hogy az amerikaiak magánkommunikációját tartalmazó adatbázisok hátsó ajtós keresései a 702-es szakasz alapján engedélyt igényelnek, ami jelentős jogi döntést jelent az Egyesült Államok kontra Hasbajrami ügyben. Annak ellenére, hogy a Kongresszus újraengedélyezte a 702-es szakaszt, bizonyítékok mutatják az FBI és a hírszerző közösség általi visszaéléseket, mivel 2021-ben 3,4 millió engedély nélküli keresést hajtottak végre, ami reformokra szólít fel az alkotmányos védelem biztosítása érdekében. A bíróság döntése kiemeli a 702-es szakasz alatti engedély nélküli keresések alkotmányellenes jellegét, és sürgeti a Kongresszust, hogy írja elő az engedélyeket az amerikai személyek adatait érintő keresésekhez, mielőtt az 2026-ban lejár.”"
    ],
    "commentSummary": [
      "„Egy szövetségi bíróság alkotmányellenesnek nyilvánította az adatok hátsó ajtós keresését, ami vitákat váltott ki a kormányzati megfigyelésről és a magánélethez való jogokról.”",
      "„Az ítélet megkérdőjelezi a 702-es szakasz megfigyelésének alkotmányosságát, kiemelve a Kongresszus és a Legfelsőbb Bíróság szerepét a magánélet védelmében.”",
      "„A döntés ellenére továbbra is szkepticizmus uralkodik annak hatásával kapcsolatban, mivel a kritikusok úgy vélik, hogy a szövetségi ügynökségek, mint például az FBI, folytathatják az ilyen gyakorlatokat, amíg a belső szabályozásokat nem módosítják.”"
    ],
    "points": 313,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1737581523
  },
  {
    "id": 42799103,
    "title": "„A számítástechnika történetének legbefolyásosabb tanulmányai”",
    "originLink": "https://terriblesoftware.org/2025/01/22/the-7-most-influential-papers-in-computer-science-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799103",
    "commentBody": "",
    "originSummary": [
      "„A lista hét alapvető tanulmányt emel ki a számítástechnika történetében, amelyek mindegyike olyan alapvető fogalmakat vezetett be, amelyek a modern technológia alapját képezik, mint például a Turing-gép, az információelmélet és a relációs adatbázis modell.”",
      "„Ezek a tanulmányok olyan úttörő ötleteket mutattak be, mint az NP-teljesség, a TCP/IP, a Világháló és a PageRank, amelyek jelentős hatást gyakoroltak a számítástechnika, a kommunikáció és az internet fejlődésére.”",
      "„A bónusz említések között szerepelnek a Lisp, az elosztott rendszerek és az „Attention Is All You Need” című tanulmány befolyásos munkái, amelyek bemutatják a számítástechnikai kutatások fejlődését és sokszínűségét.”"
    ],
    "commentSummary": [
      "„A vita középpontjában a számítástechnika befolyásos tanulmányai állnak, beleértve a klasszikusokat, mint Hoare „Kommunikáló szekvenciális folyamatok” című munkája és Turing számíthatóságról szóló írása.”",
      "„A résztvevők vitatják a közelmúltbeli munkák, például a PageRank tanulmány bevonását, és más, a kriptográfiában és az elosztott rendszerekben jelentős hatású tanulmányokat javasolnak.”",
      "„Egy Harvard kurzus kerül említésre, amely ezeket az alapvető tanulmányokat vizsgálja, hogy átfogó megértést nyújtson a számítástechnika fejlődéséről.”"
    ],
    "points": 310,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737592149
  },
  {
    "id": 42798108,
    "title": "„Az F-Droid előrehaladása és mi várható 2025-ben”",
    "originLink": "https://f-droid.org/2025/01/21/a-look-back-at-2024-f-droids-progress-and-whats-coming-in-2025.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798108",
    "commentBody": "",
    "originSummary": [
      "„2024-ben az F-Droid jelentős előrelépéseket tett az alkalmazások terjesztésének decentralizálásában, az infrastruktúra fejlesztésében és az ökoszisztéma bővítésében, nagyrészt a közösségi támogatásnak és finanszírozásnak köszönhetően. Jelentős eredmények közé tartozott az infrastruktúra fejlesztése és olyan eszközök bővítése, mint a Repomaker és a Mobifree, több mint 7205 alkalmazásfrissítéssel és 402 új alkalmazás hozzáadásával. A 2025-ös évre tekintve az F-Droid tervezi, hogy egy Open Technology Fund támogatást felhasználva tovább javítja az infrastruktúrát, és folytatja az alkalmazások terjesztésének decentralizálására és a nyílt forráskódú alternatívák népszerűsítésére való összpontosítást.”"
    ],
    "commentSummary": [
      "„Az F-Droid felhasználói egy letöltésszámláló bevezetését szorgalmazzák, hogy azonosítani lehessen a népszerű és megbízható alkalmazásokat, mivel a platformon nincs értékelési rendszer.”",
      "„A kihívások közé tartoznak a navigációs nehézségek a hiányos vagy elavult alkalmazások miatt, ami jobb keresési szűrők és felhasználói felület frissítések javaslatát eredményezi.”",
      "„Ezek ellenére az F-Droidot értékelik a nyílt forráskódú alkalmazásai miatt, és folynak a megbeszélések az alkalmazásbeküldési folyamatokról, valamint a progresszív webalkalmazások (PWA-k) integrálásának lehetőségéről.”"
    ],
    "points": 302,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1737584287
  },
  {
    "id": 42799245,
    "title": "„gRPC, OpenAPI és REST megértése, valamint azok használata az API tervezésében (2020)”",
    "originLink": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799245",
    "commentBody": "",
    "originSummary": [
      "„Az API tervezés elsősorban két modellt használ: a gRPC-t (Remote Procedure Call) és a REST-et (Representational State Transfer), mindkettőt gyakran HTTP-re térképezik, ahol a gRPC a HTTP/2-t használja a hatékony kommunikáció érdekében.”",
      "„A REST API-k egyszerűségükről és stabilitásukról ismertek, míg a gRPC hatékony kliens könyvtárakat és szerver implementációkat kínál, ami alkalmassá teszi belső API-khoz vagy olyan speciális eszközök használatakor, mint például a Cloud Endpoints.”",
      "„Az OpenAPI, hasonlóan az RPC-hez, sablonokból történő URL-konstrukciót igényel, feltárja a HTTP részleteket, és bonyolult egyedi HTTP leképezéseket is magában foglalhat, szélesebb körű HTTP eszközkompatibilitást kínálva a gRPC-hez képest.”"
    ],
    "commentSummary": [
      "„A fejlesztők gyakran kihívásnak találják a gRPC használatát az eszközök problémái miatt, különösen Java-ban, valamint a hibakeresés és a konfiguráció nehézségei miatt, annak ellenére, hogy előnyei közé tartozik a kétirányú adatfolyam és a hatékony adatátvitel.”",
      "„Az OpenAPI egy dokumentációs szabvány az API-k számára, amely megkönnyíti az ügyfélgenerálást és a tesztelést, és gyakran összekeverik a REST-tel, amelyet ritkán valósítanak meg tiszta formájában.”",
      "„A döntés, hogy gRPC-t, OpenAPI-t vagy REST-et használjunk, az adott felhasználási esetektől, a csapat szakértelmétől és a projekt követelményeitől függ, kiemelve annak fontosságát, hogy megértsük az egyes technológiák erősségeit és korlátait.”"
    ],
    "points": 291,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1737593262
  },
  {
    "id": 42798960,
    "title": "„Az NIH találkozókra, utazásokra, kommunikációra és felvételre vonatkozó zárolásokkal szembesül”",
    "originLink": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798960",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Az NIH (Nemzeti Egészségügyi Intézetek) korlátozásokkal szembesül a találkozók, utazások, kommunikáció és felvétel terén, ami potenciálisan befolyásolhatja az Egyesült Államok tudományos hírnevét. A kritikusok szerint ezek az intézkedések büntető jellegűek és politikailag motiváltak, a liberálisnak tekintett kutatókat célozzák, ami megzavarhatja a közegészségügyi kutatásokat, beleértve a rákot és a fertőző betegségeket. Ez a helyzet rávilágít a tudomány politizálásának szélesebb körű problémáira és az Egyesült Államok puha hatalmának hanyatlásával kapcsolatos aggodalmakra.”"
    ],
    "points": 260,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1737590795
  },
  {
    "id": 42801370,
    "title": "„A Bun 1.2 kiadva”",
    "originLink": "https://bun.sh/blog/bun-v1.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42801370",
    "commentBody": "",
    "originSummary": [
      "„A Bun 1.2 jelentős frissítés a JavaScript és TypeScript fejlesztéshez, amely javítja a Node.js kompatibilitást, és beépített támogatást ad az S3 és Postgres számára. A frissítés bemutatja a Bun.sql-t az SQL adatbázisokhoz, egy gyorsabb csomagkezelőt és egy beépített tesztfuttatót, valamint javított teljesítményt és új JavaScript funkciókat. A Bun 1.2 továbbá fejleszti a csomagolást HTML importokkal, önálló futtatható fájlokkal és egy új CSS elemzővel, miközben ingyenes és nyílt forráskódú marad a folyamatos közösségi hozzájárulásokkal.”"
    ],
    "commentSummary": [
      "„A Bun 1.2 megjelent, és olyan funkciókat vezet be, mint a HTML importok és a beépített Amazon S3 támogatás, amelyek tovább erősítik a „minden egyben” megközelítését.”",
      "„A kiadás célja a JavaScript fejlesztés egyszerűsítése olyan eszközök integrálásával, mint a TypeScript, a Jest és a Webpack, vonzóvá téve azt a fejlesztők számára, akik egy letisztultabb beállítást keresnek.”",
      "„Miközben Bun sebességét és használatának egyszerűségét dicsérik, a felhasználók körében továbbra is aggodalmak merülnek fel a lehetséges bezártság, harmadik féltől származó könyvtárak bevonása és a Node.js-szel való hosszú távú kompatibilitás kapcsán.”"
    ],
    "points": 237,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1737615028
  },
  {
    "id": 42800557,
    "title": "„A technológia túlságosan messzire viszi a Pareto-elvet”",
    "originLink": "https://bobbylox.com/blog/tech-takes-the-pareto-principle-too-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42800557",
    "commentBody": "",
    "originSummary": [
      "„Bobby Lockhart bírálja a technológiai ipar Pareto-elvre és MVP-kre való támaszkodását, amelyek gyakran befejezetlen termékekhez vezetnek, mivel nincs elegendő ösztönző azok befejezésére.”",
      "„Ezt szembeállítja a játékipar 'vertikális szelet' megközelítésével, amely arra összpontosít, hogy a kezdetektől fogva egy csiszolt terméket hozzon létre.”",
      "„Lockhart a szoftverfejlesztésben a kézműves megközelítést támogatja, hangsúlyozva a termékek befejezésének és finomításának fontosságát a kifinomult végső eredmény érdekében.”"
    ],
    "commentSummary": [
      "„A Pareto-elv, vagyis a 80/20 szabály, a technológia, különösen a szoftver és termékfejlesztés kontextusában kerül megvitatásra, azt sugallva, hogy a hatások 80%-a az okok 20%-ából származik.”",
      "„A kritikusok azzal érvelnek, hogy ez az elv azt eredményezi, hogy a termékeket befejezettként forgalmazzák, annak ellenére, hogy hiányzik belőlük az utolsó 20% finomítás, míg a támogatók azt állítják, hogy ez lehetővé teszi az erőforrások hatékony felhasználását és a gyors piacra lépést.”",
      "„A vita több iparágat is érint, beleértve a játék és mesterséges intelligencia iparágakat, eltérő nézetekkel arról, hogy az elv elősegíti-e az innovációt, vagy középszerűséghez vezet.”"
    ],
    "points": 235,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1737604388
  },
  {
    "id": 42796906,
    "title": "„Készítettem egy többjátékos lövöldözős játékot Lispben, íme az utam”",
    "originLink": "https://ertu.dev/posts/i-made-an-online-shooter-game-in-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796906",
    "commentBody": "",
    "originSummary": [
      "„A \"Wizard Masters\" nevű játék, egy többjátékos, harmadik személyű lövöldözős játék, amelyet a Lisp dialektusú Clojure nyelven fejlesztettek, és elérhető a CrazyGames platformon. A Clojure-t teljes stack képességei és interaktív REPL rendszere miatt választották, míg a grafikához a Babylon.js-t használták annak funkciói és közösségi támogatása miatt. A kihívások közé tartozott a bonyolult hálózatkezelés a Clojure aszinkron könyvtáraival, az állapotkezelés a Clojure változhatatlanságával, valamint a Clojure játékfejlesztő közösség hiánya, ami kiemeli a mainstream motorokra, mint például a Unity vagy az Unreal, való áttérés lehetséges előnyeit a jövőbeli projektekhez.”"
    ],
    "commentSummary": [
      "„Egy többjátékos lövöldözős játékot fejlesztettek Lisp nyelven, a frontendhez ClojureScriptet és Babylon.JS-t, a backendhez pedig Clojure-t használva, Websockets segítségével koordinálva. A Babylon.JS eszközeivel kapcsolatos kihívások ellenére a játék sikeresen megjelent, és több eszközzel, köztük iPhone-okkal is kompatibilis, pozitív visszajelzéseket kapva a játékmenet és a kidolgozottság terén. Néhány felhasználó irányítási problémákat tapasztalt Firefoxban, és a fejlesztő fontolgatja a játék bővítését a teljesítménye alapján, kiemelve a projekt egyedüli fejlesztését és a közösségi támogatást.”"
    ],
    "points": 212,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1737576222
  },
  {
    "id": 42799540,
    "title": "„Trae: Egy mesterséges intelligencia által támogatott integrált fejlesztőkörnyezet a ByteDance-től”",
    "originLink": "https://www.trae.ai/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„A Trae, a ByteDance által fejlesztett mesterséges intelligencia alapú integrált fejlesztőkörnyezet (IDE) megkezdte a megbeszéléseket a feliratkozás-alapú kódolási eszközök irányába mutató trendről és a kapcsolódó költségekről.”",
      "„Aggodalmak merülnek fel az adatvédelemmel kapcsolatban, különösen a kínai vállalatok, mint például a ByteDance esetében, valamint a hagyományos programozási készségekre gyakorolt lehetséges hatás miatt.”",
      "„A vita rávilágít a különböző nézetekre az AI szerepéről a szoftverfejlesztésben, valamint a kínai vállalatok eszközeinek használatának geopolitikai következményeire.”"
    ],
    "points": 205,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1737595297
  },
  {
    "id": 42799629,
    "title": "„A nagy nyelvi modellek alapjai”",
    "originLink": "https://arxiv.org/abs/2501.09223",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799629",
    "commentBody": "",
    "originSummary": [
      "„A „Foundations of Large Language Models” című könyv, amelyet Tong Xiao és Jingbo Zhu írt, olyan kulcsfogalmakat tárgyal, mint az előképzés, a generatív modellek, a promptolási technikák és az igazítási módszerek a nagy nyelvi modellek terén. A könyv célközönsége az egyetemi hallgatók, szakemberek és gyakorlók a természetes nyelvfeldolgozás területén, így értékes forrás azok számára, akik érdeklődnek a számítástechnika és nyelvészet, a mesterséges intelligencia és a gépi tanulás iránt. A könyv további olvasásra elérhető az arXiv-on a 2501.09223 [cs.CL] azonosító alatt.”"
    ],
    "commentSummary": [
      "„Egy könyv „Foundations of Large Language Models” címmel, amelyet a kínai Shenyangban található Northeastern University szerzői írtak, elérhető az Arxivon, és 231 oldalas terjedelmével tűnik ki.”",
      "„A vita kiemeli a ChatGPT képességeit a PDF-ek olvasásában, miközben néhány felhasználó rámutat a vizuális tartalom elemzésének korlátaira.”",
      "„Az Arxiv egy preprint platformként van leírva, ami azt jelenti, hogy a tartalom nem feltétlenül esett át szakmai bírálaton, és a felhasználók meglepődnek a könyv ottani elérhetőségén.”"
    ],
    "points": 199,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1737596006
  },
  {
    "id": 42803279,
    "title": "„Subaru feltörése: Autók nyomon követése és irányítása a Starlink adminisztrációs panelen keresztül”",
    "originLink": "https://samcurry.net/hacking-subaru",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42803279",
    "commentBody": "",
    "originSummary": [
      "„Egy biztonsági sebezhetőséget fedeztek fel a Subaru STARLINK szolgáltatásában 2024. november 20-án, amely lehetővé tette az illetéktelen hozzáférést járművekhez és ügyfélfiókokhoz az Egyesült Államokban, Kanadában és Japánban. A hiba lehetővé tette a támadók számára, hogy távolról irányítsák a járműveket és hozzáférjenek személyes információkhoz minimális adatok, például vezetéknév és irányítószám felhasználásával, a STARLINK adminisztrációs panel hibái miatt. A sebezhetőséget jelentették és 24 órán belül javították anélkül, hogy bármilyen rosszindulatú kihasználás történt volna, ami rávilágít a csatlakoztatott autórendszerek biztonságának kihívásaira a széleskörű hozzáférési jogosultságok miatt.”"
    ],
    "commentSummary": [
      "„Egy sebezhetőséget fedeztek fel a Subaru Starlink rendszerében, amely lehetővé tette a hackerek számára a járművek nyomon követését és irányítását, de ezt 24 órán belül kijavították anélkül, hogy rosszindulatú kihasználás történt volna.”",
      "„Továbbra is fennállnak aggodalmak a Subaru és partnerei által végzett adatgyűjtés és távoli hozzáférés kapcsán, mivel néhány felhasználó akkumulátor lemerülési problémákról számol be, amelyeket a rendszerhez kötnek.”",
      "„Az eset rávilágít az internetkapcsolattal rendelkező autókhoz kapcsolódó kockázatokra, hangsúlyozva a felhasználói adatvédelem javításának és az adatok gyűjtésére vonatkozó egyértelműbb leiratkozási folyamatok szükségességét.”"
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1737634939
  },
  {
    "id": 42802498,
    "title": "„Hol található London legközpontibb juha?”",
    "originLink": "https://diamondgeezer.blogspot.com/2025/01/londons-most-central-sheep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42802498",
    "commentBody": "",
    "originSummary": [
      "„A Vauxhall City Farm, amelyet 1976-ban alapítottak, a legközelebbi városi farm London központjához, mindössze egy mérföldre található a Trafalgar tértől.”",
      "„A farm több juhot is tart, köztük egy Shetlandot és egy Herdwicket, akit Daffodilnak hívnak, bemutatva a vidéki bájt a városi környezetben.”",
      "„A Spitalfields City Farm, amely a második legközelebb van London központjához, otthont ad egy Beatrix nevű Herdwick anyajuhnak és több Castlemilk Mooritnak, kiemelve a városi farmok egyedi vonzerejét Londonban.”"
    ],
    "commentSummary": [
      "„A „birkáig tartó idő” mutató, amely azt méri, mennyi időbe telik eljutni a vidékre egy városközpontból, vitát indított a városi és vidéki életmód preferenciáiról.”",
      "„A beszélgetés olyan városokat emelt ki, mint London, Bristol és Toronto, különös tekintettel a természethez vagy farmokhoz való hozzáférhetőségükre.”",
      "„A megbeszélés része voltak humoros városi mutatók is, mint például a „káoszig eltelt idő” és a „tehénig eltelt idő”, amelyek könnyed perspektívát adtak.”"
    ],
    "points": 183,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737626300
  }
]
