[
  {
    "id": 42797260,
    "title": "יצרתי מחשב נייד בקוד פתוח מאפס",
    "originLink": "https://www.byran.ee/posts/creation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797260",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "התלמיד התיכון הצליח לבנות מחשב נייד בקוד פתוח מאפס בתוך שישה חודשים, והפרויקט זמין במלואו ב-GitHub. הפרויקט זכה לתשומת לב רבה, ודורג כאחד הפוסטים המובילים ב-Show HN, מה שהדגיש דיונים על חינוך, כישרון והפוטנציאל של מהנדסים צעירים. למרות שאינו מוצר מלוטש, המחשב הנייד מתפקד כנהג יומי, ומדגים את האפשרויות של פיתוח חומרה בקוד פתוח."
    ],
    "points": 2282,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1737578512
  },
  {
    "id": 42796950,
    "title": "כיצד לשפר את התאורה בעבודה מהבית כדי להפחית מאמץ בעיניים",
    "originLink": "https://rustle.ca/posts/articles/work-from-home-lighting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796950",
    "commentBody": "",
    "originSummary": [
      "על מנת למזער מאמץ עיניים בזמן עבודה מהבית, יש ליצור סביבה מוארת מאוזנת באמצעות אור טבעי, וילונות שקופים ואורות מלאכותיים ללא ריצוד. יש ליישם את כלל 20/20/20: כל 20 דקות, להביט על משהו במרחק של 20 רגל למשך 20 שניות כדי להרגיע את העיניים. השלימו את סביבת העבודה שלכם עם וילונות מסנני אור ותאורת שולחן שתואמת את בהירות המסך, תוך כדי לקיחת הפסקות סדירות לשמירה על בריאות כללית."
    ],
    "commentSummary": [
      "על מנת לשפר את התאורה בעבודה מהבית ולהפחית מאמץ בעיניים, השתמשו באור מפוזר ממקורות שונים ושמרו על טמפרטורת צבע עקבית. קחו בחשבון את השפעת צבע הקירות על התאורה ושאפו לאפקט של \"שעת הזהב\" תאורה מפוזרת, חמה ועדינה לסביבה פוטוגנית ונוחה. חקרו אפשרויות תאורת LED, כמו נורות עם מדד צבע גבוה (CRI), לשיפור איכות האור."
    ],
    "points": 570,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1737576537
  },
  {
    "id": 42799136,
    "title": "Tailwind CSS גרסה 4.0",
    "originLink": "https://tailwindcss.com/blog/tailwindcss-v4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799136",
    "commentBody": "",
    "originSummary": [
      "Tailwind CSS v4.0 מציג מנוע בעל ביצועים גבוהים, המאפשר בניות מהירות עד פי 5 ובניות אינקרמנטליות מהירות יותר מפי 100, מה שמשפר את הביצועים והגמישות למפתחים. העדכון כולל תכונות CSS מודרניות כמו שכבות קסקדה, color-mix(), ושאילתות מיכל מובנות, יחד עם תוסף Vite רשמי לשיפור האינטגרציה והתקנה פשוטה יותר. תכונות חדשות כמו כלי עזר לטרנספורמציות תלת-ממדיות, API מורחב לגרדיאנטים, וקונפיגורציה מבוססת CSS עם טוקנים עיצוביים כמשתני CSS, מקלות ומאיצות את בניית הפרויקטים המודרניים ברשת, עם מדריך שדרוג זמין לפרויקטים קיימים."
    ],
    "commentSummary": [
      "Tailwind CSS v4.0 מציג שיפורים משמעותיים, כגון גישה למשתני CSS מקוריים ותצורה המבוססת על CSS בלבד, מה שמפחית את התלות ב-JavaScript ומגביר את הגמישות. העדכון ידוע בזכות התאמתו לזרימות עבודה של בינה מלאכותית ושימושיותו במערכות עיצוב, אם כי חלק מהמעצבים מוצאים אותו מאתגר לעיצוב שיטתי. השחרור עורר דיונים בשל שינויים שוברי תאימות, המשפיעים על שילוב עם פרויקטים וכלים קיימים, תוך שמירה על פופולריות בזכות קלות השימוש ויעילות העיצוב שלו."
    ],
    "points": 395,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1737592382
  },
  {
    "id": 42797756,
    "title": "בית המשפט הפדרלי (סוף סוף) פוסק כי חיפושים אחוריים של נתונים אינם חוקתיים",
    "originLink": "https://www.eff.org/deeplinks/2025/01/victory-federal-court-finally-rules-backdoor-searches-702-data-unconstitutional",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797756",
    "commentBody": "",
    "originSummary": [
      "בית משפט פדרלי מחוזי פסק כי חיפושים עקיפים במסדי נתונים המכילים תקשורת פרטית של אמריקאים תחת סעיף 702 דורשים צו חיפוש, מה שמסמן החלטה משפטית משמעותית בתיק ארצות הברית נגד הסבג'ראמי. למרות שהקונגרס חידש את סעיף 702, ישנן עדויות לשימוש לרעה על ידי ה-FBI והקהילה המודיעינית, עם 3.4 מיליון חיפושים ללא צו שבוצעו בשנת 2021, מה שמעורר קריאות לרפורמה להבטחת הגנות חוקתיות. החלטת בית המשפט מדגישה את האופי הלא חוקתי של חיפושים ללא צו תחת סעיף 702, ומפצירה בקונגרס לחייב צווים לחיפושים הכוללים נתונים של אזרחים אמריקאים לפני שפג תוקפו בשנת 2026."
    ],
    "commentSummary": [
      "בית משפט פדרלי הכריז כי חיפושים אחוריים של נתונים אינם חוקתיים, מה שהצית ויכוחים על מעקב ממשלתי וזכויות פרטיות.",
      "הפסיקה מערערת על חוקתיות של סעיף 702 בריגול, ומדגישה את תפקידי הקונגרס ובית המשפט העליון בשמירה על הפרטיות.",
      "על אף הפסיקה, הספקנות נמשכת לגבי השפעתה, שכן מבקרים מאמינים כי סוכנויות פדרליות כמו ה-FBI עשויות להמשיך בפרקטיקות כאלה עד שהתקנות הפנימיות יעודכנו."
    ],
    "points": 313,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1737581523
  },
  {
    "id": 42799103,
    "title": "מאמרים המשפיעים ביותר בהיסטוריה של מדעי המחשב",
    "originLink": "https://terriblesoftware.org/2025/01/22/the-7-most-influential-papers-in-computer-science-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799103",
    "commentBody": "",
    "originSummary": [
      "הרשימה מדגישה שבעה מאמרים מכוננים בהיסטוריה של מדעי המחשב, שכל אחד מהם תרם מושגים יסודיים המהווים בסיס לטכנולוגיה המודרנית, כגון מכונת טיורינג, תורת המידע ומודל בסיס הנתונים הרלציוני.",
      "מאמרים אלה הציגו רעיונות פורצי דרך כמו NP-שלמות, TCP/IP, רשת האינטרנט העולמית ו-PageRank, אשר השפיעו באופן משמעותי על חישוב, תקשורת ופיתוח האינטרנט.",
      "אזכורים נוספים כוללים עבודות משפיעות על Lisp, מערכות מבוזרות, ומאמר \"Attention Is All You Need\", המציגים את ההתפתחות והמגוון של מחקר במדעי המחשב."
    ],
    "commentSummary": [
      "הדיון מתמקד במאמרים משפיעים במדעי המחשב, כולל קלאסיקות כמו \"Communicating Sequential Processes\" של הוֹאר ועבודתו של טיורינג על חישוביות.",
      "משתתפים דנים בהכללת עבודות עדכניות יותר, כמו מאמר ה-PageRank, ומציעים מאמרים משפיעים אחרים בקריפטוגרפיה ובמערכות מבוזרות.",
      "נזכר קורס בהרווארד, אשר בוחן את המאמרים היסודיים הללו כדי להציע הבנה מקיפה של התפתחות מדעי המחשב."
    ],
    "points": 310,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737592149
  },
  {
    "id": 42798108,
    "title": "ההתקדמות של F-Droid ומה צפוי בשנת 2025",
    "originLink": "https://f-droid.org/2025/01/21/a-look-back-at-2024-f-droids-progress-and-whats-coming-in-2025.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798108",
    "commentBody": "",
    "originSummary": [
      "בשנת 2024, F-Droid עשתה התקדמות משמעותית בהפצת אפליקציות בצורה מבוזרת, שיפור התשתית והרחבת האקוסיסטם שלה, בעיקר בזכות תמיכה ומימון מהקהילה. הישגים משמעותיים כללו שדרוגי תשתית והרחבת כלים כמו Repomaker ו-Mobifree, עם מעל 7205 עדכוני אפליקציות ו-402 אפליקציות חדשות שנוספו. לקראת 2025, F-Droid מתכננת להשתמש במענק מקרן הטכנולוגיה הפתוחה כדי לשפר עוד יותר את התשתית ולהמשיך להתמקד בהפצת אפליקציות בצורה מבוזרת ולקדם חלופות קוד פתוח."
    ],
    "commentSummary": [
      "משתמשי F-Droid תומכים בהוספת מונה הורדות כדי לזהות אפליקציות פופולריות ואמינות, מכיוון שלפלטפורמה אין מערכת דירוג.",
      "אתגרים כוללים קשיי ניווט עקב אפליקציות לא שלמות או מיושנות, מה שמוביל להצעות לשיפור מסנני חיפוש ועדכוני ממשק משתמש.",
      "על אף האתגרים הללו, F-Droid מוערך בזכות האפליקציות בקוד פתוח שלו, עם דיונים על תהליכי הגשת אפליקציות והאפשרות לשילוב אפליקציות רשת מתקדמות (PWAs)."
    ],
    "points": 302,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1737584287
  },
  {
    "id": 42799245,
    "title": "להבין את gRPC, OpenAPI ו-REST ומתי להשתמש בהם בעיצוב API (2020)",
    "originLink": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799245",
    "commentBody": "",
    "originSummary": [
      "עיצוב API משתמש בעיקר בשני מודלים: gRPC (קריאה להליך מרוחק) ו-REST (העברת מצב ייצוגית), שניהם לעיתים קרובות ממופים ל-HTTP, כאשר gRPC משתמש ב-HTTP/2 לתקשורת יעילה.",
      "ידוע כי REST APIs מצטיינים בפשטות וביציבות שלהם, בעוד ש-gRPC מציע ספריות לקוח ויישומי שרת יעילים, מה שהופך אותו למתאים ל-APIs פנימיים או כאשר משתמשים בכלים ספציפיים כמו Cloud Endpoints.",
      "OpenAPI, בדומה ל-RPC, דורש בניית כתובות URL מתבניות, חשיפת פרטי HTTP, ועשוי לכלול מיפויי HTTP מותאמים אישית מורכבים, מה שמציע תאימות רחבה יותר לכלי HTTP בהשוואה ל-gRPC."
    ],
    "commentSummary": [
      "לעיתים קרובות מפתחים מוצאים את gRPC מאתגר בשל בעיות בכלים, במיוחד בג'אווה, וקושי בניפוי שגיאות ובתצורה, למרות יתרונותיו כמו הזרמה דו-כיוונית ותחבורה יעילה.",
      "OpenAPI הוא תקן תיעוד עבור APIs, המקל על יצירת לקוחות ובדיקות, ולעיתים קרובות מתבלבלים בינו לבין REST, אשר לעיתים נדירות מיושם בצורתו הטהורה.",
      "ההחלטה להשתמש ב-gRPC, OpenAPI, או REST תלויה במקרים ספציפיים, במומחיות הצוות ובדרישות הפרויקט, ומדגישה את החשיבות של הבנת החוזקות והמגבלות של כל טכנולוגיה."
    ],
    "points": 291,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1737593262
  },
  {
    "id": 42798960,
    "title": "NIH נתקל בהקפאות על פגישות, נסיעות, תקשורת וגיוס עובדים",
    "originLink": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798960",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ה-NIH (המכונים הלאומיים לבריאות) חווים הגבלות על פגישות, נסיעות, תקשורת וגיוס עובדים, מה שעלול להשפיע על המוניטין המדעי של ארה\"ב. מבקרים טוענים כי צעדים אלו הם עונשיים ומונעים פוליטית, מכוונים לחוקרים הנתפסים כליברלים, דבר שעלול לשבש מחקרי בריאות הציבור, כולל סרטן ומחלות זיהומיות. מצב זה מדגיש בעיות רחבות יותר בנוגע לפוליטיזציה של המדע ודאגות לגבי ירידת הכוח הרך של ארה\"ב."
    ],
    "points": 260,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1737590795
  },
  {
    "id": 42801370,
    "title": "באן 1.2 שוחרר",
    "originLink": "https://bun.sh/blog/bun-v1.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42801370",
    "commentBody": "",
    "originSummary": [
      "באן 1.2 הוא עדכון משמעותי לפיתוח JavaScript ו-TypeScript, המשפר את התאימות ל-Node.js ומוסיף תמיכה מובנית ל-S3 ו-Postgres. העדכון מציג את Bun.sql עבור מסדי נתונים SQL, מנהל חבילות מהיר יותר ובודק מובנה, לצד שיפור בביצועים ותכונות JavaScript חדשות. באן 1.2 גם משפר את תהליך האריזה עם ייבוא HTML, קבצים ניתנים להרצה עצמאית ופרסר CSS חדש, תוך שמירה על חינמיות וקוד פתוח עם תרומות מתמשכות מהקהילה."
    ],
    "commentSummary": [
      "באן 1.2 שוחרר, ומציג תכונות כמו ייבוא HTML ותמיכה מובנית ב-Amazon S3, שמשפרות את הגישה של 'כולל סוללות'.",
      "השחרור נועד לפשט את פיתוח ה-JavaScript על ידי שילוב כלים כמו TypeScript, Jest ו-Webpack, מה שמושך מפתחים המחפשים הגדרה פשוטה יותר.",
      "בעוד שמהירותו וקלות השימוש של Bun זוכות לשבחים, משתמשים עדיין מודאגים מהאפשרות של נעילה, הכללת ספריות צד שלישי והתאימות לטווח הארוך עם Node.js."
    ],
    "points": 237,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1737615028
  },
  {
    "id": 42800557,
    "title": "טכנולוגיה לוקחת את עקרון פארטו רחוק מדי",
    "originLink": "https://bobbylox.com/blog/tech-takes-the-pareto-principle-too-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42800557",
    "commentBody": "",
    "originSummary": [
      "בובי לוקהארט מבקר את הסתמכות תעשיית הטכנולוגיה על עקרון פארטו ועל מוצרים מינימליים ברי קיימא (MVPs), שלעיתים קרובות מובילים למוצרים לא גמורים בשל תמריצים בלתי מספקים להשלמתם.",
      "הוא משווה זאת לגישת 'הפרוסה האנכית' של תעשיית המשחקים, שמתמקדת ביצירת מוצר מלוטש מההתחלה.",
      "לוקהארט תומך בגישה של אומן לפיתוח תוכנה, תוך הדגשת החשיבות של השלמת ושיפור מוצרים לתוצאה סופית מלוטשת."
    ],
    "commentSummary": [
      "העיקרון של פארטו, או כלל ה-80/20, נדון בהקשר של טכנולוגיה, במיוחד בפיתוח תוכנה ומוצרים, ומציע ש-80% מההשפעות נובעות מ-20% מהגורמים.",
      "מבקרים טוענים שעקרון זה מוביל לשיווק מוצרים כשלמים למרות שחסרה להם ה-20% האחרונים של הגימור, בעוד שתומכים טוענים שהוא מאפשר שימוש יעיל במשאבים וכניסה מהירה לשוק.",
      "הדיון מתפרש על פני תעשיות רבות, כולל גיימינג ובינה מלאכותית, עם דעות שונות לגבי האם העיקרון מעודד חדשנות או מוביל לבינוניות."
    ],
    "points": 235,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1737604388
  },
  {
    "id": 42796906,
    "title": "יצרתי משחק יריות מרובה משתתפים בליספ, הנה המסע שלי",
    "originLink": "https://ertu.dev/posts/i-made-an-online-shooter-game-in-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796906",
    "commentBody": "",
    "originSummary": [
      "המשחק \"Wizard Masters\", משחק יריות מרובה משתתפים בגוף שלישי, פותח באמצעות Clojure, דיאלקט של Lisp, וזמין ב-CrazyGames. Clojure נבחרה בשל יכולותיה המלאות והמערכת האינטראקטיבית REPL, בעוד Babylon.js שימשה לגרפיקה בשל תכונותיה ותמיכת הקהילה. האתגרים כללו רשת מורכבת עם ספריות async של Clojure, ניהול מצב עם אי-השתנות של Clojure, והיעדר קהילה חזקה לפיתוח משחקים ב-Clojure, מה שמדגיש את היתרונות הפוטנציאליים של מעבר למנועים מרכזיים כמו Unity או Unreal לפרויקטים עתידיים."
    ],
    "commentSummary": [
      "המשחק יריות מרובה משתתפים פותח באמצעות Lisp, עם ClojureScript ו-Babylon.JS עבור החזית, ו-Clojure עבור החזית האחורית, תוך שימוש ב-Websockets לתיאום. למרות אתגרים עם כלי Babylon.JS, המשחק שוחרר בהצלחה והוא תואם למגוון מכשירים, כולל אייפונים, וקיבל משוב חיובי על המשחקיות והגימור. חלק מהמשתמשים חוו בעיות שליטה ב-Firefox, והמפתח שוקל להרחיב את המשחק בהתבסס על ביצועיו, תוך הדגשת הפיתוח העצמאי של הפרויקט ותמיכת הקהילה."
    ],
    "points": 212,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1737576222
  },
  {
    "id": 42799540,
    "title": "Trae: סביבת פיתוח משולבת (IDE) המופעלת על ידי AI מבית ByteDance",
    "originLink": "https://www.trae.ai/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "טריי, סביבת פיתוח משולבת (IDE) המופעלת על ידי בינה מלאכותית מבית ByteDance, החלה בדיונים על המגמה לעבר כלים לקידוד מבוססי מנוי והעלויות הנלוות לכך.",
      "עולות חששות לגבי פרטיות הנתונים, במיוחד עם חברות סיניות כמו ByteDance, וההשפעה הפוטנציאלית על כישורי תכנות מסורתיים.",
      "הדיון מדגיש את ההשקפות השונות על תפקיד הבינה המלאכותית בפיתוח תוכנה ואת ההשלכות הגיאופוליטיות של השימוש בכלים מחברות סיניות."
    ],
    "points": 205,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1737595297
  },
  {
    "id": 42799629,
    "title": "יסודות של מודלים לשוניים גדולים",
    "originLink": "https://arxiv.org/abs/2501.09223",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799629",
    "commentBody": "",
    "originSummary": [
      "הספר 'Foundations of Large Language Models' מאת טונג שיאו וג'ינגבו ז'ו חוקר מושגים מרכזיים כמו קדם-אימון, מודלים גנרטיביים, טכניקות הנחיה ושיטות יישור במודלים של שפה גדולה. הוא מיועד לסטודנטים במכללות, אנשי מקצוע ועוסקים בתחום עיבוד שפה טבעית, מה שהופך אותו למשאב בעל ערך עבור אלו המתעניינים בחישוב ושפה, בינה מלאכותית ולמידת מכונה. הספר זמין לקריאה נוספת ב-arXiv תחת המזהה 2501.09223 [cs.CL]."
    ],
    "commentSummary": [
      "ספר בשם 'יסודות של מודלים לשוניים גדולים' מאת מחברים מאוניברסיטת נורת'איסטרן, שניאנג, סין, זמין ב-Arxiv, ידוע בזכות 231 עמודיו המקיפים.",
      "דיון זה מדגיש את היכולות של ChatGPT בקריאת קבצי PDF, כאשר חלק מהמשתמשים מציינים את המגבלות שלו בניתוח תוכן חזותי.",
      "ארכיב מוסבר כפלטפורמה להדפסות מוקדמות, מה שאומר שהתוכן לא בהכרח עבר ביקורת עמיתים, ומשתמשים מביעים הפתעה על זמינות הספר שם."
    ],
    "points": 199,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1737596006
  },
  {
    "id": 42803279,
    "title": "פריצה לסובארו: מעקב ושליטה על מכוניות דרך פאנל הניהול של סטארלינק",
    "originLink": "https://samcurry.net/hacking-subaru",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42803279",
    "commentBody": "",
    "originSummary": [
      "פגיעות אבטחה בשירות STARLINK של סובארו התגלתה ב-20 בנובמבר 2024, שאפשרה גישה לא מורשית לרכבים ולחשבונות לקוחות בארה\"ב, קנדה ויפן. הפגם אפשר לתוקפים לשלוט מרחוק ברכבים ולגשת למידע אישי באמצעות נתונים מינימליים, כמו שם משפחה ומיקוד, בשל בעיות בפאנל הניהול של STARLINK. הפגיעות דווחה ותוקנה תוך 24 שעות ללא ניצול זדוני, מה שמדגיש את האתגרים באבטחת מערכות רכב מחוברות בשל הרשאות גישה רחבות."
    ],
    "commentSummary": [
      "פגיעות במערכת Starlink של סובארו התגלתה, שאפשרה להאקרים לעקוב ולשלוט ברכבים, אך היא תוקנה בתוך 24 שעות ללא ניצול זדוני.",
      "חששות ממשיכים להתקיים בנוגע לאיסוף נתונים וגישה מרחוק על ידי סובארו ושותפיה, כאשר חלק מהמשתמשים מדווחים על בעיות בריקון סוללה הקשורות למערכת.",
      "התקרית מדגישה את הסיכונים הקשורים למכוניות המחוברות לאינטרנט, ומבליטה את הצורך בשיפור הגנות הפרטיות של המשתמשים ובתהליכי ויתור ברורים יותר לאיסוף נתונים."
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1737634939
  },
  {
    "id": 42802498,
    "title": "היכן נמצאת הכבשה המרכזית ביותר בלונדון?",
    "originLink": "https://diamondgeezer.blogspot.com/2025/01/londons-most-central-sheep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42802498",
    "commentBody": "",
    "originSummary": [
      "ווקסהול סיטי פארם, שהוקם בשנת 1976, הוא החווה העירונית הקרובה ביותר למרכז לונדון, ממוקם במרחק של קצת יותר ממייל מכיכר טרפלגר.",
      "החווה מאכלסת מספר כבשים, כולל כבשת שטלנד וכבשת הרדויק בשם דאפודיל, המציגות את הקסם הכפרי בתוך הסביבה העירונית.",
      "ספיטלפילדס סיטי פארם, השנייה הקרובה ביותר למרכז לונדון, מארחת כבשה מסוג הרדויק בשם ביאטריקס וכמה כבשים מסוג קסטלמילק מוריטס, מה שמדגיש את הקסם הייחודי של חוות עירוניות בלונדון."
    ],
    "commentSummary": [
      "המדד 'זמן לכבשים', שמודד את משך הזמן הנדרש להגיע מהמרכז העירוני לאזור הכפרי, יזם דיון על העדפות מגורים עירוניות לעומת כפריות.",
      "השיחה הדגישה ערים כמו לונדון, בריסטול וטורונטו, תוך התמקדות בנגישות שלהן לטבע או לחוות.",
      "מדדים עירוניים הומוריסטיים כמו 'זמן לכאוס' ו'זמן לפרה' היו גם חלק מהדיון, והוסיפו נקודת מבט קלילה."
    ],
    "points": 183,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737626300
  }
]
