[
  {
    "id": 42797260,
    "title": "Saya membuat laptop open-source dari awal",
    "originLink": "https://www.byran.ee/posts/creation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797260",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Seorang siswa sekolah menengah berhasil membangun laptop open-source dari awal dalam waktu enam bulan, dan proyek tersebut sepenuhnya tersedia di GitHub. Proyek ini mendapatkan perhatian yang signifikan, menjadi salah satu postingan teratas di Show HN, menyoroti diskusi tentang pendidikan, bakat, dan potensi para insinyur muda. Meskipun bukan produk yang sudah dipoles, laptop tersebut berfungsi sebagai perangkat harian, menunjukkan kemungkinan pengembangan perangkat keras open-source."
    ],
    "points": 2282,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1737578512
  },
  {
    "id": 42796950,
    "title": "Bagaimana meningkatkan pencahayaan WFH Anda untuk mengurangi ketegangan mata",
    "originLink": "https://rustle.ca/posts/articles/work-from-home-lighting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796950",
    "commentBody": "",
    "originSummary": [
      "Untuk meminimalkan ketegangan mata saat bekerja dari rumah, ciptakan lingkungan pencahayaan yang seimbang dengan menggunakan cahaya alami, tirai tipis, dan lampu buatan yang bebas kedip. Terapkan aturan 20/20/20: setiap 20 menit, lihat sesuatu yang berjarak 20 kaki selama 20 detik untuk merilekskan mata Anda. Lengkapi ruang kerja Anda dengan tirai penyaring cahaya dan pencahayaan meja yang sesuai dengan kecerahan monitor, sambil juga mengambil istirahat secara teratur untuk menjaga kesehatan secara keseluruhan."
    ],
    "commentSummary": [
      "Untuk meningkatkan pencahayaan kerja dari rumah (WFH) dan mengurangi ketegangan mata, gunakan cahaya tersebar dari berbagai sumber dan pertahankan suhu warna yang konsisten. Pertimbangkan dampak warna dinding terhadap pencahayaan dan usahakan untuk mencapai efek \"Golden Hour\"—pencahayaan yang tersebar, hangat, dan lembut untuk lingkungan yang fotogenik dan nyaman. Jelajahi opsi pencahayaan LED, seperti bohlam dengan Indeks Rendering Warna (CRI) tinggi, untuk meningkatkan kualitas cahaya."
    ],
    "points": 570,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1737576537
  },
  {
    "id": 42799136,
    "title": "Tailwind CSS v4.0",
    "originLink": "https://tailwindcss.com/blog/tailwindcss-v4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799136",
    "commentBody": "",
    "originSummary": [
      "Tailwind CSS v4.0 memperkenalkan mesin berperforma tinggi, mencapai build hingga 5x lebih cepat dan build inkremental lebih dari 100x lebih cepat, meningkatkan kinerja dan fleksibilitas bagi pengembang. Pembaruan ini mencakup fitur CSS modern seperti lapisan kaskade, color-mix(), dan kueri kontainer bawaan, bersama dengan plugin Vite pihak pertama untuk integrasi yang lebih baik dan instalasi yang disederhanakan. Fitur baru seperti utilitas transformasi 3D, API gradien yang diperluas, dan konfigurasi CSS-pertama dengan token desain sebagai variabel CSS memudahkan dan mempercepat pembangunan proyek web modern, dengan panduan peningkatan tersedia untuk proyek yang sudah ada."
    ],
    "commentSummary": [
      "Tailwind CSS v4.0 memperkenalkan peningkatan signifikan, seperti akses variabel CSS native dan konfigurasi hanya CSS, yang mengurangi ketergantungan pada JavaScript dan meningkatkan fleksibilitas. Pembaruan ini dikenal karena kompatibilitasnya dengan alur kerja AI dan kegunaannya dalam sistem desain, meskipun beberapa desainer merasa kesulitan untuk desain sistematis. Rilis ini telah memicu diskusi karena perubahan yang merusak, mempengaruhi integrasi dengan proyek dan alat yang ada, sambil tetap populer karena kemudahan penggunaan dan efisiensi stylingnya."
    ],
    "points": 395,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1737592382
  },
  {
    "id": 42797756,
    "title": "Pengadilan Federal (Akhirnya) Memutuskan Pencarian Data Melalui Pintu Belakang Tidak Konstitusional",
    "originLink": "https://www.eff.org/deeplinks/2025/01/victory-federal-court-finally-rules-backdoor-searches-702-data-unconstitutional",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797756",
    "commentBody": "",
    "originSummary": [
      "Sebuah pengadilan distrik federal telah memutuskan bahwa pencarian pintu belakang dari basis data yang berisi komunikasi pribadi warga Amerika di bawah Pasal 702 memerlukan surat perintah, menandai keputusan hukum yang signifikan dalam kasus United States v. Hasbajrami. Meskipun Kongres memperbarui Pasal 702, bukti menunjukkan penyalahgunaan oleh FBI dan komunitas intelijen, dengan 3,4 juta pencarian tanpa surat perintah dilakukan pada tahun 2021, mendorong seruan untuk reformasi guna memastikan perlindungan konstitusional. Keputusan pengadilan menyoroti sifat inkonstitusional dari pencarian tanpa surat perintah di bawah Pasal 702, mendesak Kongres untuk mewajibkan surat perintah untuk pencarian yang melibatkan data orang-orang AS sebelum kadaluwarsa pada tahun 2026."
    ],
    "commentSummary": [
      "Pengadilan federal telah menyatakan bahwa pencarian data melalui pintu belakang tidak konstitusional, memicu perdebatan tentang pengawasan pemerintah dan hak privasi.",
      "Putusan tersebut menantang konstitusionalitas pengintaian Bagian 702, menyoroti peran Kongres dan Mahkamah Agung dalam melindungi privasi.",
      "Meskipun ada putusan tersebut, skeptisisme tetap ada mengenai dampaknya, karena para kritikus percaya bahwa lembaga federal seperti FBI mungkin akan terus melakukan praktik semacam itu sampai peraturan internal direvisi."
    ],
    "points": 313,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1737581523
  },
  {
    "id": 42799103,
    "title": "Makalah Paling Berpengaruh dalam Sejarah Ilmu Komputer",
    "originLink": "https://terriblesoftware.org/2025/01/22/the-7-most-influential-papers-in-computer-science-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799103",
    "commentBody": "",
    "originSummary": [
      "Daftar tersebut menyoroti tujuh makalah penting dalam sejarah ilmu komputer, masing-masing memberikan kontribusi konsep dasar yang mendasari teknologi modern, seperti Mesin Turing, teori informasi, dan model basis data relasional.",
      "Makalah-makalah ini memperkenalkan ide-ide terobosan seperti NP-completeness, TCP/IP, World Wide Web, dan PageRank, yang secara signifikan mempengaruhi komputasi, komunikasi, dan pengembangan internet.",
      "Bonus menyebutkan termasuk karya-karya berpengaruh tentang Lisp, sistem terdistribusi, dan makalah \"Attention Is All You Need\", yang menampilkan evolusi dan keragaman penelitian ilmu komputer."
    ],
    "commentSummary": [
      "Teks tersebut membahas makalah-makalah ilmu komputer yang berpengaruh, termasuk karya klasik seperti \"Communicating Sequential Processes\" oleh Hoare dan karya Turing tentang komputabilitas.",
      "Peserta memperdebatkan inklusi karya-karya yang lebih baru, seperti makalah PageRank, dan menyarankan makalah-makalah berpengaruh lainnya dalam kriptografi dan sistem terdistribusi.",
      "Sebagai bagian dari kursus di Harvard, makalah-makalah dasar ini diperiksa untuk menawarkan pemahaman yang komprehensif tentang evolusi ilmu komputer."
    ],
    "points": 310,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737592149
  },
  {
    "id": 42798108,
    "title": "Perkembangan F-Droid dan Apa yang Akan Datang pada 2025",
    "originLink": "https://f-droid.org/2025/01/21/a-look-back-at-2024-f-droids-progress-and-whats-coming-in-2025.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798108",
    "commentBody": "",
    "originSummary": [
      "Dalam tahun 2024, F-Droid membuat kemajuan yang signifikan dalam mendesentralisasi distribusi aplikasi, meningkatkan infrastrukturnya, dan memperluas ekosistemnya, sebagian besar berkat dukungan komunitas dan pendanaan. Pencapaian penting termasuk peningkatan infrastruktur dan perluasan alat seperti Repomaker dan Mobifree, dengan lebih dari 7205 pembaruan aplikasi dan 402 aplikasi baru ditambahkan. Menyongsong tahun 2025, F-Droid berencana memanfaatkan hibah dari Open Technology Fund untuk lebih meningkatkan infrastruktur dan terus fokus pada desentralisasi distribusi aplikasi serta mempromosikan alternatif sumber terbuka."
    ],
    "commentSummary": [
      "Pengguna F-Droid mengadvokasi adanya penghitung unduhan untuk mengidentifikasi aplikasi yang populer dan dapat diandalkan, karena platform tersebut tidak memiliki sistem penilaian.",
      "tantangan termasuk kesulitan navigasi karena aplikasi yang tidak lengkap atau usang, mendorong saran untuk filter pencarian yang lebih baik dan pembaruan antarmuka pengguna.",
      "Meskipun menghadapi tantangan ini, F-Droid dihargai karena aplikasi sumber terbukanya, dengan diskusi mengenai proses pengajuan aplikasi dan potensi integrasi aplikasi web progresif (PWA)."
    ],
    "points": 302,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1737584287
  },
  {
    "id": 42799245,
    "title": "Memahami gRPC, OpenAPI, dan REST serta kapan menggunakannya dalam desain API (2020)",
    "originLink": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799245",
    "commentBody": "",
    "originSummary": [
      "Desain API terutama menggunakan dua model: gRPC (Remote Procedure Call) dan REST (Representational State Transfer), keduanya sering dipetakan ke HTTP, dengan gRPC menggunakan HTTP/2 untuk komunikasi yang efisien.",
      "REST API dikenal karena kesederhanaan dan stabilitasnya, sementara gRPC menawarkan pustaka klien dan implementasi server yang efisien, menjadikannya cocok untuk API internal atau saat menggunakan alat tertentu seperti Cloud Endpoints.",
      "OpenAPI, mirip dengan RPC, memerlukan pembuatan URL dari template, mengekspos detail HTTP, dan mungkin melibatkan pemetaan HTTP kustom yang kompleks, menawarkan kompatibilitas alat HTTP yang lebih luas dibandingkan dengan gRPC."
    ],
    "commentSummary": [
      "Pengembang sering kali menemukan gRPC menantang karena masalah alat, terutama dalam Java, serta kesulitan dengan debugging dan konfigurasi, meskipun memiliki keunggulan seperti streaming dua arah dan transportasi yang efisien.",
      "OpenAPI adalah standar dokumentasi untuk API, memfasilitasi pembuatan dan pengujian klien yang lebih mudah, dan sering kali disalahartikan dengan REST, yang jarang diimplementasikan dalam bentuk murninya.",
      "Keputusan untuk menggunakan gRPC, OpenAPI, atau REST bergantung pada kasus penggunaan spesifik, keahlian tim, dan persyaratan proyek, yang menyoroti pentingnya memahami kekuatan dan keterbatasan masing-masing teknologi."
    ],
    "points": 291,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1737593262
  },
  {
    "id": 42798960,
    "title": "NIH terkena pembekuan pada pertemuan, perjalanan, komunikasi, dan perekrutan",
    "originLink": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798960",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "NIH (National Institutes of Health) mengalami pembatasan pada pertemuan, perjalanan, komunikasi, dan perekrutan, yang berpotensi mempengaruhi reputasi ilmiah AS. Para kritikus mengklaim bahwa langkah-langkah ini bersifat menghukum dan didorong oleh motif politik, menargetkan peneliti yang dianggap liberal, yang dapat mengganggu penelitian kesehatan masyarakat, termasuk kanker dan penyakit menular. Situasi ini menyoroti masalah yang lebih luas mengenai politisasi ilmu pengetahuan dan kekhawatiran tentang penurunan kekuatan lunak AS."
    ],
    "points": 260,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1737590795
  },
  {
    "id": 42801370,
    "title": "Bun 1.2 Telah Dirilis",
    "originLink": "https://bun.sh/blog/bun-v1.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42801370",
    "commentBody": "",
    "originSummary": [
      "Bun 1.2 adalah pembaruan signifikan untuk pengembangan JavaScript dan TypeScript, meningkatkan kompatibilitas Node.js dan menambahkan dukungan bawaan untuk S3 dan Postgres. Pembaruan ini memperkenalkan Bun.sql untuk basis data SQL, manajer paket yang lebih cepat, dan penguji bawaan, bersama dengan peningkatan kinerja dan fitur JavaScript baru. Bun 1.2 juga meningkatkan bundling dengan impor HTML, executable mandiri, dan parser CSS baru, sambil tetap gratis dan sumber terbuka dengan kontribusi komunitas yang berkelanjutan."
    ],
    "commentSummary": [
      "Bun 1.2 telah dirilis, memperkenalkan fitur-fitur seperti impor HTML dan dukungan Amazon S3 bawaan, yang meningkatkan pendekatan 'baterai-termasuk'.",
      "Tampilan ini bertujuan untuk menyederhanakan pengembangan JavaScript dengan mengintegrasikan alat-alat seperti TypeScript, Jest, dan Webpack, menarik bagi pengembang yang mencari pengaturan yang lebih efisien.",
      "Walaupun kecepatan dan kemudahan penggunaan Bun dipuji, kekhawatiran tentang potensi lock-in, penyertaan pustaka pihak ketiga, dan kompatibilitas jangka panjang dengan Node.js tetap ada di kalangan pengguna."
    ],
    "points": 237,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1737615028
  },
  {
    "id": 42800557,
    "title": "Teknologi mengambil prinsip Pareto terlalu jauh",
    "originLink": "https://bobbylox.com/blog/tech-takes-the-pareto-principle-too-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42800557",
    "commentBody": "",
    "originSummary": [
      "Bobby Lockhart mengkritik ketergantungan industri teknologi pada Prinsip Pareto dan MVP, yang sering kali menghasilkan produk yang belum selesai karena insentif yang tidak memadai untuk menyelesaikannya.",
      "Teks ini membandingkan pendekatan 'vertical slice' dalam industri game, yang berfokus pada pembuatan produk yang sudah dipoles sejak awal.",
      "Lockhart menganjurkan pendekatan seperti seorang pengrajin dalam pengembangan perangkat lunak, menekankan pentingnya menyelesaikan dan menyempurnakan produk untuk hasil akhir yang halus."
    ],
    "commentSummary": [
      "The Pareto principle, atau aturan 80/20, sedang dibahas dalam konteks teknologi, khususnya dalam pengembangan perangkat lunak dan produk, yang menyarankan bahwa 80% dari efek berasal dari 20% dari penyebab.",
      "Kritikus berpendapat bahwa prinsip ini mengakibatkan produk dipasarkan sebagai produk lengkap meskipun masih kurang 20% penyempurnaan akhir, sementara pendukungnya mengklaim bahwa prinsip ini memungkinkan penggunaan sumber daya yang efisien dan masuk ke pasar dengan cepat.",
      "Terdapat perdebatan yang meluas di berbagai industri, termasuk permainan dan AI, dengan pandangan yang berbeda mengenai apakah prinsip tersebut mendorong inovasi atau mengarah pada mediokritas."
    ],
    "points": 235,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1737604388
  },
  {
    "id": 42796906,
    "title": "Saya membuat game penembak multipemain dalam Lisp, inilah perjalanan saya",
    "originLink": "https://ertu.dev/posts/i-made-an-online-shooter-game-in-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796906",
    "commentBody": "",
    "originSummary": [
      "The game \"Wizard Masters,\" sebuah permainan tembak-menembak orang ketiga multipemain, dikembangkan menggunakan Clojure, sebuah dialek Lisp, dan tersedia di CrazyGames. Clojure dipilih karena kemampuannya dalam pengembangan full-stack dan sistem REPL interaktif, sementara Babylon.js digunakan untuk grafis karena fitur-fiturnya dan dukungan komunitas. Tantangan yang dihadapi termasuk jaringan yang kompleks dengan pustaka async Clojure, manajemen status dengan ketidakberubahan Clojure, dan kurangnya komunitas pengembangan game Clojure yang kuat, menyoroti potensi manfaat beralih ke mesin utama seperti Unity atau Unreal untuk proyek-proyek mendatang."
    ],
    "commentSummary": [
      "Sebuah game penembak multipemain dikembangkan menggunakan Lisp, dengan ClojureScript dan Babylon.JS untuk frontend, serta Clojure untuk backend, memanfaatkan Websockets untuk koordinasi. Meskipun menghadapi tantangan dengan alat Babylon.JS, game ini berhasil dirilis dan kompatibel dengan berbagai perangkat, termasuk iPhone, menerima umpan balik positif untuk gameplay dan polesan. Beberapa pengguna mengalami masalah kontrol di Firefox, dan pengembang sedang mempertimbangkan untuk memperluas game berdasarkan kinerjanya, menyoroti pengembangan proyek secara solo dan dukungan komunitas."
    ],
    "points": 212,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1737576222
  },
  {
    "id": 42799540,
    "title": "Trae: IDE bertenaga AI oleh ByteDance",
    "originLink": "https://www.trae.ai/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Trae, sebuah Integrated Development Environment (IDE) yang didukung oleh AI dari ByteDance, telah memulai diskusi tentang tren menuju alat pemrograman berbasis langganan dan biaya yang terkait.",
      "Keprihatinan muncul mengenai privasi data, terutama dengan perusahaan-perusahaan Tiongkok seperti ByteDance, dan potensi dampaknya terhadap keterampilan pemrograman tradisional.",
      "Teks tersebut menyoroti pandangan yang berbeda tentang peran AI dalam pengembangan perangkat lunak dan implikasi geopolitik dari penggunaan alat dari perusahaan-perusahaan Tiongkok."
    ],
    "points": 205,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1737595297
  },
  {
    "id": 42799629,
    "title": "Dasar-dasar Model Bahasa Besar",
    "originLink": "https://arxiv.org/abs/2501.09223",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799629",
    "commentBody": "",
    "originSummary": [
      "Teks buku \"Foundations of Large Language Models\" oleh Tong Xiao dan Jingbo Zhu mengeksplorasi konsep-konsep kunci seperti pra-pelatihan, model generatif, teknik pemicu, dan metode penyelarasan dalam model bahasa besar. Buku ini ditujukan untuk mahasiswa, profesional, dan praktisi di bidang pemrosesan bahasa alami, menjadikannya sumber daya yang berharga bagi mereka yang tertarik pada Komputasi dan Bahasa, Kecerdasan Buatan, dan Pembelajaran Mesin. Buku ini tersedia untuk dibaca lebih lanjut di arXiv dengan pengenal 2501.09223 [cs.CL]."
    ],
    "commentSummary": [
      "Sebuh buku berjudul \"Foundations of Large Language Models\" oleh penulis dari Northeastern University, Shenyang, China, tersedia di Arxiv, dikenal karena kelengkapannya yang terdiri dari 231 halaman.",
      "Diskusi tersebut menyoroti kemampuan ChatGPT dalam membaca PDF, dengan beberapa pengguna menunjukkan keterbatasannya dalam menganalisis konten visual.",
      "Arxiv dijelaskan sebagai platform untuk pra-cetak, yang berarti kontennya tidak harus ditinjau sejawat, dan pengguna menyatakan keterkejutan atas ketersediaan buku tersebut di sana."
    ],
    "points": 199,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1737596006
  },
  {
    "id": 42803279,
    "title": "Hacking Subaru: Melacak dan Mengendalikan Mobil melalui Panel Admin Starlink",
    "originLink": "https://samcurry.net/hacking-subaru",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42803279",
    "commentBody": "",
    "originSummary": [
      "Ada kerentanan keamanan dalam layanan STARLINK Subaru yang ditemukan pada 20 November 2024, yang memungkinkan akses tidak sah ke kendaraan dan akun pelanggan di AS, Kanada, dan Jepang. Cacat ini memungkinkan penyerang untuk mengendalikan kendaraan dari jarak jauh dan mengakses informasi pribadi dengan menggunakan data minimal, seperti nama belakang dan kode pos, karena masalah di panel admin STARLINK. Kerentanan ini dilaporkan dan diperbaiki dalam waktu 24 jam tanpa ada eksploitasi jahat, menyoroti tantangan dalam mengamankan sistem mobil terhubung karena izin akses yang luas."
    ],
    "commentSummary": [
      "Sebuah kerentanan dalam sistem Starlink Subaru ditemukan, memungkinkan peretas untuk melacak dan mengendalikan kendaraan, tetapi kerentanan tersebut telah diperbaiki dalam waktu 24 jam tanpa ada eksploitasi jahat.",
      "Masih ada kekhawatiran terkait pengumpulan data dan akses jarak jauh oleh Subaru dan mitranya, dengan beberapa pengguna melaporkan masalah pengurasan baterai yang terkait dengan sistem tersebut.",
      "Tindakannya menyoroti risiko yang terkait dengan mobil yang terhubung ke internet, menekankan perlunya peningkatan perlindungan privasi pengguna dan proses keluar yang lebih jelas untuk pengumpulan data."
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1737634939
  },
  {
    "id": 42802498,
    "title": "Di mana domba paling sentral di London?",
    "originLink": "https://diamondgeezer.blogspot.com/2025/01/londons-most-central-sheep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42802498",
    "commentBody": "",
    "originSummary": [
      "Vauxhall City Farm, didirikan pada tahun 1976, adalah peternakan kota terdekat dengan pusat London, terletak hanya lebih dari satu mil dari Trafalgar Square.",
      "Ternak tersebut menampung beberapa domba, termasuk seekor Shetland dan Herdwick bernama Daffodil, yang menampilkan pesona pedesaan di dalam lingkungan perkotaan.",
      "Spitalfields City Farm, yang merupakan yang kedua terdekat dengan pusat kota London, menjadi tuan rumah bagi seekor domba betina Herdwick bernama Beatrix dan beberapa Castlemilk Moorits, menekankan daya tarik unik dari peternakan kota di London."
    ],
    "commentSummary": [
      "Metode pengukuran 'waktu menuju domba', yang mengukur durasi untuk mencapai pedesaan dari pusat kota, memicu perdebatan tentang preferensi hidup di perkotaan versus pedesaan.",
      "Percakapan tersebut menyoroti kota-kota seperti London, Bristol, dan Toronto, dengan fokus pada aksesibilitas mereka terhadap alam atau pertanian.",
      "Metode pengukuran kota yang humoris seperti \"waktu menuju kekacauan\" dan \"waktu menuju sapi\" juga menjadi bagian dari diskusi, menambahkan perspektif yang ringan."
    ],
    "points": 183,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737626300
  }
]
