[
  {
    "id": 42797260,
    "title": "„Zrobiłem laptopa open-source od podstaw”",
    "originLink": "https://www.byran.ee/posts/creation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797260",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Uczeń szkoły średniej z powodzeniem zbudował od podstaw otwartoźródłowy laptop w ciągu sześciu miesięcy, a projekt jest w pełni dostępny na GitHubie. Projekt zyskał znaczną uwagę, plasując się jako jeden z najpopularniejszych postów na Show HN, podkreślając dyskusje na temat edukacji, talentu i potencjału młodych inżynierów. Chociaż nie jest to dopracowany produkt, laptop działa jako codzienne narzędzie, demonstrując możliwości rozwoju sprzętu open-source.”"
    ],
    "points": 2282,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1737578512
  },
  {
    "id": 42796950,
    "title": "„Jak poprawić oświetlenie w pracy zdalnej, aby zmniejszyć zmęczenie oczu”",
    "originLink": "https://rustle.ca/posts/articles/work-from-home-lighting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796950",
    "commentBody": "",
    "originSummary": [
      "„Aby zminimalizować zmęczenie oczu podczas pracy z domu, stwórz zrównoważone oświetlenie, korzystając z naturalnego światła, lekkich zasłon i sztucznego oświetlenia bez migotania. Wprowadź zasadę 20/20/20: co 20 minut patrz na coś oddalonego o 20 stóp przez 20 sekund, aby zrelaksować oczy. Uzupełnij swoje miejsce pracy zasłonami filtrującymi światło i oświetleniem biurkowym dopasowanym do jasności monitora, a także rób regularne przerwy, aby utrzymać ogólny stan zdrowia.”"
    ],
    "commentSummary": [
      "„Aby poprawić oświetlenie podczas pracy z domu (WFH) i zmniejszyć zmęczenie oczu, używaj rozproszonego światła z wielu źródeł i utrzymuj stałą temperaturę barwową. Weź pod uwagę wpływ koloru ścian na oświetlenie i dąż do efektu „Złotej Godziny” — rozproszonego, ciepłego i delikatnego oświetlenia, które tworzy fotogeniczne i komfortowe środowisko. Rozważ opcje oświetlenia LED, takie jak żarówki o wysokim wskaźniku oddawania barw (CRI), aby poprawić jakość światła.”"
    ],
    "points": 570,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1737576537
  },
  {
    "id": 42799136,
    "title": "„Tailwind CSS w wersji 4.0”",
    "originLink": "https://tailwindcss.com/blog/tailwindcss-v4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799136",
    "commentBody": "",
    "originSummary": [
      "„Tailwind CSS w wersji 4.0 wprowadza silnik o wysokiej wydajności, osiągając budowy do 5 razy szybsze i budowy przyrostowe ponad 100 razy szybsze, co zwiększa wydajność i elastyczność dla deweloperów. Aktualizacja obejmuje nowoczesne funkcje CSS, takie jak warstwy kaskadowe, color-mix() i wbudowane zapytania kontenerowe, wraz z oficjalną wtyczką Vite dla lepszej integracji i uproszczonej instalacji. Nowe funkcje, takie jak narzędzia do transformacji 3D, rozszerzone API gradientów i konfiguracja CSS-first z tokenami projektowymi jako zmiennymi CSS, ułatwiają i przyspieszają budowę nowoczesnych projektów internetowych, z dostępnym przewodnikiem aktualizacji dla istniejących projektów.”"
    ],
    "commentSummary": [
      "„Tailwind CSS w wersji 4.0 wprowadza znaczące ulepszenia, takie jak natywny dostęp do zmiennych CSS i konfigurację opartą wyłącznie na CSS, co zmniejsza zależność od JavaScript i zwiększa wszechstronność. Aktualizacja jest znana ze swojej kompatybilności z przepływami pracy opartymi na AI i przydatności w systemach projektowych, chociaż niektórzy projektanci uważają ją za wyzwanie dla systematycznego projektowania. Wydanie wywołało dyskusje z powodu zmian łamiących zgodność, wpływających na integrację z istniejącymi projektami i narzędziami, jednocześnie utrzymując popularność dzięki łatwości użycia i efektywności stylizacji.”"
    ],
    "points": 395,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1737592382
  },
  {
    "id": 42797756,
    "title": "„Sąd Federalny (wreszcie) orzeka, że potajemne przeszukiwania danych są niekonstytucyjne”",
    "originLink": "https://www.eff.org/deeplinks/2025/01/victory-federal-court-finally-rules-backdoor-searches-702-data-unconstitutional",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797756",
    "commentBody": "",
    "originSummary": [
      "„Sąd federalny orzekł, że przeszukiwania baz danych zawierających prywatne komunikacje Amerykanów na podstawie Sekcji 702 wymagają nakazu, co stanowi istotne orzeczenie prawne w sprawie United States v. Hasbajrami. Pomimo ponownego zatwierdzenia Sekcji 702 przez Kongres, dowody wskazują na nadużycia ze strony FBI i społeczności wywiadowczej, z 3,4 milionami przeszukań bez nakazu przeprowadzonych w 2021 roku, co wywołuje wezwania do reformy w celu zapewnienia ochrony konstytucyjnej. Decyzja sądu podkreśla niekonstytucyjny charakter przeszukań bez nakazu na podstawie Sekcji 702, wzywając Kongres do wprowadzenia obowiązku uzyskiwania nakazów na przeszukania dotyczące danych osób z USA przed jej wygaśnięciem w 2026 roku.”"
    ],
    "commentSummary": [
      "„Sąd federalny uznał przeszukiwania danych tylnymi drzwiami za niezgodne z konstytucją, co wywołało debaty na temat nadzoru rządowego i praw do prywatności.”",
      "„Orzeczenie kwestionuje konstytucyjność szpiegowania na podstawie Sekcji 702, podkreślając rolę Kongresu i Sądu Najwyższego w ochronie prywatności.”",
      "„Pomimo orzeczenia, sceptycyzm utrzymuje się co do jego wpływu, ponieważ krytycy uważają, że agencje federalne, takie jak FBI, mogą kontynuować takie praktyki, dopóki wewnętrzne przepisy nie zostaną zrewidowane.”"
    ],
    "points": 313,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1737581523
  },
  {
    "id": 42799103,
    "title": "„Najbardziej wpływowe prace w historii informatyki”",
    "originLink": "https://terriblesoftware.org/2025/01/22/the-7-most-influential-papers-in-computer-science-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799103",
    "commentBody": "",
    "originSummary": [
      "„Lista podkreśla siedem przełomowych prac w historii informatyki, z których każda wnosi podstawowe koncepcje stanowiące fundament współczesnej technologii, takie jak maszyna Turinga, teoria informacji i model relacyjnej bazy danych.”",
      "„Te prace wprowadziły przełomowe idee, takie jak NP-zupełność, TCP/IP, World Wide Web i PageRank, które znacząco wpłynęły na rozwój obliczeń, komunikacji i internetu.”",
      "„Wzmianki o bonusach obejmują wpływowe prace na temat Lisp, systemów rozproszonych oraz artykuł „Attention Is All You Need”, ukazując ewolucję i różnorodność badań w dziedzinie informatyki.”"
    ],
    "commentSummary": [
      "„Dyskusja koncentruje się na wpływowych pracach z dziedziny informatyki, w tym klasykach takich jak „Communicating Sequential Processes” Hoare'a oraz prace Turinga dotyczące obliczalności.”",
      "„Uczestnicy debatują nad włączeniem nowszych prac, takich jak artykuł o PageRank, oraz sugerują inne wpływowe prace z dziedziny kryptografii i systemów rozproszonych.”",
      "„Wspomniany jest kurs na Harvardzie, który analizuje te podstawowe prace, aby zapewnić kompleksowe zrozumienie ewolucji informatyki.”"
    ],
    "points": 310,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737592149
  },
  {
    "id": 42798108,
    "title": "„Postępy F-Droid i co nas czeka w 2025 roku”",
    "originLink": "https://f-droid.org/2025/01/21/a-look-back-at-2024-f-droids-progress-and-whats-coming-in-2025.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798108",
    "commentBody": "",
    "originSummary": [
      "„W 2024 roku F-Droid dokonał znaczących postępów w decentralizacji dystrybucji aplikacji, ulepszaniu swojej infrastruktury i rozszerzaniu ekosystemu, głównie dzięki wsparciu społeczności i finansowaniu. Do ważnych osiągnięć należały modernizacje infrastruktury oraz rozwój narzędzi takich jak Repomaker i Mobifree, z ponad 7205 aktualizacjami aplikacji i 402 nowymi aplikacjami dodanymi. Patrząc w przyszłość na rok 2025, F-Droid planuje wykorzystać grant z Open Technology Fund, aby dalej poprawiać infrastrukturę i kontynuować skupienie na decentralizacji dystrybucji aplikacji oraz promowaniu alternatyw open-source.”"
    ],
    "commentSummary": [
      "„Użytkownicy F-Droid domagają się wprowadzenia licznika pobrań, aby zidentyfikować popularne i niezawodne aplikacje, ponieważ platforma nie posiada systemu ocen.”",
      "„Wyzwania obejmują trudności w nawigacji spowodowane niekompletnymi lub nieaktualnymi aplikacjami, co skłania do sugestii dotyczących lepszych filtrów wyszukiwania i aktualizacji interfejsu użytkownika.”",
      "„Pomimo tych wyzwań, F-Droid jest ceniony za swoje aplikacje open-source, z dyskusjami na temat procesów zgłaszania aplikacji i potencjalnej integracji progresywnych aplikacji internetowych (PWA).”"
    ],
    "points": 302,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1737584287
  },
  {
    "id": 42799245,
    "title": "„Zrozumienie gRPC, OpenAPI i REST oraz kiedy ich używać w projektowaniu API (2020)”",
    "originLink": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799245",
    "commentBody": "",
    "originSummary": [
      "„Projektowanie API opiera się głównie na dwóch modelach: gRPC (Remote Procedure Call) i REST (Representational State Transfer), które często są mapowane na HTTP, przy czym gRPC wykorzystuje HTTP/2 do efektywnej komunikacji.”",
      "„REST API są znane ze swojej prostoty i stabilności, podczas gdy gRPC oferuje wydajne biblioteki klienckie i implementacje serwerowe, co czyni go odpowiednim dla wewnętrznych API lub przy korzystaniu z określonych narzędzi, takich jak Cloud Endpoints.”",
      "„OpenAPI, podobnie jak RPC, wymaga konstruowania adresów URL z szablonów, ujawniania szczegółów HTTP i może obejmować złożone niestandardowe mapowania HTTP, oferując szerszą kompatybilność z narzędziami HTTP w porównaniu do gRPC.”"
    ],
    "commentSummary": [
      "„Deweloperzy często uważają gRPC za wyzwanie z powodu problemów z narzędziami, szczególnie w Javie, oraz trudności z debugowaniem i konfiguracją, mimo jego zalet, takich jak dwukierunkowe strumieniowanie i wydajny transport.”",
      "„OpenAPI to standard dokumentacji dla interfejsów API, ułatwiający generowanie i testowanie klientów, często mylony z REST, który rzadko jest wdrażany w swojej czystej formie.”",
      "„Decyzja o użyciu gRPC, OpenAPI lub REST zależy od konkretnych przypadków użycia, wiedzy zespołu i wymagań projektu, co podkreśla znaczenie zrozumienia mocnych stron i ograniczeń każdej z technologii.”"
    ],
    "points": 291,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1737593262
  },
  {
    "id": 42798960,
    "title": "„NIH dotknięte zamrożeniem spotkań, podróży, komunikacji i zatrudniania”",
    "originLink": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798960",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„NIH (Narodowe Instytuty Zdrowia) doświadcza ograniczeń dotyczących spotkań, podróży, komunikacji i zatrudniania, co może wpłynąć na reputację naukową USA. Krytycy twierdzą, że te środki są karne i motywowane politycznie, skierowane przeciwko badaczom postrzeganym jako liberalni, co może zakłócić badania nad zdrowiem publicznym, w tym nad rakiem i chorobami zakaźnymi. Ta sytuacja podkreśla szersze problemy związane z upolitycznieniem nauki i obawy dotyczące spadku miękkiej siły USA.”"
    ],
    "points": 260,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1737590795
  },
  {
    "id": 42801370,
    "title": "„Bun 1.2 został wydany”",
    "originLink": "https://bun.sh/blog/bun-v1.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42801370",
    "commentBody": "",
    "originSummary": [
      "„Bun 1.2 to znacząca aktualizacja dla rozwoju JavaScript i TypeScript, zwiększająca kompatybilność z Node.js oraz dodająca wbudowaną obsługę S3 i Postgres. Aktualizacja wprowadza Bun.sql dla baz danych SQL, szybszy menedżer pakietów i wbudowany test runner, a także poprawioną wydajność i nowe funkcje JavaScript. Bun 1.2 również ulepsza bundling dzięki importom HTML, samodzielnym plikom wykonywalnym i nowemu parserowi CSS, pozostając jednocześnie darmowym i otwartoźródłowym projektem z ciągłym wkładem społeczności.”"
    ],
    "commentSummary": [
      "„Wydano Bun 1.2, wprowadzając funkcje takie jak importy HTML i wbudowane wsparcie dla Amazon S3, które wzmacniają jego podejście „z wbudowanymi funkcjami”.”",
      "„Wydanie ma na celu uproszczenie tworzenia w JavaScript poprzez integrację narzędzi takich jak TypeScript, Jest i Webpack, co przyciąga deweloperów poszukujących uproszczonej konfiguracji.”",
      "„Podczas gdy szybkość i łatwość użycia Bun są chwalone, wśród użytkowników utrzymują się obawy dotyczące potencjalnego uzależnienia, włączenia bibliotek zewnętrznych oraz długoterminowej kompatybilności z Node.js.”"
    ],
    "points": 237,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1737615028
  },
  {
    "id": 42800557,
    "title": "„Technologia posuwa zasadę Pareto za daleko”",
    "originLink": "https://bobbylox.com/blog/tech-takes-the-pareto-principle-too-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42800557",
    "commentBody": "",
    "originSummary": [
      "„Bobby Lockhart krytykuje poleganie branży technologicznej na zasadzie Pareto i MVP, które często prowadzą do powstawania niedokończonych produktów z powodu niewystarczających bodźców do ich ukończenia.”",
      "„Kontrastuje to z podejściem 'vertical slice' w branży gier, które koncentruje się na tworzeniu dopracowanego produktu od samego początku.”",
      "„Lockhart opowiada się za rzemieślniczym podejściem do tworzenia oprogramowania, podkreślając znaczenie ukończenia i dopracowania produktów w celu uzyskania dopracowanego efektu końcowego.”"
    ],
    "commentSummary": [
      "„Zasada Pareto, znana również jako zasada 80/20, jest omawiana w kontekście technologii, szczególnie w rozwoju oprogramowania i produktów, sugerując, że 80% efektów pochodzi z 20% przyczyn.”",
      "„Krytycy twierdzą, że zasada ta prowadzi do wprowadzania na rynek produktów jako kompletnych, mimo że brakuje im ostatecznego 20% wykończenia, podczas gdy zwolennicy uważają, że umożliwia ona efektywne wykorzystanie zasobów i szybkie wejście na rynek.”",
      "„Debata obejmuje wiele branż, w tym gry i sztuczną inteligencję, z różnymi poglądami na temat tego, czy zasada ta sprzyja innowacjom, czy prowadzi do przeciętności.”"
    ],
    "points": 235,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1737604388
  },
  {
    "id": 42796906,
    "title": "„Stworzyłem grę strzelankę multiplayer w Lispie, oto moja podróż”",
    "originLink": "https://ertu.dev/posts/i-made-an-online-shooter-game-in-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796906",
    "commentBody": "",
    "originSummary": [
      "„Gra „Wizard Masters”, wieloosobowa strzelanka z perspektywy trzeciej osoby, została opracowana przy użyciu Clojure, dialektu Lisp, i jest dostępna na CrazyGames. Clojure wybrano ze względu na jego możliwości full-stack i interaktywny system REPL, podczas gdy Babylon.js użyto do grafiki ze względu na jego funkcje i wsparcie społeczności. Wyzwania obejmowały złożone sieciowanie z bibliotekami asynchronicznymi Clojure, zarządzanie stanem z niezmiennością Clojure oraz brak silnej społeczności deweloperów gier Clojure, co podkreśla potencjalne korzyści z przejścia na popularne silniki, takie jak Unity lub Unreal, w przyszłych projektach.”"
    ],
    "commentSummary": [
      "„Gra typu multiplayer shooter została opracowana przy użyciu języka Lisp, z wykorzystaniem ClojureScript i Babylon.JS na frontendzie oraz Clojure na backendzie, z użyciem Websockets do koordynacji. Pomimo wyzwań związanych z narzędziami Babylon.JS, gra została pomyślnie wydana i jest kompatybilna z wieloma urządzeniami, w tym iPhone'ami, otrzymując pozytywne opinie za rozgrywkę i dopracowanie. Niektórzy użytkownicy doświadczyli problemów z kontrolą w przeglądarce Firefox, a deweloper rozważa rozszerzenie gry w oparciu o jej wyniki, podkreślając jednocześnie samodzielny rozwój projektu i wsparcie społeczności.”"
    ],
    "points": 212,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1737576222
  },
  {
    "id": 42799540,
    "title": "„Trae: IDE zasilane sztuczną inteligencją od ByteDance”",
    "originLink": "https://www.trae.ai/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "„Trae, zasilane sztuczną inteligencją Zintegrowane Środowisko Programistyczne (IDE) stworzone przez ByteDance, rozpoczęło dyskusje na temat trendu w kierunku narzędzi do kodowania opartych na subskrypcji oraz związanych z tym kosztów.”",
      "„Pojawiają się obawy dotyczące prywatności danych, zwłaszcza w przypadku chińskich firm takich jak ByteDance, oraz potencjalnego wpływu na tradycyjne umiejętności programistyczne.”",
      "„Debata podkreśla różne poglądy na temat roli AI w rozwoju oprogramowania oraz geopolityczne implikacje korzystania z narzędzi firm chińskich.”"
    ],
    "points": 205,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1737595297
  },
  {
    "id": 42799629,
    "title": "„Podstawy dużych modeli językowych”",
    "originLink": "https://arxiv.org/abs/2501.09223",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799629",
    "commentBody": "",
    "originSummary": [
      "„Książka „Foundations of Large Language Models” autorstwa Tong Xiao i Jingbo Zhu bada kluczowe pojęcia, takie jak wstępne trenowanie, modele generatywne, techniki podpowiadania i metody dopasowywania w dużych modelach językowych. Jest skierowana do studentów, profesjonalistów i praktyków w dziedzinie przetwarzania języka naturalnego, co czyni ją cennym źródłem dla osób zainteresowanych obliczeniami i językiem, sztuczną inteligencją oraz uczeniem maszynowym. Książka jest dostępna do dalszej lektury na arXiv pod identyfikatorem 2501.09223 [cs.CL].”"
    ],
    "commentSummary": [
      "„Książka zatytułowana „Foundations of Large Language Models” autorstwa autorów z Northeastern University, Shenyang, Chiny, jest dostępna na Arxiv i jest znana ze swoich obszernych 231 stron.”",
      "„Dyskusja podkreśla zdolności ChatGPT w zakresie czytania plików PDF, przy czym niektórzy użytkownicy zwracają uwagę na jego ograniczenia w analizowaniu treści wizualnych.”",
      "„Arxiv jest opisywany jako platforma dla preprintów, co oznacza, że treści nie są koniecznie recenzowane, a użytkownicy wyrażają zdziwienie dostępnością książki tam.”"
    ],
    "points": 199,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1737596006
  },
  {
    "id": 42803279,
    "title": "„Hakowanie Subaru: Śledzenie i kontrolowanie samochodów za pomocą panelu administracyjnego Starlink”",
    "originLink": "https://samcurry.net/hacking-subaru",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42803279",
    "commentBody": "",
    "originSummary": [
      "„Luka w zabezpieczeniach usługi STARLINK firmy Subaru została odkryta 20 listopada 2024 roku, umożliwiając nieautoryzowany dostęp do pojazdów i kont klientów w USA, Kanadzie i Japonii. Usterka pozwalała atakującym na zdalne sterowanie pojazdami i dostęp do danych osobowych przy użyciu minimalnych danych, takich jak nazwisko i kod pocztowy, z powodu problemów w panelu administracyjnym STARLINK. Luka została zgłoszona i załatana w ciągu 24 godzin bez żadnego złośliwego wykorzystania, co podkreśla wyzwania związane z zabezpieczaniem systemów samochodów połączonych z siecią z powodu szerokich uprawnień dostępu.”"
    ],
    "commentSummary": [
      "„Odkryto lukę w systemie Starlink Subaru, która umożliwiała hakerom śledzenie i kontrolowanie pojazdów, ale została załatana w ciągu 24 godzin bez żadnego złośliwego wykorzystania.”",
      "„Utrzymują się obawy dotyczące zbierania danych i zdalnego dostępu przez Subaru i jego partnerów, a niektórzy użytkownicy zgłaszają problemy z rozładowywaniem baterii związane z systemem.”",
      "„Incydent podkreśla ryzyko związane z samochodami podłączonymi do internetu, podkreślając potrzebę poprawy ochrony prywatności użytkowników oraz jaśniejszych procesów rezygnacji z gromadzenia danych.”"
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1737634939
  },
  {
    "id": 42802498,
    "title": "„Gdzie znajduje się najbardziej centralna owca Londynu?”",
    "originLink": "https://diamondgeezer.blogspot.com/2025/01/londons-most-central-sheep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42802498",
    "commentBody": "",
    "originSummary": [
      "„Vauxhall City Farm, założona w 1976 roku, jest najbliższą farmą miejską do centrum Londynu, położoną nieco ponad milę od Trafalgar Square.”",
      "„Na farmie znajduje się kilka owiec, w tym owca rasy Szetlandzkiej i Herdwick o imieniu Daffodil, co podkreśla wiejski urok w miejskim otoczeniu.”",
      "„Spitalfields City Farm, druga najbliższa centrum Londynu, jest domem dla owcy rasy Herdwick o imieniu Beatrix oraz kilku Castlemilk Moorits, co podkreśla unikalny urok miejskich farm w Londynie.”"
    ],
    "commentSummary": [
      "„Metryka „czas do owiec”, która mierzy czas potrzebny na dotarcie z centrum miasta na wieś, zainicjowała debatę na temat preferencji życia miejskiego w porównaniu do wiejskiego.”",
      "„Rozmowa podkreślała miasta takie jak Londyn, Bristol i Toronto, koncentrując się na ich dostępności do natury lub farm.”",
      "„Humorystyczne metryki miejskie, takie jak „czas do chaosu” i „czas do krowy”, również były częścią dyskusji, dodając lekki, żartobliwy akcent.”"
    ],
    "points": 183,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737626300
  }
]
