[
  {
    "id": 42797260,
    "title": "Açık kaynaklı bir dizüstü bilgisayarı sıfırdan yaptım",
    "originLink": "https://www.byran.ee/posts/creation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797260",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bir lise öğrencisi, altı ayda sıfırdan açık kaynaklı bir dizüstü bilgisayar inşa etmeyi başardı ve proje GitHub'da tamamen erişilebilir durumda. Proje, eğitim, yetenek ve genç mühendislerin potansiyeli üzerine tartışmaları vurgulayan Show HN'de en üst sıralarda yer alarak önemli bir ilgi topladı. Her ne kadar cilalı bir ürün olmasa da, dizüstü bilgisayar günlük kullanım için işlevsel olup, açık kaynaklı donanım geliştirme olanaklarını göstermektedir."
    ],
    "points": 2282,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1737578512
  },
  {
    "id": 42796950,
    "title": "Evden çalışma aydınlatmanızı göz yorgunluğunu azaltmak için nasıl iyileştirebilirsiniz",
    "originLink": "https://rustle.ca/posts/articles/work-from-home-lighting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796950",
    "commentBody": "",
    "originSummary": [
      "Evden çalışırken göz yorgunluğunu en aza indirmek için doğal ışık, tül perdeler ve titreşimsiz yapay ışıklar kullanarak dengeli bir aydınlatma ortamı oluşturun. 20/20/20 kuralını uygulayın: Her 20 dakikada bir, gözlerinizi rahatlatmak için 20 saniye boyunca 20 fit uzaklıktaki bir şeye bakın. Çalışma alanınızı ışık filtreleyen perdeler ve monitör parlaklığına uygun masa aydınlatması ile tamamlayın ve genel sağlığı korumak için düzenli molalar verin."
    ],
    "commentSummary": [
      "Evden çalışma (WFH) aydınlatmasını iyileştirmek ve göz yorgunluğunu azaltmak için, birden fazla kaynaktan gelen dağınık ışık kullanın ve tutarlı bir renk sıcaklığı sağlayın. Duvar renginin aydınlatma üzerindeki etkisini göz önünde bulundurun ve fotojenik ve rahat bir ortam için \"Altın Saat\" etkisini hedefleyin—dağınık, sıcak ve yumuşak aydınlatma. Işık kalitesini artırmak için yüksek Renk Geriverim İndeksi (CRI) ampuller gibi LED aydınlatma seçeneklerini keşfedin."
    ],
    "points": 570,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1737576537
  },
  {
    "id": 42799136,
    "title": "Tailwind CSS v4.0",
    "originLink": "https://tailwindcss.com/blog/tailwindcss-v4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799136",
    "commentBody": "",
    "originSummary": [
      "Tailwind CSS v4.0, geliştiriciler için performansı ve esnekliği artırarak, yapıları 5 kata kadar daha hızlı ve artımlı yapıları 100 kat daha hızlı hale getiren yüksek performanslı bir motor sunuyor. Güncelleme, modern CSS özellikleri olan kaskad katmanlar, color-mix() ve yerleşik konteyner sorguları ile birlikte geliştirilmiş entegrasyon ve basitleştirilmiş kurulum için birinci taraf Vite eklentisini içeriyor. 3D dönüşüm yardımcı programları, genişletilmiş gradyan API'leri ve CSS değişkenleri olarak tasarım belirteçleri ile CSS-öncelikli yapılandırma gibi yeni özellikler, modern web projelerini daha kolay ve hızlı bir şekilde oluşturmayı sağlıyor ve mevcut projeler için bir yükseltme kılavuzu da mevcut."
    ],
    "commentSummary": [
      "Tailwind CSS v4.0, JavaScript bağımlılığını azaltan ve çok yönlülüğü artıran yerel CSS değişken erişimi ve yalnızca CSS ile yapılandırma gibi önemli iyileştirmeler sunar. Güncelleme, AI iş akışlarıyla uyumluluğu ve tasarım sistemlerindeki kullanışlılığı ile dikkat çekerken, bazı tasarımcılar sistematik tasarım için zorlayıcı bulmaktadır. Sürüm, mevcut projeler ve araçlarla entegrasyonu etkileyen köklü değişiklikler nedeniyle tartışmalara yol açmış, ancak kullanım kolaylığı ve stil verimliliği nedeniyle popülerliğini korumuştur."
    ],
    "points": 395,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1737592382
  },
  {
    "id": 42797756,
    "title": "Federal Mahkeme (Nihayet) Verilerin Arka Kapı Aramaları Anayasaya Aykırı Olduğuna Karar Verdi",
    "originLink": "https://www.eff.org/deeplinks/2025/01/victory-federal-court-finally-rules-backdoor-searches-702-data-unconstitutional",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797756",
    "commentBody": "",
    "originSummary": [
      "Bir federal bölge mahkemesi, 702. Madde kapsamında Amerikalıların özel iletişimlerini içeren veritabanlarının arka kapı aramaları için bir izin gerektiğine karar vererek, Amerika Birleşik Devletleri v. Hasbajrami davasında önemli bir yasal karar aldı. Kongre 702. Maddeyi yeniden yetkilendirmesine rağmen, FBI ve istihbarat topluluğu tarafından kötüye kullanıldığını gösteren kanıtlar, 2021'de 3,4 milyon izinsiz arama yapılmasıyla birlikte, anayasal korumaların sağlanması için reform çağrılarına yol açtı. Mahkemenin kararı, 702. Madde kapsamındaki izinsiz aramaların anayasaya aykırı doğasını vurgulayarak, Kongre'yi 2026'da sona ermeden önce ABD vatandaşlarının verilerini içeren aramalar için izin zorunluluğu getirmeye çağırıyor."
    ],
    "commentSummary": [
      "Bir federal mahkeme, verilerin arka kapıdan aranmasını anayasaya aykırı ilan etti ve bu durum, hükümet gözetimi ve mahremiyet hakları üzerine tartışmaları ateşledi.",
      "Karar, 702. Bölüm casusluğunun anayasaya uygunluğunu sorguluyor ve Kongre ile Yüksek Mahkeme'nin gizliliği koruma konusundaki rollerini vurguluyor.",
      "Karara rağmen, eleştirmenler FBI gibi federal kurumların iç düzenlemeler revize edilene kadar bu tür uygulamalara devam edebileceğine inandıkları için şüphecilik etkisi konusunda devam ediyor."
    ],
    "points": 313,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1737581523
  },
  {
    "id": 42799103,
    "title": "Bilgisayar Bilimi Tarihinde En Etkili Makaleler",
    "originLink": "https://terriblesoftware.org/2025/01/22/the-7-most-influential-papers-in-computer-science-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799103",
    "commentBody": "",
    "originSummary": [
      "Liste, modern teknolojinin temelini oluşturan kavramlara katkıda bulunan, Turing Makinesi, bilgi teorisi ve ilişkisel veritabanı modeli gibi konuları içeren bilgisayar bilimi tarihindeki yedi önemli makaleyi vurgulamaktadır.",
      "Bu makaleler, hesaplama, iletişim ve internet gelişimini önemli ölçüde etkileyen NP-tamlık, TCP/IP, Dünya Çapında Ağ ve PageRank gibi çığır açan fikirleri tanıttı.",
      "Bonus olarak, Lisp, dağıtık sistemler ve bilgisayar bilimi araştırmalarının evrimini ve çeşitliliğini sergileyen \"Attention Is All You Need\" makalesi üzerine etkili çalışmalar yer almaktadır."
    ],
    "commentSummary": [
      "Bu tartışma, Hoare'un \"İletişim Kurabilen Ardışık Süreçler\" ve Turing'in hesaplanabilirlik üzerine çalışmaları gibi klasikler de dahil olmak üzere etkili bilgisayar bilimi makalelerine odaklanıyor.",
      "Katılımcılar, PageRank makalesi gibi daha yeni çalışmaların dahil edilmesini tartışıyor ve kriptografi ile dağıtık sistemlerdeki diğer etkili makaleleri öneriyorlar.",
      "Bir Harvard kursundan bahsediliyor, bu kurs temel makaleleri inceleyerek bilgisayar biliminin evrimini kapsamlı bir şekilde anlamayı sunuyor."
    ],
    "points": 310,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737592149
  },
  {
    "id": 42798108,
    "title": "F-Droid'un İlerlemesi ve 2025'te Neler Geliyor",
    "originLink": "https://f-droid.org/2025/01/21/a-look-back-at-2024-f-droids-progress-and-whats-coming-in-2025.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798108",
    "commentBody": "",
    "originSummary": [
      "2024 yılında, F-Droid, uygulama dağıtımını merkezsizleştirme, altyapısını geliştirme ve ekosistemini genişletme konularında kayda değer ilerlemeler kaydetti, bu büyük ölçüde topluluk desteği ve finansman sayesinde oldu. Önemli başarılar arasında altyapı yükseltmeleri ve Repomaker ve Mobifree gibi araçların genişletilmesi yer aldı, 7205'ten fazla uygulama güncellemesi ve 402 yeni uygulama eklendi. 2025 yılına bakıldığında, F-Droid, altyapıyı daha da geliştirmek ve uygulama dağıtımını merkezsizleştirmeye ve açık kaynak alternatiflerini teşvik etmeye odaklanmaya devam etmek için Açık Teknoloji Fonu hibesini kullanmayı planlıyor."
    ],
    "commentSummary": [
      "F-Droid kullanıcıları, platformda bir derecelendirme sistemi olmadığı için popüler ve güvenilir uygulamaları belirlemek amacıyla bir indirme sayacı talep ediyor.",
      "Zorluklar, eksik veya güncel olmayan uygulamalar nedeniyle gezinme zorluklarını içerir ve bu durum daha iyi arama filtreleri ve kullanıcı arayüzü güncellemeleri için önerilerde bulunulmasına yol açar.",
      "Bu zorluklara rağmen, F-Droid, açık kaynaklı uygulamalarıyla değer görmektedir ve uygulama gönderim süreçleri ile ilerici web uygulamalarının (PWA'lar) potansiyel entegrasyonu üzerine tartışmalar yapılmaktadır."
    ],
    "points": 302,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1737584287
  },
  {
    "id": 42799245,
    "title": "gRPC, OpenAPI ve REST'i Anlamak ve API Tasarımında Ne Zaman Kullanılacağını Bilmek (2020)",
    "originLink": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799245",
    "commentBody": "",
    "originSummary": [
      "API tasarımı öncelikle iki modeli kullanır: gRPC (Uzaktan Prosedür Çağrısı) ve REST (Temsili Durum Transferi), her ikisi de genellikle HTTP'ye eşlenir, gRPC ise verimli iletişim için HTTP/2 kullanır.",
      "REST API'ler, basitlikleri ve kararlılıkları ile bilinirken, gRPC, verimli istemci kütüphaneleri ve sunucu uygulamaları sunarak, özellikle dahili API'ler veya Cloud Endpoints gibi belirli araçlar kullanıldığında uygun hale getirir.",
      "OpenAPI, RPC'ye benzer şekilde, şablonlardan URL'ler oluşturmayı, HTTP ayrıntılarını açığa çıkarmayı gerektirir ve karmaşık özel HTTP eşlemelerini içerebilir, gRPC'ye kıyasla daha geniş HTTP araç uyumluluğu sunar."
    ],
    "commentSummary": [
      "Geliştiriciler, gRPC'nin çift yönlü akış ve verimli taşıma gibi avantajlarına rağmen, özellikle Java'da araç sorunları ve hata ayıklama ile yapılandırma zorlukları nedeniyle gRPC'yi genellikle zorlayıcı bulurlar.",
      "OpenAPI, API'ler için bir dokümantasyon standardıdır, daha kolay istemci oluşturma ve test etmeyi kolaylaştırır ve genellikle saf haliyle nadiren uygulanan REST ile karıştırılır.",
      "gRPC, OpenAPI veya REST kullanma kararı, belirli kullanım durumlarına, ekip uzmanlığına ve proje gereksinimlerine bağlıdır ve her teknolojinin güçlü yönlerini ve sınırlamalarını anlamanın önemini vurgular."
    ],
    "points": 291,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1737593262
  },
  {
    "id": 42798960,
    "title": "NIH, toplantılar, seyahat, iletişim ve işe alımlarda duraklamalarla karşı karşıya",
    "originLink": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798960",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "NIH (Ulusal Sağlık Enstitüleri), toplantılar, seyahat, iletişim ve işe alımlarda kısıtlamalar yaşıyor ve bu durum ABD'nin bilimsel itibarını etkileyebilir. Eleştirmenler, bu önlemlerin cezalandırıcı ve siyasi amaçlı olduğunu, liberal olarak algılanan araştırmacıları hedef aldığını ve kanser ve bulaşıcı hastalıklar dahil olmak üzere halk sağlığı araştırmalarını aksatabileceğini iddia ediyor. Bu durum, bilimin siyasallaşması ve ABD'nin yumuşak gücünün azalması konusundaki daha geniş sorunları vurguluyor."
    ],
    "points": 260,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1737590795
  },
  {
    "id": 42801370,
    "title": "1.2 sürümü yayınlandı",
    "originLink": "https://bun.sh/blog/bun-v1.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42801370",
    "commentBody": "",
    "originSummary": [
      "Bun 1.2, JavaScript ve TypeScript geliştirmesi için önemli bir güncellemedir, Node.js uyumluluğunu artırır ve S3 ile Postgres için yerleşik destek ekler. Güncelleme, SQL veritabanları için Bun.sql, daha hızlı bir paket yöneticisi ve yerleşik bir test çalıştırıcısı tanıtır, bunun yanı sıra geliştirilmiş performans ve yeni JavaScript özellikleri sunar. Bun 1.2 ayrıca HTML ithalatları, bağımsız çalıştırılabilir dosyalar ve yeni bir CSS ayrıştırıcı ile paketlemeyi geliştirir, aynı zamanda topluluk katkılarıyla sürekli olarak ücretsiz ve açık kaynaklı kalır."
    ],
    "commentSummary": [
      "Bun 1.2, HTML ithalatları ve yerleşik Amazon S3 desteği gibi özellikler sunarak, \"piller dahil\" yaklaşımını geliştiren bir sürüm olarak yayınlandı.",
      "Yayın, TypeScript, Jest ve Webpack gibi araçları entegre ederek JavaScript geliştirmesini basitleştirmeyi amaçlıyor ve daha düzenli bir kurulum arayan geliştiricilere hitap ediyor.",
      "Bun'un hızı ve kullanım kolaylığı övülse de, kullanıcılar arasında potansiyel kilitlenme, üçüncü taraf kütüphane dahil etme ve Node.js ile uzun vadeli uyumluluk konularında endişeler devam etmektedir."
    ],
    "points": 237,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1737615028
  },
  {
    "id": 42800557,
    "title": "Teknoloji Pareto ilkesini çok ileri götürüyor",
    "originLink": "https://bobbylox.com/blog/tech-takes-the-pareto-principle-too-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42800557",
    "commentBody": "",
    "originSummary": [
      "Bobby Lockhart, teknoloji endüstrisinin Pareto İlkesi ve MVP'lere olan bağımlılığını eleştiriyor; bu durum genellikle tamamlanmamış ürünlerle sonuçlanıyor çünkü onları tamamlamak için yeterli teşvik bulunmuyor.",
      "Bu durumu, oyun endüstrisinin baştan itibaren cilalı bir ürün yaratmaya odaklanan 'dikey dilim' yaklaşımıyla karşılaştırıyor.",
      "Lockhart, yazılım geliştirmede zanaatkar benzeri bir yaklaşımı savunarak, ürünlerin tamamlanması ve rafine edilmesinin cilalı bir nihai sonuç için önemini vurguluyor."
    ],
    "commentSummary": [
      "Pareto ilkesi veya 80/20 kuralı, teknoloji bağlamında, özellikle yazılım ve ürün geliştirmede tartışılmakta olup, etkilerin %80'inin nedenlerin %20'sinden kaynaklandığını önermektedir.",
      "Eleştirmenler, bu ilkenin, ürünlerin son %20'lik ciladan yoksun olmasına rağmen tamamlanmış olarak pazarlanmasına yol açtığını savunurken, destekçiler, bunun verimli kaynak kullanımı ve hızlı pazar girişini sağladığını iddia ediyor.",
      "Bu tartışma, oyun ve yapay zeka dahil olmak üzere birçok sektörü kapsıyor ve ilkenin yeniliği teşvik edip etmediği veya vasatlığa yol açıp açmadığı konusunda farklı görüşler bulunuyor."
    ],
    "points": 235,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1737604388
  },
  {
    "id": 42796906,
    "title": "Bir Lisp dilinde çok oyunculu bir nişancı oyunu yaptım, işte benim yolculuğum",
    "originLink": "https://ertu.dev/posts/i-made-an-online-shooter-game-in-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796906",
    "commentBody": "",
    "originSummary": [
      "Çok oyunculu üçüncü şahıs nişancı oyunu \"Wizard Masters\", bir Lisp lehçesi olan Clojure kullanılarak geliştirildi ve CrazyGames'te mevcut. Clojure, tam yığın yetenekleri ve etkileşimli REPL sistemi nedeniyle seçilirken, grafikler için Babylon.js özellikleri ve topluluk desteği nedeniyle kullanıldı. Zorluklar arasında Clojure async kütüphaneleri ile karmaşık ağ oluşturma, Clojure'un değişmezliği ile durum yönetimi ve güçlü bir Clojure oyun geliştirme topluluğunun eksikliği yer alıyordu. Bu durum, gelecekteki projeler için Unity veya Unreal gibi ana akım motorlara geçişin potansiyel faydalarını vurguluyor."
    ],
    "commentSummary": [
      "Çok oyunculu bir nişancı oyunu, ön yüz için ClojureScript ve Babylon.JS, arka yüz için Clojure kullanılarak Lisp ile geliştirildi ve koordinasyon için Websockets kullanıldı. Babylon.JS araçlarıyla ilgili zorluklara rağmen, oyun başarıyla piyasaya sürüldü ve iPhone'lar da dahil olmak üzere birden fazla cihazla uyumlu olup, oynanış ve cilası için olumlu geri bildirimler aldı. Bazı kullanıcılar Firefox'ta kontrol sorunları yaşadı ve geliştirici, performansına bağlı olarak oyunu genişletmeyi düşünüyor, projenin tek başına geliştirilmesi ve topluluk desteğini vurguluyor."
    ],
    "points": 212,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1737576222
  },
  {
    "id": 42799540,
    "title": "Trae: ByteDance tarafından geliştirilen yapay zeka destekli bir IDE",
    "originLink": "https://www.trae.ai/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ByteDance tarafından geliştirilen yapay zeka destekli Entegre Geliştirme Ortamı (IDE) olan Trae, abonelik tabanlı kodlama araçlarına ve bunlarla ilgili maliyetlere yönelik eğilimler hakkında tartışmalar başlattı.",
      "Özellikle ByteDance gibi Çinli şirketlerle ilgili olarak veri gizliliği konusunda endişeler dile getiriliyor ve bu durumun geleneksel programlama becerileri üzerindeki potansiyel etkisi üzerinde duruluyor.",
      "Bu tartışma, yapay zekanın yazılım geliştirmedeki rolü ve Çinli şirketlerin araçlarının kullanılmasının jeopolitik etkileri konusundaki farklı görüşleri vurgulamaktadır."
    ],
    "points": 205,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1737595297
  },
  {
    "id": 42799629,
    "title": "Büyük Dil Modellerinin Temelleri",
    "originLink": "https://arxiv.org/abs/2501.09223",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799629",
    "commentBody": "",
    "originSummary": [
      "Kitap \"Foundations of Large Language Models\" (Büyük Dil Modellerinin Temelleri) Tong Xiao ve Jingbo Zhu tarafından yazılmış olup, büyük dil modellerinde ön eğitim, üretici modeller, yönlendirme teknikleri ve hizalama yöntemleri gibi temel kavramları araştırmaktadır. Bu kitap, doğal dil işleme alanında çalışan üniversite öğrencileri, profesyoneller ve uygulayıcıları hedef alarak, Hesaplama ve Dil, Yapay Zeka ve Makine Öğrenimi ile ilgilenenler için değerli bir kaynak sunmaktadır. Kitap, arXiv'de 2501.09223 [cs.CL] kimliği altında daha fazla okuma için mevcuttur."
    ],
    "commentSummary": [
      "Çin, Shenyang'daki Northeastern Üniversitesi'nden yazarlar tarafından yazılan \"Büyük Dil Modellerinin Temelleri\" başlıklı bir kitap, kapsamlı 231 sayfasıyla Arxiv'de mevcuttur.",
      "Metin, bazı kullanıcıların görsel içeriği analiz etmedeki sınırlamalarına dikkat çekmesiyle birlikte, ChatGPT'nin PDF'leri okuma konusundaki yeteneklerini vurgulamaktadır.",
      "Arxiv, içeriklerin mutlaka hakem değerlendirmesinden geçmediği anlamına gelen bir ön baskı platformu olarak açıklanır ve kullanıcılar kitabın orada bulunmasına şaşırır."
    ],
    "points": 199,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1737596006
  },
  {
    "id": 42803279,
    "title": "Subaru'yu Hacklemek: Starlink Yönetim Paneli Üzerinden Araçları İzleme ve Kontrol Etme",
    "originLink": "https://samcurry.net/hacking-subaru",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42803279",
    "commentBody": "",
    "originSummary": [
      "Subaru'nun STARLINK hizmetinde, 20 Kasım 2024'te ABD, Kanada ve Japonya'daki araçlara ve müşteri hesaplarına yetkisiz erişime izin veren bir güvenlik açığı keşfedildi. Bu hata, STARLINK yönetim panelindeki sorunlar nedeniyle, saldırganların araçları uzaktan kontrol etmelerine ve bir soyadı ve posta kodu gibi minimal veriler kullanarak kişisel bilgilere erişmelerine olanak tanıdı. Güvenlik açığı, herhangi bir kötü niyetli kullanım olmadan 24 saat içinde bildirildi ve yamalandı, bu da geniş erişim izinleri nedeniyle bağlı araç sistemlerini güvence altına almanın zorluklarını vurguluyor."
    ],
    "commentSummary": [
      "Subaru'nun Starlink sisteminde, bilgisayar korsanlarının araçları takip etmesine ve kontrol etmesine olanak tanıyan bir güvenlik açığı keşfedildi, ancak bu açık herhangi bir kötü niyetli kullanım olmadan 24 saat içinde yamalandı.",
      "Subaru ve ortakları tarafından veri toplama ve uzaktan erişimle ilgili endişeler devam ediyor, bazı kullanıcılar sistemle bağlantılı pil tükenme sorunları bildirmektedir.",
      "Bu olay, internet bağlantılı arabalarla ilgili risklerin altını çiziyor ve kullanıcı gizliliği korumalarının iyileştirilmesi ve veri toplama için daha net vazgeçme süreçlerinin gerekliliğini vurguluyor."
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1737634939
  },
  {
    "id": 42802498,
    "title": "Londra'nın en merkezi koyunu nerede?",
    "originLink": "https://diamondgeezer.blogspot.com/2025/01/londons-most-central-sheep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42802498",
    "commentBody": "",
    "originSummary": [
      "Vauxhall City Farm, 1976 yılında kurulmuş olup, Trafalgar Meydanı'ndan sadece bir mil uzakta, Londra merkezine en yakın şehir çiftliğidir.",
      "Çiftlik, kentsel ortamda kırsal cazibeyi sergileyen, Daffodil adında bir Shetland ve bir Herdwick dahil olmak üzere birkaç koyuna ev sahipliği yapmaktadır.",
      "Spitalfields City Farm, Londra merkezine en yakın ikinci çiftlik olarak, Beatrix adında bir Herdwick dişi koyun ve birkaç Castlemilk Moorit barındırarak Londra'daki şehir çiftliklerinin benzersiz cazibesini vurguluyor."
    ],
    "commentSummary": [
      "Şehir merkezinden kırsal alana ulaşma süresini ölçen \"koyun zamanı\" metriği, kentsel ve kırsal yaşam tercihleri üzerine bir tartışma başlattı.",
      "Konuşma, Londra, Bristol ve Toronto gibi şehirleri, doğaya veya çiftliklere erişimlerine odaklanarak vurguladı.",
      "Kaosa kadar geçen süre\" ve \"ineğe kadar geçen süre\" gibi mizahi şehir ölçütleri de tartışmanın bir parçasıydı ve hafif bir bakış açısı kattı."
    ],
    "points": 183,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737626300
  }
]
