[
  {
    "id": 42797260,
    "title": "मैंने शुरू से एक ओपन-सोर्स लैपटॉप बनाया।",
    "originLink": "https://www.byran.ee/posts/creation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797260",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक हाई स्कूल छात्र ने छह महीने में एक ओपन-सोर्स लैपटॉप को खरोंच से सफलतापूर्वक बनाया, और यह प्रोजेक्ट पूरी तरह से GitHub पर उपलब्ध है। इस प्रोजेक्ट ने महत्वपूर्ण ध्यान आकर्षित किया, Show HN पर एक शीर्ष पोस्ट के रूप में रैंकिंग प्राप्त की, जो शिक्षा, प्रतिभा, और युवा इंजीनियरों की संभावनाओं पर चर्चाओं को उजागर करता है। हालांकि यह एक परिष्कृत उत्पाद नहीं है, लेकिन लैपटॉप एक दैनिक ड्राइवर के रूप में कार्य करता है, जो ओपन-सोर्स हार्डवेयर विकास की संभावनाओं को दर्शाता है।"
    ],
    "points": 2282,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1737578512
  },
  {
    "id": 42796950,
    "title": "अपने WFH (वर्क फ्रॉम होम) लाइटिंग को बेहतर कैसे बनाएं ताकि आंखों के तनाव को कम किया जा सके",
    "originLink": "https://rustle.ca/posts/articles/work-from-home-lighting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796950",
    "commentBody": "",
    "originSummary": [
      "घर से काम करते समय आंखों के तनाव को कम करने के लिए, प्राकृतिक प्रकाश, हल्के पर्दे और बिना झिलमिलाहट वाले कृत्रिम रोशनी का उपयोग करके एक संतुलित प्रकाश वातावरण बनाएं। 20/20/20 नियम लागू करें: हर 20 मिनट में, 20 फीट दूर किसी चीज़ को 20 सेकंड के लिए देखें ताकि आपकी आंखें आराम कर सकें। अपने कार्यक्षेत्र को प्रकाश-फिल्टरिंग पर्दे और मॉनिटर की चमक से मेल खाने वाली डेस्क लाइटिंग के साथ पूरक करें, साथ ही समग्र स्वास्थ्य बनाए रखने के लिए नियमित ब्रेक भी लें।"
    ],
    "commentSummary": [
      "घर से काम करने के दौरान प्रकाश व्यवस्था को बेहतर बनाने और आंखों के तनाव को कम करने के लिए, कई स्रोतों से फैला हुआ प्रकाश उपयोग करें और रंग तापमान को स्थिर बनाए रखें। दीवार के रंग का प्रकाश पर प्रभाव पर विचार करें और 'गोल्डन आवर' प्रभाव का लक्ष्य रखें—फैला हुआ, गर्म और कोमल प्रकाश जो एक फोटोजेनिक और आरामदायक वातावरण के लिए उपयुक्त हो। बेहतर प्रकाश गुणवत्ता के लिए उच्च रंग प्रतिपादन सूचकांक (CRI) बल्ब जैसे एलईडी प्रकाश विकल्पों का अन्वेषण करें।"
    ],
    "points": 570,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1737576537
  },
  {
    "id": 42799136,
    "title": "टेलविंड सीएसएस v4.0",
    "originLink": "https://tailwindcss.com/blog/tailwindcss-v4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799136",
    "commentBody": "",
    "originSummary": [
      "टेलविंड CSS v4.0 एक उच्च-प्रदर्शन इंजन पेश करता है, जो बिल्ड्स को 5 गुना तक तेज और इन्क्रिमेंटल बिल्ड्स को 100 गुना से अधिक तेज बनाता है, जिससे डेवलपर्स के लिए प्रदर्शन और लचीलापन बढ़ता है। इस अपडेट में आधुनिक CSS विशेषताएँ शामिल हैं जैसे कि कैस्केड लेयर्स, कलर-मिक्स(), और बिल्ट-इन कंटेनर क्वेरीज़, साथ ही बेहतर एकीकरण और सरल स्थापना के लिए एक प्रथम-पक्ष Vite प्लगइन। नई विशेषताएँ जैसे 3D ट्रांसफॉर्म यूटिलिटीज, विस्तारित ग्रेडिएंट API, और डिज़ाइन टोकन के साथ CSS वेरिएबल्स के रूप में CSS-प्रथम कॉन्फ़िगरेशन आधुनिक वेब प्रोजेक्ट्स को बनाना आसान और तेज़ बनाती हैं, और मौजूदा प्रोजेक्ट्स के लिए एक अपग्रेड गाइड उपलब्ध है।"
    ],
    "commentSummary": [
      "टेलविंड CSS v4.0 महत्वपूर्ण सुधारों को पेश करता है, जैसे कि नेटिव CSS वेरिएबल एक्सेस और एक CSS-ओनली कॉन्फ़िगरेशन, जो जावास्क्रिप्ट पर निर्भरता को कम करता है और बहुमुखी प्रतिभा को बढ़ाता है। यह अपडेट AI वर्कफ्लोज़ के साथ संगतता और डिज़ाइन सिस्टम में उपयोगिता के लिए जाना जाता है, हालांकि कुछ डिज़ाइनरों को इसे व्यवस्थित डिज़ाइन के लिए चुनौतीपूर्ण लगता है। इस रिलीज़ ने मौजूदा प्रोजेक्ट्स और टूल्स के साथ एकीकरण को प्रभावित करने वाले ब्रेकिंग चेंजेस के कारण चर्चाओं को जन्म दिया है, जबकि इसके उपयोग में आसानी और स्टाइलिंग दक्षता के लिए लोकप्रियता बनाए रखी है।"
    ],
    "points": 395,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1737592382
  },
  {
    "id": 42797756,
    "title": "संघीय अदालत ने (अंततः) डेटा की बैकडोर खोजों को असंवैधानिक घोषित किया",
    "originLink": "https://www.eff.org/deeplinks/2025/01/victory-federal-court-finally-rules-backdoor-searches-702-data-unconstitutional",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42797756",
    "commentBody": "",
    "originSummary": [
      "एक संघीय जिला अदालत ने फैसला सुनाया है कि सेक्शन 702 के तहत अमेरिकियों की निजी संचार वाली डेटाबेस की बैकडोर खोजों के लिए वारंट की आवश्यकता होती है, जो कि यूनाइटेड स्टेट्स बनाम हसबज्रामि में एक महत्वपूर्ण कानूनी निर्णय है। कांग्रेस द्वारा सेक्शन 702 को पुनः अधिकृत करने के बावजूद, एफबीआई और खुफिया समुदाय द्वारा दुरुपयोग के सबूत हैं, जिसमें 2021 में 3.4 मिलियन बिना वारंट के खोजें की गईं, जिससे संवैधानिक सुरक्षा सुनिश्चित करने के लिए सुधार की मांग उठी। अदालत का निर्णय सेक्शन 702 के तहत बिना वारंट के खोजों की असंवैधानिक प्रकृति को उजागर करता है, और कांग्रेस से आग्रह करता है कि वह 2026 में इसकी समाप्ति से पहले अमेरिकी व्यक्तियों के डेटा से संबंधित खोजों के लिए वारंट अनिवार्य करे।"
    ],
    "commentSummary": [
      "एक संघीय अदालत ने डेटा की बैकडोर खोजों को असंवैधानिक घोषित किया है, जिससे सरकारी निगरानी और गोपनीयता अधिकारों पर बहस छिड़ गई है।",
      "यह निर्णय धारा 702 जासूसी की संवैधानिकता को चुनौती देता है, जिसमें गोपनीयता की सुरक्षा में कांग्रेस और सुप्रीम कोर्ट की भूमिकाओं को उजागर किया गया है।",
      "फैसले के बावजूद, इसके प्रभाव को लेकर संदेह बना हुआ है, क्योंकि आलोचकों का मानना है कि एफबीआई जैसी संघीय एजेंसियां ऐसी प्रथाओं को तब तक जारी रख सकती हैं जब तक आंतरिक नियमों में संशोधन नहीं किया जाता।"
    ],
    "points": 313,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1737581523
  },
  {
    "id": 42799103,
    "title": "कंप्यूटर विज्ञान के इतिहास में सबसे प्रभावशाली शोध पत्र",
    "originLink": "https://terriblesoftware.org/2025/01/22/the-7-most-influential-papers-in-computer-science-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799103",
    "commentBody": "",
    "originSummary": [
      "यह सूची कंप्यूटर विज्ञान के इतिहास में सात महत्वपूर्ण शोध पत्रों को उजागर करती है, जिनमें से प्रत्येक ने आधुनिक तकनीक की नींव रखने वाले मूलभूत अवधारणाओं में योगदान दिया है, जैसे कि ट्यूरिंग मशीन, सूचना सिद्धांत, और संबंधपरक डेटाबेस मॉडल।",
      "इन पत्रों ने एनपी-पूर्णता, टीसीपी/आईपी, वर्ल्ड वाइड वेब, और पेजरैंक जैसी क्रांतिकारी अवधारणाओं को प्रस्तुत किया, जिन्होंने गणना, संचार, और इंटरनेट विकास को महत्वपूर्ण रूप से प्रभावित किया है।",
      "बोनस उल्लेखों में लिस्प, वितरित प्रणालियों, और \"अटेंशन इज़ ऑल यू नीड\" पेपर पर प्रभावशाली कार्य शामिल हैं, जो कंप्यूटर विज्ञान अनुसंधान के विकास और विविधता को प्रदर्शित करते हैं।"
    ],
    "commentSummary": [
      "चर्चा प्रभावशाली कंप्यूटर विज्ञान पत्रों पर केंद्रित है, जिसमें होअर के 'कम्युनिकेटिंग सीक्वेंशियल प्रोसेसेस' और ट्यूरिंग के गणनीयता पर कार्य जैसे क्लासिक्स शामिल हैं।",
      "प्रतिभागी हाल के कार्यों, जैसे कि पेजरैंक पेपर, को शामिल करने पर बहस करते हैं और क्रिप्टोग्राफी और वितरित प्रणालियों में अन्य प्रभावशाली पत्रों का सुझाव देते हैं।",
      "एक हार्वर्ड कोर्स का उल्लेख किया गया है, जो इन मौलिक पत्रों की जांच करता है ताकि कंप्यूटर विज्ञान के विकास की व्यापक समझ प्रदान की जा सके।"
    ],
    "points": 310,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737592149
  },
  {
    "id": 42798108,
    "title": "एफ-ड्रॉइड की प्रगति और 2025 में क्या आ रहा है",
    "originLink": "https://f-droid.org/2025/01/21/a-look-back-at-2024-f-droids-progress-and-whats-coming-in-2025.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798108",
    "commentBody": "",
    "originSummary": [
      "2024 में, एफ-ड्रॉइड ने ऐप वितरण को विकेंद्रीकृत करने, अपनी बुनियादी ढांचे को उन्नत करने और अपने पारिस्थितिकी तंत्र का विस्तार करने में उल्लेखनीय प्रगति की, जो मुख्य रूप से समुदाय के समर्थन और वित्त पोषण के कारण संभव हुआ। महत्वपूर्ण उपलब्धियों में बुनियादी ढांचे के उन्नयन और रिपोमेकर और मोबिफ्री जैसे उपकरणों का विस्तार शामिल था, जिसमें 7205 से अधिक ऐप अपडेट और 402 नए ऐप जोड़े गए। 2025 की ओर देखते हुए, एफ-ड्रॉइड ओपन टेक्नोलॉजी फंड अनुदान का उपयोग करके बुनियादी ढांचे को और बेहतर बनाने और ऐप वितरण को विकेंद्रीकृत करने और ओपन-सोर्स विकल्पों को बढ़ावा देने पर ध्यान केंद्रित करने की योजना बना रहा है।"
    ],
    "commentSummary": [
      "एफ-ड्रॉइड उपयोगकर्ता एक डाउनलोड काउंटर की वकालत कर रहे हैं ताकि लोकप्रिय और विश्वसनीय ऐप्स की पहचान की जा सके, क्योंकि इस प्लेटफॉर्म में रेटिंग सिस्टम की कमी है।",
      "चुनौतियों में अधूरी या पुरानी ऐप्स के कारण नेविगेशन में कठिनाइयाँ शामिल हैं, जो बेहतर खोज फिल्टर और यूआई अपडेट के सुझावों को प्रेरित करती हैं।",
      "इन चुनौतियों के बावजूद, F-Droid को इसके ओपन-सोर्स ऐप्स के लिए सराहा जाता है, जिसमें ऐप सबमिशन प्रक्रियाओं और प्रोग्रेसिव वेब ऐप्स (PWAs) के संभावित एकीकरण पर चर्चाएं शामिल हैं।"
    ],
    "points": 302,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1737584287
  },
  {
    "id": 42799245,
    "title": "gRPC, OpenAPI और REST को समझना और API डिज़ाइन में उनका उपयोग कब करना चाहिए (2020)",
    "originLink": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799245",
    "commentBody": "",
    "originSummary": [
      "एपीआई डिज़ाइन मुख्य रूप से दो मॉडलों का उपयोग करता है: gRPC (रिमोट प्रोसीजर कॉल) और REST (रिप्रेजेंटेशनल स्टेट ट्रांसफर), दोनों को अक्सर HTTP पर मैप किया जाता है, जिसमें gRPC कुशल संचार के लिए HTTP/2 का उपयोग करता है।",
      "REST API अपनी सरलता और स्थिरता के लिए जाने जाते हैं, जबकि gRPC प्रभावी क्लाइंट लाइब्रेरी और सर्वर इम्प्लीमेंटेशन प्रदान करता है, जो इसे आंतरिक API या विशेष उपकरण जैसे कि क्लाउड एंडपॉइंट्स का उपयोग करते समय उपयुक्त बनाता है।",
      "OpenAPI, RPC के समान, टेम्पलेट्स से URL बनाने की आवश्यकता होती है, HTTP विवरणों को उजागर करता है, और जटिल कस्टम HTTP मैपिंग्स शामिल कर सकता है, जो gRPC की तुलना में व्यापक HTTP टूल संगतता प्रदान करता है।"
    ],
    "commentSummary": [
      "डेवलपर्स अक्सर gRPC को चुनौतीपूर्ण पाते हैं, विशेष रूप से जावा में टूलिंग समस्याओं के कारण, और डिबगिंग और कॉन्फ़िगरेशन में कठिनाइयों के कारण, इसके फायदों जैसे द्विदिश स्ट्रीमिंग और कुशल परिवहन के बावजूद।",
      "ओपनएपी एपीआई के लिए एक प्रलेखन मानक है, जो क्लाइंट जनरेशन और परीक्षण को आसान बनाता है, और अक्सर इसे रेस्ट के साथ भ्रमित किया जाता है, जिसे शायद ही कभी अपने शुद्ध रूप में लागू किया जाता है।",
      "gRPC, OpenAPI, या REST का उपयोग करने का निर्णय विशेष उपयोग मामलों, टीम की विशेषज्ञता, और परियोजना की आवश्यकताओं पर निर्भर करता है, जो प्रत्येक तकनीक की ताकतों और सीमाओं को समझने के महत्व को उजागर करता है।"
    ],
    "points": 291,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1737593262
  },
  {
    "id": 42798960,
    "title": "एनआईएच को बैठकों, यात्रा, संचार, और भर्ती पर रोक का सामना करना पड़ा",
    "originLink": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42798960",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एनआईएच (नेशनल इंस्टीट्यूट्स ऑफ हेल्थ) बैठकों, यात्रा, संचार और भर्ती पर प्रतिबंधों का सामना कर रहा है, जो अमेरिका की वैज्ञानिक प्रतिष्ठा को प्रभावित कर सकता है। आलोचकों का दावा है कि ये उपाय दंडात्मक और राजनीतिक रूप से प्रेरित हैं, जो उदारवादी माने जाने वाले शोधकर्ताओं को लक्षित कर रहे हैं, जिससे सार्वजनिक स्वास्थ्य अनुसंधान, जिसमें कैंसर और संक्रामक रोग शामिल हैं, बाधित हो सकता है। यह स्थिति विज्ञान के राजनीतिकरण और अमेरिका की सॉफ्ट पावर के पतन के बारे में चिंताओं को उजागर करती है।"
    ],
    "points": 260,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1737590795
  },
  {
    "id": 42801370,
    "title": "Bun 1.2 जारी किया गया",
    "originLink": "https://bun.sh/blog/bun-v1.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42801370",
    "commentBody": "",
    "originSummary": [
      "Bun 1.2 जावास्क्रिप्ट और टाइपस्क्रिप्ट विकास के लिए एक महत्वपूर्ण अपडेट है, जो Node.js संगतता को बढ़ाता है और S3 और Postgres के लिए अंतर्निहित समर्थन जोड़ता है। यह अपडेट SQL डेटाबेस के लिए Bun.sql, एक तेज़ पैकेज प्रबंधक, और एक अंतर्निहित परीक्षण रनर पेश करता है, साथ ही प्रदर्शन में सुधार और नए जावास्क्रिप्ट फीचर्स भी शामिल हैं। Bun 1.2 HTML इम्पोर्ट्स, स्टैंडअलोन निष्पादन योग्य और एक नए CSS पार्सर के साथ बंडलिंग को भी बढ़ाता है, जबकि यह मुफ्त और ओपन-सोर्स बना रहता है और समुदाय के निरंतर योगदान के साथ आगे बढ़ता है।"
    ],
    "commentSummary": [
      "बन 1.2 जारी किया गया है, जिसमें HTML इम्पोर्ट्स और बिल्ट-इन अमेज़न S3 सपोर्ट जैसी विशेषताएं शामिल हैं, जो इसके 'बैटरियों-इनक्लूडेड' दृष्टिकोण को बढ़ावा देती हैं।",
      "रिलीज का उद्देश्य टाइपस्क्रिप्ट, जेस्ट और वेबपैक जैसे उपकरणों को एकीकृत करके जावास्क्रिप्ट विकास को सरल बनाना है, जो एक सुव्यवस्थित सेटअप की तलाश करने वाले डेवलपर्स को आकर्षित करता है।",
      "जबकि Bun की गति और उपयोग में आसानी की प्रशंसा की जाती है, उपयोगकर्ताओं के बीच संभावित लॉक-इन, तृतीय-पक्ष लाइब्रेरी समावेशन, और Node.js के साथ दीर्घकालिक संगतता को लेकर चिंताएँ बनी रहती हैं।"
    ],
    "points": 237,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1737615028
  },
  {
    "id": 42800557,
    "title": "तकनीक पारेटो सिद्धांत को बहुत दूर ले जाती है",
    "originLink": "https://bobbylox.com/blog/tech-takes-the-pareto-principle-too-far/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42800557",
    "commentBody": "",
    "originSummary": [
      "बॉबी लॉकहार्ट तकनीकी उद्योग की पारेतो सिद्धांत और एमवीपी (न्यूनतम व्यवहार्य उत्पाद) पर निर्भरता की आलोचना करते हैं, जो अक्सर अधूरे उत्पादों का परिणाम होते हैं क्योंकि उन्हें पूरा करने के लिए पर्याप्त प्रोत्साहन नहीं होते।",
      "वह इसे गेमिंग उद्योग के 'वर्टिकल स्लाइस' दृष्टिकोण के साथ तुलना करते हैं, जो शुरुआत से ही एक परिष्कृत उत्पाद बनाने पर ध्यान केंद्रित करता है।",
      "लॉकहार्ट सॉफ्टवेयर विकास के लिए एक शिल्पकार जैसी दृष्टिकोण की वकालत करते हैं, जो उत्पादों को पूरा करने और परिष्कृत करने के महत्व पर जोर देता है ताकि एक चमकदार अंतिम परिणाम प्राप्त हो सके।"
    ],
    "commentSummary": [
      "परेतो सिद्धांत, या 80/20 नियम, तकनीक के संदर्भ में चर्चा की जा रही है, विशेष रूप से सॉफ्टवेयर और उत्पाद विकास में, यह सुझाव देते हुए कि 80% प्रभाव 20% कारणों से आते हैं।",
      "आलोचकों का तर्क है कि इस सिद्धांत के कारण उत्पादों को पूर्ण के रूप में विपणन किया जाता है, भले ही उनमें अंतिम 20% की चमक की कमी हो, जबकि समर्थकों का दावा है कि यह कुशल संसाधन उपयोग और तेजी से बाजार में प्रवेश को सक्षम बनाता है।",
      "बहस कई उद्योगों में फैली हुई है, जिसमें गेमिंग और एआई शामिल हैं, और इस पर भिन्न विचार हैं कि क्या यह सिद्धांत नवाचार को बढ़ावा देता है या औसत दर्जे की ओर ले जाता है।"
    ],
    "points": 235,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1737604388
  },
  {
    "id": 42796906,
    "title": "मैंने लिस्प में एक मल्टीप्लेयर शूटर गेम बनाया, यहाँ है मेरी यात्रा",
    "originLink": "https://ertu.dev/posts/i-made-an-online-shooter-game-in-lisp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42796906",
    "commentBody": "",
    "originSummary": [
      "खेल \"विजार्ड मास्टर्स,\" एक मल्टीप्लेयर थर्ड-पर्सन शूटर, को क्लोजर, एक लिस्प डायलैक्ट का उपयोग करके विकसित किया गया है और यह क्रेजीगेम्स पर उपलब्ध है। क्लोजर को इसकी फुल-स्टैक क्षमताओं और इंटरैक्टिव REPL सिस्टम के लिए चुना गया था, जबकि ग्राफिक्स के लिए Babylon.js का उपयोग इसके फीचर्स और समुदाय समर्थन के कारण किया गया। चुनौतियों में क्लोजर असिंक लाइब्रेरी के साथ जटिल नेटवर्किंग, क्लोजर की अपरिवर्तनीयता के साथ स्टेट प्रबंधन, और एक मजबूत क्लोजर गेम डेवलपमेंट समुदाय की कमी शामिल थी, जो भविष्य की परियोजनाओं के लिए यूनिटी या अनरियल जैसे मुख्यधारा के इंजनों में स्थानांतरित होने के संभावित लाभों को उजागर करता है।"
    ],
    "commentSummary": [
      "एक मल्टीप्लेयर शूटर गेम को Lisp का उपयोग करके विकसित किया गया, जिसमें फ्रंटएंड के लिए ClojureScript और Babylon.JS का उपयोग किया गया, और बैकएंड के लिए Clojure का उपयोग किया गया, समन्वय के लिए Websockets का उपयोग करते हुए। Babylon.JS टूलिंग के साथ चुनौतियों के बावजूद, गेम को सफलतापूर्वक रिलीज़ किया गया और यह कई उपकरणों के साथ संगत है, जिसमें iPhones भी शामिल हैं, और इसे गेमप्ले और पॉलिश के लिए सकारात्मक प्रतिक्रिया मिली। कुछ उपयोगकर्ताओं ने Firefox में नियंत्रण समस्याओं का अनुभव किया, और डेवलपर इसके प्रदर्शन के आधार पर गेम का विस्तार करने पर विचार कर रहा है, जो परियोजना के एकल विकास और सामुदायिक समर्थन को उजागर करता है।"
    ],
    "points": 212,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1737576222
  },
  {
    "id": 42799540,
    "title": "ट्रे: बाइटडांस द्वारा एआई-संचालित आईडीई",
    "originLink": "https://www.trae.ai/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ट्रे, बाइटडांस द्वारा संचालित एक एआई-सक्षम एकीकृत विकास वातावरण (आईडीई), ने सब्सक्रिप्शन-आधारित कोडिंग टूल्स और संबंधित लागतों की प्रवृत्ति के बारे में चर्चाएं शुरू की हैं।",
      "डेटा गोपनीयता के बारे में चिंताएँ उठाई जा रही हैं, विशेष रूप से चीनी कंपनियों जैसे बाइटडांस के साथ, और पारंपरिक प्रोग्रामिंग कौशल पर संभावित प्रभाव।",
      "बहस सॉफ्टवेयर विकास में एआई की भूमिका और चीनी कंपनियों के उपकरणों के उपयोग के भू-राजनीतिक प्रभावों पर विभिन्न दृष्टिकोणों को उजागर करती है।"
    ],
    "points": 205,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1737595297
  },
  {
    "id": 42799629,
    "title": "बड़े भाषा मॉडल की नींव",
    "originLink": "https://arxiv.org/abs/2501.09223",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42799629",
    "commentBody": "",
    "originSummary": [
      "टोंग शियाओ और जिंगबो झू द्वारा लिखित पुस्तक \"फाउंडेशन्स ऑफ लार्ज लैंग्वेज मॉडल्स\" बड़े भाषा मॉडलों में पूर्व-प्रशिक्षण, जनरेटिव मॉडल, प्रॉम्प्टिंग तकनीकें, और संरेखण विधियों जैसे प्रमुख अवधारणाओं का अन्वेषण करती है। यह पुस्तक कॉलेज के छात्रों, पेशेवरों, और प्राकृतिक भाषा प्रसंस्करण के क्षेत्र में कार्यरत व्यक्तियों को लक्षित करती है, जिससे यह कंप्यूटेशन और भाषा, कृत्रिम बुद्धिमत्ता, और मशीन लर्निंग में रुचि रखने वालों के लिए एक मूल्यवान संसाधन बन जाती है। यह पुस्तक arXiv पर 2501.09223 [cs.CL] पहचानकर्ता के तहत आगे पढ़ने के लिए उपलब्ध है।"
    ],
    "commentSummary": [
      "एक पुस्तक जिसका शीर्षक \"फाउंडेशन्स ऑफ लार्ज लैंग्वेज मॉडल्स\" है, जिसे शेनयांग, चीन के नॉर्थईस्टर्न यूनिवर्सिटी के लेखकों द्वारा लिखा गया है, अरxiv पर उपलब्ध है और इसे इसके व्यापक 231 पृष्ठों के लिए जाना जाता है।",
      "चर्चा में ChatGPT की क्षमताओं को पीडीएफ पढ़ने में उजागर किया गया है, जिसमें कुछ उपयोगकर्ताओं ने इसके दृश्य सामग्री का विश्लेषण करने में सीमाओं की ओर इशारा किया है।",
      "Arxiv को प्री-प्रिंट्स के लिए एक मंच के रूप में समझाया गया है, जिसका मतलब है कि सामग्री जरूरी नहीं कि सहकर्मी-समीक्षित हो, और उपयोगकर्ता इस बात पर आश्चर्य व्यक्त करते हैं कि पुस्तक वहां उपलब्ध है।"
    ],
    "points": 199,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1737596006
  },
  {
    "id": 42803279,
    "title": "हैकिंग सुबारू: स्टारलिंक एडमिन पैनल के माध्यम से कारों को ट्रैक और नियंत्रित करना",
    "originLink": "https://samcurry.net/hacking-subaru",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42803279",
    "commentBody": "",
    "originSummary": [
      "20 नवंबर, 2024 को Subaru की STARLINK सेवा में एक सुरक्षा खामी का पता चला, जिससे अमेरिका, कनाडा और जापान में वाहनों और ग्राहक खातों तक अनधिकृत पहुंच संभव हो गई। इस खामी ने हमलावरों को वाहनों को दूरस्थ रूप से नियंत्रित करने और व्यक्तिगत जानकारी तक पहुंचने की अनुमति दी, जैसे कि केवल अंतिम नाम और ज़िप कोड का उपयोग करके, STARLINK एडमिन पैनल में समस्याओं के कारण। इस खामी की रिपोर्ट की गई और 24 घंटों के भीतर इसे ठीक कर दिया गया, बिना किसी दुर्भावनापूर्ण शोषण के, जो जुड़े हुए कार सिस्टम की सुरक्षा में व्यापक पहुंच अनुमतियों के कारण आने वाली चुनौतियों को उजागर करता है।"
    ],
    "commentSummary": [
      "सुबेरू के स्टारलिंक सिस्टम में एक कमजोरी पाई गई, जिससे हैकर्स वाहनों को ट्रैक और नियंत्रित कर सकते थे, लेकिन इसे 24 घंटों के भीतर बिना किसी दुर्भावनापूर्ण शोषण के ठीक कर दिया गया।",
      "डेटा संग्रह और Subaru और उसके साझेदारों द्वारा रिमोट एक्सेस को लेकर चिंताएँ बनी हुई हैं, कुछ उपयोगकर्ताओं ने सिस्टम से जुड़े बैटरी ड्रेन की समस्याओं की रिपोर्ट की है।",
      "यह घटना इंटरनेट से जुड़े कारों से जुड़े जोखिमों को उजागर करती है, जो उपयोगकर्ता की गोपनीयता सुरक्षा में सुधार और डेटा संग्रह के लिए स्पष्ट विकल्प प्रक्रिया की आवश्यकता पर जोर देती है।"
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1737634939
  },
  {
    "id": 42802498,
    "title": "लंदन की सबसे केंद्रीय भेड़ कहाँ है?",
    "originLink": "https://diamondgeezer.blogspot.com/2025/01/londons-most-central-sheep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42802498",
    "commentBody": "",
    "originSummary": [
      "वॉक्सहॉल सिटी फार्म, जो 1976 में स्थापित हुआ था, केंद्रीय लंदन के सबसे निकटतम सिटी फार्म है, जो ट्राफलगर स्क्वायर से सिर्फ एक मील से अधिक की दूरी पर स्थित है।",
      "फार्म में कई भेड़ें हैं, जिनमें एक शेटलैंड और एक हर्डविक शामिल हैं, जिसका नाम डैफोडिल है, जो शहरी वातावरण में ग्रामीण आकर्षण को प्रदर्शित करता है।",
      "स्पिटलफील्ड्स सिटी फार्म, जो केंद्रीय लंदन के दूसरे सबसे करीब है, एक हर्डविक भेड़ जिसका नाम बीट्रिक्स है और कई कैसलमिल्क मूरिट्स की मेजबानी करता है, जो लंदन में सिटी फार्मों की अनोखी अपील को दर्शाता है।"
    ],
    "commentSummary": [
      "शहर के केंद्र से ग्रामीण क्षेत्र तक पहुंचने की अवधि को मापने वाले 'टाइम टू शीप' मीट्रिक ने शहरी बनाम ग्रामीण जीवन की प्राथमिकताओं पर बहस शुरू कर दी।",
      "वार्तालाप में लंदन, ब्रिस्टल और टोरंटो जैसे शहरों पर प्रकाश डाला गया, जो प्रकृति या खेतों तक उनकी पहुंच पर केंद्रित था।",
      "चर्चा में \"अराजकता का समय\" और \"गाय तक का समय\" जैसे हास्यपूर्ण शहर मापदंड भी शामिल थे, जो एक हल्के-फुल्के दृष्टिकोण को जोड़ते हैं।"
    ],
    "points": 183,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1737626300
  }
]
