[
  {
    "id": 42809268,
    "title": "ஒரு க்யூஆர் குறியீடு, இது உங்களை வேறு இடத்திற்குக் கொண்டு செல்கிறது – லென்டிகுலர் மற்றும் எதிர்மறை",
    "originLink": "https://mstdn.social/@isziaui/113874436953157913",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42809268",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "QR குறியீடுகள், ஸ்கேன் செய்யும் நிலைமைகளின் அடிப்படையில் மாறும் ஒட்டுமொத்த வடிவங்களை உருவாக்குவதன் மூலம் பயனர்களை வெவ்வேறு இடங்களுக்கு வழிநடத்த முடியும்.",
      "இந்த நுட்பத்தை இலக்கு வைக்கப்பட்ட தாக்குதல்களுக்கு அல்லது மாறுபட்ட உள்ளடக்கத்தை வழங்க பயன்படுத்தலாம், ஆனால் சர்வர்-சைடு மறுவழிமாற்றம் போன்ற எளிய முறைகள் பெரும்பாலும் அதிக பயனுள்ளதாக இருக்கும்.",
      "அதன் கவர்ச்சிகரமான தன்மைக்கு மாறாக, இந்த QR குறியீட்டு மாற்றத்தின் நடைமுறை பயன்பாடு அதன் சிக்கல்தன்மை மற்றும் காட்சியளிக்கும் தன்மை காரணமாக வரையறுக்கப்பட்டுள்ளது."
    ],
    "points": 499,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1737676534
  },
  {
    "id": 42810176,
    "title": "விம் மாநிலம்",
    "originLink": "https://lwn.net/Articles/1002342/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42810176",
    "commentBody": "",
    "originSummary": [
      "பிராம் மூலனார், விம் நிறுவனர், 2023 இல் மரணமடைந்ததைத் தொடர்ந்து, விம் வளர்ச்சியைத் தொடர்வதற்காக சமூகம் மறுசீரமைக்கப்பட்டுள்ளது, இதில் கிறிஸ்டியன் பிராபாண்ட்ட் அதிக பங்கு வகிக்கிறார். இந்த திட்டம் விம் கித்ஹப் அமைப்பை நிர்வகித்தல், இணையதளத்தை புதுப்பித்தல் மற்றும் XDG ஆதரவு போன்ற மாற்றங்களை பரிசீலித்தல் போன்ற சவால்களை எதிர்கொள்கிறது, அதே நேரத்தில் பராமரிப்பு முறையில் உள்ளது. டோக்கியோவில் நடைபெற்ற விம் கான்ஃபரன்ஸ் 2024 சர்வதேச ஒத்துழைப்பை முன்னிறுத்தியது, ஆங்கிலம் மற்றும் ஜப்பானிய மொழிகளில் வழங்கப்பட்ட பிரசங்கங்களுடன், சமூகத்தின் கருத்துக்களை மற்றும் ஒரு தலைவரின் அணுகுமுறையை விட கவனமாக சோதனை செய்வதை வலியுறுத்தியது."
    ],
    "commentSummary": [
      "\"விம்\" இன் புதிய தலைமையின் கீழ் வெற்றி, BDFL (Benevolent Dictator For Life) போன்ற ஆட்சி முறைமைகள் பற்றிய விவாதங்களை தூண்டியுள்ளது, ஒற்றை தலைமையினை எதிர்த்து குழு அடிப்படையிலான அணுகுமுறைகள் பற்றிய மாறுபட்ட கருத்துக்களுடன்.",
      "TEXT: நியோவிம், விம் என்பதற்கான ஒரு நவீன மாற்று, அதன் அம்சங்கள் மற்றும் சமூக ஆதரவினால் பிரபலமடைந்துள்ளது, ஆனால் சில பயனர்கள் அதன் நிலைத்தன்மைக்காக விம் மீது நம்பிக்கையுடன் உள்ளனர். TEXT:",
      "இந்த உரையாடல் திறந்த மூல திட்டங்களை நிலைநிறுத்துவதற்கான சவால்கள் மற்றும் செருகுநிரல் கட்டமைப்புகளின் நன்மைகளை வெளிப்படுத்துகிறது, மேலும் Vim மற்றும் Emacs ஆகியவை வளர்ந்து வரும் டெவலப்பர் கருவிகளின் சூழலில் தொடர்ந்து நிலைத்திருக்கின்றன."
    ],
    "points": 245,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737688970
  },
  {
    "id": 42810300,
    "title": "UI என்பது நரகம்: நான்கு செயல்பாட்டு கணக்குப்பதிவிகள்",
    "originLink": "https://lcamtuf.substack.com/p/ui-is-hell-four-function-calculators",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42810300",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும்: இந்த கட்டுரை அடிப்படை கணக்குப்பிரிப்புகளுக்கான பயனர் இடைமுகங்களை வடிவமைப்பதில் உள்ள சிக்கல்களை ஆராய்கிறது, செயல்பாடுகள் மற்றும் விளிம்பு வழக்குகளுடன் உள்ள சவால்களை மையமாகக் கொண்டு. இது \"x÷\" இணைந்த விசை மற்றும் சில பயன்பாடுகளில் உள்ள புரியாத செயல்பாடுகள் போன்ற கணக்குப்பிரிப்பு வடிவமைப்பில் உள்ள வரலாற்று விசித்திரங்களை வெளிப்படுத்துகிறது. விவாதம் கணக்குகளை எளிமைப்படுத்தவும், குழப்பத்தை குறைக்கவும் ரிவர்ஸ் போலிஷ் குறியீட்டு (RPN) நன்மைகளை, பயனர் அனுபவங்கள் மற்றும் விருப்பங்களை உள்ளடக்கியது."
    ],
    "points": 192,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1737690379
  },
  {
    "id": 42812641,
    "title": "அதை நீங்களே கட்டுங்கள்",
    "originLink": "https://lucumr.pocoo.org/2025/1/24/build-it-yourself/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42812641",
    "commentBody": "",
    "originSummary": [
      "ஆர்மின் ரோனாசர் மென்பொருள் மேம்பாட்டில், குறிப்பாக ஜாவாஸ்கிரிப்ட் மற்றும் ரஸ்ட் சூழல்களில், அடிக்கடி புதுப்பிப்புகள் மற்றும் பல்வேறு சார்புகள் பாதுகாப்பு பாதிப்புகள் மற்றும் சிக்கல்களை ஏற்படுத்தக்கூடிய நிலையைப் பற்றி பேசுகிறார்.",
      "அவர் குறைந்த சார்புகளுடன் குறியீடு எழுதுவதற்கான மாற்றத்தை பரிந்துரைக்கிறார், விரிவான சார்பு வரைபடங்களுக்குப் பதிலாக நிலையான, சுயமாக எழுதப்பட்ட செயல்பாடுகளின் நன்மைகளை வலியுறுத்துகிறார்.",
      "ரொனாசர் நிறுவன மற்றும் திறந்த மூல சமூகங்களில் எளிமை மற்றும் நிலைத்தன்மையை முன்னுரிமையாகக் கொண்ட குறியீட்டு நடைமுறைகளை முன்னேற்றுவதற்கான கலாச்சார மாற்றத்தை அழைக்கிறார், இது பராமரிப்பு குறைவாகவும், விரைவான செயல்படுத்தலையும் ஏற்படுத்த முடியும்."
    ],
    "commentSummary": [
      "உரை நிரலாக்கத்தில் சார்புகளை நிர்வகிக்கும் சவால்களை விளக்குகிறது, ரஸ்ட் மொழியின் சார்புகளை அதிகரிக்கும் பழக்கத்தை C++ மொழியின் அவற்றை கட்டுப்படுத்தும் திறனுடன் ஒப்பிடுகிறது.",
      "இது தொகுப்பு மேலாண்மை அமைப்புகளுடன் தொடர்புடைய பாதுகாப்பு கவலைகளை விவரிக்கிறது, குறிப்பாக Debian/Ubuntu அமைப்புகளை Docker/Python/Rust உடன் ஒப்பிட்டு, தெரியாத பராமரிப்பாளர்களுடன் நம்பிக்கை பிரச்சினைகளை எழுப்புகிறது.",
      "உரையாடல், நீண்டகால விளைவுகளை கருத்தில் கொண்டு, சிக்கல்களை மற்றும் பாதுகாப்பு ஆபத்துகளை குறைக்க, உள்ளமைந்த நூலகங்களைப் பயன்படுத்துவதையும் தனிப்பயன் குறியீடுகளை எழுதுவதையும் சமநிலைப்படுத்துவதின் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "points": 190,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1737723335
  }
]
