[
  {
    "id": 42809268,
    "title": "एक क्यूआर कोड जो आपको एक अलग गंतव्य पर भेजता है लेंटिक्युलर और प्रतिकूल",
    "originLink": "https://mstdn.social/@isziaui/113874436953157913",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42809268",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "क्यूआर कोड्स को इस तरह से बदला जा सकता है कि वे उपयोगकर्ताओं को विभिन्न गंतव्यों की ओर निर्देशित करें, इसके लिए ओवरलैपिंग पैटर्न बनाए जाते हैं जो स्कैनिंग की स्थिति के आधार पर बदलते हैं।",
      "इस तकनीक का उपयोग लक्षित हमलों के लिए या विविध सामग्री प्रदान करने के लिए किया जा सकता है, लेकिन सर्वर-साइड रीडायरेक्शन जैसी सरल विधियाँ अक्सर अधिक प्रभावी होती हैं।",
      "इसके पेचीदा स्वभाव के बावजूद, इस क्यूआर कोड हेरफेर का व्यावहारिक उपयोग इसकी जटिलता और दृश्यता के कारण सीमित है।"
    ],
    "points": 499,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1737676534
  },
  {
    "id": 42810176,
    "title": "विम की स्थिति",
    "originLink": "https://lwn.net/Articles/1002342/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42810176",
    "commentBody": "",
    "originSummary": [
      "2023 में विम के संस्थापक ब्रैम मोलनार के निधन के बाद, समुदाय ने विम के विकास की निरंतरता सुनिश्चित करने के लिए पुनर्गठन किया है, जिसमें क्रिश्चियन ब्राबांट ने अधिक सक्रिय भूमिका निभाई है। परियोजना चुनौतियों का सामना कर रही है जैसे कि विम गिटहब संगठन का प्रबंधन, वेबसाइट को अपडेट करना, और XDG समर्थन जैसे परिवर्तनों पर विचार करना, जबकि यह रखरखाव मोड में बनी हुई है। टोक्यो में विमकॉनफ 2024 ने अंतरराष्ट्रीय सहयोग को उजागर किया, जिसमें अंग्रेजी और जापानी में प्रस्तुतियाँ शामिल थीं, और एकल नेता दृष्टिकोण के बजाय सामुदायिक इनपुट और सावधानीपूर्वक परीक्षण पर जोर दिया।"
    ],
    "commentSummary": [
      "विम की नई नेतृत्व के तहत सफलता ने शासन मॉडल पर चर्चाओं को जन्म दिया है, जैसे कि बीडीएफएल (बेनवोलेंट डिक्टेटर फॉर लाइफ), जिसमें एकल नेतृत्व बनाम समिति-आधारित दृष्टिकोणों पर विभिन्न राय हैं।",
      "विम के आधुनिक विकल्प के रूप में नियोविम ने अपनी विशेषताओं और समुदाय समर्थन के कारण लोकप्रियता हासिल की है, हालांकि कुछ उपयोगकर्ता इसकी स्थिरता के लिए विम के प्रति वफादार बने हुए हैं।",
      "यह बातचीत ओपन-सोर्स परियोजनाओं को बनाए रखने की चुनौतियों और प्लगइन आर्किटेक्चर के फायदों को उजागर करती है, जिसमें Vim और Emacs डेवलपर टूल्स के विकसित होते परिदृश्य में लचीले बने हुए हैं।"
    ],
    "points": 245,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1737688970
  },
  {
    "id": 42810300,
    "title": "यूआई नर्क है: चार-कार्य कैल्कुलेटर",
    "originLink": "https://lcamtuf.substack.com/p/ui-is-hell-four-function-calculators",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42810300",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "लेख बुनियादी कैलकुलेटरों के लिए उपयोगकर्ता इंटरफेस डिजाइन करने में जटिलताओं की जांच करता है, विशेष रूप से संचालन और किनारे के मामलों के साथ चुनौतियों पर ध्यान केंद्रित करता है। यह कैलकुलेटर डिजाइन में ऐतिहासिक विचित्रताओं को उजागर करता है, जैसे कि संयुक्त \"x÷\" कुंजी और कुछ ऐप्स में गैर-सहज व्यवहार। चर्चा में गणनाओं को सरल बनाने और अस्पष्टता को कम करने के लिए रिवर्स पोलिश नोटेशन (RPN) के लाभों के साथ-साथ उपयोगकर्ता अनुभव और प्राथमिकताएं शामिल हैं।"
    ],
    "points": 192,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1737690379
  },
  {
    "id": 42812641,
    "title": "इसे स्वयं बनाएं",
    "originLink": "https://lucumr.pocoo.org/2025/1/24/build-it-yourself/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42812641",
    "commentBody": "",
    "originSummary": [
      "आर्मिन रोनाचर सॉफ्टवेयर विकास में निर्भरता के बदलाव की समस्या को संबोधित करते हैं, विशेष रूप से जावास्क्रिप्ट और रस्ट पारिस्थितिक तंत्र में, जहां बार-बार अपडेट और कई निर्भरताएं सुरक्षा कमजोरियों और जटिलता का कारण बन सकती हैं।",
      "वह न्यूनतम निर्भरताओं के साथ कोड लिखने की दिशा में बदलाव का सुझाव देते हैं, स्थिर, स्वयं-लिखित कार्यों के लाभों पर जोर देते हुए, जो व्यापक निर्भरता ग्राफ के बजाय होते हैं।",
      "रोनाचर ने कॉर्पोरेट और ओपन-सोर्स समुदायों में सांस्कृतिक परिवर्तन का आह्वान किया है ताकि कोडिंग प्रथाओं में सरलता और स्थिरता को प्राथमिकता दी जा सके, जिससे रखरखाव में कमी और तेजी से कार्यान्वयन हो सकता है।"
    ],
    "commentSummary": [
      "पाठ प्रोग्रामिंग में निर्भरताओं के प्रबंधन की चुनौतियों को उजागर करता है, जिसमें रस्ट की निर्भरताओं को इकट्ठा करने की प्रवृत्ति की तुलना सी++ की उन पर नियंत्रण के साथ की जाती है।",
      "यह पैकेज प्रबंधन प्रणालियों से संबंधित सुरक्षा चिंताओं पर चर्चा करता है, जिसमें Debian/Ubuntu की प्रणालियों की तुलना Docker/Python/Rust से की जाती है, और अज्ञात मेंटेनरों के साथ विश्वास के मुद्दों को उठाता है।",
      "वार्तालाप इस बात पर जोर देता है कि जटिलता और सुरक्षा जोखिमों को कम करने के लिए मौजूदा लाइब्रेरी के उपयोग को कस्टम कोड लिखने के साथ संतुलित करना कितना महत्वपूर्ण है, दीर्घकालिक प्रभावों को ध्यान में रखते हुए।"
    ],
    "points": 190,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1737723335
  }
]
