[
  {
    "id": 42780816,
    "title": "0-क्लिक गुमनामी हटाने का हमला जो सिग्नल, डिस्कॉर्ड, और अन्य प्लेटफार्मों को लक्षित करता है",
    "originLink": "https://gist.github.com/hackermondev/45a3cdfa52246f1d1201c1e8cdef6117",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780816",
    "commentBody": "",
    "originSummary": [
      "एक 15 वर्षीय हाई स्कूल छात्र ने क्लाउडफ्लेयर के कैशिंग सिस्टम का उपयोग करके एक 0-क्लिक डीनोनिमाइजेशन हमला खोजा, जो उपयोगकर्ताओं को 250 मील की त्रिज्या के भीतर स्थित कर सकता है। यह भेद्यता सिग्नल और डिस्कॉर्ड जैसे लोकप्रिय ऐप्स को प्रभावित करती है, जिससे हमलावर उपयोगकर्ताओं को उनकी सहमति के बिना ट्रैक कर सकते हैं। इस मुद्दे की रिपोर्ट करने के बावजूद, क्लाउडफ्लेयर द्वारा केवल एक संबंधित बग को पैच किया गया, जिससे मुख्य भेद्यता अनसुलझी रह गई, जो उपयोगकर्ताओं, विशेष रूप से पत्रकारों और कार्यकर्ताओं, को उनकी गोपनीयता के प्रति सतर्क रहने की आवश्यकता को उजागर करती है।"
    ],
    "commentSummary": [
      "एक 0-क्लिक डीनोनिमाइजेशन हमला क्लाउडफ्लेयर के कैशिंग सिस्टम का उपयोग करता है, जैसे कि सिग्नल और डिस्कॉर्ड पर, जिससे कैश स्थिति की जांच करके प्राप्तकर्ता के मोटे स्थान का पता चल सकता है। इस हमले के लिए सर्वर नियंत्रण की आवश्यकता नहीं होती, केवल एक अद्वितीय URL की आवश्यकता होती है, और यह महत्वपूर्ण मेटाडेटा को उजागर कर सकता है, जो इन सुरक्षित संचार प्लेटफार्मों के उपयोगकर्ताओं के लिए गोपनीयता चिंताओं को बढ़ाता है। सुरक्षा रणनीतियों में वर्चुअल प्राइवेट नेटवर्क्स (VPNs) का उपयोग करना या ऑटो-डाउनलोड्स को अक्षम करना शामिल है ताकि उपयोगकर्ता की गोपनीयता की रक्षा की जा सके।"
    ],
    "points": 557,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1737471584
  },
  {
    "id": 42778266,
    "title": "स्टार्टअप विंटर: हैकर न्यूज़ ने अपना विश्वास खो दिया",
    "originLink": "https://www.vincentschmalbach.com/startup-winter-hacker-news-lost-its-faith/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42778266",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "हैकर न्यूज़ ने एक स्टार्टअप-केंद्रित समुदाय से एक व्यापक तकनीकी मंच में परिवर्तन किया है, जो उपयोगकर्ता की रुचियों में सामान्य तकनीकी विषयों की ओर बदलाव को दर्शाता है।",
      "इस बदलाव के परिणामस्वरूप स्टार्टअप्स के प्रति उत्साह में कमी आई है, जिसमें उपयोगकर्ता वेंचर कैपिटल (वीसी) मॉडल और नवीन विचारों की कमी के प्रति संदेह व्यक्त कर रहे हैं।",
      "स्टार्टअप्स में काम करने के वित्तीय लाभों को अक्सर संदेह की दृष्टि से देखा जाता है, क्योंकि कई कर्मचारियों को महत्वपूर्ण रिटर्न नहीं मिलता है, जो तकनीकी समुदाय के भीतर प्राथमिकताओं में बदलाव का संकेत देता है।"
    ],
    "points": 455,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1737453607
  },
  {
    "id": 42774221,
    "title": "कॉल ऑफ ड्यूटी एंटी-चीट का रिवर्स इंजीनियरिंग",
    "originLink": "https://ssno.cc/posts/reversing-tac-1-4-2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774221",
    "commentBody": "",
    "originSummary": [
      "ब्लैक ऑप्स कोल्ड वॉर में ट्रेयार्क एंटी-चीट (TAC) एक यूजर-मोड एंटी-चीट सिस्टम है, जिसमें मॉडर्न वॉरफेयर के रिकोशे में पाए जाने वाले कर्नल-मोड घटक की कमी है। TAC अस्पष्टता के लिए Arxan का उपयोग करता है, जो रनटाइम निष्पादन योग्य डिक्रिप्शन, निष्पादन योग्य चेकसम और पॉइंटर एन्क्रिप्शन जैसी तकनीकों के माध्यम से रिवर्स इंजीनियरिंग को जटिल बनाता है। प्रमुख एंटी-चीट विशेषताओं में API हुकिंग का पता लगाना, डिबग रजिस्टर, नेटवर्क ट्रैफिक मॉनिटरिंग, और बाहरी ओवरले शामिल हैं, साथ ही विभिन्न एंटी-डिबगिंग तकनीकें और हुक को बायपास करने के लिए कस्टम सिस्टम कॉल स्टब्स भी शामिल हैं।"
    ],
    "commentSummary": [
      "उपयोगकर्ता CS:GO और Call of Duty जैसे खेलों में एंटी-चीट समस्याओं का सामना कर रहे हैं, विशेष रूप से उन लिनक्स उपयोगकर्ताओं के लिए जिनके पास विशेष हार्डवेयर है। चर्चा में झूठे प्रतिबंध, नैतिक चिंताएं, और वर्तमान एंटी-चीट सिस्टम की प्रभावशीलता जैसी चुनौतियों को उजागर किया गया है, जो निष्पक्ष गेमप्ले को प्रभावित कर रही हैं। व्यक्तिगत कहानियाँ झूठे आरोपों को संबोधित करने और गेमिंग अनुभवों को बेहतर बनाने के लिए बेहतर समाधानों की आवश्यकता पर जोर देती हैं।"
    ],
    "points": 442,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737414430
  },
  {
    "id": 42772995,
    "title": "क्या एलन मस्क ने ट्रंप के उद्घाटन समारोह में 'सीग हाइल' की मुद्रा अपनाई?",
    "originLink": "https://www.jpost.com/international/article-838444",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772995",
    "commentBody": "",
    "originSummary": [
      "एलन मस्क को ट्रंप के उद्घाटन समारोह में एक इशारा करते हुए देखा गया, जिसे कुछ लोगों ने नाजी सलामी के रूप में व्याख्यायित किया, जिससे सोशल मीडिया पर विवाद उत्पन्न हो गया। एंटी-डिफेमेशन लीग (एडीएल) ने सुझाव दिया कि यह इशारा संभवतः एक अजीब क्षण था न कि एक जानबूझकर किया गया सलामी, और कुछ ने इसे मस्क के एस्परगर सिंड्रोम से जोड़ा। मस्क ने इस विवाद पर हंसते हुए इमोजी के साथ प्रतिक्रिया दी और ट्रंप के मंगल ग्रह के उल्लेख के प्रति उत्साह व्यक्त किया, जो उनके अंतरिक्ष अन्वेषण लक्ष्यों के साथ मेल खाता है।"
    ],
    "commentSummary": [
      "एलन मस्क पर ट्रंप के उद्घाटन समारोह में नाजी सलामी देने का आरोप लगाया गया, जिससे हैकर न्यूज़ पर इस तरह के विषयों पर चर्चा की उपयुक्तता को लेकर बहस छिड़ गई। कुछ उपयोगकर्ताओं ने तर्क दिया कि मस्क का तकनीकी उद्योग में प्रभाव इस विषय को प्रासंगिक बनाता है, जबकि अन्य ने महसूस किया कि यह मंच के लिए अनुचित था। इस चर्चा ने सेंसरशिप पर विभिन्न रायों और तकनीकी समुदाय के भीतर मस्क की कार्रवाइयों के प्रभावों को उजागर किया।"
    ],
    "points": 283,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1737406930
  },
  {
    "id": 42773778,
    "title": "एलन मस्क ने उद्घाटन रैली में लगातार फासीवादी सलामी देने का संकेत दिया।",
    "originLink": "https://www.theguardian.com/technology/2025/jan/20/trump-elon-musk-salute",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42773778",
    "commentBody": "",
    "originSummary": [
      "एलोन मस्क को डोनाल्ड ट्रंप के उद्घाटन समारोह के दौरान एक इशारा करने के लिए आलोचना का सामना करना पड़ा, जो कुछ लोगों ने फासीवादी-शैली की सलामी के रूप में देखा, जिसे कुछ ने नाजी सलामी के रूप में व्याख्यायित किया।",
      "एंटी-डिफेमेशन लीग ने इस इशारे की नाजी सलामी से समानता को स्वीकार किया, लेकिन बाद में इसे उत्साह के एक अजीब क्षण के रूप में सुझाया, जिससे एलेक्जेंड्रिया ओकासियो-कोर्टेज़ की आलोचना हुई।",
      "मस्क की कार्रवाइयों का कुछ दूर-दराज़ के व्यक्तियों द्वारा स्वागत किया गया, जिससे उनकी राजनीतिक संबद्धताओं और इरादों के बारे में बहसें तेज हो गईं।"
    ],
    "commentSummary": [
      "एलन मस्क के उद्घाटन रैली में किए गए इशारे, जिन्हें कुछ लोगों ने फासीवादी सलामी के रूप में देखा, ने विवाद और ऑनलाइन बहस को जन्म दिया है। इस घटना ने हैकर न्यूज़ पर एक चिह्नित चर्चा को जन्म दिया, जिससे मंच की मॉडरेशन और सेंसरशिप नीतियों पर बहस छिड़ गई। यह स्थिति राजनीतिक विमर्श में प्रभावशाली तकनीकी हस्तियों की भूमिका और हैकर न्यूज़ जैसे प्लेटफार्मों पर मॉडरेशन नीतियों की स्थिरता के बारे में सवाल उठाती है।"
    ],
    "points": 238,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1737411660
  },
  {
    "id": 42777938,
    "title": "मेटा इंस्टाग्राम पर '#डेमोक्रेट' को सेंसर कर रहा है",
    "originLink": "https://mstdn.chrisalemany.ca/@chris/113864600222476627",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777938",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "मेटा कथित तौर पर इंस्टाग्राम पर हैशटैग '#Democrat' को सेंसर कर रहा है, जिससे सोशल मीडिया प्लेटफॉर्म्स पर सेंसरशिप और इसके प्रभावों के बारे में चर्चाएं हो रही हैं।",
      "यूके, स्पेन और जर्मनी जैसे कई देशों के उपयोगकर्ताओं ने इस समस्या का अनुभव किया है, हालांकि कुछ रिपोर्ट करते हैं कि इसे हल कर दिया गया है।",
      "यह घटना सोशल मीडिया प्लेटफॉर्म्स के प्रभाव और सामग्री मॉडरेशन और सेंसरशिप के बीच नाजुक संतुलन के बारे में चिंताओं को उजागर करती है, जिसमें अभिव्यक्ति की स्वतंत्रता और संभावित राजनीतिक पक्षपात पर बहस शामिल है।"
    ],
    "points": 224,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1737450496
  },
  {
    "id": 42779776,
    "title": "स्थानीय समुदायों को बिना फेसबुक के संगठित करें?",
    "originLink": "https://news.ycombinator.com/item?id=42779776",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779776",
    "commentBody": "",
    "originSummary": [
      "व्यक्ति स्थानीय समुदाय की बातचीत को फेसबुक से एक स्व-होस्टेड, संघीय प्लेटफॉर्म पर स्थानांतरित करने की कोशिश कर रहा है, जो विकेंद्रीकृत नियंत्रण और प्रबंधन की अनुमति देता है।",
      "वे इस कदम को सुगम बनाने के लिए तैयार समाधानों या सहयोगियों की तलाश कर रहे हैं, जो यह दर्शाता है कि उन्हें सुलभ और अनुकूलन योग्य विकल्पों की आवश्यकता है।",
      "संदर्भ में ग्रामीण क्षेत्र शामिल हैं जिनमें कई छोटे शहर हैं, प्रत्येक की जनसंख्या लगभग 50,000 है, जो कनेक्टिविटी और सामुदायिक भागीदारी के महत्व को उजागर करता है।"
    ],
    "commentSummary": [
      "लेखक स्थानीय समुदायों को फेसबुक से एक स्व-होस्टेड, संघीय प्लेटफॉर्म पर स्थानांतरित करने की कोशिश कर रहे हैं, जिसमें इवेंट कैलेंडर और मैसेजिंग जैसी सुविधाओं की आवश्यकता पर जोर दिया गया है। मास्टोडन जैसे विकल्प फेसबुक की कार्यक्षमता को पूरी तरह से दोहरा नहीं सकते, जिससे डिस्कोर्स, नेक्स्टडोर, या groups.io जैसे अन्य प्लेटफार्मों पर विचार करने की आवश्यकता होती है। यह महत्वपूर्ण है कि समुदाय की स्थानांतरित होने की रुचि का मूल्यांकन किया जाए और यह सुनिश्चित किया जाए कि नया प्लेटफॉर्म उनकी आवश्यकताओं के अनुरूप हो, जिसमें स्थानीय समाचार पत्र और ईमेल सूचियों जैसे विकल्पों पर भी विचार किया जा रहा है।"
    ],
    "points": 217,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1737465542
  },
  {
    "id": 42780022,
    "title": "मेटाकॉग्निटिव आलस्य: जनरेटिव एआई का सीखने की प्रेरणा पर प्रभाव",
    "originLink": "https://bera-journals.onlinelibrary.wiley.com/doi/10.1111/bjet.13544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780022",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक अध्ययन में यह बताया गया है कि जनरेटिव एआई उपकरण, जैसे कि ChatGPT, \"मेटाकॉग्निटिव आलस्य\" की ओर ले जा सकते हैं, जहां उपयोगकर्ता एआई पर अत्यधिक निर्भर हो जाते हैं, जिससे आत्म-नियंत्रित सीखने में कमी आती है। इस एआई पर निर्भरता से गहन सीखने और आलोचनात्मक सोच कौशल में कमी आ सकती है, क्योंकि शिक्षार्थी जानकारी को समझने और मूल्यांकन करने में सक्रिय रूप से शामिल नहीं हो सकते। जबकि एआई कार्य दक्षता को बढ़ा सकता है, अध्ययन इस बात पर जोर देता है कि शिक्षार्थियों को आवश्यक संज्ञानात्मक कौशल विकसित करने के लिए सीखने की प्रक्रिया में सक्रिय रूप से भाग लेना चाहिए।"
    ],
    "points": 213,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1737467238
  },
  {
    "id": 42772983,
    "title": "आधिकारिक डीपसीक R1 अब ओलामा पर उपलब्ध है",
    "originLink": "https://ollama.com/library/deepseek-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772983",
    "commentBody": "",
    "originSummary": [
      "डीपसीक ने अपनी पहली पीढ़ी के तर्क मॉडल पेश किए हैं, जो गणित, कोड और तर्क से संबंधित कार्यों में ओपनएआई-o1 के बराबर प्रदर्शन करते हैं। इन मॉडलों का आकार काफी भिन्न होता है, 1.5 बिलियन से 671 बिलियन पैरामीटर तक, जो विविध भंडारण आवश्यकताओं को दर्शाता है। ये मॉडल एमआईटी लाइसेंस के तहत उपलब्ध हैं, जो व्यापक उपयोग और संशोधन की अनुमति देते हैं।"
    ],
    "commentSummary": [
      "डीपसीक आर1, एक नया भाषा मॉडल, अब ओलामा पर उपलब्ध है, जिससे इसके सेंसरशिप के बारे में चर्चाएं हो रही हैं, विशेष रूप से तियानमेन स्क्वायर जैसे संवेदनशील राजनीतिक विषयों पर।",
      "बहस का केंद्र राजनीतिक शुद्धता और ऐतिहासिक सटीकता के बीच संतुलन पर है, जिसमें भाषा मॉडलों में राजनीतिक पूर्वाग्रह के संदर्भ में पश्चिमी और चीनी दृष्टिकोणों की तुलना की जाती है।",
      "ओपन-सोर्स मॉडल को सेंसरशिप का मुकाबला करने के लिए एक संभावित समाधान के रूप में सुझाया गया है, हालांकि इस तरह के उपायों की प्रभावशीलता और प्रभावों पर राय भिन्न होती है।"
    ],
    "points": 210,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1737406824
  },
  {
    "id": 42779147,
    "title": "लोग यह रिपोर्ट करने में अच्छे नहीं होते कि वे क्या खाते हैं। यह आहार संबंधी अनुसंधान के लिए एक समस्या है।",
    "originLink": "https://www.science.org/content/article/people-are-bad-reporting-what-they-eat-s-problem-dietary-research",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779147",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "भोजन की खपत को सटीक रूप से रिपोर्ट करना चुनौतीपूर्ण है, क्योंकि लोग अक्सर भाग के आकार का औसतन 53% गलत अनुमान लगाते हैं, यहां तक कि प्रशिक्षित पेशेवरों के बीच भी। तेल और वसा जैसे छिपे हुए अवयव भाग के आकार की त्रुटियों की तुलना में कम समस्याग्रस्त होते हैं, जो भोजन के तराजू जैसे सटीक माप उपकरणों की आवश्यकता को उजागर करते हैं। नई तकनीकें और ऐप्स, जैसे कि SnapCalorie, आहार ट्रैकिंग की सटीकता में सुधार करने का लक्ष्य रखते हैं, हालांकि वे अक्सर उच्च परिचालन लागत के कारण सदस्यता की आवश्यकता होती है, जो उपयोगकर्ताओं को अधिक जागरूक आहार विकल्प बनाने में मदद कर सकते हैं।"
    ],
    "points": 206,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1737460490
  },
  {
    "id": 42772170,
    "title": "ROCm डिवाइस समर्थन इच्छासूची",
    "originLink": "https://github.com/ROCm/ROCm/discussions/4276",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772170",
    "commentBody": "",
    "originSummary": [
      "ROCm समुदाय की प्रतिक्रिया एकत्र कर रहा है ताकि यह निर्धारित किया जा सके कि भविष्य के अपडेट में किन GPUs का समर्थन किया जाए, जिसकी वर्तमान संगतता विवरण उनकी वेबसाइट पर उपलब्ध है। उपयोगकर्ता व्यापक समर्थन की वकालत कर रहे हैं, विशेष रूप से पुराने और उपभोक्ता-ग्रेड GPUs के लिए, और Windows सिस्टम के साथ बेहतर एकीकरण के लिए। सभी आर्किटेक्चर में लगातार समर्थन की मजबूत मांग है, AI अनुप्रयोगों के लिए VRAM के महत्व पर जोर देते हुए, और AMD के APU समर्थन में सुधार और NVIDIA के CUDA के समान एक विकास प्रक्रिया के लिए आह्वान किया जा रहा है।"
    ],
    "commentSummary": [
      "ROCm, AMD के सॉफ़्टवेयर प्लेटफ़ॉर्म जो GPU प्रोग्रामिंग के लिए है, को इसके हार्डवेयर-विशिष्ट कोड संकलन के लिए आलोचना का सामना करना पड़ता है, जिसके परिणामस्वरूप Nvidia के CUDA की तुलना में असंगत GPU समर्थन होता है।",
      "उपयोगकर्ता AMD के GPU के लिए दीर्घकालिक समर्थन की कमी से निराश हैं, कुछ को खरीद के तुरंत बाद समर्थन में कमी का सामना करना पड़ता है, जिससे बेहतर क्रॉस-प्लेटफ़ॉर्म समर्थन और बेहतर दस्तावेज़ीकरण की मांग उठ रही है।",
      "समुदाय एएमडी से आग्रह करता है कि वह सभी जीपीयू का समर्थन करे, जैसा कि एनवीडिया करता है, और कुछ उपयोगकर्ताओं ने जीपीयू बाजार में बेहतर प्रतिस्पर्धा के लिए अपनी उम्मीदें इंटेल पर स्थानांतरित कर दी हैं।"
    ],
    "points": 195,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1737401463
  },
  {
    "id": 42775029,
    "title": "रफ: रस्ट में लिखा गया पायथन लिंटर और कोड फॉर्मेटर",
    "originLink": "https://github.com/astral-sh/ruff",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42775029",
    "commentBody": "",
    "originSummary": [
      "रफ डॉक्सप्लेग्राउंड एक पायथन लिंटर और कोड फॉर्मेटर है जो रस्ट में लिखा गया है, और यह पारंपरिक टूल्स जैसे फ्लेक8 और ब्लैक की तुलना में 10-100 गुना तेज गति प्रदान करता है। यह पायथन 3.13 का समर्थन करता है, और वीएस कोड जैसे संपादकों के साथ एकीकृत होता है, और फ्लेक8, ब्लैक, और इसॉर्ट जैसे कई टूल्स को बदल सकता है, जबकि यह मोनोरिपो-फ्रेंडली भी है। रफ को प्रमुख परियोजनाओं जैसे अपाचे एयरफ्लो, फास्टएपीआई, और पांडा में व्यापक रूप से अपनाया गया है, और यह पिप, पिपएक्स, और अन्य पैकेज मैनेजर्स के माध्यम से इंस्टॉलेशन के लिए उपलब्ध है, जिसमें पायप्रोजेक्ट.टॉमल के माध्यम से कॉन्फ़िगरेशन समर्थन है।"
    ],
    "commentSummary": [
      "रफ एक पायथन लिंटर और कोड फॉर्मेटर है जिसे रस्ट में विकसित किया गया है, जो अपनी गति और दक्षता के लिए जाना जाता है। यह कई उपकरणों को एक में एकीकृत करके पायथन विकास को सरल बनाता है।",
      "इस उपकरण ने पायथन समुदाय के भीतर रुचि और बहस को जन्म दिया है, कुछ डेवलपर्स इसकी प्रदर्शन क्षमता और सरलता की सराहना कर रहे हैं, जबकि अन्य नए उपकरणों के प्रति संदेहपूर्ण बने हुए हैं।",
      "रफ का विकास एस्ट्रल द्वारा, जो एक वेंचर कैपिटल समर्थित संगठन है, इसकी जिज्ञासा और चर्चा में इजाफा करता है, विशेष रूप से इसके प्रभाव के संदर्भ में जब बात आती है पायथन की डायनामिक टाइपिंग और बड़े प्रोजेक्ट्स में टाइप चेकर और लिंटर के उपयोग की।"
    ],
    "points": 185,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1737420581
  },
  {
    "id": 42777857,
    "title": "किमी K1.5: LLMs के साथ सुदृढीकरण शिक्षण का विस्तार",
    "originLink": "https://github.com/MoonshotAI/Kimi-k1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777857",
    "commentBody": "",
    "originSummary": [
      "Kimi k1.5 एक अत्याधुनिक मल्टी-मोडल मॉडल है जो शॉर्ट-चेन-ऑफ-थॉट (CoT) कार्यों में GPT-4o और Claude Sonnet 3.5 से काफी बेहतर प्रदर्शन करता है, जिसमें AIME, MATH-500, और LiveCodeBench जैसे बेंचमार्क पर 550% तक सुधार होता है।",
      "यह विभिन्न रूपों में लंबे-समय के प्रदर्शन में OpenAI के o1 से मेल खाता है, जिसमें लंबे संदर्भ स्केलिंग और उन्नत नीति अनुकूलन के साथ सुदृढीकरण सीखने का उपयोग किया जाता है, जबकि मोंटे कार्लो ट्री सर्च जैसी जटिल विधियों से बचा जाता है।",
      "Kimi k1.5 को पाठ और दृष्टि डेटा दोनों पर प्रशिक्षित किया गया है, जिससे संयुक्त तर्क संभव हो सके, और यह जल्द ही Kimi OpenPlatform के माध्यम से https://kimi.ai पर उपलब्ध होगा।"
    ],
    "commentSummary": [
      "कंपनियाँ, जिनमें कुछ चीन से भी हैं, GitHub का उपयोग उत्पादों को बढ़ावा देने के लिए कर रही हैं, जिसमें वे \"शोध पत्र\" और कोड नमूने पोस्ट कर रही हैं, लेकिन वास्तविक सॉफ़्टवेयर डेवलपमेंट किट्स (SDKs) या लाइब्रेरीज़ प्रदान नहीं कर रही हैं।",
      "इस प्रथा को भ्रामक माना जाता है, जैसे कि झूठा विज्ञापन, क्योंकि वादा किए गए एपीआई (एप्लिकेशन प्रोग्रामिंग इंटरफेस) या मॉडल वेट्स अक्सर साकार नहीं होते हैं।",
      "GitHub रिपॉजिटरी का उपयोग प्रचार उपकरण के रूप में करने की प्रवृत्ति, कभी-कभी स्रोत कोड की कमी के साथ, एआई अनुसंधान और विकास में पारदर्शिता और प्रामाणिकता के बारे में चिंताएं उठाती है।"
    ],
    "points": 152,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1737449601
  },
  {
    "id": 42772771,
    "title": "लेखक एआई पाइरेसी जांच में मेटा के टोरेंट क्लाइंट लॉग और सीडिंग डेटा की मांग कर रहे हैं",
    "originLink": "https://torrentfreak.com/authors-seek-metas-torrent-client-logs-and-seeding-data-in-ai-piracy-probe-250120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772771",
    "commentBody": "",
    "originSummary": [
      "मेटा पर मुकदमा चल रहा है, जिसमें आरोप है कि उसने अपने एआई मॉडल को प्रशिक्षित करने के लिए बिटटोरेंट के माध्यम से विशेष रूप से लाइबजेन से कॉपीराइटेड पुस्तकों जैसे पायरेटेड सामग्री का उपयोग किया है।",
      "लेखक, जिनमें रिचर्ड कैड्रे और सारा सिल्वरमैन शामिल हैं, मेटा पर कॉपीराइट उल्लंघन का आरोप लगाते हैं, जबकि मेटा का दावा है कि उसके कार्य उचित उपयोग के अंतर्गत आते हैं।",
      "अदालत ने मेटा की टोरेंटिंग गतिविधियों के बारे में नए आरोपों की अनुमति दी है, जिसमें लेखक मेटा के टोरेंट क्लाइंट लॉग्स और सीडिंग डेटा तक पहुंच की मांग कर रहे हैं, जो एआई प्रशिक्षण डेटा और कॉपीराइट मुद्दों से संबंधित कानूनी चुनौतियों को उजागर करता है।"
    ],
    "commentSummary": [
      "लेखक मेटा द्वारा एआई प्रशिक्षण के लिए पायरेटेड सामग्री के संभावित उपयोग की जांच कर रहे हैं, जिसमें सबूत के रूप में टोरेंट क्लाइंट लॉग और सीडिंग डेटा का उपयोग किया जा रहा है।",
      "यह बहस चल रही है कि क्या बड़े पैमाने पर एआई प्रशिक्षण पायरेटेड सामग्री पर निर्भर करता है, क्योंकि बड़े टेक्स्ट डेटासेट को कानूनी रूप से प्राप्त करने की चुनौतियाँ हैं, बनाम प्रकाशकों के साथ कानूनी पहुंच के लिए बातचीत करने की संभावना।",
      "कानूनी प्रभाव, जिसमें निष्पक्ष उपयोग और कॉपीराइट उल्लंघन शामिल हैं, चर्चा के अधीन हैं, जो तकनीकी कंपनियों की डेटा आवश्यकताओं और मौजूदा कॉपीराइट कानूनों के बीच संघर्ष को उजागर करते हैं।"
    ],
    "points": 150,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737405488
  },
  {
    "id": 42774621,
    "title": "एलन ने उद्घाटन भाषण के दौरान नाजी सलामी दी",
    "originLink": "https://www.youtube.com/watch?v=e2bbb-6Clhs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एलन मस्क एक उद्घाटन भाषण के दौरान कथित रूप से नाजी सलामी देने के बाद विवाद के केंद्र में हैं, जिससे उनकी मंशा और राजनीतिक संबद्धताओं के बारे में बहस छिड़ गई है।",
      "इस घटना ने मस्क के संबंधों और तकनीकी समुदाय की प्रतिक्रिया के बारे में चर्चाओं को जन्म दिया है, जो तकनीकी उद्योग के भीतर राजनीतिक गतिशीलता को उजागर करता है।",
      "आलोचक इस बात पर विभाजित हैं कि यह इशारा एक गलतफहमी थी या एक जानबूझकर किया गया कदम, कुछ लोग मस्क के पिछले कार्यों और संबद्धताओं का संदर्भ देते हुए उनके इरादों के संभावित प्रमाण के रूप में देखते हैं।"
    ],
    "points": 139,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1737417209
  }
]
