[
  {
    "id": 42780816,
    "title": "מתקפת דה-אנונימיזציה ללא קליקים המכוונת ל-Signal, Discord ופלטפורמות אחרות",
    "originLink": "https://gist.github.com/hackermondev/45a3cdfa52246f1d1201c1e8cdef6117",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780816",
    "commentBody": "",
    "originSummary": [
      "התלמיד בן ה-15 מבית הספר התיכון גילה התקפת דה-אנונימיזציה ללא קליקים באמצעות מערכת הקאשינג של Cloudflare, שיכולה לאתר משתמשים ברדיוס של 250 מייל. פגיעות זו משפיעה על אפליקציות פופולריות כמו Signal ו-Discord, ומאפשרת לתוקפים לעקוב אחר משתמשים ללא הסכמתם. למרות שדיווח על הבעיה, רק באג קשור תוקן על ידי Cloudflare, והפגיעות המרכזית נותרה ללא מענה, מה שמדגיש את הצורך של משתמשים, במיוחד עיתונאים ופעילים, להיות ערניים לגבי פרטיותם."
    ],
    "commentSummary": [
      "מתקפת דה-אנונימיזציה ללא קליקים מנצלת את מערכת הקאשינג של Cloudflare בפלטפורמות כמו Signal ו-Discord, ובכך עשויה לחשוף את מיקומו המשוער של הנמען על ידי בדיקת מצב הקאש. המתקפה אינה דורשת שליטה בשרת, אלא רק כתובת URL ייחודית, ויכולה לחשוף מטא-דאטה חשוב, מה שמעלה חששות לפרטיות עבור משתמשי פלטפורמות תקשורת מאובטחות אלו. אסטרטגיות למיתון כוללות שימוש ברשתות פרטיות וירטואליות (VPNs) או השבתת הורדות אוטומטיות כדי להגן על פרטיות המשתמש."
    ],
    "points": 557,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1737471584
  },
  {
    "id": 42778266,
    "title": "סטארטאפ חורף: האקר ניוז איבד את אמונתו",
    "originLink": "https://www.vincentschmalbach.com/startup-winter-hacker-news-lost-its-faith/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42778266",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "חדשות האקרים עברו מקהילה ממוקדת סטארטאפים לפורום טכנולוגי רחב יותר, המשקף שינוי באינטרסים של המשתמשים לנושאים טכנולוגיים כלליים.",
      "מעבר זה הביא לירידה בהתלהבות מהסטארטאפים, כאשר משתמשים מביעים ספקנות כלפי מודל ההון סיכון (VC) ומחסור ברעיונות חדשניים.",
      "היתרונות הכספיים הנתפסים של עבודה בסטארטאפים מוטלים לעיתים קרובות בספק, שכן עובדים רבים אינם חווים תשואות משמעותיות, מה שמעיד על שינוי בסדרי העדיפויות בתוך קהילת הטכנולוגיה."
    ],
    "points": 455,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1737453607
  },
  {
    "id": 42774221,
    "title": "הנדסה לאחור של מערכת האנטי-צ'יט של Call of Duty",
    "originLink": "https://ssno.cc/posts/reversing-tac-1-4-2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774221",
    "commentBody": "",
    "originSummary": [
      "ה-Treyarch Anti-Cheat (TAC) ב-Black Ops Cold War הוא מערכת אנטי-צ'יט במצב משתמש, שחסרה את רכיב מצב הליבה שנמצא ב-Ricochet של Modern Warfare. TAC משתמש ב-Arxan להסוואה, מה שמסבך הנדסה לאחור באמצעות טכניקות כמו פענוח קובץ הרצה בזמן ריצה, בדיקות סכום ביקורת של קובץ הרצה, והצפנת מצביעים. תכונות אנטי-צ'יט מרכזיות כוללות זיהוי של חיבורי API, רישומי ניפוי שגיאות, ניטור תעבורת רשת, ושכבות חיצוניות, לצד טכניקות אנטי-ניפוי שגיאות שונות וקריאות מערכת מותאמות אישית לעקיפת חיבורים."
    ],
    "commentSummary": [
      "משתמשים חווים בעיות עם מערכות נגד רמאות במשחקים כמו CS:GO ו-Call of Duty, במיוחד משתמשי לינוקס עם חומרה מסוימת. הדיון מדגיש אתגרים כמו חסימות שגויות, חששות אתיים, והיעילות של מערכות נגד רמאות נוכחיות, המשפיעות על משחק הוגן. סיפורים אישיים מדגישים את הצורך בפתרונות משופרים לטיפול בהאשמות שגויות ולשיפור חוויות המשחק."
    ],
    "points": 442,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737414430
  },
  {
    "id": 42772995,
    "title": "האם אילון מאסק נראה מצדיע במועל יד בהשבעת טראמפ?",
    "originLink": "https://www.jpost.com/international/article-838444",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772995",
    "commentBody": "",
    "originSummary": [
      "נראה כי אילון מאסק עשה תנועה בטקס ההשבעה של טראמפ, שתורגמה על ידי חלק כצדעה נאצית, מה שהוביל למחלוקת ברשתות החברתיות. הליגה נגד השמצה (ADL) הציעה כי התנועה הייתה ככל הנראה רגע מביך ולא הצדעה מכוונת, כאשר חלק מייחסים זאת לתסמונת אספרגר של מאסק. מאסק הגיב למחלוקת עם אימוג'י צוחק והביע התלהבות מהאזכור של טראמפ על מאדים, מה שמתאים למטרות חקר החלל שלו."
    ],
    "commentSummary": [
      "אלון מאסק הואשם בכך שביצע הצדעה נאצית בטקס ההשבעה של טראמפ, מה שהוביל לדיון ב-Hacker News על ההתאמה של דיון בנושאים כאלה בפלטפורמות טכנולוגיות. חלק מהמשתמשים טענו שהשפעתו של מאסק בתעשיית הטכנולוגיה הופכת את הנושא לרלוונטי, בעוד אחרים חשו שזה לא מתאים לפורום. הדיון הדגיש דעות שונות על צנזורה והשלכות פעולותיו של מאסק בתוך קהילת הטכנולוגיה."
    ],
    "points": 283,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1737406930
  },
  {
    "id": 42773778,
    "title": "נראה כי אילון מאסק מבצע הצדעות פשיסטיות עוקבות בעצרת ההשבעה",
    "originLink": "https://www.theguardian.com/technology/2025/jan/20/trump-elon-musk-salute",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42773778",
    "commentBody": "",
    "originSummary": [
      "אלון מאסק נתקל בביקורת על כך שביצע מחווה המזכירה הצדעה בסגנון פשיסטי במהלך חגיגות ההשבעה של דונלד טראמפ, שחלקם פירשו כהצדעה נאצית.",
      "הליגה נגד השמצה הכירה בדמיון של המחווה להצדעה נאצית, אך מאוחר יותר הציעה שזה היה רגע מביך של התלהבות, מה שגרר ביקורת מאלכסנדריה אוקסיו-קורטז.",
      "מעשיו של מאסק נחגגו על ידי כמה דמויות מהימין הקיצוני, מה שהצית ויכוחים על השתייכותו הפוליטית וכוונותיו."
    ],
    "commentSummary": [
      "מחוותיו של אילון מאסק בעצרת חנוכה, שנתפסו על ידי חלק כצדעות פשיסטיות, עוררו מחלוקת ודיון מקוון. האירוע הוביל לדיון מסומן ב-Hacker News, והצית ויכוח על מדיניות המודרציה והצנזורה של הפלטפורמה. המצב מעלה שאלות על תפקידם של דמויות טכנולוגיה משפיעות בשיח הפוליטי ועל עקביות מדיניות המודרציה בפלטפורמות כמו Hacker News."
    ],
    "points": 238,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1737411660
  },
  {
    "id": 42777938,
    "title": "צנזורה של Meta על '#Democrat' באינסטגרם",
    "originLink": "https://mstdn.chrisalemany.ca/@chris/113864600222476627",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777938",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "על פי הדיווחים, מטא מצנזרת את ההאשטאג '#Democrat' באינסטגרם, מה שמוביל לדיונים על צנזורה והשלכותיה על פלטפורמות המדיה החברתית.",
      "משתמשים ממדינות שונות, כמו בריטניה, ספרד וגרמניה, חוו את הבעיה הזו, אם כי ישנם דיווחים על כך שהיא נפתרה.",
      "התקרית מדגישה חששות לגבי ההשפעה של פלטפורמות המדיה החברתית והאיזון העדין בין מתן תוכן לצנזורה, עם דיונים על חופש הביטוי והטיה פוליטית פוטנציאלית."
    ],
    "points": 224,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1737450496
  },
  {
    "id": 42779776,
    "title": "לארגן קהילות מקומיות ללא פייסבוק?",
    "originLink": "https://news.ycombinator.com/item?id=42779776",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779776",
    "commentBody": "",
    "originSummary": [
      "האדם מחפש להעביר את האינטראקציות של הקהילה המקומית מפייסבוק לפלטפורמה מאוחסנת עצמאית ומפדרטת, המאפשרת שליטה וניהול מבוזרים.",
      "הם מחפשים פתרונות מדף או שותפים לשיתוף פעולה כדי להקל על המעבר הזה, מה שמעיד על צורך באפשרויות נגישות וניתנות להתאמה אישית.",
      "ההקשר כולל אזורים כפריים עם מספר עיירות קטנות, כל אחת עם אוכלוסייה של כ-50,000, המדגיש את החשיבות של קישוריות ומעורבות קהילתית."
    ],
    "commentSummary": [
      "המחבר מבקש להעביר קהילות מקומיות מפייסבוק לפלטפורמה מאוחסנת עצמאית ומבוזרת, תוך הדגשת הצורך בתכונות כמו לוחות שנה לאירועים והודעות. חלופות כמו מאסטודון עשויות לא לשכפל במלואן את הפונקציונליות של פייסבוק, מה שמוביל לשקול פלטפורמות אחרות כמו דיסקורס, נקסטדור או groups.io. חשוב להעריך את העניין של הקהילה במעבר ולוודא שהפלטפורמה החדשה תואמת את הצרכים שלהם, עם אפשרויות כמו עיתונים מקומיים ורשימות דוא\"ל שנשקלות גם כן."
    ],
    "points": 217,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1737465542
  },
  {
    "id": 42780022,
    "title": "עצלות מטה-קוגניטיבית: השפעות של בינה מלאכותית גנרטיבית על מוטיבציה ללמידה",
    "originLink": "https://bera-journals.onlinelibrary.wiley.com/doi/10.1111/bjet.13544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780022",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "מחקר מדגיש כי כלים של בינה מלאכותית גנרטיבית, כמו ChatGPT, יכולים להוביל ל\"עצלנות מטה-קוגניטיבית\", שבה משתמשים תלויים יותר מדי בבינה מלאכותית, מה שמפחית את הלמידה המווסתת עצמית. תלות זו בבינה מלאכותית עשויה להקטין את הלמידה העמוקה ואת כישורי החשיבה הביקורתית, שכן הלומדים עשויים לא לעסוק באופן פעיל בהבנה והערכת מידע. בעוד שבינה מלאכותית יכולה לשפר את יעילות המשימות, המחקר מדגיש את החשיבות של השתתפות פעילה של הלומדים בתהליך הלמידה כדי לפתח כישורים קוגניטיביים חיוניים."
    ],
    "points": 213,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1737467238
  },
  {
    "id": 42772983,
    "title": "גרסה רשמית של DeepSeek R1 זמינה כעת ב-Ollama",
    "originLink": "https://ollama.com/library/deepseek-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772983",
    "commentBody": "",
    "originSummary": [
      "DeepSeek הציגה את דגמי ההיגיון מהדור הראשון שלה, אשר מבצעים ברמה שווה ל-OpenAI-o1 במשימות הכוללות מתמטיקה, קוד והיגיון. הדגמים משתנים באופן משמעותי בגודלם, מ-1.5 מיליארד עד 671 מיליארד פרמטרים, מה שמצביע על צרכי אחסון מגוונים. דגמים אלו זמינים תחת רישיון MIT, מה שמאפשר שימוש רחב ושינוי."
    ],
    "commentSummary": [
      "DeepSeek R1, מודל שפה חדש, זמין כעת ב-Ollama, ומעורר דיונים על הצנזורה שלו, במיוחד בנושאים פוליטיים רגישים כמו כיכר טיאננמן.",
      "הדיון מתמקד באיזון בין תקינות פוליטית לדיוק היסטורי, עם השוואות בין גישות מערביות וסיניות להטיה פוליטית במודלים של שפה.",
      "מודלים בקוד פתוח מוצעים כפתרון פוטנציאלי להתמודדות עם צנזורה, אם כי הדעות חלוקות לגבי היעילות וההשלכות של צעדים כאלה."
    ],
    "points": 210,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1737406824
  },
  {
    "id": 42779147,
    "title": "אנשים גרועים בדיווח על מה שהם אוכלים. זו בעיה למחקר תזונתי",
    "originLink": "https://www.science.org/content/article/people-are-bad-reporting-what-they-eat-s-problem-dietary-research",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779147",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "דיוק בדיווח על צריכת מזון מהווה אתגר, כאשר אנשים לעיתים קרובות מעריכים באופן שגוי את גודל המנות בממוצע של 53%, אפילו בקרב אנשי מקצוע מיומנים. מרכיבים נסתרים כמו שמנים ושומנים מהווים פחות בעיה מאשר טעויות בגודל המנות, מה שמדגיש את הצורך בכלי מדידה מדויקים כמו מאזני מזון. טכנולוגיות ואפליקציות חדשות, כמו SnapCalorie, שואפות לשפר את דיוק המעקב אחר דיאטה, אם כי לעיתים קרובות הן דורשות מנויים בשל עלויות תפעול גבוהות, מה שעשוי לסייע למשתמשים בקבלת החלטות תזונתיות מודעות יותר."
    ],
    "points": 206,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1737460490
  },
  {
    "id": 42772170,
    "title": "רשימת משאלות לתמיכה במכשירי ROCm",
    "originLink": "https://github.com/ROCm/ROCm/discussions/4276",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772170",
    "commentBody": "",
    "originSummary": [
      "ROCm אוסף משוב מהקהילה כדי לקבוע אילו כרטיסי מסך (GPUs) לתמוך בעדכונים עתידיים, עם פרטי תאימות נוכחיים זמינים באתר שלהם. משתמשים תומכים בהרחבת התמיכה, במיוחד עבור כרטיסי מסך ישנים וכאלה המיועדים לצרכנים, ושיפור האינטגרציה עם מערכות Windows. יש דרישה חזקה לתמיכה עקבית בכל הארכיטקטורות, תוך הדגשת החשיבות של זיכרון VRAM ליישומי בינה מלאכותית, וקריאות לשיפורים בתמיכה של APU של AMD ותהליך פיתוח דומה ל-CUDA של NVIDIA."
    ],
    "commentSummary": [
      "ROCm, פלטפורמת התוכנה של AMD לתכנות GPU, נתקלת בביקורת על כך שהקומפילציה של הקוד שלה מותאמת לחומרה ספציפית, מה שמוביל לתמיכה לא עקבית ב-GPU בהשוואה ל-CUDA של Nvidia.",
      "משתמשים מתוסכלים מהיעדר התמיכה ארוכת הטווח של AMD בכרטיסי המסך, כאשר חלקם חווים הפסקת תמיכה זמן קצר לאחר הרכישה, מה שמוביל לקריאות לשיפור התמיכה בין פלטפורמות ולתיעוד טוב יותר.",
      "הקהילה מפצירה ב-AMD לתמוך בכל כרטיסי המסך, בדומה ל-Nvidia, וחלק מהמשתמשים העבירו את תקוותיהם לאינטל לתחרות טובה יותר בשוק כרטיסי המסך."
    ],
    "points": 195,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1737401463
  },
  {
    "id": 42775029,
    "title": "Ruff: בודק תחביר ומעצב קוד לפייתון שנכתב ב-Rust",
    "originLink": "https://github.com/astral-sh/ruff",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42775029",
    "commentBody": "",
    "originSummary": [
      "רף DocsPlayground הוא לינטור ומעצב קוד לפייתון שנכתב ב-Rust, ומציע מהירויות הגבוהות פי 10-100 מכלים מסורתיים כמו Flake8 ו-Black. הוא תומך בפייתון 3.13, משתלב עם עורכים כמו VS Code, ויכול להחליף כלים מרובים כמו Flake8, Black ו-isort, תוך שהוא ידידותי למונורפו. רף מאומץ באופן נרחב בפרויקטים גדולים כמו Apache Airflow, FastAPI ו-Pandas, וזמין להתקנה דרך pip, pipx ומנהלי חבילות אחרים, עם תמיכה בקונפיגורציה דרך pyproject.toml."
    ],
    "commentSummary": [
      "רף הוא כלי לבדיקת קוד ועיצוב קוד בשפת פייתון, שפותח בשפת ראסט, ומוכר בזכות מהירותו ויעילותו. הוא מפשט את פיתוח הפייתון על ידי שילוב של כלים מרובים לכלי אחד.",
      "הכלי עורר עניין ודיון בתוך קהילת פייתון, כאשר חלק מהמפתחים מעריכים את הביצועים והפשטות שלו, בעוד אחרים נשארים ספקנים לגבי כלים חדשים.",
      "פיתוחו של Ruff על ידי Astral, ארגון הנתמך על ידי הון סיכון, מוסיף לעניין ולדיון, במיוחד בנוגע להשפעתו על ההקלדה הדינמית של Python והשימוש בבודקי סוגים ובודקי קוד בפרויקטים גדולים."
    ],
    "points": 185,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1737420581
  },
  {
    "id": 42777857,
    "title": "קימי K1.5: הגדלת למידת חיזוק עם מודלים לשוניים גדולים (LLMs)",
    "originLink": "https://github.com/MoonshotAI/Kimi-k1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777857",
    "commentBody": "",
    "originSummary": [
      "קימי k1.5 הוא מודל רב-מודלי מתקדם שמבצע באופן משמעותי טוב יותר מ-GPT-4o ו-Claude Sonnet 3.5 במשימות של שרשרת מחשבה קצרה (CoT), עם שיפורים של עד 550% במדדים כמו AIME, MATH-500 ו-LiveCodeBench.",
      "זה תואם את הביצועים של o1 של OpenAI בביצועי CoT ארוכים במגוון מודליות, תוך שימוש בלמידת חיזוק עם סקלת הקשר ארוך ואופטימיזציה משופרת של מדיניות, תוך הימנעות משיטות מורכבות כמו חיפוש עץ מונטה קרלו.",
      "קימי k1.5 מאומן על נתוני טקסט וראייה, מה שמאפשר הסקת מסקנות משותפת, ויהיה זמין בקרוב דרך פלטפורמת קימי הפתוחה בכתובת https://kimi.ai."
    ],
    "commentSummary": [
      "ישנן חברות, כולל כמה מסין, שמשתמשות ב-GitHub כדי לקדם מוצרים על ידי פרסום \"מאמרי מחקר\" ודוגמאות קוד מבלי לספק ערכות פיתוח תוכנה (SDKs) או ספריות בפועל.",
      "נוהג זה נחשב למטעה, בדומה לפרסום כוזב, שכן ממשקי API (ממשקי תכנות יישומים) או משקלי מודלים שהובטחו לעיתים קרובות אינם מתממשים.",
      "המגמה של שימוש במאגרי GitHub ככלי קידום, שלעיתים חסרים קוד מקור, מעוררת חששות לגבי שקיפות ואותנטיות במחקר ופיתוח בינה מלאכותית."
    ],
    "points": 152,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1737449601
  },
  {
    "id": 42772771,
    "title": "מחברים מבקשים את יומני לקוח הטורנט של מטא ונתוני הזריעה בחקירת פיראטיות בינה מלאכותית",
    "originLink": "https://torrentfreak.com/authors-seek-metas-torrent-client-logs-and-seeding-data-in-ai-piracy-probe-250120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772771",
    "commentBody": "",
    "originSummary": [
      "Meta עומדת בפני תביעה על כך שלכאורה השתמשה בחומרים פיראטיים, במיוחד ספרים המוגנים בזכויות יוצרים מ-LibGen, כדי לאמן את מודלי הבינה המלאכותית שלה באמצעות BitTorrent.",
      "מחברים, כולל ריצ'רד קאדרי ושרה סילברמן, מאשימים את מטא בהפרת זכויות יוצרים, בעוד מטא טוענת כי פעולותיה נופלות תחת שימוש הוגן.",
      "הבית המשפט התיר טענות חדשות בנוגע לפעילויות הטורנט של מטא, כאשר מחברים מבקשים גישה ליומני לקוח הטורנט של מטא ונתוני הזרעה, מה שמדגיש את האתגרים המשפטיים סביב נתוני אימון בינה מלאכותית ונושאי זכויות יוצרים."
    ],
    "commentSummary": [
      "מחברים בוחנים את השימוש הפוטנציאלי של מטא בתוכן פיראטי לאימון בינה מלאכותית, תוך שימוש ביומני לקוח טורנט ונתוני זריעה כראיות.",
      "יש ויכוח האם אימון בינה מלאכותית בקנה מידה גדול תלוי בתוכן פיראטי בשל האתגרים בהשגת מאגרי טקסט גדולים באופן חוקי, לעומת האפשרות לנהל משא ומתן על גישה חוקית עם מוציאים לאור.",
      "ההשלכות המשפטיות, כולל שימוש הוגן והפרת זכויות יוצרים, נמצאות בדיון, ומדגישות את הקונפליקט בין דרישות הנתונים של חברות הטכנולוגיה לבין חוקי זכויות היוצרים הקיימים."
    ],
    "points": 150,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737405488
  },
  {
    "id": 42774621,
    "title": "אלון נותן הצדעה נאצית במהלך נאום ההשבעה",
    "originLink": "https://www.youtube.com/watch?v=e2bbb-6Clhs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "אלון מאסק נמצא במרכז המחלוקת לאחר שלכאורה נתן הצדעה נאצית במהלך נאום השבעה, מה שהוביל לדיונים על כוונותיו והשתייכויותיו הפוליטיות.",
      "התקרית עוררה דיונים על הקשרים של מאסק ועל תגובת קהילת הטכנולוגיה, והדגישה את הדינמיקה הפוליטית בתוך תעשיית הטכנולוגיה.",
      "המבקרים חלוקים בשאלה האם המחווה הייתה מעשה מוטעה או מהלך מכוון, כאשר חלקם מתייחסים לפעולותיו והשתייכויותיו הקודמות של מאסק כראיה פוטנציאלית לכוונותיו."
    ],
    "points": 139,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1737417209
  }
]
