[
  {
    "id": 42780816,
    "title": "0-клик деанонимизационная атака, нацеленная на Signal, Discord и другие платформы",
    "originLink": "https://gist.github.com/hackermondev/45a3cdfa52246f1d1201c1e8cdef6117",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780816",
    "commentBody": "",
    "originSummary": [
      "15-летний ученик средней школы обнаружил атаку деанонимизации без кликов, используя систему кэширования Cloudflare, которая может определить местоположение пользователей в радиусе 250 миль. Эта уязвимость затрагивает популярные приложения, такие как Signal и Discord, позволяя злоумышленникам отслеживать пользователей без их согласия. Несмотря на сообщение об этой проблеме, Cloudflare исправила только связанную ошибку, оставив основную уязвимость без внимания, что подчеркивает необходимость для пользователей, особенно журналистов и активистов, быть бдительными в отношении своей конфиденциальности."
    ],
    "commentSummary": [
      "Нулевая атака деанонимизации использует систему кэширования Cloudflare на таких платформах, как Signal и Discord, потенциально раскрывая приблизительное местоположение получателя путем проверки статуса кэша. Атака не требует контроля над сервером, только уникальный URL, и может раскрыть важные метаданные, вызывая опасения по поводу конфиденциальности пользователей этих защищенных платформ связи. Стратегии смягчения включают использование виртуальных частных сетей (VPN) или отключение автоматической загрузки для защиты конфиденциальности пользователей."
    ],
    "points": 557,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1737471584
  },
  {
    "id": 42778266,
    "title": "Стартап-зима: Hacker News потерял веру",
    "originLink": "https://www.vincentschmalbach.com/startup-winter-hacker-news-lost-its-faith/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42778266",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Хакер Ньюс перешел от сообщества, ориентированного на стартапы, к более широкому техническому форуму, отражая изменение интересов пользователей в сторону общих технических тем.",
      "Этот сдвиг привел к снижению энтузиазма в отношении стартапов, при этом пользователи выражают скептицизм по поводу модели венчурного капитала (VC) и нехватки инновационных идей.",
      "Восприятие финансовых выгод от работы в стартапах часто ставится под сомнение, так как многие сотрудники не получают значительных доходов, что указывает на изменение приоритетов в технологическом сообществе."
    ],
    "points": 455,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1737453607
  },
  {
    "id": 42774221,
    "title": "Реверс-инжиниринг античита Call of Duty",
    "originLink": "https://ssno.cc/posts/reversing-tac-1-4-2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774221",
    "commentBody": "",
    "originSummary": [
      "Античит-система Treyarch (TAC) в Black Ops Cold War работает в пользовательском режиме и не имеет компонента в режиме ядра, как в Ricochet от Modern Warfare. TAC использует Arxan для обфускации, что усложняет обратное проектирование с помощью таких техник, как расшифровка исполняемых файлов во время выполнения, контрольные суммы исполняемых файлов и шифрование указателей. Основные функции античита включают обнаружение API-хуков, регистров отладки, мониторинг сетевого трафика и внешних наложений, а также различные антиотладочные техники и пользовательские системные вызовы для обхода хуков."
    ],
    "commentSummary": [
      "Пользователи сталкиваются с проблемами античита в играх, таких как CS:GO и Call of Duty, особенно это затрагивает пользователей Linux с определенным оборудованием. Обсуждение подчеркивает такие проблемы, как ложные баны, этические вопросы и эффективность текущих систем античита, влияющих на честную игру. Личные истории подчеркивают необходимость улучшения решений для устранения ложных обвинений и улучшения игрового опыта."
    ],
    "points": 442,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737414430
  },
  {
    "id": 42772995,
    "title": "Появлялся ли Илон Маск с жестом «зиг хайль» на инаугурации Трампа?",
    "originLink": "https://www.jpost.com/international/article-838444",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772995",
    "commentBody": "",
    "originSummary": [
      "На инаугурации Трампа было замечено, как Илон Маск сделал жест, который некоторые интерпретировали как нацистское приветствие, что вызвало споры в социальных сетях. Антидиффамационная лига (ADL) предположила, что жест, вероятно, был неловким моментом, а не намеренным приветствием, и некоторые связывают это с синдромом Аспергера у Маска. Маск ответил на спор с помощью эмодзи со смехом и выразил энтузиазм по поводу упоминания Трампом Марса, что соответствует его целям в области космических исследований."
    ],
    "commentSummary": [
      "Илона Маска обвинили в том, что он сделал нацистское приветствие на инаугурации Трампа, что привело к дебатам на Hacker News о целесообразности обсуждения таких тем на технологических платформах. Некоторые пользователи утверждали, что влияние Маска в технологической индустрии делает эту тему актуальной, в то время как другие считали, что это неуместно для форума. Обсуждение подчеркнуло различные мнения о цензуре и последствиях действий Маска в технологическом сообществе."
    ],
    "points": 283,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1737406930
  },
  {
    "id": 42773778,
    "title": "Илон Маск, похоже, делает подряд фашистские приветствия на инаугурационном митинге",
    "originLink": "https://www.theguardian.com/technology/2025/jan/20/trump-elon-musk-salute",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42773778",
    "commentBody": "",
    "originSummary": [
      "Илон Маск столкнулся с критикой за жест, напоминающий фашистское приветствие, во время празднований инаугурации Дональда Трампа, который некоторые интерпретировали как нацистское приветствие.",
      "Антидиффамационная лига признала сходство жеста с нацистским салютом, но позже предположила, что это был неловкий момент энтузиазма, вызвавший критику со стороны Александрии Окасио-Кортес.",
      "Действия Маска были встречены с одобрением некоторыми ультраправыми деятелями, что вызвало дебаты о его политических связях и намерениях."
    ],
    "commentSummary": [
      "Жесты Илона Маска на инаугурационном митинге, которые некоторые восприняли как фашистские приветствия, вызвали споры и дебаты в интернете. Этот инцидент привел к обсуждению на Hacker News, вызвав дебаты о политике модерации и цензуры платформы. Ситуация поднимает вопросы о роли влиятельных фигур в сфере технологий в политическом дискурсе и о последовательности политики модерации на таких платформах, как Hacker News."
    ],
    "points": 238,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1737411660
  },
  {
    "id": 42777938,
    "title": "Meta цензурирует '#Democrat' в Instagram",
    "originLink": "https://mstdn.chrisalemany.ca/@chris/113864600222476627",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777938",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Сообщается, что Meta цензурирует хэштег '#Democrat' в Instagram, что приводит к обсуждениям о цензуре и ее последствиях на платформах социальных сетей.",
      "Пользователи из нескольких стран, таких как Великобритания, Испания и Германия, столкнулись с этой проблемой, хотя некоторые сообщают, что она была решена.",
      "Инцидент подчеркивает обеспокоенность по поводу влияния платформ социальных медиа и тонкого баланса между модерацией контента и цензурой, с дебатами о свободе слова и возможной политической предвзятости."
    ],
    "points": 224,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1737450496
  },
  {
    "id": 42779776,
    "title": "Организовать местные сообщества без Facebook?",
    "originLink": "https://news.ycombinator.com/item?id=42779776",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779776",
    "commentBody": "",
    "originSummary": [
      "Человек стремится перевести взаимодействия местного сообщества с Facebook на самоуправляемую, федеративную платформу, которая позволяет децентрализованное управление и контроль.",
      "Они ищут готовые решения или партнеров для содействия этому переходу, что указывает на необходимость в доступных и настраиваемых вариантах.",
      "Контекст включает сельские районы с несколькими небольшими городами, каждый из которых имеет население около 50 000 человек, подчеркивая важность связности и вовлеченности сообщества."
    ],
    "commentSummary": [
      "Автор стремится перевести местные сообщества с Facebook на самоуправляемую, федеративную платформу, подчеркивая необходимость таких функций, как календари событий и обмен сообщениями. Альтернативы, такие как Mastodon, могут не полностью воспроизводить функциональность Facebook, что побуждает рассмотреть другие платформы, такие как Discourse, Nextdoor или groups.io. Важно оценить интерес сообщества к переходу и убедиться, что новая платформа соответствует их потребностям, при этом также рассматриваются варианты, такие как местные газеты и списки рассылки."
    ],
    "points": 217,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1737465542
  },
  {
    "id": 42780022,
    "title": "Метакогнитивная лень: Влияние генеративного ИИ на мотивацию к обучению",
    "originLink": "https://bera-journals.onlinelibrary.wiley.com/doi/10.1111/bjet.13544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780022",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Исследование подчеркивает, что инструменты генеративного ИИ, такие как ChatGPT, могут привести к «метакогнитивной лености», когда пользователи слишком сильно зависят от ИИ, снижая саморегулируемое обучение. Эта зависимость от ИИ может уменьшить глубокое обучение и навыки критического мышления, так как учащиеся могут не активно участвовать в понимании и оценке информации. Хотя ИИ может повысить эффективность выполнения задач, исследование подчеркивает важность активного участия учащихся в процессе обучения для развития необходимых когнитивных навыков."
    ],
    "points": 213,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1737467238
  },
  {
    "id": 42772983,
    "title": "Официальный DeepSeek R1 теперь на Ollama",
    "originLink": "https://ollama.com/library/deepseek-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772983",
    "commentBody": "",
    "originSummary": [
      "DeepSeek представила свои модели первого поколения для рассуждений, которые по производительности сопоставимы с OpenAI-o1 в задачах, связанных с математикой, кодом и логикой. Размеры моделей значительно различаются, от 1,5 миллиарда до 671 миллиарда параметров, что указывает на разнообразные потребности в хранении. Эти модели доступны по лицензии MIT, что позволяет их широкое использование и модификацию."
    ],
    "commentSummary": [
      "DeepSeek R1, новая языковая модель, теперь доступна на Ollama, вызывая обсуждения о её цензуре, особенно по чувствительным политическим темам, таким как площадь Тяньаньмэнь.",
      "Дебаты сосредоточены на балансе между политической корректностью и исторической точностью, с проведением сравнений между западными и китайскими подходами к политической предвзятости в языковых моделях.",
      "Открытые модели предлагаются как потенциальное решение для противодействия цензуре, хотя мнения о их эффективности и последствиях таких мер расходятся."
    ],
    "points": 210,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1737406824
  },
  {
    "id": 42779147,
    "title": "Люди плохо сообщают о том, что они едят. Это проблема для исследований в области питания.",
    "originLink": "https://www.science.org/content/article/people-are-bad-reporting-what-they-eat-s-problem-dietary-research",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779147",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Точное отслеживание потребления пищи является сложной задачей, так как люди часто ошибаются в оценке размеров порций в среднем на 53%, даже среди обученных профессионалов. Скрытые ингредиенты, такие как масла и жиры, менее проблематичны, чем ошибки в размере порций, что подчеркивает необходимость в точных инструментах измерения, таких как кухонные весы. Новые технологии и приложения, такие как SnapCalorie, стремятся улучшить точность отслеживания диеты, хотя они часто требуют подписки из-за высоких эксплуатационных расходов, что потенциально может помочь пользователям делать более осознанный выбор в питании."
    ],
    "points": 206,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1737460490
  },
  {
    "id": 42772170,
    "title": "Список желаемой поддержки устройств ROCm",
    "originLink": "https://github.com/ROCm/ROCm/discussions/4276",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772170",
    "commentBody": "",
    "originSummary": [
      "ROCm собирает отзывы сообщества, чтобы определить, какие графические процессоры поддерживать в будущих обновлениях, с текущими деталями совместимости, доступными на их веб-сайте. Пользователи выступают за более широкую поддержку, особенно для старых и потребительских графических процессоров, и улучшенную интеграцию с системами Windows. Существует сильный спрос на постоянную поддержку всех архитектур, подчеркивая важность VRAM для AI-приложений, и призывы к улучшению поддержки APU от AMD и процессу разработки, аналогичному CUDA от NVIDIA."
    ],
    "commentSummary": [
      "ROCm, программная платформа AMD для программирования GPU, сталкивается с критикой из-за компиляции кода, специфичной для оборудования, что приводит к непоследовательной поддержке GPU по сравнению с CUDA от Nvidia.",
      "Пользователи разочарованы отсутствием долгосрочной поддержки графических процессоров от AMD, так как некоторые сталкиваются с прекращением поддержки вскоре после покупки, что приводит к призывам улучшить поддержку на разных платформах и предоставить лучшую документацию.",
      "Сообщество призывает AMD поддерживать все графические процессоры, подобно Nvidia, и некоторые пользователи возлагают свои надежды на Intel для улучшения конкуренции на рынке графических процессоров."
    ],
    "points": 195,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1737401463
  },
  {
    "id": 42775029,
    "title": "Ruff: линтер Python и форматировщик кода, написанный на Rust",
    "originLink": "https://github.com/astral-sh/ruff",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42775029",
    "commentBody": "",
    "originSummary": [
      "Ruff DocsPlayground — это линтер и форматировщик кода на Python, написанный на Rust, предлагающий скорость в 10-100 раз выше, чем традиционные инструменты, такие как Flake8 и Black. Он поддерживает Python 3.13, интегрируется с редакторами, такими как VS Code, и может заменить несколько инструментов, таких как Flake8, Black и isort, при этом оставаясь дружелюбным к монорепозиториям. Ruff широко используется в крупных проектах, таких как Apache Airflow, FastAPI и Pandas, и доступен для установки через pip, pipx и другие менеджеры пакетов, с поддержкой конфигурации через pyproject.toml."
    ],
    "commentSummary": [
      "Ruff — это линтер и форматировщик кода для Python, разработанный на языке Rust, известный своей скоростью и эффективностью, который упрощает разработку на Python, интегрируя несколько инструментов в один.",
      "Инструмент вызвал интерес и дебаты в сообществе Python: некоторые разработчики ценят его производительность и простоту, в то время как другие остаются скептически настроенными по отношению к новым инструментам.",
      "Разработка Ruff компанией Astral, поддерживаемой венчурным капиталом, добавляет интриги и обсуждений, особенно в отношении его влияния на динамическую типизацию Python и использование проверяющих типов и линтеров в крупных проектах."
    ],
    "points": 185,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1737420581
  },
  {
    "id": 42777857,
    "title": "Кими K1.5: Масштабирование обучения с подкреплением с помощью больших языковых моделей",
    "originLink": "https://github.com/MoonshotAI/Kimi-k1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777857",
    "commentBody": "",
    "originSummary": [
      "Kimi k1.5 — это передовая мультимодальная модель, которая значительно превосходит GPT-4o и Claude Sonnet 3.5 в задачах с короткой цепочкой рассуждений (CoT), с улучшениями до 550% на таких тестах, как AIME, MATH-500 и LiveCodeBench.",
      "Это соответствует o1 от OpenAI по производительности в долгосрочном контексте в различных модальностях, используя обучение с подкреплением с масштабированием длинного контекста и улучшенной оптимизацией политики, избегая сложных методов, таких как поиск по дереву Монте-Карло.",
      "Kimi k1.5 обучена как на текстовых, так и на визуальных данных, что позволяет осуществлять совместное рассуждение, и вскоре будет доступна через Kimi OpenPlatform по адресу https://kimi.ai."
    ],
    "commentSummary": [
      "Компании, включая некоторые из Китая, используют GitHub для продвижения продуктов, публикуя «научные статьи» и образцы кода без предоставления реальных наборов для разработки программного обеспечения (SDK) или библиотек.",
      "Эта практика считается вводящей в заблуждение, аналогично ложной рекламе, так как обещанные API (интерфейсы прикладного программирования) или веса моделей часто не материализуются.",
      "Тенденция использования репозиториев GitHub в качестве инструментов продвижения, иногда без исходного кода, вызывает обеспокоенность по поводу прозрачности и подлинности в исследованиях и разработке ИИ."
    ],
    "points": 152,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1737449601
  },
  {
    "id": 42772771,
    "title": "Авторы запрашивают журналы клиента торрентов Meta и данные о раздаче в рамках расследования пиратства ИИ",
    "originLink": "https://torrentfreak.com/authors-seek-metas-torrent-client-logs-and-seeding-data-in-ai-piracy-probe-250120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772771",
    "commentBody": "",
    "originSummary": [
      "Meta сталкивается с иском за предполагаемое использование пиратских материалов, а именно книг, защищенных авторским правом, из LibGen для обучения своих моделей ИИ через BitTorrent.",
      "Авторы, включая Ричарда Кадри и Сару Сильверман, обвиняют Meta в нарушении авторских прав, в то время как Meta утверждает, что её действия подпадают под добросовестное использование.",
      "Суд разрешил новые обвинения в отношении деятельности Meta, связанной с торрентами, при этом авторы стремятся получить доступ к журналам торрент-клиента Meta и данным о раздаче, что подчеркивает юридические проблемы, связанные с обучающими данными ИИ и вопросами авторского права."
    ],
    "commentSummary": [
      "Авторы изучают потенциальное использование Meta пиратского контента для обучения ИИ, используя логи торрент-клиентов и данные о раздаче в качестве доказательства.",
      "Существует дебаты о том, зависит ли обучение ИИ в крупном масштабе от пиратского контента из-за трудностей с легальным получением больших текстовых наборов данных, по сравнению с возможностью договориться о легальном доступе с издателями.",
      "Правовые последствия, включая добросовестное использование и нарушение авторских прав, находятся в стадии обсуждения, подчеркивая конфликт между требованиями к данным технологических компаний и существующими законами об авторских правах."
    ],
    "points": 150,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737405488
  },
  {
    "id": 42774621,
    "title": "Илон отдает нацистский салют во время инаугурационной речи",
    "originLink": "https://www.youtube.com/watch?v=e2bbb-6Clhs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Илон Маск оказался в центре скандала после того, как, как утверждается, отдал нацистский салют во время инаугурационной речи, что вызвало дебаты о его намерениях и политических связях.",
      "Инцидент вызвал обсуждения о связях Маска и реакции технологического сообщества, подчеркивая политическую динамику внутри технологической индустрии.",
      "Критики разделились во мнениях о том, было ли это жестом ошибочным или преднамеренным шагом, при этом некоторые ссылаются на прошлые действия и связи Маска как на возможные доказательства его намерений."
    ],
    "points": 139,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1737417209
  }
]
