[
  {
    "id": 42780816,
    "title": "0-클릭 익명 해제 공격이 Signal, Discord, 기타 플랫폼을 대상으로 함",
    "originLink": "https://gist.github.com/hackermondev/45a3cdfa52246f1d1201c1e8cdef6117",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780816",
    "commentBody": "",
    "originSummary": [
      "15세 고등학생이 Cloudflare의 캐싱 시스템을 이용한 0-클릭 익명 해제 공격을 발견했으며, 이를 통해 사용자를 250마일 반경 내에서 위치 추적할 수 있습니다. 이 취약점은 Signal과 Discord와 같은 인기 앱에 영향을 미쳐 공격자가 사용자의 동의 없이 추적할 수 있게 합니다. 문제를 보고했음에도 불구하고 Cloudflare는 관련 버그만 수정했을 뿐 핵심 취약점은 해결되지 않아, 특히 기자와 활동가들이 자신의 프라이버시에 대해 경각심을 가져야 함을 강조합니다."
    ],
    "commentSummary": [
      "0-클릭 익명 해제 공격은 Signal 및 Discord와 같은 플랫폼에서 Cloudflare의 캐싱 시스템을 악용하여 캐시 상태를 확인함으로써 수신자의 대략적인 위치를 드러낼 수 있습니다. 이 공격은 서버 제어가 필요하지 않으며, 고유한 URL만으로 중요한 메타데이터를 노출시킬 수 있어 이러한 보안 통신 플랫폼 사용자에게 프라이버시 우려를 제기합니다. 완화 전략으로는 가상 사설망(VPN)을 사용하거나 자동 다운로드를 비활성화하여 사용자 프라이버시를 보호하는 방법이 포함됩니다."
    ],
    "points": 557,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1737471584
  },
  {
    "id": 42778266,
    "title": "스타트업 겨울: 해커 뉴스가 신뢰를 잃었다",
    "originLink": "https://www.vincentschmalbach.com/startup-winter-hacker-news-lost-its-faith/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42778266",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "해커 뉴스는 스타트업 중심 커뮤니티에서 더 넓은 기술 포럼으로 전환되었으며, 이는 사용자 관심사가 일반 기술 주제로 변화했음을 반영합니다.",
      "이러한 변화로 인해 스타트업에 대한 열정이 감소했으며, 사용자들은 벤처 캐피털(VC) 모델과 혁신적인 아이디어의 부족에 대해 회의적인 반응을 보이고 있습니다.",
      "스타트업에서 일하는 것의 재정적 이점은 종종 의문시되며, 많은 직원들이 실질적인 수익을 경험하지 못하고 있어 기술 커뮤니티 내에서 우선순위의 변화가 있음을 나타냅니다."
    ],
    "points": 455,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1737453607
  },
  {
    "id": 42774221,
    "title": "콜 오브 듀티 안티 치트 역공학",
    "originLink": "https://ssno.cc/posts/reversing-tac-1-4-2025/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774221",
    "commentBody": "",
    "originSummary": [
      "블랙 옵스 콜드 워의 Treyarch Anti-Cheat (TAC)는 사용자 모드의 안티 치트 시스템으로, 모던 워페어의 Ricochet에 있는 커널 모드 구성 요소가 없습니다. TAC는 Arxan을 사용하여 난독화를 수행하며, 이는 런타임 실행 파일 암호 해독, 실행 파일 체크섬, 포인터 암호화와 같은 기술을 통해 리버스 엔지니어링을 복잡하게 만듭니다. 주요 안티 치트 기능으로는 API 훅킹, 디버그 레지스터, 네트워크 트래픽 모니터링, 외부 오버레이의 감지와 다양한 안티 디버깅 기술 및 훅을 우회하기 위한 사용자 정의 시스템 호출 스텁이 포함됩니다."
    ],
    "commentSummary": [
      "사용자들은 CS:GO와 Call of Duty와 같은 게임에서 안티 치트 문제를 겪고 있으며, 특히 특정 하드웨어를 사용하는 리눅스 사용자들에게 영향을 미치고 있습니다. 이 논의는 잘못된 금지, 윤리적 문제, 현재 안티 치트 시스템의 효과성 등 공정한 게임 플레이에 영향을 미치는 도전 과제를 강조합니다. 개인적인 이야기는 잘못된 비난을 해결하고 게임 경험을 향상시키기 위한 개선된 솔루션의 필요성을 강조합니다."
    ],
    "points": 442,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737414430
  },
  {
    "id": 42772995,
    "title": "엘론 머스크가 트럼프 취임식에서 나치 경례를 한 것처럼 보였는가?",
    "originLink": "https://www.jpost.com/international/article-838444",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772995",
    "commentBody": "",
    "originSummary": [
      "일론 머스크가 트럼프의 취임식에서 어떤 사람들은 나치 경례로 해석한 제스처를 취하는 모습이 관찰되어 소셜 미디어에서 논란이 일어났다. 반명예훼손연맹(ADL)은 그 제스처가 의도적인 경례라기보다는 어색한 순간일 가능성이 높다고 제안했으며, 일부는 이를 머스크의 아스퍼거 증후군에 기인한 것으로 보았다. 머스크는 웃는 이모티콘으로 논란에 응답하며, 자신의 우주 탐사 목표와 일치하는 트럼프의 화성 언급에 대해 열정을 표명했다."
    ],
    "commentSummary": [
      "엘론 머스크가 트럼프의 취임식에서 나치 경례를 했다는 비난을 받았고, 이로 인해 해커 뉴스에서 기술 플랫폼에서 이러한 주제를 논의하는 것이 적절한지에 대한 토론이 벌어졌다. 일부 사용자들은 머스크의 기술 산업에서의 영향력이 이 주제를 관련 있게 만든다고 주장한 반면, 다른 사용자들은 이 포럼에 적절하지 않다고 느꼈다. 이 논의는 검열에 대한 상반된 의견과 기술 커뮤니티 내에서 머스크의 행동이 미치는 영향에 대한 논란을 부각시켰다."
    ],
    "points": 283,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1737406930
  },
  {
    "id": 42773778,
    "title": "일론 머스크, 취임 집회에서 연이어 파시스트 경례를 하는 듯",
    "originLink": "https://www.theguardian.com/technology/2025/jan/20/trump-elon-musk-salute",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42773778",
    "commentBody": "",
    "originSummary": [
      "엘론 머스크는 도널드 트럼프의 취임 축하 행사에서 파시스트 스타일의 경례를 연상시키는 제스처를 취해 일부 사람들이 나치 경례로 해석하면서 반발에 직면했다.",
      "명예훼손방지연맹은 그 제스처가 나치 경례와 유사하다는 점을 인정했지만, 나중에 그것이 어색한 순간의 열정이었다고 제안하여 알렉산드리아 오카시오-코르테스의 비판을 받았습니다.",
      "머스크의 행동은 일부 극우 인사들에 의해 환영받았으며, 그의 정치적 성향과 의도에 대한 논쟁을 불러일으켰다."
    ],
    "commentSummary": [
      "일론 머스크가 취임 집회에서 한 제스처가 일부 사람들에게 파시스트 경례로 인식되면서 논란과 온라인 논쟁을 불러일으켰습니다. 이 사건은 해커 뉴스에서 논의가 표시되었고, 플랫폼의 중재 및 검열 정책에 대한 논쟁을 촉발했습니다. 이 상황은 정치적 담론에서 영향력 있는 기술 인물의 역할과 해커 뉴스와 같은 플랫폼에서의 중재 정책의 일관성에 대한 의문을 제기합니다."
    ],
    "points": 238,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1737411660
  },
  {
    "id": 42777938,
    "title": "메타, 인스타그램에서 '#Democrat' 검열",
    "originLink": "https://mstdn.chrisalemany.ca/@chris/113864600222476627",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777938",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "보도에 따르면 메타는 인스타그램에서 '#Democrat' 해시태그를 검열하고 있으며, 이는 소셜 미디어 플랫폼에서의 검열과 그 영향에 대한 논의를 불러일으키고 있습니다.",
      "영국, 스페인, 독일 등 여러 국가의 사용자들이 이 문제를 경험했지만, 일부는 문제가 해결되었다고 보고하고 있습니다.",
      "이 사건은 소셜 미디어 플랫폼의 영향력과 콘텐츠 조정과 검열 사이의 미묘한 균형에 대한 우려를 부각시키며, 자유 발언과 잠재적인 정치적 편향에 대한 논쟁을 불러일으킨다."
    ],
    "points": 224,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1737450496
  },
  {
    "id": 42779776,
    "title": "페이스북 없이 지역 사회를 조직하기?",
    "originLink": "https://news.ycombinator.com/item?id=42779776",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779776",
    "commentBody": "",
    "originSummary": [
      "그 개인은 지역 사회의 상호작용을 페이스북에서 자가 호스팅된 연합 플랫폼으로 전환하려고 하고 있으며, 이는 분산된 제어와 관리를 가능하게 합니다.",
      "그들은 이 이동을 촉진하기 위해 기성 솔루션이나 협력자를 찾고 있으며, 이는 접근 가능하고 맞춤화 가능한 옵션에 대한 필요성을 나타냅니다.",
      "이 문맥은 인구 약 50,000명의 여러 작은 마을이 있는 농촌 지역을 포함하며, 연결성과 지역 사회 참여의 중요성을 강조합니다."
    ],
    "commentSummary": [
      "저자는 지역 사회를 페이스북에서 자체 호스팅된 연합 플랫폼으로 전환하려고 하며, 이벤트 캘린더와 메시징과 같은 기능의 필요성을 강조하고 있습니다. 마스토돈과 같은 대안은 페이스북의 기능을 완전히 복제하지 못할 수 있어, 디스코스, 넥스트도어, 그룹스.io와 같은 다른 플랫폼을 고려하게 됩니다. 새로운 플랫폼이 지역 사회의 요구에 부합하는지 평가하고, 지역 신문과 이메일 목록과 같은 옵션도 고려하는 것이 중요합니다."
    ],
    "points": 217,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1737465542
  },
  {
    "id": 42780022,
    "title": "메타인지적 게으름: 생성적 인공지능이 학습 동기에 미치는 영향",
    "originLink": "https://bera-journals.onlinelibrary.wiley.com/doi/10.1111/bjet.13544",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42780022",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "한 연구는 ChatGPT와 같은 생성 AI 도구가 사용자가 AI에 지나치게 의존하게 되어 자기 조절 학습이 감소하는 '메타인지적 게으름'을 초래할 수 있음을 강조합니다. 이러한 AI 의존은 학습자가 정보를 이해하고 평가하는 데 적극적으로 참여하지 않을 수 있어 심층 학습과 비판적 사고 능력을 감소시킬 수 있습니다. AI가 작업 효율성을 향상시킬 수 있지만, 연구는 필수적인 인지 기술을 개발하기 위해 학습자가 학습 과정에 적극적으로 참여하는 것이 중요하다고 강조합니다."
    ],
    "points": 213,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1737467238
  },
  {
    "id": 42772983,
    "title": "공식 DeepSeek R1이 이제 Ollama에서 제공됩니다.",
    "originLink": "https://ollama.com/library/deepseek-r1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772983",
    "commentBody": "",
    "originSummary": [
      "DeepSeek는 수학, 코드 및 추론을 포함한 작업에서 OpenAI-o1과 동등한 성능을 발휘하는 1세대 추론 모델을 도입했습니다. 이 모델들은 15억에서 6710억 개의 매개변수로 크기가 크게 다르며, 다양한 저장 요구를 나타냅니다. 이러한 모델들은 MIT 라이선스 하에 접근 가능하여 광범위한 사용 및 수정이 가능합니다."
    ],
    "commentSummary": [
      "DeepSeek R1이라는 새로운 언어 모델이 이제 Ollama에서 사용할 수 있게 되어, 특히 천안문 광장과 같은 민감한 정치적 주제에 대한 검열에 관한 논의를 촉발하고 있습니다.",
      "논쟁은 정치적 올바름과 역사적 정확성 사이의 균형에 초점을 맞추고 있으며, 언어 모델에서의 정치적 편향에 대한 서구와 중국의 접근 방식을 비교하고 있다.",
      "오픈 소스 모델은 검열을 방지하기 위한 잠재적 해결책으로 제안되지만, 이러한 조치의 효과와 함의에 대한 의견은 다릅니다."
    ],
    "points": 210,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1737406824
  },
  {
    "id": 42779147,
    "title": "사람들은 자신이 먹는 것을 보고하는 데 서툽니다. 이는 식이 연구에 문제가 됩니다.",
    "originLink": "https://www.science.org/content/article/people-are-bad-reporting-what-they-eat-s-problem-dietary-research",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42779147",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "음식 섭취량을 정확하게 보고하는 것은 어려운 일이며, 훈련된 전문가들조차도 평균 53%의 오차로 포션 크기를 잘못 판단하는 경우가 많습니다. 기름과 지방과 같은 숨겨진 재료는 포션 크기 오류보다 덜 문제가 되며, 이는 음식 저울과 같은 정밀한 측정 도구의 필요성을 강조합니다. SnapCalorie와 같은 새로운 기술과 앱은 식단 추적의 정확성을 향상시키려 하지만, 높은 운영 비용으로 인해 종종 구독이 필요하며, 이는 사용자가 더 신중한 식단 선택을 하는 데 도움을 줄 수 있습니다."
    ],
    "points": 206,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1737460490
  },
  {
    "id": 42772170,
    "title": "ROCm 장치 지원 위시리스트",
    "originLink": "https://github.com/ROCm/ROCm/discussions/4276",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772170",
    "commentBody": "",
    "originSummary": [
      "ROCm은 향후 업데이트에서 지원할 GPU를 결정하기 위해 커뮤니티 피드백을 수집하고 있으며, 현재 호환성 세부 정보는 웹사이트에서 확인할 수 있습니다. 사용자들은 특히 오래된 소비자용 GPU에 대한 더 넓은 지원과 Windows 시스템과의 통합 개선을 요구하고 있습니다. 모든 아키텍처에 걸쳐 일관된 지원에 대한 강한 수요가 있으며, AI 애플리케이션에 VRAM의 중요성을 강조하고, AMD의 APU 지원 강화와 NVIDIA의 CUDA와 유사한 개발 프로세스를 요구하고 있습니다."
    ],
    "commentSummary": [
      "ROCm, AMD의 GPU 프로그래밍을 위한 소프트웨어 플랫폼은 하드웨어에 특화된 코드 컴파일로 인해 비판을 받고 있으며, 이는 Nvidia의 CUDA에 비해 일관되지 않은 GPU 지원을 초래하고 있습니다.",
      "사용자들은 AMD의 GPU에 대한 장기 지원 부족에 불만을 가지고 있으며, 일부는 구매 직후 지원이 중단되는 경험을 하고 있어, 플랫폼 간 지원 개선과 더 나은 문서를 요구하고 있습니다.",
      "커뮤니티는 AMD가 Nvidia처럼 모든 GPU를 지원할 것을 촉구하고 있으며, 일부 사용자는 GPU 시장에서 더 나은 경쟁을 위해 인텔에 대한 기대를 옮겼습니다."
    ],
    "points": 195,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1737401463
  },
  {
    "id": 42775029,
    "title": "Ruff: Rust로 작성된 Python 린터 및 코드 포매터",
    "originLink": "https://github.com/astral-sh/ruff",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42775029",
    "commentBody": "",
    "originSummary": [
      "Ruff DocsPlayground는 Rust로 작성된 Python 린터 및 코드 포매터로, Flake8 및 Black과 같은 전통적인 도구보다 10-100배 빠른 속도를 제공합니다. Python 3.13을 지원하며, VS Code와 같은 편집기와 통합되고, Flake8, Black, isort와 같은 여러 도구를 대체할 수 있으며, 모노레포 친화적입니다. Ruff는 Apache Airflow, FastAPI, Pandas와 같은 주요 프로젝트에서 널리 채택되고 있으며, pip, pipx 및 기타 패키지 관리자를 통해 설치할 수 있으며, pyproject.toml을 통한 구성 지원을 제공합니다."
    ],
    "commentSummary": [
      "Ruff는 Rust로 개발된 Python 린터 및 코드 포매터로, 속도와 효율성으로 주목받고 있으며 여러 도구를 하나로 통합하여 Python 개발을 단순화합니다.",
      "이 도구는 Python 커뮤니티 내에서 관심과 논쟁을 불러일으켰으며, 일부 개발자들은 그 성능과 단순성을 높이 평가하는 반면, 다른 이들은 새로운 도구에 대해 회의적인 입장을 유지하고 있습니다.",
      "벤처 캐피털 지원 조직인 Astral에 의해 개발된 Ruff는 특히 Python의 동적 타이핑과 대규모 프로젝트에서 타입 체커 및 린터의 사용에 미치는 영향과 관련하여 그 흥미와 논의에 기여하고 있습니다."
    ],
    "points": 185,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1737420581
  },
  {
    "id": 42777857,
    "title": "Kimi K1.5: LLM을 활용한 강화 학습 확장",
    "originLink": "https://github.com/MoonshotAI/Kimi-k1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42777857",
    "commentBody": "",
    "originSummary": [
      "Kimi k1.5는 최첨단 멀티모달 모델로, AIME, MATH-500, LiveCodeBench와 같은 벤치마크에서 최대 550%의 향상을 보이며, 단기 사고 체인(CoT) 작업에서 GPT-4o와 Claude Sonnet 3.5를 크게 능가합니다.",
      "여러 가지 모달리티에서 긴 CoT 성능에 있어 OpenAI의 o1과 일치하며, 긴 문맥 확장과 향상된 정책 최적화를 통한 강화 학습을 활용하면서 몬테카를로 트리 탐색과 같은 복잡한 방법을 피합니다.",
      "Kimi k1.5는 텍스트와 비전 데이터를 모두 학습하여 공동 추론이 가능하며, 곧 https://kimi.ai의 Kimi OpenPlatform을 통해 접근할 수 있게 됩니다."
    ],
    "commentSummary": [
      "중국을 포함한 일부 기업들은 실제 소프트웨어 개발 키트(SDK)나 라이브러리를 제공하지 않고 '연구 논문'과 코드 샘플을 게시하여 GitHub를 통해 제품을 홍보하고 있습니다.",
      "이 관행은 약속된 API(응용 프로그래밍 인터페이스)나 모델 가중치가 종종 실현되지 않기 때문에 허위 광고와 유사하게 오해의 소지가 있는 것으로 간주됩니다.",
      "GitHub 저장소를 홍보 도구로 사용하는 경향이 때때로 소스 코드가 부족한 경우가 있어 AI 연구 및 개발에서 투명성과 진정성에 대한 우려를 제기하고 있습니다."
    ],
    "points": 152,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1737449601
  },
  {
    "id": 42772771,
    "title": "저자들은 AI 불법 복제 조사에서 메타의 토렌트 클라이언트 로그와 시딩 데이터를 요청한다",
    "originLink": "https://torrentfreak.com/authors-seek-metas-torrent-client-logs-and-seeding-data-in-ai-piracy-probe-250120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42772771",
    "commentBody": "",
    "originSummary": [
      "메타는 비트토렌트를 통해 AI 모델을 훈련시키기 위해 LibGen의 저작권이 있는 책을 포함한 불법 복제 자료를 사용했다는 혐의로 소송에 직면하고 있습니다.",
      "리처드 카드리와 사라 실버먼을 포함한 작가들은 메타를 저작권 침해로 고소했으며, 메타는 자신의 행위가 공정 사용에 해당한다고 주장하고 있다.",
      "법원은 Meta의 토렌트 활동에 대한 새로운 혐의를 허용했으며, 저자들은 Meta의 토렌트 클라이언트 로그와 시딩 데이터에 대한 접근을 요구하고 있다. 이는 AI 훈련 데이터와 저작권 문제를 둘러싼 법적 도전 과제를 강조한다."
    ],
    "commentSummary": [
      "저자들은 토렌트 클라이언트 로그와 시딩 데이터를 증거로 사용하여 Meta가 AI 훈련을 위해 불법 복제된 콘텐츠를 사용할 가능성을 조사하고 있습니다.",
      "대규모 AI 훈련이 합법적으로 대규모 텍스트 데이터셋을 얻는 데 어려움이 있기 때문에 불법 복제된 콘텐츠에 의존하는지, 아니면 출판사와의 법적 접근 협상을 통해 가능성을 모색할 수 있는지에 대한 논쟁이 있다.",
      "공정 사용 및 저작권 침해를 포함한 법적 함의가 논의 중이며, 이는 기술 회사의 데이터 요구 사항과 기존 저작권 법률 간의 갈등을 부각시킵니다."
    ],
    "points": 150,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1737405488
  },
  {
    "id": 42774621,
    "title": "엘론, 취임 연설 중 나치 경례",
    "originLink": "https://www.youtube.com/watch?v=e2bbb-6Clhs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42774621",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "일론 머스크는 취임 연설 중 나치 경례를 했다는 의혹을 받으며 논란의 중심에 서 있으며, 그의 의도와 정치적 성향에 대한 논쟁을 불러일으키고 있다.",
      "이번 사건은 머스크의 연관성과 기술 커뮤니티의 반응에 대한 논의를 촉발하여 기술 산업 내의 정치적 역학을 부각시켰습니다.",
      "비평가들은 그 제스처가 잘못된 행동인지 아니면 의도적인 움직임인지에 대해 의견이 분분하며, 일부는 머스크의 과거 행동과 소속을 그의 의도를 나타내는 잠재적 증거로 언급하고 있다."
    ],
    "points": 139,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1737417209
  }
]
