[
  {
    "id": 42562750,
    "title": "سنة جديدة سعيدة 2025",
    "originLink": "https://news.ycombinator.com/item?id=42562750",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562750",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1117,
    "commentCount": 244,
    "retryCount": 0,
    "time": 1735688916
  },
  {
    "id": 42566112,
    "title": "كابتشا الموت",
    "originLink": "https://doom-captcha.vercel.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42566112",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DOOM CAPTCHA هو مشروع إبداعي يتطلب من المستخدمين لعب مستوى من لعبة DOOM الكلاسيكية كاختبار CAPTCHA، مما يبرز المهارات التقنية والحنين إلى الماضي. - يجد المستخدمون أنه تحدٍ بسبب غياب الضوابط الحديثة، مما يؤدي إلى ردود فعل متباينة حول عمليته وسهولة الوصول إليه. - يبرز المشروع، رغم كونه جديدًا، الاستياء المستمر من أنظمة CAPTCHA التقليدية، على الرغم من بنائه بمساعدة الذكاء الاصطناعي من Vercel وتكامل اللعبة اليدوي."
    ],
    "points": 613,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1735740735
  },
  {
    "id": 42562847,
    "title": "أشجار البحث الثابتة: أسرع من البحث الثنائي",
    "originLink": "https://curiouscoding.nl/posts/static-search-tree/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562847",
    "commentBody": "",
    "originSummary": [
      "تناقش المقالة تنفيذ وتحسين أشجار البحث الثابتة (أشجار S+) لتحقيق سرعة بحث أسرع بكثير في البيانات المرتبة، حيث تصل السرعة إلى 40 مرة أسرع من البحث الثنائي التقليدي. - يتم استخدام تقنيات تحسين مثل التجميع، والتحميل المسبق، وSIMD اليدوي (تعليمات واحدة، بيانات متعددة) لتعزيز إنتاجية الاستعلام. - تستكشف المقالة أيضًا تخطيطات الأشجار المختلفة، وأحجام العقد، واستراتيجيات إدارة الذاكرة، مع مناقشة العمل المستقبلي مثل البحث المتفرع والبحث التداخلي لتحسين كفاءة البحث بشكل أكبر."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على التحول من C/C++ إلى Rust في المحتوى الخوارزمي، خاصة في أشجار البحث الثابتة، بسبب فوائد الأمان والأداء التي يوفرها Rust.",
      "تُلاحظ الشعبية المتزايدة للغة Rust في البرمجة منخفضة المستوى، حيث يفضل بعض المستخدمين لغة C أو الكود الزائف لسهولة الوصول، بينما يقدر آخرون الميزات الحديثة للغة Rust.",
      "تستكشف المحادثة أيضًا إمكانيات لغة البرمجة Zig والتحديات المرتبطة بتعلم لغات جديدة، مما يعكس المشهد المتطور للغات البرمجة."
    ],
    "points": 543,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1735690083
  },
  {
    "id": 42565606,
    "title": "انخفاض بنسبة 30% في دقة معاينة o1 عندما يتم تغيير مشكلات بوتنام بشكل طفيف",
    "originLink": "https://openreview.net/forum?id=YXnwlZe0yf&noteId=yrsGpHd0Sf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42565606",
    "commentBody": "",
    "originSummary": [
      "تم تصميم معيار Putnam-AXIOM لتقييم نماذج اللغة الكبيرة (LLMs) في الاستدلال الرياضي المتقدم باستخدام مسائل من مسابقة بوتنام الرياضية. - يتضمن المعيار 236 مسألة أصلية ونسخة معدلة تحتوي على 52 مسألة لتجنب تلوث البيانات. - حقق النموذج الأعلى أداءً من OpenAI دقة بلغت 41.95% في المسائل الأصلية، لكنه شهد انخفاضًا كبيرًا في الأداء بحوالي 30% في المسائل المعدلة، مما يبرز التحديات في التكيف مع التغييرات."
    ],
    "commentSummary": [
      "كشفت دراسة عن انخفاض بنسبة 30% في دقة نموذج o1-Preview عند التعامل مع مسائل بوتنام عندما تم إدخال تغييرات طفيفة، مما يشير إلى تحديات تواجه النماذج اللغوية الكبيرة (LLMs) مع التغييرات الصغيرة. - تغذي هذه النتائج النقاش حول ما إذا كانت النماذج اللغوية الكبيرة تستطيع التفكير بشكل حقيقي أم أنها تعتمد بشكل أساسي على مطابقة الأنماط والحفظ، مشابهة للأخطاء البشرية تحت الضغط. - على الرغم من هذه التحديات، تستمر نماذج مثل o1 وo3 في الأداء الجيد في المسائل الرياضية المعقدة، رغم أن قدرتها على التعميم لا تزال تحت المراجعة."
    ],
    "points": 423,
    "commentCount": 381,
    "retryCount": 0,
    "time": 1735734078
  },
  {
    "id": 42566192,
    "title": "قواعد البيانات في عام 2024: مراجعة سنوية",
    "originLink": "https://www.cs.cmu.edu/~pavlo/blog/2025/01/2024-databases-retrospective.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42566192",
    "commentBody": "",
    "originSummary": [
      "شهدت ساحة قواعد البيانات في عام 2024 تغييرات كبيرة، بما في ذلك عمليات استحواذ رئيسية، وتحولات في التراخيص، واستمرار المنافسات بين اللاعبين الرئيسيين مثل Redis وElasticsearch وDatabricks وSnowflake. - اكتسب DuckDB شعبية في الاستعلامات التحليلية، مع تكاملات في Postgres، بينما تضمنت الإصدارات البارزة Amazon Aurora DSQL وMicrosoft Garnet. - كانت عمليات الاستحواذ مثل Tabular من قبل Databricks وOrioleDB من قبل Supabase ذات أهمية، وعلى الرغم من النكسات مثل إغلاق OtterTune، لا تزال الصناعة ديناميكية مع مشاريع جديدة وتمويل."
    ],
    "commentSummary": [
      "ينتقد النقاش واجهة برمجة تطبيقات Redis، حيث يجادل البعض بأن النقد يفتقر إلى فهم عميق لتصميم Redis ونموذج البيانات الفريد الخاص به.",
      "يُعرف Redis باستخدامه الفعال في تطبيقات محددة مثل لوحات الصدارة والأنظمة في الوقت الحقيقي، على الرغم من بعض الانتقادات المتعلقة بواجهة برمجة التطبيقات.",
      "تستكشف المحادثة أيضًا المشهد الأوسع لقواعد البيانات، بما في ذلك التحديات التي تواجه الشركات الناشئة، ودور SQL، وتطور تقنيات قواعد البيانات، مع التأكيد على أهمية فهم الأنظمة قبل انتقادها."
    ],
    "points": 305,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1735741659
  },
  {
    "id": 42564687,
    "title": "الكتب التي أحببت قراءتها في عام 2024",
    "originLink": "https://thoughts.wyounas.com/p/books-i-enjoyed-most-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42564687",
    "commentBody": "",
    "originSummary": [
      "تتضمن القائمة مجموعة متنوعة من الكتب، بما في ذلك التاريخية والفلسفية والعلمية والسرديات الشخصية، حيث يقدم كل منها رؤى فريدة وتجارب غنية.",
      "تشمل النقاط البارزة رسائل شيشرون للحصول على رؤى حول الحياة الرومانية، وأعمال بن-آري حول منطق علوم الكمبيوتر والتحقق من البرامج، ومذكرات ستيف مارتن حول النجاح في الكوميديا.",
      "تتضمن المجموعة أيضًا استكشافات فلسفية لبير هادو ونيتشه، ومآسي يونانية لأيسخيلوس، وأعمالًا أدبية لأورسولا لو جوين ورابندرانات طاغور."
    ],
    "commentSummary": [],
    "points": 289,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1735719369
  },
  {
    "id": 42568399,
    "title": "تيرينس تاو: تم رفض إحدى أوراقي اليوم",
    "originLink": "https://mathstodon.xyz/@tao/113721192051328193",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42568399",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تيرينس تاو، وهو عالم رياضيات بارز، شارك تجربة رفض ورقة بحثية له، مما يبرز حدوث الرفض بشكل متكرر في الأوساط الأكاديمية. - أثارت قصته نقاشات حول الطبيعة العشوائية للمراجعات من قبل الأقران والتحديات التي تواجه النشر الأكاديمي. - وأبرزت المحادثة أن الرفض جزء طبيعي من العملية الأكاديمية، حتى بالنسبة للباحثين البارزين، وأكدت على أهمية مشاركة الإخفاقات لمعالجة متلازمة المحتال."
    ],
    "points": 256,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735758777
  },
  {
    "id": 42565821,
    "title": "ببغاء API - عكس هندسة واجهات برمجة التطبيقات HTTP تلقائيًا",
    "originLink": "https://apiparrot.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42565821",
    "commentBody": "",
    "originSummary": [
      "API Parrot هو أداة جديدة مصممة لتبسيط أتمتة العمليات التجارية من خلال تحديد تلقائي للارتباطات بين طلبات API وتوفير تمثيل بياني للتدفق. - يسمح للمستخدمين بتسجيل الطلبات، وتحديد المدخلات والمخرجات، وتصدير هذه التدفقات ككود JavaScript، مما يجعل العملية أكثر كفاءة من الهندسة العكسية اليدوية أو استخدام تقنيات أقل كفاءة مثل أتمتة العمليات الروبوتية (RPA). - تم بناء الأداة على Electron وهي متاحة لكل من منصات Windows وLinux، مع توفر دليل تعليمي للهندسة العكسية لواجهة برمجة تطبيقات USPS."
    ],
    "commentSummary": [
      "API Parrot هو أداة تقوم بأتمتة الهندسة العكسية لواجهات برمجة التطبيقات HTTP، مما يسهل أتمتة العمليات التجارية من خلال تحديد الارتباطات بين الطلبات. - يقدم ميزات مثل تسجيل الطلبات، وتحديد المدخلات والمخرجات، وتصدير التدفقات كرمز JavaScript، مع تمثيل بياني للتدفق. - متاح حاليًا لنظامي التشغيل Windows وLinux، API Parrot مجاني، مع احتمال وجود نسخة \"احترافية\" للشركات، وخطط لإصدار لنظام macOS في المستقبل."
    ],
    "points": 241,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1735737303
  },
  {
    "id": 42562529,
    "title": "مكتب التحقيقات الفيدرالي: العثور على أكبر مخزون من المتفجرات محلية الصنع في تاريخ الوكالة في ولاية فرجينيا",
    "originLink": "https://thehill.com/national-security/5061535-virginia-man-arrested-explosives/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562529",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "كشفت مكتب التحقيقات الفيدرالي عن أكبر مخزون من المتفجرات المصنوعة منزليًا في تاريخه في ولاية فرجينيا، مما أدى إلى نقاش قانوني وعام كبير.",
      "المشتبه به متهم حاليًا فقط بحيازة بندقية قصيرة الماسورة، حيث يتم فحص قانونية أسلحته النارية.",
      "أثارت القضية نقاشات حول قوانين الأسلحة، والتعديل الثاني، والتوازن بين تنظيم الحكومة وحقوق الأفراد."
    ],
    "points": 224,
    "commentCount": 371,
    "retryCount": 0,
    "time": 1735686210
  },
  {
    "id": 42562743,
    "title": "ديجا فو: CVEs شبحية في عنوان الطرفية الخاصة بي",
    "originLink": "https://dgl.cx/2024/12/ghostty-terminal-title",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562743",
    "commentBody": "",
    "originSummary": [
      "كان لدى Ghostty، وهو محاكي طرفية جديد، ثغرة أمنية مشابهة لواحدة من عام 2003، تسمح لأحرف الهروب ASCII بتنفيذ أوامر مثل فتح التطبيقات. - كانت المشكلة ملحوظة بشكل خاص مع Zsh وBash في وضع vi، لكن Ghostty 1.0.1 قام بحل هذه المشكلة عن طريق تعطيل الميزة بشكل افتراضي. - على الرغم من العيب الأمني، يُشاد بـ Ghostty لميزاته، وقد عالج المطور المشكلة بسرعة، مقدماً إصلاحات وحلولاً للمستخدمين."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول الثغرات الأمنية في الطرفيات، خاصة تلك المتعلقة بتسلسلات الهروب، وتستكشف طرقًا للتخفيف من هذه المخاطر. - تشمل الاقتراحات لتعزيز أمان الطرفيات اعتماد أنظمة مشابهة لحلقات حماية وحدة المعالجة المركزية أو استدعاء النظام pledge() في OpenBSD، والتي تحد من القدرات لمنع الاستغلالات. - يعترف المشاركون بتحدي تحقيق التوازن بين الأمان والوظائف في تطبيقات الطرفيات ويعبرون عن اهتمامهم بمزيد من الاستكشاف والتعاون لتحسين ممارسات الأمان."
    ],
    "points": 185,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1735688876
  },
  {
    "id": 42563534,
    "title": "نماذج المفاهيم الكبيرة: نمذجة اللغة في فضاء تمثيل الجمل",
    "originLink": "https://github.com/facebookresearch/large_concept_model",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42563534",
    "commentBody": "",
    "originSummary": [
      "يقدم المستودع تنفيذات لنماذج المفاهيم الكبيرة (LCM)، التي تستخدم \"المفاهيم\" كتمثيل دلالي على مستوى أعلى لنمذجة اللغة.",
      "يدعم LCM 200 لغة نصية و57 لغة نطق باستخدام فضاء تضمين SONAR، ويتم تدريبه على التنبؤ بالجمل التلقائي باستخدام طرق مثل الانحدار MSE وتوليد قائم على الانتشار.",
      "يوفر المستودع تعليمات التثبيت، وتحضير البيانات، وإرشادات التدريب، والتعديل الدقيق، والتقييم، ويتم إصداره بموجب ترخيص MIT، باستخدام fairseq2 مع خيارات التثبيت عبر UV وpip."
    ],
    "commentSummary": [
      "تركز نماذج المفاهيم الكبيرة على تمثيل اللغة من حيث \"المفاهيم\" بدلاً من الرموز الفردية، بهدف تعزيز تجزئة الدلالات والتنبؤ.",
      "تقترح هذه الطريقة استخدام تمثيلات على مستوى أعلى لمحاكاة التخطيط والتواصل البشري، مما قد يوفر مزايا على النماذج التقليدية القائمة على الرموز.",
      "تتناول هذه المقاربة القيود الموجودة في هياكل نماذج اللغة الكبيرة الحالية من خلال التركيز على الهياكل الهرمية الصريحة لتحسين محاكاة التفكير البشري."
    ],
    "points": 151,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1735699102
  }
]
