[
  {
    "id": 42562750,
    "title": "2025 புத்தாண்டு வாழ்த்துக்கள்",
    "originLink": "https://news.ycombinator.com/item?id=42562750",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562750",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 1117,
    "commentCount": 244,
    "retryCount": 0,
    "time": 1735688916
  },
  {
    "id": 42566112,
    "title": "டூம் கேப்ட்சா",
    "originLink": "https://doom-captcha.vercel.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42566112",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். DOOM CAPTCHA என்பது பயனர்களை CAPTCHA சோதனையாக DOOM என்ற பாரம்பரிய விளையாட்டின் ஒரு நிலையை விளையாட வைக்கும் ஒரு படைப்பாற்றல் திட்டமாகும், இது தொழில்நுட்ப திறன்களையும் நினைவூட்டலையும் முன்னிலைப்படுத்துகிறது. - நவீன கட்டுப்பாடுகள் இல்லாததால் பயனர்கள் சவாலாக உணர்கிறார்கள், இதன் நடைமுறை மற்றும் அணுகல் திறனைப் பற்றிய கலவையான எதிர்வினைகளை ஏற்படுத்துகிறது. - இந்த திட்டம் புதுமையானதாக இருந்தாலும், Vercel இன் AI உதவியாளர் மற்றும் கையேடு விளையாட்டு ஒருங்கிணைப்புடன் கட்டப்பட்டிருந்தாலும், பாரம்பரிய CAPTCHA அமைப்புகளின் மீதான நிலையான அதிருப்தியை வலியுறுத்துகிறது."
    ],
    "points": 613,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1735740735
  },
  {
    "id": 42562847,
    "title": "நிலையான தேடல் மரங்கள்: பைனரி தேடலைவிட வேகமாக",
    "originLink": "https://curiouscoding.nl/posts/static-search-tree/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562847",
    "commentBody": "",
    "originSummary": [
      "கட்டுரை வரிசைப்படுத்தப்பட்ட தரவின் தேடலை 40 மடங்கு வேகமாகச் செய்ய, நிலையான தேடல் மரங்கள் (S+ மரங்கள்) செயல்படுத்தல் மற்றும் மேம்படுத்தல் குறித்து விவாதிக்கிறது. - தேடல் கேள்வி திறனையை மேம்படுத்துவதற்கான தொகுதி, முன்னேற்றம், மற்றும் கைமுறை SIMD (ஒற்றை கட்டளை, பல தரவுகள்) போன்ற மேம்பாட்டு நுட்பங்கள் பயன்படுத்தப்படுகின்றன. - கட்டுரை பல்வேறு மர அமைப்புகள், முறை அளவுகள், மற்றும் நினைவக மேலாண்மை உத்திகள் பற்றியும், தேடல் திறனை மேலும் மேம்படுத்த எதிர்கால பணிகள் போன்ற கிளை தேடல் மற்றும் இடைமறை தேடல் பற்றிய விவாதத்தையும் ஆராய்கிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம், குறிப்பாக நிலையான தேடல் மரங்களில், C/C++ இலிருந்து Rust க்கு மாற்றத்தை முக்கியமாகக் குறிப்பிடுகிறது, இது Rust இன் பாதுகாப்பு மற்றும் செயல்திறன் நன்மைகளால் ஏற்படுகிறது.",
      "ரஸ்ட் மொழியின் குறைந்த நிலை நிரலாக்கத்தில் வளர்ந்து வரும் பிரபலத்தன்மை குறிப்பிடப்பட்டுள்ளது, சில பயனர்கள் அணுகல் எளிமைக்காக C அல்லது பாசுடோ கோடை விரும்பினாலும், மற்றவர்கள் ரஸ்ட் மொழியின் நவீன அம்சங்களை மதிக்கின்றனர்.",
      "இந்த உரையாடல், புதிய மொழிகளை கற்றுக்கொள்வதில் உள்ள சவால்களை மற்றும் நிரலாக்க மொழிகளின் மாறிவரும் சூழலை பிரதிபலிக்கும் வகையில், Zig நிரலாக்க மொழியின் சாத்தியங்களைப் பற்றியும் ஆராய்கிறது."
    ],
    "points": 543,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1735690083
  },
  {
    "id": 42565606,
    "title": "புட்னம் பிரச்சினைகள் சிறிது மாறுபட்டால் o1-முன்னோட்ட துல்லியத்தில் 30% குறைவு",
    "originLink": "https://openreview.net/forum?id=YXnwlZe0yf&noteId=yrsGpHd0Sf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42565606",
    "commentBody": "",
    "originSummary": [
      "புட்னம்-அக்ஸியோம் என்பது புட்னம் கணிதப் போட்டியில் இருந்து பெறப்பட்ட சிக்கலான கணித காரணங்களை மதிப்பீடு செய்ய பெரிய மொழி மாதிரிகளை (LLMs) மதிப்பீடு செய்ய வடிவமைக்கப்பட்ட ஒரு அளவுகோல் ஆகும். - இந்த அளவுகோல் 236 அசல் பிரச்சினைகளை மற்றும் தரவுக் களங்கத்தை தவிர்க்க 52 மாற்றப்பட்ட பிரச்சினைகளுடன் ஒரு மாறுபாட்டை உள்ளடக்கியது. - ஓபன்ஏஐயின் சிறந்த செயல்திறன் கொண்ட மாதிரி அசல் பிரச்சினைகளில் 41.95% துல்லியத்தை அடைந்தது, ஆனால் மாற்றப்பட்ட பிரச்சினைகளில் சுமார் 30% குறைவான செயல்திறன் வீழ்ச்சியை அனுபவித்தது, மாறுபாடுகளுக்கு ஏற்ப மாறுவதில் சவால்களை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "உரை: ஒரு ஆய்வு, சிறிய மாற்றங்கள் அறிமுகப்படுத்தப்பட்டபோது Putnam பிரச்சினைகளில் o1-Preview மாதிரியின் துல்லியத்தில் 30% குறைவு ஏற்பட்டதை வெளிப்படுத்தியது, இது சிறிய மாற்றங்களுடன் பெரிய மொழி மாதிரிகளுக்கு (LLMs) சவால்களை குறிக்கிறது. - இந்த கண்டுபிடிப்புகள், LLMக்கள் உண்மையில் காரணம் கூற முடியுமா அல்லது அவை முதன்மையாக முறை பொருத்தம் மற்றும் நினைவகத்தை சார்ந்துள்ளதா என்ற விவாதத்தை ஊக்குவிக்கின்றன, மனித தவறுகள் அழுத்தத்தில் உள்ளதைப் போல. - இந்த சவால்கள் இருந்தபோதிலும், o1 மற்றும் o3 போன்ற மாதிரிகள் சிக்கலான கணித பிரச்சினைகளில் நன்றாக செயல்படுகின்றன, ஆனால் அவற்றின் பொது மயமாக்கும் திறன் இன்னும் ஆய்வில் உள்ளது."
    ],
    "points": 423,
    "commentCount": 381,
    "retryCount": 0,
    "time": 1735734078
  },
  {
    "id": 42566192,
    "title": "2024 இல் தரவுத்தளங்கள்: ஒரு வருட மதிப்பீடு",
    "originLink": "https://www.cs.cmu.edu/~pavlo/blog/2025/01/2024-databases-retrospective.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42566192",
    "commentBody": "",
    "originSummary": [
      "உரை: 2024 ஆம் ஆண்டில் தரவுத்தள காட்சி முக்கியமான மாற்றங்களை சந்தித்தது, அதில் முக்கியமான கையகப்படுத்தல்கள், உரிமம் மாற்றங்கள் மற்றும் Redis, Elasticsearch, Databricks, Snowflake போன்ற முக்கிய வீரர்களிடையே தொடர்ந்த போட்டிகள் அடங்கும். - DuckDB பகுப்பாய்வு வினவல்களுக்கு பிரபலமடைந்தது, Postgres உடன் ஒருங்கிணைப்புகளுடன், அதேசமயம் Amazon Aurora DSQL மற்றும் Microsoft Garnet போன்ற குறிப்பிடத்தக்க வெளியீடுகள் இடம்பெற்றன. - Databricks ஆல் Tabular மற்றும் Supabase ஆல் OrioleDB போன்ற கையகப்படுத்தல்கள் முக்கியமானவை, மேலும் OtterTune இன் மூடல் போன்ற பின்னடைவுகள் இருந்தபோதிலும், புதிய திட்டங்கள் மற்றும் நிதியுதவிகளுடன் தொழில் துறையில் இயக்கம் தொடர்கிறது."
    ],
    "commentSummary": [
      "Redis' API குறித்து விவாதம் விமர்சிக்கப்படுகிறது, அதில் சிலர் Redis' வடிவமைப்பு மற்றும் அதன் தனித்துவமான தரவுக் கோட்பாட்டை ஆழமாகப் புரிந்துகொள்ளாமல் விமர்சனம் செய்யப்படுவதாக வாதிடுகின்றனர்.",
      "Redis என்பது சில API விமர்சனங்கள் இருந்தாலும், தலைவர்களின் பட்டியல் மற்றும் நேரடி முறைமைகள் போன்ற குறிப்பிட்ட பயன்பாடுகளில் அதன் திறமையான பயன்பாட்டிற்காக அறியப்படுகிறது.",
      "தமிழில் எழுத வேண்டும். உரையாடல் மேலும் பரந்த தரவுத்தொகுப்பு காட்சியையும் ஆராய்கிறது, இதில் தொடக்க நிறுவனங்களுக்கு எதிர்கொள்ளும் சவால்கள், SQL இன் பங்கு மற்றும் தரவுத்தொகுப்பு தொழில்நுட்பங்களின் பரிணாமம் ஆகியவை அடங்கும், அமைப்புகளை விமர்சிப்பதற்கு முன் அவற்றை புரிந்துகொள்வது முக்கியம் என்பதை வலியுறுத்துகிறது."
    ],
    "points": 305,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1735741659
  },
  {
    "id": 42564687,
    "title": "2024 இல் நான் விரும்பி வாசித்த புத்தகங்கள்",
    "originLink": "https://thoughts.wyounas.com/p/books-i-enjoyed-most-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42564687",
    "commentBody": "",
    "originSummary": [
      "பட்டியலில் வரலாற்று, தத்துவ, அறிவியல் மற்றும் தனிப்பட்ட கதைகள் உள்ளிட்ட பல்வேறு வகையான புத்தகங்கள் இடம்பெற்றுள்ளன, ஒவ்வொன்றும் தனித்துவமான பார்வைகளை வழங்கி, செழுமையான அனுபவங்களை வழங்குகின்றன.",
      "தமிழில் எழுத வேண்டும். உள்ளடக்கத்தில் சிசெரோவின் கடிதங்கள் ரோமன் வாழ்க்கையின் பார்வைகளை வழங்குகின்றன, பென்-அரியின் கணினி அறிவியல் தர்க்கம் மற்றும் நிரல் சரிபார்ப்பு குறித்த படைப்புகள், மற்றும் ஸ்டீவ் மார்டினின் நகைச்சுவை வெற்றியைப் பற்றிய சுயசரிதை ஆகியவை அடங்கும்.",
      "இந்தத் தொகுப்பில் பியர் ஹடோ மற்றும் நிட்ஷே ஆகியோரின் தத்துவ ஆராய்ச்சிகள், எஸ்கிலஸ் எழுதிய கிரேக்க துன்ப நாடகங்கள், மற்றும் உர்சுலா லெ குவின் மற்றும் ரவீந்திரநாத் தாகூர் ஆகியோரின் இலக்கிய படைப்புகள் அடங்கும்."
    ],
    "commentSummary": [],
    "points": 289,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1735719369
  },
  {
    "id": 42568399,
    "title": "டெரன்ஸ் டாவ்: இன்று எனது ஒரு ஆய்வு கட்டுரை நிராகரிக்கப்பட்டது",
    "originLink": "https://mathstodon.xyz/@tao/113721192051328193",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42568399",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "டெரன்ஸ் டாவ், ஒரு முக்கிய கணிதவியலாளர், ஒரு கட்டுரை நிராகரிக்கப்பட்ட அனுபவத்தை பகிர்ந்து கொண்டார், இது கல்வியியல் துறையில் நிராகரிப்புகள் அடிக்கடி நிகழ்வாக இருப்பதை வலியுறுத்துகிறது. - அவரது கதை, சமீபத்திய மதிப்பீடுகளின் தற்காலிக தன்மை மற்றும் கல்வியியல் வெளியீட்டில் எதிர்கொள்ளப்படும் சவால்கள் குறித்து விவாதங்களை தூண்டியது. - இந்த உரையாடல், முன்னணி ஆராய்ச்சியாளர்களுக்குப் பிறகும் நிராகரிப்பு கல்வியியல் செயல்முறையின் ஒரு சாதாரண பகுதியாக இருப்பதை வெளிப்படுத்தியது மற்றும் தன்னம்பிக்கை குறைபாட்டை சமாளிக்க தோல்விகளை பகிர்வதன் முக்கியத்துவத்தை வலியுறுத்தியது."
    ],
    "points": 256,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1735758777
  },
  {
    "id": 42565821,
    "title": "API Parrot – HTTP APIகளை தானாகவே ரிவர்ஸ் என்ஜினியர் செய்யவும்",
    "originLink": "https://apiparrot.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42565821",
    "commentBody": "",
    "originSummary": [
      "API Parrot என்பது வணிக செயல்முறைகளின் தானியக்கத்தை எளிமைப்படுத்த புதிய கருவியாகும், இது API கோரிக்கைகளுக்கு இடையிலான தரவுத் தொடர்புகளை தானாகவே அடையாளம் காண்கிறது மற்றும் ஒரு கிராபிகல் ஓட்டம் பிரதிநிதித்துவத்தை வழங்குகிறது. - இது பயனர்களுக்கு கோரிக்கைகளை பதிவு செய்ய, உள்ளீடுகள் மற்றும் வெளியீடுகளை வரையறுக்க, மற்றும் இந்த ஓட்டங்களை ஜாவாஸ்கிரிப்ட் குறியீடாக ஏற்றுமதி செய்ய அனுமதிக்கிறது, இது கையேடு ரிவர்ஸ் என்ஜினியரிங் அல்லது ரோபோடிக் செயல்முறை தானியக்கம் (RPA) போன்ற குறைவான தொழில்நுட்பங்களைப் பயன்படுத்துவதைக் காட்டிலும் செயல்முறையை மேலும் திறமையாக ஆக்குகிறது. - இந்த கருவி எலக்ட்ரான் மீது கட்டப்பட்டுள்ளது மற்றும் விண்டோஸ் மற்றும் லினக்ஸ் தளங்களில் கிடைக்கிறது, மேலும் USPS API ஐ ரிவர்ஸ் என்ஜினியரிங் செய்ய ஒரு பயிற்சி கிடைக்கிறது."
    ],
    "commentSummary": [
      "API Parrot என்பது HTTP APIகளின் ரிவர்ஸ் என்ஜினியரிங்கை தானியங்கி செய்யும் ஒரு கருவியாகும், கோரிக்கைகளுக்கு இடையிலான தரவுச் சம்பந்தங்களை அடையாளம் காண்பதன் மூலம் வணிக செயல்முறைகளை தானியங்கி செய்ய உதவுகிறது. - இது கோரிக்கைகளை பதிவு செய்தல், உள்ளீடுகள் மற்றும் வெளியீடுகளை வரையறுத்தல், மற்றும் ஜாவாஸ்கிரிப்ட் குறியீடாக ஓட்டங்களை ஏற்றுமதி செய்தல் போன்ற அம்சங்களை வழங்குகிறது, ஒரு கிராபிகல் ஓட்ட பிரதிநிதித்துவத்துடன். - தற்போது விண்டோஸ் மற்றும் லினக்ஸிற்காக கிடைக்கின்ற API Parrot இலவசமாக உள்ளது, வணிகங்களுக்கான ஒரு \"ப்ரோ\" பதிப்பு மற்றும் எதிர்காலத்தில் macOS வெளியீட்டிற்கான திட்டங்களுடன்."
    ],
    "points": 241,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1735737303
  },
  {
    "id": 42562529,
    "title": "FBI: வரலாற்றில் மிகப்பெரிய கையால் தயாரிக்கப்பட்ட வெடிகுண்டுகள் களஞ்சியம் விர்ஜீனியாவில் கண்டுபிடிக்கப்பட்டது",
    "originLink": "https://thehill.com/national-security/5061535-virginia-man-arrested-explosives/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562529",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "எஃப்பிஐ தனது வரலாற்றில் மிகப்பெரிய அளவிலான கையால் தயாரிக்கப்பட்ட வெடிகுண்டுகளை விர்ஜீனியாவில் கண்டுபிடித்தது, இது முக்கியமான சட்ட மற்றும் பொது விவாதத்திற்கு வழிவகுத்தது.",
      "சந்தேகநபர் தற்போது குறுகிய துப்பாக்கியை வைத்திருப்பதற்காக மட்டுமே குற்றம் சாட்டப்பட்டுள்ளார், ஏனெனில் அவரது துப்பாக்கிகளின் சட்டபூர்வத்தன்மை பரிசீலிக்கப்படுகிறது.",
      "இந்த வழக்கு துப்பாக்கி சட்டங்கள், இரண்டாவது திருத்தம், மற்றும் அரசாங்க ஒழுங்குமுறை மற்றும் தனிநபர் உரிமைகள் ஆகியவற்றுக்கு இடையிலான சமநிலையைப் பற்றிய விவாதங்களைத் தூண்டியுள்ளது."
    ],
    "points": 224,
    "commentCount": 371,
    "retryCount": 0,
    "time": 1735686210
  },
  {
    "id": 42562743,
    "title": "டெஜா வு: என் டெர்மினல் தலைப்பில் பேய்கள் போன்ற CVEs",
    "originLink": "https://dgl.cx/2024/12/ghostty-terminal-title",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42562743",
    "commentBody": "",
    "originSummary": [
      "கோஸ்ட்டி, ஒரு புதிய டெர்மினல் எமுலேட்டர், 2003 இல் இருந்ததற்கு ஒத்த ஒரு பாதுகாப்பு பாதிப்பை கொண்டிருந்தது, இது ASCII எஸ்கேப் எழுத்துக்களை பயன்பாடுகளை திறக்க போன்ற கட்டளைகளை இயக்க அனுமதித்தது. - இந்த பிரச்சனை குறிப்பாக Zsh மற்றும் Bash இல் vi முறையில் மிகவும் சிக்கலாக இருந்தது, ஆனால் கோஸ்ட்டி 1.0.1 இந்த அம்சத்தை இயல்பாக முடக்குவதன் மூலம் இதை தீர்த்துவிட்டது. - பாதுகாப்பு குறைபாடு இருந்தபோதிலும், கோஸ்ட்டி அதன் அம்சங்களுக்காக பாராட்டப்படுகிறது, மேலும் டெவலப்பர் உடனடியாக இந்த பிரச்சனையை தீர்த்து, பயனர்களுக்கு சரிசெய்தல் மற்றும் மாற்று வழிகளை வழங்கினார்."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். விவாதம், குறிப்பாக தப்பிக்கும் வரிசைகளுடன் தொடர்புடையவை, மற்றும் இந்த ஆபத்துகளை குறைப்பதற்கான வழிகளை ஆராய்கிறது. - டெர்மினல் பாதுகாப்பை மேம்படுத்துவதற்கான பரிந்துரைகள் CPU பாதுகாப்பு வளையங்கள் அல்லது OpenBSD இன் pledge() syscall போன்ற அமைப்புகளை ஏற்கும், சாத்தியமான தாக்குதல்களைத் தடுக்க திறன்களை வரையறுக்கும். - பங்கேற்பாளர்கள் டெர்மினல் பயன்பாடுகளில் பாதுகாப்பையும் செயல்பாட்டையும் சமநிலைப்படுத்துவதன் சவால்களை ஒப்புக்கொண்டு, பாதுகாப்பு நடைமுறைகளை மேம்படுத்துவதற்கான மேலதிக ஆராய்ச்சி மற்றும் ஒத்துழைப்பில் ஆர்வம் காட்டுகின்றனர்."
    ],
    "points": 185,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1735688876
  },
  {
    "id": 42563534,
    "title": "பெரிய கருத்து மாதிரிகள்: ஒரு வாக்கிய பிரதிநிதித்துவ இடத்தில் மொழி மாதிரியாக்கம்",
    "originLink": "https://github.com/facebookresearch/large_concept_model",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42563534",
    "commentBody": "",
    "originSummary": [
      "களஞ்சியம், மொழி மாதிரிக்கான உயர் நிலை அர்த்தவியல் பிரதிநிதித்துவமாக 'கொள்கைகளை' பயன்படுத்தும் பெரிய கொள்கை மாதிரிகளுக்கான (LCM) செயலாக்கங்களை வழங்குகிறது.",
      "LCM 200 உரை மொழிகளையும் 57 பேச்சு மொழிகளையும் SONAR எம்பெடிங் இடத்தைப் பயன்படுத்தி ஆதரிக்கிறது, மேலும் MSE ரிக்ரெஷன் மற்றும் டிஃப்யூஷன் அடிப்படையிலான உருவாக்கம் போன்ற முறைகளுடன் தானியங்கி-மறுமொழி வாக்கியம் கணிப்புக்காக பயிற்சியளிக்கப்படுகிறது.",
      "களஞ்சியம் நிறுவல் வழிமுறைகள், தரவுத் தயாரிப்பு, பயிற்சி, நுணுக்கமாக்கல் மற்றும் மதிப்பீட்டு வழிகாட்டுதல்களை வழங்குகிறது மற்றும் இது MIT உரிமத்தின் கீழ் வெளியிடப்பட்டுள்ளது, UV மற்றும் pip நிறுவல் விருப்பங்களுடன் fairseq2 ஐப் பயன்படுத்துகிறது."
    ],
    "commentSummary": [
      "பெரிய கருத்து மாதிரிகள், தனிப்பட்ட குறியீடுகளுக்கு பதிலாக \"கருத்துகள்\" அடிப்படையில் மொழியை பிரதிநிதித்துவப்படுத்துவதில் கவனம் செலுத்துகின்றன, அர்த்தமுள்ள தொகுதிகள் மற்றும் முன்னறிவிப்பை மேம்படுத்துவதற்காக.",
      "இந்த முறை மனித திட்டமிடல் மற்றும் தொடர்பை பின்பற்ற உயர் நிலை பிரதிநிதித்துவங்களைப் பயன்படுத்துவதைக் குறிக்கிறது, இது பாரம்பரிய டோக்கன் அடிப்படையிலான மாதிரிகளுக்கு மேல் நன்மைகளை வழங்கக்கூடும்.",
      "இந்த அணுகுமுறை, தற்போதைய பெரிய மொழி மாதிரி (LLM) கட்டமைப்புகளில் உள்ள குறைபாடுகளை, மனித தர்க்கத்தை மேம்படுத்துவதற்காக வெளிப்படையான அடுக்குமுறை அமைப்புகளை முக்கியமாகக் கொண்டு தீர்க்கிறது."
    ],
    "points": 151,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1735699102
  }
]
