[
  {
    "id": 42663231,
    "title": "كن على دراية بتأثير ملف Makefile",
    "originLink": "https://blog.yossarian.net/2025/01/10/Be-aware-of-the-Makefile-effect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42663231",
    "commentBody": "",
    "originSummary": [
      "يصف \"تأثير ملف Makefile\" ممارسة المهندسين في نسخ وتعديل التكوينات المعقدة الموجودة، مثل ملفات Makefile، بدلاً من إنشاء جديدة من الصفر. - هذا النهج شائع في أنظمة مختلفة، مثل تكوينات التكامل المستمر/النشر المستمر (CI/CD) وأنظمة البناء، ويمكن أن يشير إلى أدوات معقدة للغاية أو سيئة التصميم. - وعلى الرغم من أنه ليس سلبيًا بطبيعته، إلا أن تأثير ملف Makefile يمكن أن يعيق التعلم، ويعقد الأمان، ويؤدي إلى تصحيح الأخطاء بشكل غير فعال، مما يبرز الحاجة إلى تصميم أدوات مدروس يأخذ في الاعتبار القابلية للتكوين وسهولة الاستخدام."
    ],
    "commentSummary": [
      "يصف \"تأثير ملف البناء\" ميل المطورين إلى نسخ وتعديل الشيفرة أو التكوينات دون فهم كامل لها، وغالبًا ما يكون ذلك بسبب تعقيد الأدوات أو قلة استخدامها.",
      "هذه الظاهرة منتشرة على نطاق واسع في مهام البرمجة والتكوين، حيث يستخدم المطورون الحلول المعروفة لتوفير الوقت والجهد، مما قد يؤدي إلى كود يصعب صيانته.",
      "تؤكد المناقشة على الحاجة إلى تحقيق توازن بين استخدام القوالب والحلول الموجودة وبين اكتساب فهم أعمق للأدوات والأنظمة المعنية."
    ],
    "points": 238,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1736568792
  },
  {
    "id": 42661185,
    "title": "البوابات والزلازل",
    "originLink": "https://30fps.net/pages/pvs-portals-and-quake/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42661185",
    "commentBody": "",
    "originSummary": [
      "المقالة هي الأولى في سلسلة \"إزالة الغموض عن PVS\"، تركز على نظام الرؤية المحسوب مسبقًا في Quake لمعالجة مشكلة الرسم الزائد، حيث يتم رسم البكسلات عدة مرات. - يستخدم Quake تقنية استبعاد البوابات ومجموعات الرؤية المحتملة (PVS) عن طريق تقسيم العالم إلى خلايا وبوابات، وحساب الرؤية مسبقًا لتحسين عملية الرسم. - تقدم المقالة فئات Portal وLeaf في vis.py، وهي إعادة تنفيذ بلغة بايثون لخوارزمية الرؤية في Quake، مع تسليط الضوء على استخدام مصفوفة رؤية من ورقة إلى ورقة."
    ],
    "commentSummary": [
      "استفاد مصممو مستويات لعبة Quake من فرش \"التلميح\" و\"بوابات المنطقة\" لتحسين أداء اللعبة، وهي تقنية كانت أساسية في الرسومات ثلاثية الأبعاد. - ألعاب مثل Prey وPortal سلطت الضوء على البوابات كآليات للعب، رغم أن المفهوم قد تم استخدامه في العرض منذ الرسومات ثلاثية الأبعاد المبكرة. - استخدم محرك Unreal Engine 1 المناطق للتحسين، وتستمر المحركات الحديثة مثل Unreal Engine 5 في استخدام طرق مماثلة لتعزيز كفاءة العرض."
    ],
    "points": 183,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1736549293
  },
  {
    "id": 42660335,
    "title": "إصلاحات الأخطاء في Phi-4",
    "originLink": "https://unsloth.ai/blog/phi4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42660335",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "اكتشف دانيال هانشين وأصلح أخطاء في نموذج اللغة الكبير Phi-4 من مايكروسوفت، مثل مشاكل إنهاء الجمل ومطالبات قوالب الدردشة. - قام بتحويل Phi-4 إلى بنية Llama، مما عزز الأداء، وشارك الإصلاحات على منصة Hugging Face، وهي منصة لنماذج التعلم الآلي. - يتوفر دفتر ملاحظات Colab لتخصيص Phi-4، وبينما حسنت الإصلاحات الأداء في بعض المعايير، فقد قللته في أخرى؛ يعمل فريق Phi-4 على دمج هذه التحسينات في النموذج الأصلي."
    ],
    "points": 176,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1736543841
  },
  {
    "id": 42661432,
    "title": "رياضيات خاطئة جدًا",
    "originLink": "https://www.charlespetzold.com/blog/2025/01/Very-Wrong-Math.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42661432",
    "commentBody": "",
    "originSummary": [
      "ارتكبت شركة تصميم وإنشاء خطأً رياضيًا على فيسبوك، حيث حسبت بشكل غير صحيح نصف قطر الأرض ليكون 4,333 قدمًا، مما أدى إلى تقدير محيطها بشكل منخفض للغاية ليكون أكثر بقليل من 5 أميال.",
      "نشأ الخطأ من حساب أطوال الأقواس دون استخدام نصف قطر الأرض الفعلي، والذي يبلغ حوالي 3,959 ميلاً.",
      "أبرز المنشور أن القوس الخارجي كان أطول بأقل من 1% من القوس الداخلي، مما يشير إلى احتمال تقليل وقت الطيران بسبب انخفاض مقاومة الهواء."
    ],
    "commentSummary": [
      "ادعى أحد صانعي المحتوى على يوتيوب بشكل غير صحيح أن خطوط الشاقول ستكون متوازية على أرض مسطحة، مما يعكس سوء فهم لانحناء الأرض، الذي يكون ضئيلاً في مثل هذه القياسات. - سلط النقاش الضوء على فشل الحدس في فهم المفاهيم واسعة النطاق وتناول نظريات الأرض المسطحة، وسوء الفهم حول الجاذبية، وتأثير دوران الأرض على الطيران. - تناولت المحادثة بشكل فكاهي استمرار المعتقدات الخاطئة وصعوبة شرح المفاهيم العلمية لأولئك الذين يرفضون العلم الراسخ."
    ],
    "points": 170,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1736550656
  },
  {
    "id": 42660942,
    "title": "بناء الزينة",
    "originLink": "https://ianthehenry.com/posts/bauble/building-bauble/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42660942",
    "commentBody": "",
    "originSummary": [
      "باوبل هو أداة لتصميم النماذج ثلاثية الأبعاد وعرضها، يستخدم وظائف المسافة الموقعة (SDFs) لإنشاء أشكال ورسوم متحركة معقدة. - في البداية كان نظامًا أساسيًا لتوليد مظللات GLSL، وقد تم إعادة كتابة باوبل ليشمل ميزات مثل تصدير النماذج ثلاثية الأبعاد، التحرير التفاعلي، والإضاءة المخصصة. - تدعم الأداة الآن تضمين الويب، تحرير المتجهات التفاعلي، وتوفر وثائق شاملة، مما يجعلها متاحة للمشاريع الإبداعية والمستخدمين المهتمين بتصميم ثلاثي الأبعاد."
    ],
    "commentSummary": [
      "مشروع بناء باوبل، الذي تم عرضه على موقع ianthehenry.com، أثار الحماس من خلال استعراض سحر ومتعة البرمجة، خاصة في مجال الترميز والرسوميات.",
      "يُشيد بالمشروع لإبداعه وكتابته التفصيلية، مما يلهم القراء لإعادة النظر في المشاريع غير المكتملة واستكشاف تقنيات جديدة مثل Janet (لغة برمجة) وGLSL (لغة تظليل OpenGL).",
      "على الرغم من بعض المشاكل التقنية في متصفح سفاري، يُحتفى بالمشروع لتنفيذه المذهل وقصة تطويره الجذابة، مما أثار نقاشات حول المشاريع الشخصية واستخدام قارئات RSS."
    ],
    "points": 164,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1736547735
  },
  {
    "id": 42664400,
    "title": "تقريبًا جميع عمليات البحث الثنائي والدمج مكسورة (2006)",
    "originLink": "https://research.google/blog/extra-extra-read-all-about-it-nearly-all-binary-searches-and-mergesorts-are-broken/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42664400",
    "commentBody": "",
    "originSummary": [
      "في عام 2006، حدد جوشوا بلوخ خطأً في خوارزمية البحث الثنائي، الذي تم الإشارة إليه في البداية في كتاب جون بنتلي \"Programming Pearls\"، حيث يحدث تجاوز عند تجاوز قيمتي 'low' و'high' الحد الأقصى لقيمة int.",
      "كانت هذه المشكلة، التي تؤثر على المصفوفات ذات الأطوال التي تبلغ 2^30 أو أكثر، نادرة في الثمانينيات ولكنها أصبحت أكثر شيوعًا اليوم، حيث تؤثر أيضًا على خوارزميات الدمج والترتيب الأخرى التي تعتمد على التقسيم والغزو.",
      "يوصي بلوخ بحل المشكلة عن طريق حساب نقطة المنتصف باستخدام `int mid = low + ((high - low) / 2);`، مشيرًا إلى التحديات التي تواجه كتابة كود خالٍ من الأخطاء وضرورة إجراء اختبارات شاملة."
    ],
    "commentSummary": [
      "تتعرض العديد من عمليات البحث الثنائي وعمليات الدمج للفرز لمشاكل تجاوز السعة الصحيحة، خاصة في التطبيقات القديمة، كما تم تسليط الضوء عليها في مقال عام 2006.",
      "تؤكد المقالة على أهمية مراعاة الحالات الحديّة والقيود المتعلقة بالأجهزة في البرمجة، وهو أمر لا يزال ذو صلة حتى اليوم.",
      "يُنصح المطورون باستخدام الدوال المدمجة أو أنواع الأعداد الصحيحة الأكبر لمنع مثل هذه الأخطاء، مما يبرز الحاجة إلى الحذر عند التعامل مع أنواع البيانات وأحجام المدخلات."
    ],
    "points": 143,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1736585205
  },
  {
    "id": 42665367,
    "title": "تتبع أجهزتك عبر شبكة Apple FindMy باستخدام Go/TinyGo",
    "originLink": "https://github.com/hybridgroup/go-haystack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42665367",
    "commentBody": "",
    "originSummary": [
      "يتيح Go Haystack تتبع الأجهزة الشخصية التي تعمل بتقنية البلوتوث عبر شبكة \"Find My\" التابعة لأبل دون الحاجة إلى أجهزة أبل، وذلك باستخدام OpenHaystack وMacless-Haystack مع أدوات Go/TinyGo.",
      "يمكن للمستخدمين إنشاء مناراتهم الخاصة باستخدام برنامج TinyGo الثابت على أجهزة مثل لوحات Adafruit Bluefruit وBBC Microbit، مع ضرورة إعداد معرف Apple مع المصادقة الثنائية (2FA).",
      "تشمل العملية تثبيت أداة go-haystack، واستخدام أوامر مثل `haystack scan` لتحديد موقع الأجهزة، وتوليد المفاتيح، وتفليش الجهاز، ورفع ملف JSON إلى macless-haystack لظهور الجهاز في واجهة المستخدم على الويب."
    ],
    "commentSummary": [
      "يمكن استخدام شبكة Apple FindMy مع Go/TinyGo لتتبع الأجهزة، مما يوفر طريقة لتوسيع الشبكة دون الحاجة إلى حساب Apple.",
      "يتم تخفيف مخاوف الخصوصية من خلال تصميم شركة آبل، ولدى الشركة سمعة قوية في الحفاظ على خصوصية المستخدم، على الرغم من أن بعض المستخدمين لا يزالون حذرين من المراقبة المحتملة.",
      "تعمل شبكة FindMy في جزأين: أجهزة Apple التي تحدد مواقع العناصر وأجهزة المستخدمين التي ترفع بيانات الموقع إلى Apple، مع وجود خيار للمستخدمين لتعطيل الميزة إذا رغبوا في ذلك."
    ],
    "points": 139,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1736597674
  },
  {
    "id": 42665222,
    "title": "حالة فيم",
    "originLink": "https://lwn.net/SubscriberLink/1002342/a8d8a17f30968b93/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42665222",
    "commentBody": "",
    "originSummary": [
      "بعد وفاة مؤسس Vim برام مولينار في عام 2023، أعادت مجتمع Vim تنظيم نفسه لضمان استمرار تطوير المشروع، مع كريستيان براباندت كالمسؤول الحالي. - في مؤتمر VimConf 2024، نوقش أن الفريق قد توسع، مع التركيز على تحديث موقع Vim الإلكتروني، وإدارة الأمن، وتعزيز قنوات الاتصال. - لا يزال Vim في وضع الصيانة، مع إعطاء الأولوية لاحتياجات المجتمع ودمج الميزات الجديدة بعناية، مع الاستمرار في دعم ICCF هولندا، وهي جمعية خيرية أسسها مولينار."
    ],
    "commentSummary": [
      "يستعرض مستخدمو Vim القدامى مستقبل المحرر بعد وفاة مبتكره، برام مولينار، حيث يشعر البعض بالرضا عن استقراره الحالي بينما يستكشف آخرون بدائل مثل Neovim للحصول على ميزات حديثة.",
      "يحظى Neovim بالاهتمام لدعمه لبرمجة Lua والتحسينات الحديثة، بينما يفكر بعض المستخدمين في استخدام Emacs بسبب الانقسام الملحوظ بين Vim وNeovim.",
      "تشمل المناقشات بين المستخدمين مواضيع مثل أداء Treesitter، ودعم بروتوكول خادم اللغة (LSP)، والمقارنات مع Visual Studio Code (VSCode)، مما يبرز مرونة واستقرار هذه المحررات."
    ],
    "points": 138,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1736595779
  },
  {
    "id": 42659061,
    "title": "تسطيح هياكل البيانات الخاصة بالمترجمين مثل ASTs (2023)",
    "originLink": "https://www.cs.cornell.edu/~asampson/blog/flattening.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42659061",
    "commentBody": "",
    "originSummary": [
      "يتناول المنشور تسطيح هياكل البيانات، وهي تقنية للمترجمات التي تحسن الأشجار النحوية المجردة (ASTs) باستخدام مصفوفة واحدة مع مؤشرات بدلاً من المؤشرات. - تعزز هذه الطريقة الأداء من خلال تحسين محلية الذاكرة، وتقليل حجم المرجع، وتبسيط إدارة الذاكرة، مما يؤدي إلى زيادة في السرعة بمقدار 2.4× في اختبار دقيق. - تُستخدم التقنية بشكل ملحوظ في مشاريع Rust وتوفر فوائد مريحة، مثل إدارة الذاكرة بشكل أسهل، وتُقارن بمفسرات البايت كود لتحسينات الأداء الإضافية."
    ],
    "commentSummary": [
      "تركز المناقشة على تحسين أشجار بناء الجملة المجردة (ASTs) من خلال تخزينها في مصفوفات مسطحة ومتجاورة لتحسين الأداء وكفاءة الذاكرة.",
      "تعزز هذه الطريقة محلية الذاكرة المؤقتة وتبسط إدارة الذاكرة، مما يتيح مقارنات مع تقنيات في لغات مثل Lisp ومترجم Zig.",
      "تشير المحادثة أيضًا إلى الأساليب التاريخية والتقنيات المماثلة في لغات البرمجة الأخرى، مع التأكيد على فوائد الهياكل البيانية المسطحة من حيث القدرة على التركيب وسهولة التلاعب."
    ],
    "points": 137,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1736537030
  },
  {
    "id": 42666572,
    "title": "إزالة الذكاء من مكبر الصوت بلوتوث مارشال أُكسبرِدج",
    "originLink": "https://tomscii.sig7.se/2025/01/De-smarting-the-Marshall-Uxbridge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42666572",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تركز المناقشة على تعديل مكبر الصوت Marshall Uxbridge Bluetooth لإزالة ميزاته \"الذكية\"، وتشمل الجوانب التقنية مثل تصميم لوحة الدوائر المطبوعة (PCB) لإدخال I2S الرقمي.",
      "يناقش المستخدمون دور معالجة الإشارة الرقمية (DSP) في تحقيق جودة صوت جيدة، حيث يؤكد البعض على ضرورتها لتعويض قيود الأجهزة.",
      "تتناول المحادثة أيضًا التحديات المتعلقة بتعديل الأجهزة الذكية وإمكانية تحمل تكاليف إنتاج اللوحات الإلكترونية الحديثة والمكونات."
    ],
    "points": 119,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1736610122
  },
  {
    "id": 42660377,
    "title": "حطمت بوت OpenAI موقع الويب لهذه الشركة المكونة من سبعة أشخاص 'مثل هجوم DDoS'",
    "originLink": "https://techcrunch.com/2025/01/10/how-openais-bot-crushed-this-seven-person-companys-web-site-like-a-ddos-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42660377",
    "commentBody": "",
    "originSummary": [
      "تعرض موقع التجارة الإلكترونية لشركة Triplegangers لهجوم يشبه هجوم DDoS بسبب قيام روبوت OpenAI بإجراء عشرات الآلاف من الطلبات لجمع البيانات من أكثر من 65,000 صفحة منتج. - كان الموقع يفتقر إلى ملف robots.txt مُعد بشكل صحيح لمنع مثل هذه الروبوتات، مما أدى إلى زيادة تكاليف AWS ومخاوف بشأن أمان البيانات. - يبرز هذا الحادث أهمية حصول شركات الذكاء الاصطناعي على إذن قبل جمع البيانات ويعمل كتحذير للشركات الصغيرة لمراقبة نشاط روبوتات الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تسبب الروبوت الخاص بـ OpenAI في حركة مرور مفرطة على موقع شركة صغيرة، مشابهة لهجوم حجب الخدمة الموزع (DDoS)، مما يبرز المشكلات المتعلقة بالروبوتات الذكية التي تغمر المواقع الإلكترونية.",
      "واجهت شركات مثل Read the Docs تحديات مماثلة مع الروبوتات الذكية التي تولد حركة مرور ضخمة، على الرغم من استخدام \"robots.txt\" لإدارة زواحف الويب.",
      "يؤكد الحادث على الجدل المستمر حول تحقيق التوازن بين إتاحة الوصول إلى الويب والحماية ضد جمع البيانات العدواني من قبل شركات الذكاء الاصطناعي، حيث تتجاهل بعض الروبوتات ملف \"robots.txt\"، مما يؤدي إلى مشكلات قانونية ومالية محتملة لأصحاب المواقع الصغيرة."
    ],
    "points": 111,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1736544077
  }
]
