[
  {
    "id": 42704078,
    "title": "कोसाइन समानता का उपयोग लापरवाही से न करें",
    "originLink": "https://p.migdal.pl/blog/2025/01/dont-use-cosine-similarity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704078",
    "commentBody": "",
    "originSummary": [
      "कोसाइन समानता, जो वेक्टरों की तुलना करने की एक विधि है, संदर्भ को समझे बिना उपयोग करने पर भ्रामक हो सकती है, क्योंकि यह आवश्यक नहीं है कि यह अर्थगत समानताओं को सही ढंग से पकड़ सके। - एम्बेडिंग्स, जैसे कि word2vec या बड़े भाषा मॉडल (LLMs) से वाक्य एम्बेडिंग्स, को यह सुनिश्चित करने के लिए सावधानीपूर्वक और जानबूझकर उपयोग की आवश्यकता होती है कि वे वांछित संबंधों को प्रतिबिंबित करते हैं। - वेक्टर समानता परिणामों में सुधार करने के लिए, सीधे LLMs का उपयोग करने पर विचार करें, फाइन-ट्यूनिंग के माध्यम से कार्य-विशिष्ट एम्बेडिंग्स बनाएं, और एम्बेडिंग से पहले यह सुनिश्चित करें कि पाठ साफ है और प्रॉम्प्ट्स अच्छी तरह से इंजीनियर किए गए हैं।"
    ],
    "commentSummary": [
      "रिट्रीवल-अगमेंटेड जनरेशन (RAG) अनुप्रयोगों में, \"समानार्थक पुनः-रैंकिंग\" का उपयोग करने से उपयोगकर्ता प्रश्नों के मिलान को बेहतर बनाया जा सकता है जब कोसाइन समानता का उपयोग किया जाता है। - खाली सामग्री के वेक्टर एम्बेडिंग को संग्रहीत करने से बचें, क्योंकि वे गलत मिलान का कारण बन सकते हैं; कुछ परियोजनाएं इस समस्या को रोकने के लिए \"शून्यता\" का प्रतिनिधित्व करने के लिए विशेष एन्कोडिंग का उपयोग करती हैं। - बड़े भाषा मॉडल (LLMs), क्रॉस-एन्कोडर्स, L2 पुनः-रैंकिंग मॉडल, या ग्राफ-आधारित विधियों जैसे विकल्पों का अन्वेषण करना कोसाइन समानता पर पूरी तरह निर्भर रहने की तुलना में अधिक सटीक पुनः प्राप्ति परिणाम प्रदान कर सकता है।"
    ],
    "points": 399,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1736889801
  },
  {
    "id": 42707573,
    "title": "नेवादा कोर्ट ने नागरिक संपत्ति जब्ती के लिए संघीय छिद्र का उपयोग करने वाली पुलिस को बंद किया।",
    "originLink": "https://ij.org/press-release/nevada-court-shuts-down-police-use-of-federal-loophole-for-civil-forfeiture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42707573",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "नेवादा की एक अदालत ने पुलिस के खिलाफ फैसला सुनाया है, जो नागरिक जब्ती के लिए एक संघीय छिद्र का उपयोग कर रही थी, जहां संपत्तियों को बिना मालिक पर अपराध का आरोप लगाए जब्त कर लिया जाता है।",
      "यह निर्णय नागरिक जब्ती कानूनों पर बहस को रेखांकित करता है, जिसकी आलोचना दोष मानने और संभावित रूप से भ्रष्टाचार की ओर ले जाने के लिए की जाती है।",
      "मामला एक व्यक्ति की जीवन भर की बचत को एक ट्रैफिक स्टॉप के दौरान जब्त किए जाने से संबंधित था, जो नागरिकों के अधिकारों की रक्षा के लिए कानूनी कार्रवाई और मीडिया ध्यान की आवश्यकता को उजागर करता है।"
    ],
    "points": 369,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1736918124
  },
  {
    "id": 42710339,
    "title": "टिकटॉक रविवार को अमेरिका में बंद होने की तैयारी कर रहा है",
    "originLink": "https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42710339",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "टिकटॉक अमेरिका में संभावित बंदी का सामना कर रहा है, जिससे उपयोगकर्ता विकल्पों जैसे कि शियाओहोंगशु, यूट्यूब शॉर्ट्स और इंस्टाग्राम रील्स की खोज कर रहे हैं। - शियाओहोंगशु, जो चीन में लोकप्रिय है, पश्चिमी दर्शकों के लिए अनुकूलित नहीं है, जिससे चीनी और अमेरिकी उपयोगकर्ताओं के बीच सीधे संपर्क को लेकर चिंताएं बढ़ रही हैं। - अमेरिकी सरकार राष्ट्रीय सुरक्षा चिंताओं का हवाला देती है, जिसमें विदेशी प्रभाव और प्रचार के डर शामिल हैं, टिकटॉक पर प्रतिबंध लगाने पर विचार करने के कारणों के रूप में।"
    ],
    "points": 329,
    "commentCount": 981,
    "retryCount": 0,
    "time": 1736945851
  },
  {
    "id": 42708773,
    "title": "कोकोरो-82M के साथ ई-पुस्तकों से ऑडियोबुक्स बनाएं",
    "originLink": "https://claudio.uk/posts/epub-to-audiobook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42708773",
    "commentBody": "",
    "originSummary": [
      "Kokoro v0.19 एक नया टेक्स्ट-टू-स्पीच मॉडल है जिसमें 82 मिलियन पैरामीटर हैं, जो अमेरिकी और ब्रिटिश अंग्रेजी, फ्रेंच, कोरियाई, जापानी और मंदारिन सहित कई भाषाओं में उच्च गुणवत्ता वाली ऑडियो आउटपुट प्रदान करता है।",
      "क्लाउडियो सैंटिनी ने ऑडिबल्ज़ विकसित किया, जो एक उपकरण है जो कोकोरो का उपयोग करके ई-बुक्स को ऑडियोबुक्स में परिवर्तित करता है, .epub फाइलों को प्रोसेस करता है और ऑडियो फाइलें उत्पन्न करता है, जिसमें M2 मैकबुक प्रो पर 100,000 शब्दों की पुस्तक के लिए लगभग 2 घंटे का समय लगता है।",
      "ऑडिबल्ज़ को पिप के माध्यम से इंस्टॉलेशन की आवश्यकता होती है, यह विभिन्न भाषाओं और आवाज़ों का समर्थन करता है, और .m4b फाइल निर्माण के लिए ffmpeg की आवश्यकता होती है, यह टूल GitHub पर आगे के विकास और सुधार के लिए उपलब्ध है।"
    ],
    "commentSummary": [
      "Kokoro-82M एक एआई उपकरण है जिसे ई-पुस्तकों को ऑडियोबुक में बदलने के लिए डिज़ाइन किया गया है, जो विशेष रूप से गैर-काल्पनिक कार्यों के लिए सुविधा प्रदान करता है।",
      "जबकि एआई-जनित ऑडियोबुक्स उन जगहों को भर सकते हैं जहाँ कोई मानव-नरेटेड संस्करण मौजूद नहीं है, वे वर्तमान में मानव कथाकारों द्वारा प्रदान की गई भावनात्मक गहराई और चरित्र की कमी रखते हैं।",
      "यह उपकरण रचनात्मक पेशों पर एआई के प्रभाव पर बहस को प्रज्वलित करता है, ऐतिहासिक तकनीकी परिवर्तनों के साथ समानताएं खींचता है, और इन क्षेत्रों में प्रशिक्षण और अनुभव के अवसरों के घटने के बारे में चिंताएं उठाता है।"
    ],
    "points": 323,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1736930858
  },
  {
    "id": 42704491,
    "title": "दूषित क्षेत्रों में विकिरण जोखिम को सीमित करने में मदद के लिए सड़क संकेत",
    "originLink": "https://www.theautopian.com/if-you-ever-see-this-speed-sign-youre-probably-going-to-die/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704491",
    "commentBody": "",
    "originSummary": [
      "यूनिफॉर्म ट्रैफिक कंट्रोल डिवाइसेस (MUTCD) पर मैनुअल में शीत युद्ध युग के संकेत शामिल हैं, जैसे कि \"सर्वोच्च सुरक्षित गति बनाए रखें,\" जो रेडियोलॉजिकल संदूषण क्षेत्रों के लिए अभिप्रेत हैं।",
      "ये संकेत नागरिकों को संभावित परमाणु प्रलय के दौरान सुरक्षित रखने के लिए नागरिक सुरक्षा रणनीतियों का हिस्सा थे, हालांकि इन्हें कभी उपयोग में नहीं लाया गया।",
      "इनमें से कुछ संकेत अभी भी MUTCD में आपातकालीन प्रबंधन संकेतों के रूप में शामिल हैं, जो उस अवधि के ऐतिहासिक भय और तैयारी के प्रयासों को उजागर करते हैं।"
    ],
    "commentSummary": [
      "अधिकारियों द्वारा उन क्षेत्रों में उच्च गति से यात्रा करने की सलाह देने के लिए सड़क संकेतों पर विचार किया जा रहा है जो कि विकिरणित हैं, ताकि इन क्षेत्रों में बिताए गए समय को कम करके विकिरण के संपर्क को कम किया जा सके। - इस चर्चा में चेरनोबिल और फुकुशिमा के समानांतर खींचे गए हैं, जो रेडियोधर्मी धूल से साँस लेने और प्रदूषण के बारे में चिंताओं को उजागर करते हैं। - व्यापक भू-राजनीतिक मुद्दे, जिनमें राष्ट्रवाद और परमाणु निवारण शामिल हैं, भी बातचीत का हिस्सा हैं, जो ऐतिहासिक और वर्तमान वैश्विक तनावों पर विचार करते हैं।"
    ],
    "points": 261,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1736891952
  },
  {
    "id": 42711781,
    "title": "1971 में WTF हुआ? (2019)",
    "originLink": "https://wtfhappenedin1971.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42711781",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "वेबसाइट \"WTF Happened in 1971?\" 1971 में शुरू हुए महत्वपूर्ण आर्थिक और सामाजिक परिवर्तनों की जांच करती है, जो अक्सर स्वर्ण मानक के अंत से जुड़े होते हैं।",
      "चर्चा में इन परिवर्तनों के कारणों पर विभिन्न दृष्टिकोण शामिल हैं, जैसे कि कार्यकारी मुआवजे में वृद्धि, तेल संकट, और आर्थिक नीतियों में परिवर्तन।",
      "बहस में निक्सन शॉक के प्रभाव, क्रेडिट और फिएट मुद्रा की भूमिका, और शहरीकरण और ऊर्जा कीमतों जैसे व्यापक कारकों पर भी विचार किया जाता है।"
    ],
    "points": 238,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1736954220
  },
  {
    "id": 42703282,
    "title": "rqlite का परीक्षण कैसे किया जाता है",
    "originLink": "https://philipotoole.com/how-is-rqlite-tested/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42703282",
    "commentBody": "",
    "originSummary": [
      "rqlite एक हल्का वितरित डेटाबेस है जो SQLite और Raft को मिलाता है, और एक संरचित परीक्षण रणनीति के माध्यम से विश्वसनीयता और गुणवत्ता पर ध्यान केंद्रित करता है। - परीक्षण रणनीति परीक्षण पिरामिड का अनुसरण करती है, जिसमें अलग-अलग घटकों के लिए यूनिट परीक्षण, सिस्टम-स्तरीय सत्यापन के लिए एकीकरण परीक्षण, और बुनियादी संचालन जांच के लिए न्यूनतम एंड-टू-एंड परीक्षण पर जोर दिया जाता है। - rqlite के परीक्षण दृष्टिकोण से प्रमुख सबक में परीक्षण को जल्दी शुरू करना, परीक्षण कोड को सरल बनाना, और निर्धारण सुनिश्चित करना शामिल है, जो न्यूनतम ओवरहेड के साथ उच्च गुणवत्ता बनाए रखने में मदद करता है।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र बिंदु rqlite के लिए परीक्षण रणनीतियाँ हैं, जो SQLite पर आधारित एक वितरित डेटाबेस है, जिसमें प्रारंभिक परीक्षण, परीक्षण पिरामिड, और पैरामीटरयुक्त और गुण परीक्षणों पर जोर दिया गया है।",
      "जटिल प्रणालियों में एंड-टू-एंड (E2E) परीक्षण की चुनौतियों को उजागर किया गया है, साथ ही rqlite के लिए गो प्रोग्रामिंग भाषा के चयन और सुरक्षा चिंताओं का भी उल्लेख किया गया है।",
      "डेटरमिनिस्टिक सिमुलेशन परीक्षण को डेटाबेस की विश्वसनीयता के लिए एक उच्च मानक के रूप में उल्लेख किया गया है, जिसमें अन्य डेटाबेस जैसे फाउंडेशनडीबी का संदर्भ दिया गया है, जो प्रभावी परीक्षण प्रथाओं पर विविध दृष्टिकोण प्रस्तुत करता है।"
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1736886107
  },
  {
    "id": 42705077,
    "title": "अपने वेबसाइट को साधारण HTML और CSS में फिर से लिखना",
    "originLink": "https://www.vijayp.dev/blog/rewrite-plain-html/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42705077",
    "commentBody": "",
    "originSummary": [
      "लेखक ने अपनी वेबसाइट को साधारण HTML और CSS का उपयोग करके फिर से बनाया, SvelteKit से दूर जाकर, साइट को सरल बनाने और इसे Cloudflare Pages पर होस्ट करने के लिए। - उन्होंने Markdown को HTML में बदलने के लिए Pandoc और स्क्रिप्टिंग के लिए Python का उपयोग किया, जिसके परिणामस्वरूप एक छोटी वेबसाइट बनी, जिसमें संपत्ति का आकार ~356kb से घटकर ~88kb हो गया। - इस परियोजना ने कोड डुप्लिकेशन और लाइव रीलोडिंग की कमी जैसी चुनौतियों को उजागर किया, जिनसे निपटने के लिए वेब घटकों और FastAPI का पता लगाने की योजना है, जो संभावित रूप से Markdown पोस्ट के साथ एक फ्रेमवर्क-मुक्त वेबसाइट की तलाश करने वालों के लिए एक टेम्पलेट के रूप में काम कर सकता है।"
    ],
    "commentSummary": [
      "लेखक एक व्यक्तिगत वेबसाइट को साधारण HTML और CSS का उपयोग करके बनाए रखते हैं, जो इसे बनाए रखने में न्यूनतम समय की प्रतिबद्धता और कौशल को निखारने का अवसर प्रदान करता है।",
      "वेबसाइट GitHub Pages पर होस्ट की गई है, और सामग्री को MS Word में ड्राफ्ट किया जाता है इससे पहले कि इसे मैन्युअल रूप से अपडेट किया जाए।",
      "लेखक सर्वर-साइड इनक्लूड्स या Jekyll या Hugo जैसे स्टैटिक साइट जनरेटर्स का उपयोग करने के सुझावों के बावजूद अपनी वर्तमान विधि के नियंत्रण और सरलता को महत्व देते हैं।"
    ],
    "points": 180,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1736895439
  }
]
