[
  {
    "id": 42704078,
    "title": "কসমাইন সাদৃশ্য অসতর্কভাবে ব্যবহার করবেন না",
    "originLink": "https://p.migdal.pl/blog/2025/01/dont-use-cosine-similarity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704078",
    "commentBody": "",
    "originSummary": [
      "কোসাইন সাদৃশ্য, ভেক্টর তুলনা করার একটি পদ্ধতি, প্রসঙ্গ না বুঝে ব্যবহার করলে বিভ্রান্তিকর হতে পারে, কারণ এটি সেমান্টিক সাদৃশ্যগুলি সঠিকভাবে প্রতিফলিত নাও করতে পারে। - এম্বেডিংস, যেমন word2vec বা বড় ভাষার মডেল (LLMs) থেকে বাক্য এম্বেডিংস, ইচ্ছাকৃত এবং যত্নশীল ব্যবহারের প্রয়োজন যাতে তারা কাঙ্ক্ষিত সম্পর্কগুলি প্রতিফলিত করে। - ভেক্টর সাদৃশ্যের ফলাফল উন্নত করতে, সরাসরি LLMs ব্যবহার করা, ফাইন-টিউনিংয়ের মাধ্যমে কাজ-নির্দিষ্ট এম্বেডিংস তৈরি করা এবং এম্বেডিংয়ের আগে পাঠ্য পরিষ্কার এবং প্রম্পটগুলি ভালভাবে প্রকৌশল করা নিশ্চিত করুন।"
    ],
    "commentSummary": [
      "রিট্রিভাল-অগমেন্টেড জেনারেশন (RAG) অ্যাপ্লিকেশনগুলিতে, \"সেমান্টিক রি-র্যাঙ্কার\" ব্যবহার করে কসমাইন সাদৃশ্য প্রয়োগ করার সময় ব্যবহারকারীর প্রশ্নের সাথে মিল বাড়ানো যায়। - খালি বিষয়বস্তুর ভেক্টর এম্বেডিং সংরক্ষণ এড়িয়ে চলুন, কারণ এগুলি ভুল মেলাতে পারে; কিছু প্রকল্প \"কিছুই নয়\" উপস্থাপন করতে বিশেষ এনকোডিং ব্যবহার করে এই সমস্যাটি প্রতিরোধ করে। - বড় ভাষার মডেল (LLMs), ক্রস-এনকোডার, L2 রি-র্যাঙ্কিং মডেল বা গ্রাফ-ভিত্তিক পদ্ধতির মতো বিকল্পগুলি অনুসন্ধান করা কসমাইন সাদৃশ্যের উপর নির্ভর করার চেয়ে আরও সঠিক রিট্রিভাল ফলাফল প্রদান করতে পারে।"
    ],
    "points": 399,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1736889801
  },
  {
    "id": 42707573,
    "title": "নেভাদা আদালত ফেডারেল ফাঁকফোকর ব্যবহার করে পুলিশের নাগরিক সম্পত্তি বাজেয়াপ্ত করার প্রক্রিয়া বন্ধ করেছে",
    "originLink": "https://ij.org/press-release/nevada-court-shuts-down-police-use-of-federal-loophole-for-civil-forfeiture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42707573",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "একটি নেভাদা আদালত পুলিশকে ফেডারেল ফাঁকফোকর ব্যবহার করে বেসামরিক বাজেয়াপ্তির বিরুদ্ধে রায় দিয়েছে, যেখানে মালিককে কোনো অপরাধে অভিযুক্ত না করেই সম্পদ বাজেয়াপ্ত করা হয়।",
      "এই সিদ্ধান্তটি নাগরিক সম্পত্তি বাজেয়াপ্ত করার আইন নিয়ে বিতর্ককে জোরদার করে, যা দোষী সাব্যস্ত করার অনুমান এবং সম্ভাব্য দুর্নীতির দিকে নিয়ে যাওয়ার জন্য সমালোচিত হয়েছে।",
      "এই মামলাটি একটি ট্রাফিক থামানোর সময় একজন ব্যক্তির জীবনের সঞ্চয় বাজেয়াপ্ত করার সাথে জড়িত ছিল, যা নাগরিকদের অধিকার রক্ষার জন্য আইনি পদক্ষেপ এবং মিডিয়া মনোযোগের প্রয়োজনীয়তাকে তুলে ধরে।"
    ],
    "points": 369,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1736918124
  },
  {
    "id": 42710339,
    "title": "টিকটক রবিবার মার্কিন যুক্তরাষ্ট্রে বন্ধের জন্য প্রস্তুতি নিচ্ছে",
    "originLink": "https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42710339",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "টিকটক যুক্তরাষ্ট্রে সম্ভাব্য বন্ধের মুখোমুখি হচ্ছে, যা ব্যবহারকারীদের বিকল্প হিসেবে শিয়াওহংশু, ইউটিউব শর্টস এবং ইনস্টাগ্রাম রিলসের মতো প্ল্যাটফর্মগুলি অন্বেষণ করতে উদ্বুদ্ধ করছে। - শিয়াওহংশু, যা চীনে জনপ্রিয়, পশ্চিমা দর্শকদের জন্য উপযুক্ত নয়, যা চীনা এবং মার্কিন ব্যবহারকারীদের মধ্যে সরাসরি যোগাযোগের বিষয়ে উদ্বেগ সৃষ্টি করছে। - মার্কিন সরকার জাতীয় নিরাপত্তা উদ্বেগ, যার মধ্যে বিদেশী প্রভাব এবং প্রচারণার ভয় অন্তর্ভুক্ত, টিকটক নিষিদ্ধ করার কারণ হিসেবে উল্লেখ করছে।"
    ],
    "points": 329,
    "commentCount": 981,
    "retryCount": 0,
    "time": 1736945851
  },
  {
    "id": 42708773,
    "title": "কোকোরো-৮২এম দিয়ে ই-বুক থেকে অডিওবুক তৈরি করুন",
    "originLink": "https://claudio.uk/posts/epub-to-audiobook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42708773",
    "commentBody": "",
    "originSummary": [
      "Kokoro v0.19 হল একটি নতুন টেক্সট-টু-স্পিচ মডেল যার ৮২ মিলিয়ন প্যারামিটার রয়েছে, যা উচ্চ-মানের অডিও আউটপুট প্রদান করে বিভিন্ন ভাষায়, যার মধ্যে রয়েছে আমেরিকান এবং ব্রিটিশ ইংরেজি, ফরাসি, কোরিয়ান, জাপানি এবং ম্যান্ডারিন।",
      "ক্লডিও সান্তিনি অডিবলেজ নামে একটি টুল তৈরি করেছেন, যা কোকোরো ব্যবহার করে ই-বুককে অডিওবুকে রূপান্তরিত করে, .epub ফাইল প্রক্রিয়াকরণ করে এবং অডিও ফাইল তৈরি করে, যেখানে একটি ১০০,০০০ শব্দের বইকে রূপান্তর করতে একটি M2 ম্যাকবুক প্রো-তে প্রায় ২ ঘণ্টা সময় লাগে।",
      "অডিবলজ পিপির মাধ্যমে ইনস্টলেশন প্রয়োজন, বিভিন্ন ভাষা এবং কণ্ঠস্বর সমর্থন করে এবং .m4b ফাইল তৈরির জন্য ffmpeg প্রয়োজন, এই টুলটি আরও উন্নয়ন এবং উন্নতির জন্য গিটহাবে উপলব্ধ।"
    ],
    "commentSummary": [
      "Kokoro-82M একটি এআই টুল যা ই-বুককে অডিওবুকে রূপান্তর করতে ডিজাইন করা হয়েছে, বিশেষ করে নন-ফিকশন কাজের জন্য সুবিধা প্রদান করে।",
      "যদিও এআই-উৎপন্ন অডিওবুকগুলি এমন ফাঁক পূরণ করতে পারে যেখানে কোনো মানব-নির্দেশিত সংস্করণ নেই, তবুও এগুলি বর্তমানে মানব বর্ণনাকারীদের দ্বারা প্রদত্ত আবেগগত গভীরতা এবং চরিত্রের অভাব রয়েছে।",
      "এই সরঞ্জামটি সৃজনশীল পেশার উপর এআই-এর প্রভাব নিয়ে বিতর্ক উস্কে দেয়, ঐতিহাসিক প্রযুক্তিগত পরিবর্তনের সাথে সমান্তরাল টানে এবং এই ক্ষেত্রগুলিতে প্রশিক্ষণ এবং অভিজ্ঞতার সুযোগ হ্রাসের বিষয়ে উদ্বেগ উত্থাপন করে।"
    ],
    "points": 323,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1736930858
  },
  {
    "id": 42704491,
    "title": "দূষিত এলাকায় রেডিয়েশন এক্সপোজার সীমিত করতে সহায়ক সড়ক চিহ্ন",
    "originLink": "https://www.theautopian.com/if-you-ever-see-this-speed-sign-youre-probably-going-to-die/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704491",
    "commentBody": "",
    "originSummary": [
      "ইউনিফর্ম ট্রাফিক কন্ট্রোল ডিভাইসেস (MUTCD) ম্যানুয়ালে ঠান্ডা যুদ্ধের যুগের চিহ্নগুলি রয়েছে, যেমন \"MAINTAIN TOP SAFE SPEED,\" যা রেডিওলজিক্যাল দূষণ অঞ্চলের জন্য নির্ধারিত।",
      "এই চিহ্নগুলি একটি সম্ভাব্য পারমাণবিক মহাপ্রলয়ের সময় নাগরিকদের সুরক্ষিত করার জন্য সিভিল ডিফেন্স কৌশলের অংশ ছিল, যদিও সেগুলি কখনও ব্যবহার করা হয়নি।",
      "এই চিহ্নগুলির কিছু এখনও MUTCD-তে জরুরি ব্যবস্থাপনা চিহ্ন হিসাবে অন্তর্ভুক্ত রয়েছে, যা সেই সময়ের ঐতিহাসিক ভয় এবং প্রস্তুতি প্রচেষ্টাকে তুলে ধরে।"
    ],
    "commentSummary": [
      "কর্তৃপক্ষ দূষিত এলাকাগুলির মধ্য দিয়ে উচ্চ গতিতে ভ্রমণের পরামর্শ দেওয়ার জন্য সড়ক চিহ্ন বিবেচনা করছে, যাতে এই অঞ্চলে ব্যয়িত সময় কমিয়ে বিকিরণ এক্সপোজার হ্রাস করা যায়। - আলোচনাটি চেরনোবিল এবং ফুকুশিমার সাথে সাদৃশ্য টানে, যা রেডিওঅ্যাকটিভ ধূলিকণা থেকে শ্বাস-প্রশ্বাস এবং দূষণ সম্পর্কে উদ্বেগকে জোর দেয়। - বৃহত্তর ভূ-রাজনৈতিক বিষয়গুলি, যার মধ্যে জাতীয়তাবাদ এবং পারমাণবিক প্রতিরোধ অন্তর্ভুক্ত রয়েছে, আলোচনার অংশ, যা ঐতিহাসিক এবং বর্তমান বৈশ্বিক উত্তেজনার প্রতিফলন ঘটায়।"
    ],
    "points": 261,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1736891952
  },
  {
    "id": 42711781,
    "title": "১৯৭১ সালে WTF কী ঘটেছিল? (২০১৯)",
    "originLink": "https://wtfhappenedin1971.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42711781",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ওয়েবসাইট \"WTF Happened in 1971?\" ১৯৭১ সালে শুরু হওয়া উল্লেখযোগ্য অর্থনৈতিক এবং সামাজিক পরিবর্তনগুলি পরীক্ষা করে, যা প্রায়শই স্বর্ণমানের সমাপ্তির সাথে যুক্ত।",
      "আলোচনায় এই পরিবর্তনগুলির কারণ সম্পর্কে বিভিন্ন দৃষ্টিভঙ্গি অন্তর্ভুক্ত রয়েছে, যেমন নির্বাহী ক্ষতিপূরণ বৃদ্ধি, তেল সংকট এবং অর্থনৈতিক নীতির পরিবর্তন।",
      "আলোচনায় নিক্সন শকের প্রভাব, ঋণ এবং ফিয়াট মুদ্রার ভূমিকা, এবং নগরায়ণ ও জ্বালানির মূল্যের মতো বিস্তৃত বিষয়গুলিও বিবেচনা করা হয়।"
    ],
    "points": 238,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1736954220
  },
  {
    "id": 42703282,
    "title": "rqlite কীভাবে পরীক্ষা করা হয়",
    "originLink": "https://philipotoole.com/how-is-rqlite-tested/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42703282",
    "commentBody": "",
    "originSummary": [
      "rqlite হল একটি হালকা ওজনের বিতরণকৃত ডাটাবেস যা SQLite এবং Raft কে একত্রিত করে, নির্ভরযোগ্যতা এবং গুণমানের উপর জোর দেয় একটি গঠিত পরীক্ষার কৌশলের মাধ্যমে। - পরীক্ষার কৌশলটি পরীক্ষার পিরামিড অনুসরণ করে, যেখানে পৃথক উপাদানগুলির জন্য ইউনিট টেস্টগুলির উপর জোর দেওয়া হয়, সিস্টেম-স্তরের যাচাইয়ের জন্য ইন্টিগ্রেশন টেস্ট এবং মৌলিক অপারেশন চেকের জন্য ন্যূনতম প্রান্ত-থেকে-প্রান্ত টেস্ট। - rqlite এর পরীক্ষার পদ্ধতির মূল পাঠগুলির মধ্যে রয়েছে পরীক্ষার কাজটি তাড়াতাড়ি শুরু করা, পরীক্ষার কোডকে সরল করা এবং নির্ধারিততা নিশ্চিত করা, যা ন্যূনতম ওভারহেড সহ উচ্চ গুণমান বজায় রাখতে সহায়তা করে।"
    ],
    "commentSummary": [
      "আলোচনাটি rqlite-এর জন্য পরীক্ষার কৌশলগুলির উপর কেন্দ্রীভূত, যা SQLite-এর উপর ভিত্তি করে একটি বিতরণকৃত ডাটাবেস, প্রাথমিক পরীক্ষা, পরীক্ষার পিরামিড এবং প্যারামিটারাইজড এবং প্রপার্টি পরীক্ষার উপর জোর দিয়ে।",
      "জটিল সিস্টেমে এন্ড-টু-এন্ড (E2E) পরীক্ষার চ্যালেঞ্জগুলি তুলে ধরা হয়েছে, rqlite-এর জন্য Go প্রোগ্রামিং ভাষার পছন্দ এবং নিরাপত্তা উদ্বেগের সাথে।",
      "ডিটারমিনিস্টিক সিমুলেশন টেস্টিংকে ডাটাবেস নির্ভরযোগ্যতার জন্য একটি উচ্চ মান হিসেবে উল্লেখ করা হয়েছে, যেখানে ফাউন্ডেশনডিবি-এর মতো অন্যান্য ডাটাবেসের উল্লেখ রয়েছে, যা কার্যকর টেস্টিং প্র্যাকটিসের উপর বিভিন্ন দৃষ্টিভঙ্গি প্রদর্শন করে।"
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1736886107
  },
  {
    "id": 42705077,
    "title": "আমার ওয়েবসাইটটি সাধারণ HTML এবং CSS-এ পুনরায় লিখছি",
    "originLink": "https://www.vijayp.dev/blog/rewrite-plain-html/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42705077",
    "commentBody": "",
    "originSummary": [
      "লেখক তাদের ওয়েবসাইটটি সাধারণ HTML এবং CSS ব্যবহার করে পুনর্নির্মাণ করেছেন, SvelteKit থেকে সরে এসে সাইটটি সহজ করার জন্য এবং এটি Cloudflare Pages-এ হোস্ট করার জন্য। - তারা Markdown থেকে HTML-এ রূপান্তরের জন্য Pandoc এবং স্ক্রিপ্টিংয়ের জন্য Python ব্যবহার করেছেন, যার ফলে ওয়েবসাইটটি ছোট হয়েছে, সম্পদের আকার প্রায় ৩৫৬ কিলোবাইট থেকে প্রায় ৮৮ কিলোবাইটে কমেছে। - প্রকল্পটি কোডের পুনরাবৃত্তি এবং লাইভ রিলোডিংয়ের অভাবের মতো চ্যালেঞ্জগুলি তুলে ধরেছে, যা সমাধানের জন্য ওয়েব কম্পোনেন্ট এবং FastAPI অন্বেষণের পরিকল্পনা রয়েছে, যা সম্ভবত Markdown পোস্ট সহ ফ্রেমওয়ার্ক-মুক্ত ওয়েবসাইট খুঁজছেন এমন অন্যদের জন্য একটি টেমপ্লেট হিসাবে কাজ করতে পারে।"
    ],
    "commentSummary": [
      "লেখক একটি ব্যক্তিগত ওয়েবসাইট পরিচালনা করেন সাধারণ HTML এবং CSS ব্যবহার করে, যা কম সময়ের প্রতিশ্রুতি এবং দক্ষতা শাণিত করার সুযোগ প্রদান করে বলে তিনি প্রশংসা করেন।",
      "ওয়েবসাইটটি GitHub Pages-এ হোস্ট করা হয়েছে, এবং বিষয়বস্তু MS Word-এ খসড়া করা হয় তারপর ম্যানুয়ালি আপডেট করা হয়।",
      "লেখক সার্ভার-সাইড ইনক্লুড বা জেকিল বা হুগোর মতো স্ট্যাটিক সাইট জেনারেটর ব্যবহারের পরামর্শ সত্ত্বেও তাদের বর্তমান পদ্ধতির নিয়ন্ত্রণ এবং সরলতাকে মূল্যায়ন করেন।"
    ],
    "points": 180,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1736895439
  }
]
