[
  {
    "id": 42704078,
    "title": "لا تستخدم تشابه جيب التمام بلا مبالاة",
    "originLink": "https://p.migdal.pl/blog/2025/01/dont-use-cosine-similarity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704078",
    "commentBody": "",
    "originSummary": [
      "يمكن أن تكون تشابهات جيب التمام، وهي طريقة لمقارنة المتجهات، مضللة إذا استخدمت دون فهم السياق، حيث قد لا تعكس بدقة التشابهات الدلالية. - تتطلب التضمينات، مثل تلك من word2vec أو تضمينات الجمل من النماذج اللغوية الكبيرة (LLMs)، استخدامًا دقيقًا ومتعمدًا لضمان أنها تعكس العلاقات المرغوبة. - لتحسين نتائج تشابه المتجهات، يُنصح باستخدام النماذج اللغوية الكبيرة مباشرة، وإنشاء تضمينات مخصصة للمهام من خلال التخصيص الدقيق، وضمان أن يكون النص نظيفًا وأن تكون التعليمات مصممة بشكل جيد قبل التضمين."
    ],
    "commentSummary": [
      "في تطبيقات التوليد المعزز بالاسترجاع (RAG)، يمكن لاستخدام \"مُعيد ترتيب دلالي\" تحسين مطابقة استفسارات المستخدم عند استخدام تشابه جيب التمام. - يجب تجنب تخزين تضمينات المتجهات للمحتوى الفارغ، حيث يمكن أن تؤدي إلى تطابقات خاطئة؛ تستخدم بعض المشاريع ترميزات خاصة لتمثيل \"العدم\" لمنع هذه المشكلة. - يمكن لاستكشاف بدائل مثل النماذج اللغوية الكبيرة (LLMs)، والمشفرات المتقاطعة، ونماذج إعادة الترتيب L2، أو الطرق القائمة على الرسوم البيانية أن توفر نتائج استرجاع أكثر دقة من الاعتماد فقط على تشابه جيب التمام."
    ],
    "points": 399,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1736889801
  },
  {
    "id": 42707573,
    "title": "محكمة نيفادا تغلق استخدام الشرطة للثغرة الفيدرالية في المصادرة المدنية",
    "originLink": "https://ij.org/press-release/nevada-court-shuts-down-police-use-of-federal-loophole-for-civil-forfeiture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42707573",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "حكمت محكمة في نيفادا ضد استخدام الشرطة لثغرة فيدرالية لمصادرة الممتلكات المدنية، حيث يتم الاستيلاء على الأصول دون توجيه تهمة إلى المالك بارتكاب جريمة.",
      "يؤكد هذا القرار على الجدل حول قوانين المصادرة المدنية، التي تُنتقد لافتراضها الذنب وقد تؤدي إلى الفساد.",
      "تتعلق القضية بمصادرة مدخرات حياة رجل خلال توقف مروري، مما يبرز الحاجة إلى اتخاذ إجراءات قانونية واهتمام إعلامي لحماية حقوق المواطنين."
    ],
    "points": 369,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1736918124
  },
  {
    "id": 42710339,
    "title": "تيك توك يستعد للإغلاق في الولايات المتحدة يوم الأحد",
    "originLink": "https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42710339",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تواجه تيك توك احتمال الإغلاق في الولايات المتحدة، مما يدفع المستخدمين لاستكشاف بدائل مثل شياوهونغشو، ويوتيوب شورتس، وإنستغرام ريلز. - شياوهونغشو، الشائع في الصين، ليس موجهًا للجماهير الغربية، مما يثير مخاوف بشأن التفاعلات المباشرة بين المستخدمين الصينيين والأمريكيين. - تستشهد الحكومة الأمريكية بمخاوف تتعلق بالأمن القومي، بما في ذلك مخاوف من التأثير الأجنبي والدعاية، كأسباب للنظر في حظر تيك توك."
    ],
    "points": 329,
    "commentCount": 981,
    "retryCount": 0,
    "time": 1736945851
  },
  {
    "id": 42708773,
    "title": "توليد الكتب الصوتية من الكتب الإلكترونية باستخدام Kokoro-82M",
    "originLink": "https://claudio.uk/posts/epub-to-audiobook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42708773",
    "commentBody": "",
    "originSummary": [
      "كوكورو v0.19 هو نموذج جديد لتحويل النص إلى كلام يحتوي على 82 مليون معلمة، ويوفر إخراج صوتي عالي الجودة بعدة لغات، بما في ذلك الإنجليزية الأمريكية والبريطانية، والفرنسية، والكورية، واليابانية، والماندرين.",
      "طور كلاوديو سانتيني أداة Audiblez، التي تحول الكتب الإلكترونية إلى كتب صوتية باستخدام Kokoro، حيث تعالج ملفات .epub وتولد ملفات صوتية، مع وقت تحويل يبلغ حوالي ساعتين لكتاب يحتوي على 100,000 كلمة على جهاز M2 MacBook Pro.",
      "يتطلب Audiblez التثبيت عبر pip، ويدعم لغات وأصوات متنوعة، ويحتاج إلى ffmpeg لإنشاء ملفات .m4b، مع توفر الأداة على GitHub لمزيد من التطوير والتحسينات."
    ],
    "commentSummary": [
      "كوكورو-82M هو أداة ذكاء اصطناعي مصممة لتحويل الكتب الإلكترونية إلى كتب صوتية، مما يوفر الراحة، خاصة للأعمال غير الخيالية.",
      "في حين أن الكتب الصوتية التي يتم إنشاؤها بواسطة الذكاء الاصطناعي يمكن أن تسد الفجوات حيث لا توجد نسخ مروية بواسطة البشر، إلا أنها تفتقر حاليًا إلى العمق العاطفي والشخصية التي يوفرها الرواة البشريون.",
      "يثير الأداة نقاشًا حول تأثير الذكاء الاصطناعي على المهن الإبداعية، مستعرضة أوجه الشبه مع التحولات التكنولوجية التاريخية، وتثير مخاوف بشأن تقليص الفرص للتدريب والخبرة في هذه المجالات."
    ],
    "points": 323,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1736930858
  },
  {
    "id": 42704491,
    "title": "لافتات الطرق لمساعدة الناس على الحد من التعرض للإشعاع في المناطق الملوثة",
    "originLink": "https://www.theautopian.com/if-you-ever-see-this-speed-sign-youre-probably-going-to-die/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704491",
    "commentBody": "",
    "originSummary": [
      "يتضمن دليل الأجهزة الموحدة للتحكم في المرور (MUTCD) علامات تعود لعصر الحرب الباردة، مثل \"الحفاظ على السرعة الآمنة القصوى\"، والمخصصة لمناطق التلوث الإشعاعي.",
      "كانت هذه العلامات جزءًا من استراتيجيات الدفاع المدني لحماية المواطنين خلال احتمال حدوث نهاية العالم النووية، على الرغم من أنها لم تُستخدم أبدًا.",
      "لا تزال بعض هذه العلامات مدرجة في MUTCD كعلامات لإدارة الطوارئ، مما يبرز المخاوف التاريخية وجهود الاستعداد من تلك الفترة."
    ],
    "commentSummary": [
      "تدرس السلطات وضع لافتات طرقية لتوجيه السفر بسرعة عالية عبر المناطق الملوثة لتقليل التعرض للإشعاع عن طريق تقليل الوقت الذي يقضى في هذه المناطق. - تثير المناقشة مقارنات مع تشيرنوبيل وفوكوشيما، مع التركيز على المخاوف بشأن الاستنشاق والتلوث من الغبار المشع. - كما أن القضايا الجيوسياسية الأوسع، بما في ذلك القومية والردع النووي، هي جزء من المحادثة، مما يعكس التوترات العالمية التاريخية والحالية."
    ],
    "points": 261,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1736891952
  },
  {
    "id": 42711781,
    "title": "ماذا حدث بحق الجحيم في عام 1971؟ (2019)",
    "originLink": "https://wtfhappenedin1971.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42711781",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يستعرض موقع \"WTF Happened in 1971?\" التغيرات الاقتصادية والاجتماعية الهامة التي بدأت في عام 1971، والتي ترتبط غالبًا بنهاية معيار الذهب.",
      "تشمل المناقشة وجهات نظر متنوعة حول أسباب هذه التغيرات، مثل زيادة تعويضات التنفيذيين، وأزمة النفط، والتغيرات في السياسات الاقتصادية.",
      "يناقش الجدل أيضًا تأثيرات صدمة نيكسون، ودور الائتمان والعملات الورقية، والعوامل الأوسع مثل التحضر وأسعار الطاقة."
    ],
    "points": 238,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1736954220
  },
  {
    "id": 42703282,
    "title": "كيف يتم اختبار rqlite",
    "originLink": "https://philipotoole.com/how-is-rqlite-tested/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42703282",
    "commentBody": "",
    "originSummary": [
      "rqlite هو قاعدة بيانات موزعة خفيفة الوزن تجمع بين SQLite وRaft، مع التركيز على الموثوقية والجودة من خلال استراتيجية اختبار منظمة. - تتبع استراتيجية الاختبار هرم الاختبار، مع التركيز على اختبارات الوحدة للمكونات المعزولة، واختبارات التكامل للتحقق من صحة النظام على مستوى النظام، واختبارات شاملة بسيطة للتحقق من العمليات الأساسية. - تشمل الدروس الرئيسية من نهج اختبار rqlite بدء الاختبار مبكرًا، وتبسيط كود الاختبار، وضمان الحتمية، مما يساعد في الحفاظ على جودة عالية مع الحد الأدنى من العبء."
    ],
    "commentSummary": [
      "تركز المناقشة على استراتيجيات اختبار rqlite، وهي قاعدة بيانات موزعة تعتمد على SQLite، مع التأكيد على الاختبارات الأولية، هرم الاختبار، والاختبارات المعلمة واختبارات الخصائص.",
      "تُبرز التحديات المتعلقة بالاختبار الشامل (E2E) في الأنظمة المعقدة، إلى جانب اختيار لغة البرمجة Go لـ rqlite والمخاوف الأمنية.",
      "يُذكر اختبار المحاكاة الحتمية كمعيار عالٍ لموثوقية قواعد البيانات، مع الإشارة إلى قواعد بيانات أخرى مثل FoundationDB، مما يعرض وجهات نظر متنوعة حول ممارسات الاختبار الفعالة."
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1736886107
  },
  {
    "id": 42705077,
    "title": "إعادة كتابة موقعي الإلكتروني باستخدام HTML وCSS البسيطين",
    "originLink": "https://www.vijayp.dev/blog/rewrite-plain-html/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42705077",
    "commentBody": "",
    "originSummary": [
      "قام المؤلف بإعادة بناء موقعه الإلكتروني باستخدام HTML وCSS البسيطين، مبتعدًا عن SvelteKit، لتبسيط الموقع واستضافته على Cloudflare Pages. - استخدموا Pandoc لتحويل Markdown إلى HTML وPython للبرمجة النصية، مما أدى إلى تقليل حجم الموقع، حيث انخفض حجم الأصول من حوالي 356 كيلوبايت إلى حوالي 88 كيلوبايت. - أبرز المشروع تحديات مثل تكرار الشيفرة وعدم وجود إعادة تحميل حية، مع خطط لاستكشاف مكونات الويب وFastAPI لمعالجة هذه القضايا، مما قد يخدم كنموذج للآخرين الذين يسعون إلى موقع بدون إطار عمل مع منشورات Markdown."
    ],
    "commentSummary": [
      "يحتفظ المؤلف بموقع شخصي باستخدام HTML وCSS البسيط، مقدرًا الالتزام الزمني القليل وصقل المهارات الذي يوفره.",
      "يتم استضافة الموقع على GitHub Pages، ويتم إعداد المحتوى في MS Word قبل تحديثه يدويًا.",
      "على الرغم من الاقتراحات باستخدام تضمينات من جانب الخادم أو مولدات المواقع الثابتة مثل Jekyll أو Hugo، يقدر المؤلف التحكم والبساطة في الطريقة الحالية التي يستخدمها."
    ],
    "points": 180,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1736895439
  }
]
