[
  {
    "id": 42704078,
    "title": "கோசைன் ஒற்றுமையை கவனக்குறைவாக பயன்படுத்த வேண்டாம்",
    "originLink": "https://p.migdal.pl/blog/2025/01/dont-use-cosine-similarity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704078",
    "commentBody": "",
    "originSummary": [
      "கோசைன் ஒற்றுமை, வெக்டர்களை ஒப்பிடும் ஒரு முறை, சூழலின் புரிதலின்றி பயன்படுத்தினால் தவறான முடிவுகளை தரக்கூடும், ஏனெனில் இது அர்த்தமுள்ள ஒற்றுமைகளை துல்லியமாகப் பிடிக்க முடியாது. - word2vec அல்லது பெரிய மொழி மாதிரிகளிலிருந்து (LLMs) வாக்கிய எம்பெட்டிங்ஸ் போன்ற எம்பெட்டிங்ஸ்கள், அவை விரும்பிய உறவுகளை பிரதிபலிக்க உறுதியாகவும் நோக்கமுடனும் பயன்படுத்தப்பட வேண்டும். - வெக்டர் ஒற்றுமை முடிவுகளை மேம்படுத்த, LLMகளை நேரடியாகப் பயன்படுத்தவும், நுணுக்கமாகத் தகுதிப்படுத்துவதன் மூலம் பணிக்கேற்ப எம்பெட்டிங்ஸ்களை உருவாக்கவும், மற்றும் எம்பெட்டிங் செய்வதற்கு முன் உரை சுத்தமாகவும், தூண்டுதல்கள் நன்றாக வடிவமைக்கப்பட்டவையாகவும் இருப்பதை உறுதிசெய்யவும்."
    ],
    "commentSummary": [
      "Retrieval-Augmented Generation (RAG) பயன்பாடுகளில், 'அறிவார்ந்த மறுவரிசைப்படுத்தி'யை பயன்படுத்துவது, கோசைன் ஒத்திசைவு பயன்படுத்தும் போது பயனர் கேள்விகளின் பொருத்தத்தை மேம்படுத்த முடியும். - காலியான உள்ளடக்கத்தின் வெக்டர் எம்பெடிங்குகளை சேமிப்பதை தவிர்க்கவும், ஏனெனில் அவை தவறான பொருத்தங்களை ஏற்படுத்தக்கூடும்; சில திட்டங்கள் இந்த பிரச்சினையைத் தவிர்க்க 'எதுவுமில்லாத'தை பிரதிநிதித்துவப்படுத்த சிறப்பு குறியீடுகளைப் பயன்படுத்துகின்றன. - பெரிய மொழி மாதிரிகள் (LLMs), குறுக்குவிளக்கிகள், L2 மறுவரிசைப்படுத்தல் மாதிரிகள் அல்லது வரைபட அடிப்படையிலான முறைகள் போன்ற மாற்றுவழிகளை ஆராய்வது, கோசைன் ஒத்திசைவின் மீது மட்டுமே நம்புவதற்குப் பதிலாக, மேலும் துல்லியமான மீட்பு முடிவுகளை வழங்க முடியும்."
    ],
    "points": 399,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1736889801
  },
  {
    "id": 42707573,
    "title": "நெவாடா நீதிமன்றம் சிவில் பறிமுதல் தொடர்பான கூட்டாட்சி வழிவெளியை போலீசார் பயன்படுத்துவதை நிறுத்தியது",
    "originLink": "https://ij.org/press-release/nevada-court-shuts-down-police-use-of-federal-loophole-for-civil-forfeiture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42707573",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "நெவாடா நீதிமன்றம், சொத்துக்களை குற்றச்சாட்டின்றி பறிமுதல் செய்யும் சமயத்தில், போலீசார் ஒரு கூட்டாட்சி வழிவழிக்கான சாக்கை பயன்படுத்துவதை எதிர்த்து தீர்ப்பளித்துள்ளது.",
      "இந்த முடிவு, குற்றச்சாட்டை முன்னிட்டு குற்றவாளியாக கருதுவதற்கும், ஊழலுக்கு வழிவகுக்கும் சாத்தியக்கூறுகளுக்கும் விமர்சிக்கப்பட்டுள்ள சிவில் பறிமுதல் சட்டங்களைப் பற்றிய விவாதத்தை வலுப்படுத்துகிறது.",
      "இந்த வழக்கு ஒரு மனிதனின் வாழ்நாள் சேமிப்புகளை போக்குவரத்து நிறுத்தத்தின் போது பறிமுதல் செய்ததை உள்ளடக்கியது, இது குடிமக்களின் உரிமைகளை பாதுகாக்கும் வகையில் சட்ட நடவடிக்கையும் ஊடக கவனமும் தேவை என்பதை வெளிப்படுத்துகிறது."
    ],
    "points": 369,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1736918124
  },
  {
    "id": 42710339,
    "title": "டிக்டாக் ஞாயிற்றுக்கிழமை அமெரிக்காவில் நிறுத்தம் செய்யத் தயாராகிறது",
    "originLink": "https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42710339",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "டிக் டாக் அமெரிக்காவில் மூடப்பட வாய்ப்பு உள்ளதால், பயனர்கள் சியாவோஹொங்ஷு, யூடியூப் ஷார்ட்ஸ் மற்றும் இன்ஸ்டாகிராம் ரீல்ஸ் போன்ற மாற்றுகளை ஆராயத் தொடங்கியுள்ளனர். - சீனாவில் பிரபலமான சியாவோஹொங்ஷு, மேற்கத்திய பார்வையாளர்களுக்காக வடிவமைக்கப்படவில்லை, இது சீன மற்றும் அமெரிக்க பயனர்களுக்கு இடையிலான நேரடி தொடர்புகளுக்கு கவலைகளை எழுப்புகிறது. - அமெரிக்க அரசு தேசிய பாதுகாப்பு கவலைகளை, வெளிநாட்டு செல்வாக்கு மற்றும் பிரச்சாரத்தின் பயங்களை உள்ளடக்கிய காரணங்களாகக் குறிப்பிடுகிறது, டிக் டாக் தடை குறித்து பரிசீலிக்க."
    ],
    "points": 329,
    "commentCount": 981,
    "retryCount": 0,
    "time": 1736945851
  },
  {
    "id": 42708773,
    "title": "கோகோரோ-82எம் மூலம் மின்புத்தகங்களில் இருந்து ஆடியோபுத்தகங்களை உருவாக்கவும்",
    "originLink": "https://claudio.uk/posts/epub-to-audiobook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42708773",
    "commentBody": "",
    "originSummary": [
      "கோகோரோ v0.19 என்பது 82 மில்லியன் அளவுகோள்களைக் கொண்ட புதிய உரை-மொழி மாதிரி ஆகும், இது அமெரிக்க மற்றும் பிரிட்டிஷ் ஆங்கிலம், பிரெஞ்சு, கொரியன், ஜப்பானீஸ் மற்றும் மாண்டரின் உள்ளிட்ட பல மொழிகளில் உயர்தர ஆடியோ வெளியீட்டை வழங்குகிறது.",
      "Claudio Santini Audiblez என்ற கருவியை உருவாக்கினார், இது Kokoro ஐப் பயன்படுத்தி மின்நூல்களை ஆடியோ புத்தகங்களாக மாற்றுகிறது, .epub கோப்புகளை செயலாக்கி ஆடியோ கோப்புகளை உருவாக்குகிறது, M2 MacBook Pro இல் 100,000 வார்த்தைகள் கொண்ட ஒரு புத்தகத்திற்கான மாற்ற நேரம் சுமார் 2 மணி நேரம் ஆகும்.",
      "Audiblez நிறுவல் pip மூலம் தேவைப்படுகிறது, பல்வேறு மொழிகள் மற்றும் குரல்களை ஆதரிக்கிறது, .m4b கோப்பு உருவாக்க ffmpeg தேவைப்படுகிறது, மேலும் இந்த கருவி GitHub இல் மேலும் மேம்பாடு மற்றும் முன்னேற்றங்களுக்காக கிடைக்கிறது."
    ],
    "commentSummary": [
      "கோகோரோ-82எம் என்பது ஒரு செயற்கை நுண்ணறிவு கருவி ஆகும், இது மின்புத்தகங்களை ஆடியோபுத்தகங்களாக மாற்றுவதற்காக வடிவமைக்கப்பட்டுள்ளது, குறிப்பாக புனைவு அல்லாத படைப்புகளுக்கு வசதியை வழங்குகிறது.",
      "AI உருவாக்கிய ஆடியோ புத்தகங்கள், மனிதர் குரல் கொடுத்த பதிப்புகள் இல்லாத இடங்களில் இடைவெளிகளை நிரப்ப முடியும், ஆனால் அவை தற்போது மனிதர் குரல் கொடுக்கும் உணர்ச்சி ஆழம் மற்றும் குணாதிசயத்தை கொண்டிருக்கவில்லை.",
      "இந்த கருவி செயற்கை நுண்ணறிவின் தாக்கத்தை படைப்பாற்றல் தொழில்களில் விவாதத்தை தூண்டுகிறது, வரலாற்று தொழில்நுட்ப மாற்றங்களுடன் ஒப்பிடுகிறது, மேலும் இந்த துறைகளில் பயிற்சி மற்றும் அனுபவம் பெறுவதற்கான வாய்ப்புகள் குறைவதற்கான கவலைகளை எழுப்புகிறது."
    ],
    "points": 323,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1736930858
  },
  {
    "id": 42704491,
    "title": "காலனிகள் பாதிக்கப்பட்ட பகுதிகளில் கதிர்வீச்சு வெளிப்பாட்டை கட்டுப்படுத்த உதவும் சாலை அடையாளங்கள்",
    "originLink": "https://www.theautopian.com/if-you-ever-see-this-speed-sign-youre-probably-going-to-die/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42704491",
    "commentBody": "",
    "originSummary": [
      "மனுவல் ஆன் யூனிஃபார்ம் ட்ராஃபிக் கண்ட்ரோல் டிவைசஸ் (MUTCD) குளிர்போர் காலத்தின் சின்னங்களை கொண்டுள்ளது, உதாரணமாக, \"MAINTAIN TOP SAFE SPEED,\" இது கதிரியக்க மாசுபாடு மண்டலங்களுக்கு உகந்ததாகும்.",
      "இந்த அடையாளங்கள், ஒரு அணு உலக முடிவின் போது குடிமக்களை பாதுகாக்கும் குடிமை பாதுகாப்பு உத்திகளின் ஒரு பகுதியாக இருந்தன, ஆனால் அவை ஒருபோதும் பயன்படுத்தப்படவில்லை.",
      "TEXT: இந்த அடையாளங்களில் சில இன்னும் அவசர மேலாண்மை அடையாளங்களாக MUTCD இல் சேர்க்கப்பட்டுள்ளன, அந்த காலத்திலிருந்து வரலாற்று பயங்கள் மற்றும் தயார்நிலை முயற்சிகளை வெளிப்படுத்துகின்றன."
    ],
    "commentSummary": [
      "உரிமையாளர்கள் கதிர்வீச்சு வெளிப்பாட்டை குறைக்க, இந்த பகுதிகளில் செலவிடும் நேரத்தை குறைப்பதன் மூலம் மாசுபட்ட பகுதிகளின் வழியாக அதிவேக பயணத்தை அறிவுறுத்த சாலை அடையாளங்களை பரிசீலிக்கின்றனர். - இந்த விவாதம் செர்னோபில் மற்றும் புக்குஷிமாவுடன் ஒப்பீடு செய்யப்படுகிறது, கதிர்வீச்சு தூசிலிருந்து உள்சுவாசம் மற்றும் மாசுபாடு பற்றிய கவலைகளை வலியுறுத்துகிறது. - தேசியவாதம் மற்றும் அணு தடுப்பு உள்பட பரந்த புவிசார் அரசியல் பிரச்சினைகள், வரலாற்று மற்றும் தற்போதைய உலகளாவிய பதற்றங்களை பிரதிபலிக்கும் உரையாடலின் ஒரு பகுதியாகவும் உள்ளன."
    ],
    "points": 261,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1736891952
  },
  {
    "id": 42711781,
    "title": "\"1971ல் என்ன நடந்தது?\" (2019)",
    "originLink": "https://wtfhappenedin1971.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42711781",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"1971 இல் என்ன நடந்தது?\" என்ற இணையதளம், 1971 இல் தொடங்கிய முக்கிய பொருளாதார மற்றும் சமூக மாற்றங்களை ஆராய்கிறது, இது பெரும்பாலும் தங்க நாணயத்தின் முடிவுடன் தொடர்புடையது.",
      "தமிழில் எழுத வேண்டும். இந்த மாற்றங்களின் காரணங்களைப் பற்றிய விவாதம், நிர்வாக அதிகாரிகளின் ஊதிய உயர்வு, எண்ணெய் நெருக்கடி மற்றும் பொருளாதார கொள்கைகளில் மாற்றங்கள் போன்ற பல்வேறு பார்வைகளை உள்ளடக்கியது.",
      "விவாதம் நிக்சன் அதிர்ச்சியின் விளைவுகள், கடன் மற்றும் காகித நாணயத்தின் பங்கு, நகரமயமாக்கல் மற்றும் ஆற்றல் விலைகள் போன்ற பரந்த காரணிகளைப் பற்றியும் கருத்துக்களிக்கிறது."
    ],
    "points": 238,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1736954220
  },
  {
    "id": 42703282,
    "title": "rqlite எப்படி சோதிக்கப்படுகிறது",
    "originLink": "https://philipotoole.com/how-is-rqlite-tested/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42703282",
    "commentBody": "",
    "originSummary": [
      "rqlite என்பது SQLite மற்றும் Raft ஆகியவற்றை இணைக்கும் எளிய பகிர்ந்தளிக்கப்பட்ட தரவுத்தொகுப்பாகும், இது நம்பகத்தன்மை மற்றும் தரத்தை கட்டமைக்கப்பட்ட சோதனை மூலமாக கவனிக்கிறது. - சோதனை மூலோபாயம் சோதனை முக்கோணத்தை பின்பற்றுகிறது, தனிமைப்படுத்தப்பட்ட கூறுகளுக்கான அலகு சோதனைகளை, அமைப்பு மட்டத்திலான சரிபார்ப்புக்கான ஒருங்கிணைப்பு சோதனைகளை, மற்றும் அடிப்படை செயல்பாட்டு சரிபார்ப்புகளுக்கான குறைந்த அளவிலான முடிவு-to-end சோதனைகளை வலியுறுத்துகிறது. - rqlite இன் சோதனை அணுகுமுறையிலிருந்து முக்கிய பாடங்கள், சோதனையை ஆரம்பத்தில் தொடங்குவது, சோதனை குறியீட்டை எளிமைப்படுத்துவது, மற்றும் தீர்மானத்தை உறுதிப்படுத்துவது ஆகியவை, குறைந்த செலவுடன் உயர் தரத்தை பராமரிக்க உதவுகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் rqlite என்ற SQLite அடிப்படையிலான பகிர்ந்தளிக்கப்பட்ட தரவுத்தொகுப்புக்கான சோதனை உத்திகள் மீது கவனம் செலுத்துகிறது, ஆரம்ப சோதனைகள், சோதனை முக்கோணம், மற்றும் அளவுரு மற்றும் சொத்து சோதனைகளை முக்கியமாகக் குறிப்பிடுகிறது.",
      "சிக்கலான அமைப்புகளில் முடிவு-to-முடிவு (E2E) சோதனைகளின் சவால்கள் குறிப்பிடப்பட்டுள்ளன, rqlite க்கான Go நிரலாக்க மொழியின் தேர்வு மற்றும் பாதுகாப்பு கவலைகளுடன்.",
      "தமிழில் எழுத வேண்டும். நிச்சயமான சிமுலேஷன் சோதனை என்பது தரவுத்தொகுப்பின் நம்பகத்தன்மைக்கு ஒரு உயர்ந்த தரமாக குறிப்பிடப்பட்டுள்ளது, FoundationDB போன்ற பிற தரவுத்தொகுப்புகளுக்கான குறிப்புகளுடன், பயனுள்ள சோதனை நடைமுறைகள் குறித்த பல்வேறு பார்வைகளை வெளிப்படுத்துகிறது."
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1736886107
  },
  {
    "id": 42705077,
    "title": "என் இணையதளத்தை எளிய HTML மற்றும் CSS இல் மறுபதிவு செய்தல்",
    "originLink": "https://www.vijayp.dev/blog/rewrite-plain-html/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42705077",
    "commentBody": "",
    "originSummary": [
      "உரையாடல்: ஆசிரியர் தங்கள் இணையதளத்தை எளிமைப்படுத்தவும், அதை Cloudflare Pages இல் ஹோஸ்ட் செய்யவும், SvelteKit ஐ விட்டு விலகி, சுத்தமான HTML மற்றும் CSS ஐப் பயன்படுத்தி மீண்டும் கட்டமைத்தனர். - அவர்கள் Markdown ஐ HTML ஆக மாற்ற Pandoc ஐ மற்றும் ஸ்கிரிப்டிங் செய்ய Python ஐ பயன்படுத்தினர், இதனால் ஒரு சிறிய இணையதளம் உருவானது, சொத்து அளவை ~356kb இல் இருந்து ~88kb ஆக குறைத்தது. - இந்த திட்டம் குறியீட்டு நகலெடுப்பு மற்றும் நேரடி மீட்டெடுப்பு இல்லாமை போன்ற சவால்களை வெளிப்படுத்தியது, இச்செயல்களை சமாளிக்க வலை கூறுகள் மற்றும் FastAPI ஐ ஆராய திட்டமிட்டுள்ளனர், இது Markdown பதிவுகளுடன் ஒரு கட்டமைப்பு இல்லாத இணையதளத்தை நாடுபவர்களுக்கு ஒரு வார்ப்புருவாக செயல்படக்கூடும்."
    ],
    "commentSummary": [
      "ஆசிரியர் தனிப்பட்ட இணையதளத்தை எளிய HTML மற்றும் CSS பயன்படுத்தி பராமரிக்கிறார், இது குறைந்த நேர ஒதுக்கீடு மற்றும் திறன் மேம்பாட்டை வழங்குவதால் அவர் பாராட்டுகிறார்.",
      "TEXT: இணையதளம் GitHub Pages இல் ஹோஸ்ட் செய்யப்பட்டுள்ளது, மற்றும் உள்ளடக்கம் MS Word இல் வரைந்து, கையேடு முறையில் புதுப்பிக்கப்படுகிறது.",
      "சர்வர்-சைடு இன்க்ளூட்ஸ் அல்லது ஜெகில் அல்லது ஹ்யூகோ போன்ற நிலையான தள ஜெனரேட்டர்களைப் பயன்படுத்துவதற்கான பரிந்துரைகள் இருந்தபோதிலும், ஆசிரியர் தங்களின் தற்போதைய முறையின் கட்டுப்பாடு மற்றும் எளிமையை மதிக்கிறார்."
    ],
    "points": 180,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1736895439
  }
]
