[
  {
    "id": 42579873,
    "title": "मैं अमीर हूँ और मुझे नहीं पता कि क्या करना है",
    "originLink": "https://vinay.sh/i-am-rich-and-have-no-idea-what-to-do-with-my-life/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42579873",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "पोस्ट में वित्तीय सफलता प्राप्त करने के बाद उद्देश्य खोजने के सामान्य संघर्ष पर चर्चा की गई है, जो मोहभंग और अलगाव की भावनाओं को जन्म दे सकता है। - यह सुझाव देता है कि दूसरों को विकसित करने, संबंध बनाने या नए रुचियों का पीछा करने में संतोष पाया जा सकता है, वित्तीय धन से परे उद्देश्य के महत्व पर जोर देते हुए। - चर्चा यह भी रेखांकित करती है कि जब धन सामाजिक विभाजन पैदा करता है, तो संबंधों को बनाए रखने की चुनौतियाँ होती हैं, सार्थक गतिविधियों और संबंधों की आवश्यकता को रेखांकित करते हुए जो एकता की भावना को बढ़ावा देते हैं।"
    ],
    "points": 793,
    "commentCount": 1375,
    "retryCount": 0,
    "time": 1735858215
  },
  {
    "id": 42579472,
    "title": "iTerm2 महत्वपूर्ण सुरक्षा रिलीज़",
    "originLink": "https://iterm2.com/downloads/stable/iTerm2-3_5_11.changelog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42579472",
    "commentBody": "",
    "originSummary": [
      "iTerm2 संस्करण 3.5.11, जो 2 जनवरी, 2025 को जारी किया गया, पिछले संस्करणों में SSH एकीकरण सुविधा से संबंधित एक गंभीर सुरक्षा भेद्यता को संबोधित करता है। - इस बग में रिमोट होस्ट पर एक फाइल में इनपुट/आउटपुट को लॉग करना शामिल था, जिसे अन्य लोग एक्सेस कर सकते थे, जिससे संस्करण 3.5.6 से 3.5.10 और कुछ बीटा संस्करणों के उपयोगकर्ता प्रभावित हो सकते थे। - उपयोगकर्ताओं को तुरंत संस्करण 3.5.11 में अपडेट करने, /tmp/framer.txt फाइल को हटाने, और सुरक्षा आश्वासन के लिए प्रदान किए गए SHA-256 और PGP हस्ताक्षर का उपयोग करके अपडेट को सत्यापित करने की सलाह दी जाती है।"
    ],
    "commentSummary": [
      "iTerm2 ने अपने SSH एकीकरण में एक बग को संबोधित करने के लिए एक महत्वपूर्ण सुरक्षा अपडेट जारी किया, जो रिमोट होस्ट पर इनपुट और आउटपुट को एक फाइल में लॉग करता था, जिससे अन्य उपयोगकर्ताओं के लिए डेटा उजागर होने की संभावना थी।",
      "यह समस्या उत्पादन में अनजाने में विस्तृत लॉगिंग सक्षम होने के कारण हुई, जिससे पूर्व-कमिट हुक और इसी तरह की त्रुटियों को रोकने के लिए सुरक्षा उपायों के महत्व पर चर्चाएं शुरू हुईं।",
      "इस घटना ने Ghostty या Terminal.app जैसे विकल्पों पर स्विच करने की बहस को जन्म दिया, जबकि साथ ही फीचर-समृद्ध सॉफ़्टवेयर और सुरक्षा जोखिमों के बीच संतुलन को भी उजागर किया।"
    ],
    "points": 647,
    "commentCount": 412,
    "retryCount": 0,
    "time": 1735855722
  },
  {
    "id": 42584400,
    "title": "क्या LLMs बेहतर कोड लिख सकते हैं यदि आप उनसे बार-बार \"बेहतर कोड लिखने\" के लिए कहते रहें?",
    "originLink": "https://minimaxir.com/2025/01/write-better-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42584400",
    "commentBody": "",
    "originSummary": [
      "नवंबर 2023 में, एक मीम ट्रेंड में उपयोगकर्ता ChatGPT से छवियों को क्रमिक रूप से सुधारने के लिए कह रहे थे, जिसे बाद में Claude 3.5 Sonnet का उपयोग करके कोड पर लागू किया गया ताकि एक Python प्रोग्राम को बेहतर बनाया जा सके। - अस्पष्ट प्रॉम्प्ट जैसे \"बेहतर कोड लिखें\" के साथ प्रारंभिक प्रयासों में कुछ सुधार दिखे, लेकिन विशिष्ट अनुकूलन लक्ष्यों के साथ संरचित प्रॉम्प्ट इंजीनियरिंग ने महत्वपूर्ण प्रदर्शन सुधारों को जन्म दिया। - इस प्रयोग ने मानव पर्यवेक्षण के महत्व को रेखांकित किया, क्योंकि जबकि बड़े भाषा मॉडल (LLMs) नवीन विचार प्रदान कर सकते हैं, वे कोड अनुकूलन के दौरान सूक्ष्म बग भी पेश कर सकते हैं।"
    ],
    "commentSummary": [
      "बड़े भाषा मॉडल (LLMs) अक्सर कई ट्यूटोरियल्स पर अपने प्रशिक्षण के कारण बुनियादी कोड उत्पन्न करते हैं, जिससे वे कोड प्रदर्शन को बढ़ाने वाले सरल अनुकूलनों को याद कर सकते हैं। - LLMs को कोड सुधारने के लिए बार-बार प्रेरित करना बेहतर परिणाम दे सकता है, लेकिन यह प्रक्रिया मैनुअल कोडिंग जितनी समय लेने वाली हो सकती है। - यह चर्चा LLMs की जटिल अनुकूलनों को समझने में सीमाओं को रेखांकित करती है और बेहतर कोड गुणवत्ता के लिए संदर्भ और विशिष्ट निर्देश प्रदान करने के महत्व को उजागर करती है।"
    ],
    "points": 453,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1735900244
  },
  {
    "id": 42577736,
    "title": "एडवेंट ऑफ कोड 2024 को शुद्ध SQL में",
    "originLink": "http://databasearchitects.blogspot.com/2024/12/advent-of-code-2024-in-pure-sql.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42577736",
    "commentBody": "",
    "originSummary": [
      "थॉमस न्यूमैन ने एडवेंट ऑफ कोड 2024 चुनौतियों को शुद्ध SQL का उपयोग करके हल करने के अपने अनुभव को साझा किया, इसे वैकल्पिक समस्या-समाधान दृष्टिकोणों के अभ्यास के रूप में उजागर किया। - न्यूमैन ने सभी चुनौतियों को सफलतापूर्वक पूरा किया, हालांकि उन्होंने जटिल एल्गोरिदम और स्थिति अपडेट को संभालने में SQL की सीमाओं को नोट किया, SQL की दक्षता के लिए संभावित सुधारों का सुझाव दिया। - ब्लॉग पोस्ट में एक चुनौती के लिए एक विस्तृत SQL समाधान शामिल है और डेटाबेस के भीतर सीधे जटिल एल्गोरिदम निष्पादन का बेहतर समर्थन करने के लिए SQL को बढ़ाने की संभावना पर चर्चा की गई है।"
    ],
    "commentSummary": [
      "एडवेंट ऑफ कोड 2024 को शुद्ध SQL में प्रस्तुत करना SQL की जटिल चुनौतियों को संभालने की क्षमता को उजागर करता है, जिससे इसकी प्रदर्शन क्षमता और तार्किक संरचना में रुचि बढ़ती है।",
      "चर्चा से पता चलता है कि SQL के साथ विभिन्न अनुभव हैं, जैसे कि संग्रहीत प्रक्रियाओं का अनुकूलन करना और इसे व्यावसायिक तर्क के लिए उपयोग करना, जो इसकी ताकत और चुनौतियों दोनों को प्रदर्शित करता है।",
      "वार्तालाप SQL जैसी भाषाओं की संभावनाओं और डेटाबेस लॉजिक और एप्लिकेशन कोड के बीच संतुलन की भी जांच करता है, जो सॉफ्टवेयर विकास में SQL की भूमिका पर विभिन्न विचारों को दर्शाता है।"
    ],
    "points": 431,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1735845650
  },
  {
    "id": 42578237,
    "title": "यू.एस. अपील अदालत ने एफसीसी के नेट न्यूट्रैलिटी नियमों को खारिज कर दिया",
    "originLink": "https://www.tvtechnology.com/news/sixth-circuit-of-appeals-strikes-down-fccs-net-neutrality-rules",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42578237",
    "commentBody": "",
    "originSummary": [
      "एक अमेरिकी अपील अदालत ने एफसीसी के नेट न्यूट्रैलिटी नियमों को अमान्य कर दिया है, जो ब्रॉडबैंड प्रदाताओं द्वारा इंटरनेट ट्रैफिक के समान उपचार को अनिवार्य करते थे, यह कहते हुए कि एफसीसी ने कानूनी अधिकार का अतिक्रमण किया है।",
      "यह निर्णय एक सुप्रीम कोर्ट के फैसले का संदर्भ देता है जो नियामक एजेंसियों की शक्तियों को सीमित करता है, जिससे एफसीसी की नेट न्यूट्रैलिटी को लागू करने की क्षमता प्रभावित होती है।",
      "एफसीसी की अध्यक्ष जेसिका रोसेनवोर्सेल ने कांग्रेस से नेट न्यूट्रैलिटी पर कानून बनाने का आह्वान किया, जबकि आयुक्त ब्रेंडन कार ने नियामक अतिरेक पर नियंत्रण के रूप में अदालत के निर्णय का समर्थन किया।"
    ],
    "commentSummary": [
      "एक अमेरिकी अपील अदालत ने एफसीसी के नेट न्यूट्रैलिटी नियमों को अमान्य कर दिया है, यह कहते हुए कि वर्तमान कानून के तहत पर्याप्त कानूनी अधिकार नहीं है। - यह निर्णय सुप्रीम कोर्ट द्वारा शेवरॉन डिफरेंस को पलटने के बाद आया है, जिसने एफसीसी जैसी एजेंसियों को विधियों की व्यापक व्याख्या करने की अनुमति दी थी। - अदालत ने ब्रॉडबैंड प्रदाताओं को \"सूचना सेवा\" प्रदान करने वाला माना, न कि \"दूरसंचार सेवा,\" जिससे एफसीसी की नियामक शक्ति सीमित हो गई और संघीय नेट न्यूट्रैलिटी नियम समाप्त हो गए, जिससे आईएसपी को इंटरनेट ट्रैफिक को थ्रॉटल या प्राथमिकता देने की अनुमति मिल सकती है।"
    ],
    "points": 356,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1735848335
  },
  {
    "id": 42581119,
    "title": "इंटरनेट पर किरायेदार नहीं, बल्कि संपत्ति के मालिक बनें",
    "originLink": "https://den.dev/blog/be-a-property-owner-not-a-renter-on-the-internet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42581119",
    "commentBody": "",
    "originSummary": [
      "लेख इस बात पर जोर देता है कि प्रमुख इंटरनेट प्लेटफार्मों पर पूरी तरह निर्भर रहने के बजाय अपने डिजिटल स्पेस का स्वामित्व रखना कितना महत्वपूर्ण है, क्योंकि ये प्लेटफॉर्म अक्सर उपयोगकर्ता की रुचियों के बजाय अपनी वृद्धि को प्राथमिकता देते हैं। - अपनी ऑनलाइन उपस्थिति पर नियंत्रण बनाए रखने की रणनीतियों में एक डोमेन का स्वामित्व, कई प्लेटफार्मों पर सामग्री का विविधीकरण, और ईमेल सूचियों के माध्यम से दर्शकों के साथ सीधे संबंध बनाना शामिल है। - अपनी खुद की वेब संपत्ति बनाकर, आप अपने डिजिटल प्रयासों में लचीलापन और स्थिरता सुनिश्चित करते हैं, जिससे किसी एकल नेटवर्क पर निर्भरता कम होती है।"
    ],
    "commentSummary": [
      "चर्चा इस बात पर जोर देती है कि सोशल मीडिया प्लेटफॉर्म्स पर निर्भर रहने के बजाय अपनी डिजिटल उपस्थिति का स्वामित्व होना कितना महत्वपूर्ण है, खासकर जब एआई द्वारा उपयोगकर्ता-जनित सामग्री के शोषण की चिंताओं को संबोधित किया जा रहा है। - यह कॉपीराइट, एआई नैतिकता की जटिलताओं और ऑनलाइन डेटा पर बेहतर नियंत्रण के लिए व्यक्तिगत वेबसाइट या डोमेन होने के महत्व की पड़ताल करता है। - बातचीत में आत्म-होस्टिंग की व्यावहारिकता और सीमाओं पर भी विचार किया गया है, विशेष रूप से डोमेन रजिस्ट्रार और होस्टिंग प्रदाताओं जैसी बाहरी सेवाओं पर निर्भरता को देखते हुए, और अपनी ऑनलाइन उपस्थिति को प्रबंधित करने में अधिक स्वतंत्रता की वकालत की गई है।"
    ],
    "points": 295,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1735867317
  },
  {
    "id": 42583086,
    "title": "ब्लॉगस्क्रॉल – व्यक्तिगत साइटों और ब्लॉगों की एक खुली निर्देशिका",
    "originLink": "https://blogscroll.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42583086",
    "commentBody": "",
    "originSummary": [
      "ब्लॉगस्क्रॉल व्यक्तिगत साइटों और ब्लॉगों की एक खुली निर्देशिका है, जो प्रमुख प्रौद्योगिकी कंपनियों के बाहर के डिजिटल स्थानों पर जोर देती है, और इसे डेन डेलिमार्स्की द्वारा गिटहब पर बनाए रखा जाता है। - उपयोगकर्ता गिटहब के माध्यम से या निर्माता को ईमेल करके ब्लॉगस्क्रॉल में योगदान कर सकते हैं, और अपडेट एक आरएसएस फीड के माध्यम से उपलब्ध हैं। - निर्देशिका में डिज़ाइन-एंड-यूएक्स, व्यक्तिगत, फोटो-वीडियो-प्रोडक्शन, और प्रौद्योगिकी जैसी विभिन्न श्रेणियाँ शामिल हैं, जो कई व्यक्तियों के योगदान को प्रदर्शित करती हैं।"
    ],
    "commentSummary": [
      "ब्लॉगस्क्रॉल व्यक्तिगत साइटों और ब्लॉगों के लिए एक खुली निर्देशिका है, जो डिजिटल गार्डन साझा करने पर केंद्रित है, जिन्हें कुछ उपयोगकर्ताओं द्वारा किसी भी व्यक्तिगत साइट के रूप में बहस की जाती है।",
      "GitHub पर होस्ट किए गए, BlogScroll ने अपनी \"दीवारों से घिरी बगिया\" प्रकृति के बारे में चर्चाओं को जन्म दिया है, जिसमें OPML निर्यात और स्केलेबिलिटी सुधारों के सुझाव दिए गए हैं।",
      "यह परियोजना अपनी सूची को विस्तारित करने के लिए प्रस्तुतियों को प्रोत्साहित करती है, जो व्यक्तिगत वेब स्पेस में नए सिरे से रुचि और स्वतंत्र, क्यूरेटेड सामग्री को ऑनलाइन बनाए रखने की चुनौतियों को दर्शाती है।"
    ],
    "points": 262,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1735885431
  },
  {
    "id": 42579969,
    "title": "एल्डर लेक SHLX विसंगति",
    "originLink": "https://tavianator.com/2025/shlx.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42579969",
    "commentBody": "",
    "originSummary": [
      "हेरोल्ड एप्ट्रूट ने खोजा कि इंटेल के एल्डर लेक प्रोसेसर पर SHLX निर्देश में \"मध्यम विलंबता\" होती है, जो 3 चक्रों की होती है, जो बाएँ-शिफ्ट संचालन के लिए असामान्य है जो आमतौर पर 1 चक्र लेते हैं। - यह विलंबता समस्या एल्डर लेक के प्रदर्शन कोर के लिए विशिष्ट है और दक्षता कोर को प्रभावित नहीं करती है, जो इंटेल के 1-चक्र विलंबता के दावों का खंडन करती है। - विलंबता शिफ्ट काउंट रजिस्टर के आरंभिकरण के आधार पर भिन्न होती है, जिसमें 32-बिट निर्देश या बिना इमीडिएट्स के 64-बिट निर्देश 1-चक्र विलंबता प्राप्त करते हैं, जबकि इमीडिएट्स के साथ 64-बिट निर्देश 3-चक्र विलंबता का परिणाम देते हैं।"
    ],
    "commentSummary": [
      "एल्डर लेक SHLX विसंगति एक प्रदर्शन समस्या है जहां विशेष निर्देश, जैसे `mov rcx, 1`, `SHLX` निर्देश को धीमा कर देते हैं, संभवतः छोटे इमीडिएट्स के रजिस्टर रिनेमर के प्रबंधन के कारण।",
      "यह विसंगति 3 गुना धीमी गति का कारण बन सकती है और इसे पुन: उत्पन्न करना चुनौतीपूर्ण है क्योंकि संदर्भ स्विच रजिस्टर स्थिति को रीसेट कर सकते हैं, जिससे अनजाने में कोड की गति बढ़ सकती है।",
      "यह समस्या हाल ही में खोजी गई है और मुख्य रूप से शिफ्ट काउंट्स को प्रभावित करती है, जैसे कि `SHL` निर्देश, लेकिन `ANDN` जैसे अन्य निर्देशों को प्रभावित नहीं करती है, और आमतौर पर कंपाइलरों द्वारा इसका ध्यान नहीं रखा जाता है।"
    ],
    "points": 194,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1735858848
  }
]
