[
  {
    "id": 42485124,
    "title": "Fastmail'de kendi donanımımızı kullanıyoruz",
    "originLink": "https://www.fastmail.com/blog/why-we-use-our-own-hardware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42485124",
    "commentBody": "",
    "originSummary": [
      "Fastmail, maliyet optimizasyonu ve uzun vadeli planlamaya odaklanarak, 25 yıllık deneyiminden yararlanarak bulut hizmetleri yerine kendi donanımını kullanmayı tercih ediyor.",
      "NVMe SSD'lere yükselttiler, bu da geleneksel Sabit Disk Sürücülere (HDD'ler) kıyasla performansı ve güvenilirliği artırıyor.",
      "Fastmail, depolama için sıkıştırma ve şifreleme gibi avantajlar sunan ZFS kullanıyor ve giriş/çıkış, güvenilirlik ve maliyet etkinliğini artırmak için SSD'li yeni 2U sunucularını seçti."
    ],
    "commentSummary": [
      "Fastmail, bulut hizmetleri yerine kendi donanımını kullanmayı tercih ediyor ve bunun, önemli barındırma gereksinimleri olan işletmeler için maliyet etkin olduğunu belirtiyor.",
      "Bulut ve kendi kendine barındırma arasındaki tartışma genellikle yanlış anlamalarla bulanıklaşır, bazı bulut savunucuları teknik içgörüden yoksundur.",
      "Fastmail'in stratejisi, işletmelerin kendi sistemlerini yönetmelerinin mümkün olduğunu vurguluyor ve bulut çözümlerinin evrensel olarak üstün olduğu varsayımını sorguluyor."
    ],
    "points": 594,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1734856591
  },
  {
    "id": 42483895,
    "title": "Rosetta 2'nin yaratıcısı, Lean üzerinde tam zamanlı çalışmak için Apple'dan ayrıldı.",
    "originLink": "https://www.linkedin.com/posts/leonardo-de-moura-26a27b5_leanlang-leanprover-leanfro-activity-7274523099394400256-0F0x",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42483895",
    "commentBody": "",
    "originSummary": [
      "Leonardo de Moura, AWS ve Lean FRO'da önemli bir isim, Apple'da Rosetta 2'yi yaratan Cameron Zwarich'in Lean FRO'ya katıldığını duyurdu.",
      "Cameron Zwarich, geniş yazılım geliştirme deneyimini ekibe getirerek Lean'in kod üreticisini geliştirmeye odaklanacak."
    ],
    "commentSummary": [
      "Rosetta 2'nin geliştiricisi, resmi akıl yürütme ve yazılım doğrulama alanına yönelik bir değişimi vurgulayarak, bir kanıt asistanı ve programlama dili olan Lean'e odaklanmak için Apple'dan ayrıldı.",
      "Rosetta 2, bir ekip kurulmadan önce bu geliştiricinin önemli katkılarıyla teknik becerisiyle tanınmaktadır.",
      "Yalın'a geçiş, ölçeklenebilirlik, kullanılabilirlik ve kanıt otomasyonu geliştirme hedefleriyle, yapay zeka ilerlemelerindeki potansiyeli tarafından motive edilmektedir."
    ],
    "points": 316,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1734832911
  },
  {
    "id": 42482829,
    "title": "Binlerce yıllık bir veri tablosu (2020)",
    "originLink": "https://www.datafix.com.au/BASHing/2020-08-12.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42482829",
    "commentBody": "",
    "originSummary": [
      "Antik Mezopotamya'da hesap tutma, modern veri tablolarına benzer şekilde satır ve sütunlarla kil tabletler kullanılarak yapılırdı, bu durum Eleanor Robson tarafından tercüme edilen Larsa, Irak'tan bir tabletle kanıtlanmıştır.- British Museum'da kataloglanan tablet, bir inşaat projesi için bir maaş özeti gibi görünmekte olup, 3500 yıldan daha uzun bir süre önce başlıklar ve hesaplamalarla düzenlenmiş verileri göstermektedir.- Bu tarihsel içgörü, veri tablolarının eski kökenlere sahip olduğunu, ancak sürekli kullanımının garanti edilmediğini, çünkü icatların zamanla kaybolup yeniden keşfedilebileceğini vurgulamaktadır."
    ],
    "commentSummary": [
      "Bu tartışma, 2020'den kalma ve günümüz standartlarına göre eski kabul edilen veri tablosuna rağmen, tabular veri temsilinin zamansız önemini vurgulamaktadır.",
      "Katılımcılar, tabloların tarihsel önemini ve sezgisel tasarımını keşfederek, bunların modern elektronik tablolar ve veritabanlarına dönüşümünü not ederler.",
      "Konuşma ayrıca veri koruma alanındaki kültürel ve teknik ilerlemeleri ele alarak, modern verilerin eski verilerle benzer şekilde korunabileceğini öne sürüyor."
    ],
    "points": 227,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1734819937
  },
  {
    "id": 42484139,
    "title": "Yavaş dağıtım toplantılara neden olur (2015)",
    "originLink": "https://tidyfirst.substack.com/p/slow-deployment-causes-meetings",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42484139",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yavaş dağıtımlar riski artırır ve daha fazla toplantıya yol açarken, sık ve daha küçük dağıtımlar riski azaltır ve değer teslimini artırır.",
      "Otomatik testler ve altyapı iyileştirmeleri, toplantı ihtiyacını azaltabilir ve dağıtım verimliliğini artırabilir, ancak organizasyonlar genellikle bürokrasi ve teknik beceri eksikliği gibi zorluklarla karşılaşır.",
      "Teknik olmayan personeli otomatik testleri benimsemeye teşvik etmek ve manuel süreçleri azaltmak, mikro hizmetleri benimsemekle birlikte, dağıtım sıklığını artırabilir, ancak bu, organizasyonel değişiklik ve daha iyi yönetim gerektirir."
    ],
    "points": 164,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1734837143
  },
  {
    "id": 42484527,
    "title": "Michel de Montaigne'in denemeleri çevrimiçi",
    "originLink": "https://hyperessays.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42484527",
    "commentBody": "",
    "originSummary": [
      "HyperEssays, Michel de Montaigne'in Denemeler'inin modern baskılarını sunan çevrimiçi bir projedir ve farklı tarihsel çevirilerden ve güncellemelerden dört versiyon içermektedir. Proje, yeni okuyucular için araçlar ve bağlam sunar, ücretsiz bölüm PDF'leri ve çeşitli cihazlarda kolay okuma için formatlama sağlar, din, dostluk ve hukuk gibi konuları kapsar. HyperEssays, erişilebilirliğini ve ücretsiz erişimini sürdürmek için katkıları memnuniyetle karşılayan sürekli gelişen bir kaynaktır."
    ],
    "commentSummary": [
      "Michel de Montaigne'in çevrimiçi olarak erişilebilen denemeleri, kişisel ama özenle hazırlanmış doğaları nedeniyle sıklıkla bloglara benzetilir ve ölümün kabulü gibi çeşitli konuları kapsar.",
      "Deneyim Üzerine\" adlı makalesinden dikkat çekici bir alıntı, insan durumunu vurgulayarak, en yüksek tahtta bile olsak insan olarak kaldığımızı belirtir.",
      "Modern çeviriler ve yapay zeka destekli güncellemeler, Montaigne'in yazılarını daha erişilebilir hale getirmeyi amaçlayarak, hem zengin hem de sıradan okuyucular için orijinal çekiciliklerini korumaktadır."
    ],
    "points": 148,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1734844597
  },
  {
    "id": 42481612,
    "title": "İşaretsiz 8 bitlik sayıları bölme",
    "originLink": "http://0x80.pl/notesen/2024-12-21-uint8-division.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42481612",
    "commentBody": "",
    "originSummary": [
      "Metin, SIMD (Tek Komut, Çoklu Veri) talimatlarını kullanarak işaretsiz 8 bitlik sayıları bölme yöntemlerini, özellikle kayan nokta bölme ve uzun bölme algoritmasına odaklanarak inceliyor.",
      "Bu yöntemlerin SSE, AVX2 ve AVX-512 talimatları kullanılarak uygulanmasını, Ryzen 7, Skylake-X ve IceLake gibi CPU'larda performans karşılaştırmaları ile vurgulamaktadır.",
      "Özellikle, uzun bölme işleminin AVX-512 uygulaması Intel CPU'larda en hızlı iken, yaklaşık tersini kullanan AVX2 Ryzen'de en hızlıdır ve kaynak kodu GitHub'da mevcuttur."
    ],
    "commentSummary": [
      "İşaretsiz 8 bit sayılarının bölünmesi, 3'e bölme için 171 ile çarpıp 9 bit sağa kaydırma gibi bir diyadik rasyonel ile yaklaşık olarak bir karşılıklı ile çarpma kullanılarak optimize edilebilir.",
      "Bu optimizasyon, donanım ve optimize edici derleyicilerde faydalıdır ve her birinin sınırlamaları olmasına rağmen modüler çarpma, arama tabloları ve SIMD (Tek Komut, Çoklu Veri) talimatları gibi ek tekniklerle birlikte kullanılır.",
      "RISC-V Vektör Uzantısı gibi bazı Komut Seti Mimarileri (ISA'lar), SIMD tamsayı bölmesini destekler, ancak bu tür destek yaygın değildir ve optimizasyon için kayan nokta aritmetiği ve mikro arama tabloları dahil olmak üzere çeşitli teknikler araştırılmaktadır."
    ],
    "points": 148,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1734809113
  },
  {
    "id": 42481813,
    "title": "JEP 483: Zamanından Önce Sınıf Yükleme ve Bağlama",
    "originLink": "https://openjdk.org/jeps/483",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42481813",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "JEP 483, Java için Zamanından Önce (AOT) sınıf yükleme ve bağlama öneriyor, özellikle komut satırı arayüzü (CLI) uygulamaları için başlangıç sürelerini iyileştirmeyi amaçlıyor.",
      "Öneri, AWS Lambda gibi sunucusuz ortamlarda avantajlı olabilecek, JIT (Just-In-Time) derlenmiş kod yerine sınıf yükleme ve bağlama verilerinin önbelleğe alınmasına odaklanmaktadır.",
      "Artan konteyner boyutu ile iyileştirilmiş sınıf yükleme hızı arasında bir denge vardır ve bu, özellikle daha büyük uygulamalar için dikkatli bir değerlendirme gerektirir."
    ],
    "points": 118,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1734810806
  },
  {
    "id": 42485795,
    "title": "Pink Floyd'un 'The Wall' albümündeki telefon sinyallerinin kodunu çözmek",
    "originLink": "https://corelatus.com/blog/Decoding_the_telephony_signals_in_Pink_Floyd_s__The_Wall_.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42485795",
    "commentBody": "",
    "originSummary": [
      "Corelatus Blog, özellikle E1/T1 ve SDH/SONET arayüzleri olmak üzere telekom donanımını inceliyor ve yakın zamanda Pink Floyd'un 'The Wall' albümündeki telefon sinyallerini analiz etti. Analiz, ses spektrogramlarını inceleyerek ve bunları DTMF ve CAS R2 gibi bilinen standartlarla karşılaştırarak, 1980'lerin başında kullanılan bir sistem olan SS5 sinyalleşmesini tanımladı. Çalışma, sesin muhtemelen gerçek bir çağrıdan kaynaklandığını ve şarkı 'Young Lust'ta genişletilmiş bir versiyonunun yer aldığını belirterek, otantik bir uzun mesafe bağlantı hissi sağladığını sonucuna vardı."
    ],
    "commentSummary": [
      "James Guthrie, Pink Floyd'un 'The Wall' albümünde, turne sırasında yaşanan izolasyonu simgelemek için bir telefon operatörünün sesinin kaydedildiğini açıkladı.",
      "Albümün kayıt süreci, ticari kısıtlamalardan uzak sanatsal özgürlükle işaretlendi ve bu da geniş ve karmaşık parçalara yol açtı.",
      "Röportaj ayrıca, yıllar içinde Londra'nın alan kodlarındaki değişiklikler nedeniyle kayıtta kullanılan telefon numarasını çözmenin zorluğunu vurguladı."
    ],
    "points": 117,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1734868152
  },
  {
    "id": 42481659,
    "title": "Singlefile: Tam bir web sayfasını tek bir HTML dosyasına kaydetmek için bir web uzantısı",
    "originLink": "https://github.com/gildas-lormeau/SingleFile",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42481659",
    "commentBody": "",
    "originSummary": [
      "SingleFile, kullanıcıların tüm web sayfalarını tek HTML dosyası olarak kaydetmelerini sağlayan, Chrome, Firefox, Edge ve Safari gibi büyük tarayıcılarla uyumlu çok yönlü bir web uzantısı ve komut satırı aracıdır.",
      "Seçilen içeriği kaydetme, birden fazla sekme, açıklamalar, otomatik kaydetme ve Google Drive ve GitHub ile entegrasyon gibi özellikler sunar, ancak belirli alanlar ve dosya adı karakterleri ile ilgili bazı sınırlamaları vardır.",
      "Araç, AGPL lisansı altında açık kaynaklıdır ve ArchiveBox ve Zotero Connector gibi projelerde kullanılmaktadır, çeşitli çevirmenlerin katkılarıyla."
    ],
    "commentSummary": [
      "SingleFile, UTF-16 kodlamasını kullanarak tek HTML dosyası olarak tüm web sayfalarını kaydetmek için tasarlanmış bir web uzantısıdır ve kompakt bir kaydetme yöntemi sunar.- Uzantı, sayfaları kendi kendine açılan ZIP/HTML dosyaları olarak kaydederek, standart tarayıcı kaydetme işlevlerinin sınırlamalarını ele alır ve PDF yazdırmayı geliştirir.- Gizlilik endişeleri tartışıldı, ancak geliştirici, SingleFile'ın kullanıcı gizliliğine saygı duyduğunu doğruladı ve bu da onu çevrimdışı erişim ve paylaşım için değerli bir araç haline getiriyor."
    ],
    "points": 112,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1734809595
  }
]
